{"title":"Characterization and Failure Analysis of Plastics by American So","uid":11271158,"size":11299496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00cb66259cf0d59f9ba7dfbd7a1b144df73d01ee&amp;dn=Characterization+and+Failure+Analysis+of+Plastics+by+American+So&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thilanga123","files":1,"time":1414084138,"description":"\nCharacterization and Failure Analysis of Plastics\n\nProduct Details\nHardcover: 482 pages\nPublisher: ASM International (December 1, 2003)\nLanguage: English\nISBN-10: 0871707896\nISBN-13: 978-0871707895\n\nReviews\nThe selection and application of engineered materials is an integrated process that requires an understanding of the interaction between materials properties, manufacturing characteristics, design considerations, and the total life cycle of the product. This reference book on engineering plastics provides practical and comprehensive coverage on how the performance of plastics is characterized during design, property testing, and failure analysis. The fundamental structure and properties of plastics are reviewed for general reference, and detailed articles describe the important design factors, properties, and failure mechanisms of plastics. The effects of composition, processing, and structure are detailed in articles on the physical, chemical, thermal, and mechanical properties. Other articles cover failure mechanisms such as: crazing and fracture; impact loading; fatigue failure; wear failures, moisture related failure; organic chemical related failure; photolytic degradation; and microbial degradation. Characterization of plastics in failure analysis is described with additional articles on analysis of structure, surface analysis, and fractography. Sections include: Materials Selection and Design of Engineering Plastics; Physical, Chemical, and Thermal Analysis; Mechanical Behavior and Wear; Environmental Effects; Failure Analysis; Index","torrent":{"xt":"urn:btih:00cb66259cf0d59f9ba7dfbd7a1b144df73d01ee","amp;dn":"Characterization+and+Failure+Analysis+of+Plastics+by+American+So","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00cb66259cf0d59f9ba7dfbd7a1b144df73d01ee","infoHashBuffer":{"type":"Buffer","data":[0,203,102,37,156,240,213,159,155,167,223,189,122,27,20,77,247,61,1,238]},"announce":[],"urlList":[]}}