{"title":"Parliament - Gloryhallastoopid (Or Pin the Tale on the Funky) .f","uid":6318091,"size":314204821,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:012dc62e796009941325a3f8c26d1619b596e14e&amp;dn=Parliament+-+Gloryhallastoopid+%28Or+Pin+the+Tale+on+the+Funky%29+.f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ulikes","files":15,"time":1302776892,"description":"Gloryhallastoopid is by far the most misunderstood P. Funk album. You have to understand that these guys were trying to keep on evolving musically and stick with the same theme that made them so successful. What you have is a decent album, but there is not enough musical meshing with a bunch of new members coming on around this time. Numerous side projects were also being constructed by George and the gang, and more time could've probably been put into this effort. With that said, it is still killer funk, and certainly better than most of the music put out around that time. Synthesizers are present on every track as less and less real bass is actually used. Bootsy is not on here as much as other albums and Bernie was all but gone. (Worrell did not co-write a single song here.) Once again, Junie Morrison is the main guy behind the keys. The lp starts off in fine fashion with a great intro and &quot;Gloryhallastoopid&quot; is a nice track to get us into the theme. &quot;Party People&quot; is good, but it suffers greatly from legnth and it strays from the theme. It tries too hard to duplicate Funkadelic's &quot;Knee Deep,&quot; but doesn't hold a candle to it. &quot;The Big Bang Theory&quot; is a great synth-oriented instrumental song that seems to almost be asking to be sampled by rap artists. &quot;The Freeze&quot; is a creative track, but it too suffers from legnth. The best 2 songs here are &quot;Theme From The Black Hole,&quot; and &quot;Colour Me Funky.&quot; They are both extremely funky and show that P. Funk was still alive and well. &quot;May We Bang You?&quot; tires on you after a while, but is a decent track none the less and closes out the album nicely. Though Bootsy isn't on here that much, he would practically dominate TROMBIPULATION, which is the last record from Parliament. I strongly recommend that album along with the main P. Funk albums from 75-78. \n\nTrack listing:\n1. Prologue\t0:47\n2. Gloryhallastoopid (Pin The Tale On The Funky)\t4:06\n3. Party People\t10:08\n4. The Big Bang Theory\t7:10\n5. The Freeze (Sizzaleenmean)\t8:59\n6. Colour Me Funky\t4:52\n7. Theme From The Black Hole\t4:38\n8. May We Bang You\t4:43\n\nEnjoy and please seed!!!","torrent":{"xt":"urn:btih:012dc62e796009941325a3f8c26d1619b596e14e","amp;dn":"Parliament+-+Gloryhallastoopid+%28Or+Pin+the+Tale+on+the+Funky%29+.f","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"012dc62e796009941325a3f8c26d1619b596e14e","infoHashBuffer":{"type":"Buffer","data":[1,45,198,46,121,96,9,148,19,37,163,248,194,109,22,25,181,150,225,78]},"announce":[],"urlList":[]}}