{"title":"Surfactants and Polymers in Aqueous Solution 2nd ed","uid":14592520,"size":6145632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:015c81cae94626a129eb3b81bd7a277220d8a45a&amp;dn=Surfactants+and+Polymers+in+Aqueous+Solution+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1463002185,"description":"Surfactants and Polymers in Aqueous Solution 2nd ed - K. Holmberg et al. (Wiley, 2003).pdf\r\n\r\nMany industrial formulations such as detergents, paints, foodstuff and cosmetics contain both surfactants and polymers and their interaction govern many of the properties. This book is unique in that it discusses the solution chemistry of both surfactants and polymers and also the interactions between the two. The book, which is based on successful courses given by the authors since 1992, is a revised and extended version of the first edition that became a market success with six reprints since 1998. Surfactants and Polymers in Aqueous Solution is broad in scope, providing both theoretical insights and practical help for those active in the area.\r\nThis book contains a thorough discussion of surfactant types and gives information of main routes of preparation. A chapter on novel surfactants has been included in the new edition. Physicochemical phenomena such as self-assembly in solution, adsorption, gel formation and foaming are discussed in detail. Particular attention is paid to the solution behaviour of surfactants and polymers containing polyoxyethylene chains. Surface active polymers are presented and their interaction with surfactants is a core topic of the book. Protein-surfactant interaction is also important and a new chapter deals with this issue. Microemulsions are treated in depth and several important application such as detergency and their use as media for chemical reactions are presented. Emulsions and the choice of emulsifier is discussed in some detail. The new edition also contains chapters on rheology and wetting.\r\nSurfactants and Polymers in Aqueous Solution is aimed at those dealing with surface chemistry research at universities and with surfactant formulation in industry","torrent":{"xt":"urn:btih:015c81cae94626a129eb3b81bd7a277220d8a45a","amp;dn":"Surfactants+and+Polymers+in+Aqueous+Solution+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015c81cae94626a129eb3b81bd7a277220d8a45a","infoHashBuffer":{"type":"Buffer","data":[1,92,129,202,233,70,38,161,41,235,59,129,189,122,39,114,32,216,164,90]},"announce":[],"urlList":[]}}