{"title":"Friends of God (Documentary)","uid":4787191,"size":707534051,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:017dc3ce19dc5a582e1e882594121b83752d6d10&amp;dn=Friends+of+God+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Paul-ish","files":-1,"time":1237589623,"description":"This is a DVD rip I did myself using Handbrake.\nhttp://handbrake.fr/\n\nEnjoy!\n\nDescription from Wikipedia:\nFriends of God: A Road Trip With Alexandra Pelosi is an HBO television documentary about evangelicals in the United States that is written, directed, produced, and narrated by Alexandra Pelosi, (daughter of current U.S. Speaker of the House, Nancy Pelosi). The documentary first aired on January 25, 2007 on HBO. Lisa Heller was supervising producer and Sheila Nevins was executive producer.\n\nIn this documentary, Alexandra Pelosi visits several of the largest evangelical Christian church congregations (&quot;megachurches&quot;) in the country, such as Lakewood Church and New Life Church (Colorado Springs, Colorado), and interviews their leaders and members. Pelosi also visits other Christian organizations like the Christian Wrestling Federation and Cruisers for Christ (a car club) as well as others committed to spreading the Gospel through their own unique packaging and marketing. The documentary centers around the relationship between Christian evangelical churches and political activism. It attempts to demonstrate how these organizations have shaped modern politics in regards to issues that include, but are not limited to, gay rights, abortion, and the creation-evolution controversy.\n\nPLEASE COMMENT!","torrent":{"xt":"urn:btih:017dc3ce19dc5a582e1e882594121b83752d6d10","amp;dn":"Friends+of+God+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017dc3ce19dc5a582e1e882594121b83752d6d10","infoHashBuffer":{"type":"Buffer","data":[1,125,195,206,25,220,90,88,46,30,136,37,148,18,27,131,117,45,109,16]},"announce":[],"urlList":[]}}