{"title":"Corrosion Of Conformity -feat Pepper Keenan Compilation 2014 a2k","uid":11380732,"size":162713696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0181e5f93969462258ec5d017d214ac634205ac0&amp;dn=Corrosion+Of+Conformity+-feat+Pepper+Keenan+Compilation+2014+a2k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"analogkid6103","files":13,"time":1415211753,"description":"Hah its been awhile since I made a description on the fly but here goes... What we got A compilation of CoC Tracks that feature the Vocals of Pepper Keenan Who mostly is associated with Down now days but last I heard nothing was forever. Down Is a great Kicking Ass band , but pointof contention Pepper dont sing in Down  I mean Duh But Down has Phil Anselmo so theres that. Right? Hmmmm not quite.  How Down is one of my top bands  No doubt. 0 But I miss the oppertunities that CoC had with him If anyone could have returned CoC to prominance I think It would be Pepper Keenan but I dont get to make such decisions. Tats YOUR job cause the bottom line is what you guys want and will support And of that I also have 0 doubts. Anyway I am putting this out there and we will see if something happens.             I made some selections based on what else Vocals and Guitar work which Keenan handles the both of.  So make some noise if ya like and if ya dont ......Than why are you even here?The top 100 are far from here Except for my Slipknot which is mostly  an rare exception Since my Music of choice Dont usally live in the rare air of PoP which for the most part i find mindless and forgettable. But Im practical as well and know that thousands of seeders arn in permalock up there Its hard to believe that there is 2-3,4 year old shit that just lingers there. Ah well enjoy this and seed it so that the few who will want this are able to get it and 1 track from Down Its just to good to pass up and Its Keenan on the six string so is also relevant  Metal today,tomorrow and .......................................predicting this will be downloaded maybe 20 or 30 times and I say Cool... cause thats probably my target audience and who else would I try for?   Hit files for track identification mp3  320k Natch.  Late   Im out and this is up","torrent":{"xt":"urn:btih:0181e5f93969462258ec5d017d214ac634205ac0","amp;dn":"Corrosion+Of+Conformity+-feat+Pepper+Keenan+Compilation+2014+a2k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0181e5f93969462258ec5d017d214ac634205ac0","infoHashBuffer":{"type":"Buffer","data":[1,129,229,249,57,105,70,34,88,236,93,1,125,33,74,198,52,32,90,192]},"announce":[],"urlList":[]}}