{"title":"Adam Thorpe - Ulverton: A Novel (pdf)","uid":10299384,"size":3638840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01b01c9bd6c035aac7fabf23863ed9bd0fc275e8&amp;dn=Adam+Thorpe+-+Ulverton%3A+A+Novel+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401947482,"description":"Adam Thorpe - Ulverton: A Novel (FSG, 1992). 390 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. (There's another version of this book online, an epub that's missing most of the unusual formatting, especially in the last chapter.)\n\n\nAnother books that's been forgotten, at least in the U.S. But in the U.K., it's been reprinted recently as a classic.\n\n\ndescription:\n\nThree hundred years of English history come alive through the lives and fortunes of the inhabitants of Ulverton, a fictional village on England's Wessex Downs. A first novel.\n\nFrom Library Journal\n\nIn its long history, the town of Ulverton in Wessex Downs has withstood the impact of major world-wide events as well as events of local importance from the local murder of a returned soldier in 1650 through the discovery and photography of an Egyptian tomb in 1859 to the desecrations of a developer in 1988. First-time novelist Thorpe immerses the reader in the language, social mores, and attitudes of each succeeding chapter in the town's history. A challenging, exciting, mind-expanding novel of historical fiction, Ulverton provides readers with subtle intergenerational connections. It's one of those novels of lasting value that will be read and re-read for sheer pleasure.\n\nFrom Publishers Weekly\n\nThis first novel was warmly received in England, and it is easy to see why. It possesses many of the virtues of the traditional English novel--pride of place, respect for a winsome underclass and an overriding fascination with the language and wiles of the ruling elite--and at the same time radically subverts those virtues. Thorpe's ambitions are broad, and paradoxically so, since he has subjected himself to the narrow constraints of period style. No single family or dominant theme threads through the novel's 12 chapters; they are unified only in their recounting of events--or more accurately, their extended snatches of language--grounded in rural Ulverton, a fictional town in Thomas Hardy's Wessex. The opening scene depicts one of Cromwell's soldiers staggering home; the closer is a shooting script for a film about the failed purchase of land in Ulverton in 1988. In between we are treated to letters from a barely literate mother to her imprisoned son (said to date from 1775), a story, told in an alehouse, about a road accident (1803), an arch Victorian discussion of a collection of photographs, and more. Thorpe's attempt to portray a changing England solely through changing literary conventions is more than admirable. However, it is sometimes less than readable (&quot; 'tis the seed of wild clymatis, that is named bedwine here, it must grow &amp; tangle these words ere long, or I puff it out again&quot;). A post-modern novel if there ever was one, Ulverton is nevertheless a better idea than it is a book. ","torrent":{"xt":"urn:btih:01b01c9bd6c035aac7fabf23863ed9bd0fc275e8","amp;dn":"Adam+Thorpe+-+Ulverton%3A+A+Novel+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b01c9bd6c035aac7fabf23863ed9bd0fc275e8","infoHashBuffer":{"type":"Buffer","data":[1,176,28,155,214,192,53,170,199,250,191,35,134,62,217,189,15,194,117,232]},"announce":[],"urlList":[]}}