{"title":"Railworks TS2014 EWS Class 92","uid":9749779,"size":62829249,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:01c8e3ea5951322fc59b67b2fc53ed03145483c7&amp;dn=Railworks+TS2014+EWS+Class+92&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tygn547","files":-1,"time":1394648328,"description":"The dual voltage Class 92 electric locomotive is now available for Train Simulator in the privatised livery of English, Welsh &amp; Scottish Railway (EWS) livery. \n\nThe Class was built by a consortium of Brush Traction and ABB Traction between 1993 and 1996 with the intention of running services through the Channel Tunnel between Britain and France. All locomotives were fitted with dual voltage operation to allow operation on either third rail 750v DC or overhead 25kV AC power, with most electrical systems duplicated to reduce the possibility of locomotive failure in the Channel Tunnel. \n\nIn total, 46 locomotives were built in the Class and shared a body shell with the Class 60, albeit with a modified front end. The locomotive was fitted with both rheostatic and regenerative braking, in addition to standard Westinghouse air brake equipment, and an electrical train bus was fitted to enable two locomotives to work in multiple formation, either double-heading or in push-pull formation with a Driving Van Trailer (DVT). \nPost privatisation, the fleet was split between EWS, European Passenger Services, Eurostar (UK) and SNCF; the six locomotives retained by Eurostar were initially earmarked to head sleeper services through the Channel Tunnel, but this project was quickly abandoned. \n\nThe BR Class 92 for Train Simulator is available in former BR Railfreight grey livery with EWS overlay stickers to replicate the locomotive as it looked under EWS ownership. The locomotive features functioning dual voltage operation, vacuum circuit breaker to isolate power supply, PBL brake, variable wiper speed, pantograph up/down control, power mode selector and AWS. Also included are loaded and unloaded Megafret container wagons. \n\nThe locomotive is also Quick Drive compatible, giving you the freedom to drive the EWS Class 92 on any Quick Drive enabled route for Train Simulator, such as those available through Steam. Also included are scenarios specifically for the West Coast Main Line North route (available separately and required to play these scenarios).","torrent":{"xt":"urn:btih:01c8e3ea5951322fc59b67b2fc53ed03145483c7","amp;dn":"Railworks+TS2014+EWS+Class+92","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01c8e3ea5951322fc59b67b2fc53ed03145483c7","infoHashBuffer":{"type":"Buffer","data":[1,200,227,234,89,81,50,47,197,155,103,178,252,83,237,3,20,84,131,199]},"announce":[],"urlList":[]}}