{"title":"Invincible - Inside Arsenal's Unbeaten 2003-2004 Season - Gooner","uid":14586624,"size":4509064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0222c43fa7f8de3a9b2c28daba4ce09a294da3d0&amp;dn=Invincible+-+Inside+Arsenal%27s+Unbeaten+2003-2004+Season+-+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1462927651,"description":"Invincible - Inside Arsenal's Unbeaten 2003-2004 Season (2014).epub Gooner\r\n\r\nPublisher: Viking; 1st Edition edition (23 Oct. 2014)\r\nLanguage: English\r\nISBN-10: 024100456X\r\nISBN-13: 978-0241004562\r\n\r\nInvincible by Amy Lawrence: A gripping insider's account of how Bergkamp, Henry, Vieira and Pires became the first team in 100 years to go the entire season undefeated\r\n\r\n2014 Writer of the Year, Football Supporters' Federation\r\n\r\n'This book is so full of exclusive interviews you'll soon feel like part of the squad. A worthy tribute to one of English football's best ever teams, it makes you long for one more game at Highbury' Shortlist\r\n\r\n'Unbeatable insight' \r\nHenry Winter, Daily Telegraph\r\n\r\nIn 2003-04, a team that played with lightning speed and lustrous skill fulfilled Wenger's lifelong dream - to go a whole season unbeaten. They pushed and inspired each other, bringing the best out of strong characters like Jens Lehmann, a self-styled 'Mad German', Sol Campbell, an intense competitor, Robert Pirès, an instant friend if you give him a football, Patrick Vieira, a soft-spoken, battle-hardened captain, Gilberto, a thoughtful Brazilian, Thierry Henry, a supremely gifted and obsessed scorer and creator, and Dennis Bergkamp, the perfectionist conductor.\r\n\r\nBased on exclusive player interviews, and with a foreword and afterword by Arsene Wenger, this definitive book allows the Invincibles to tell their own story. Football writer Amy Lawrence weaves together the team's recollections, and the testimonies of other key players and protagonists around the club, to relive the pivotal games and moments. From the battle of Old Trafford to jubilation at White Hart Lane, from training ground sparks to dressing room revelations, readers will go behind closed doors, onto the pitch, and into the players' minds to understand the teamwork and the psychology to go unbeaten.\r\n\r\nPublished in time for the 10-year anniversary, this is a must-have read for any Arsenal fan. It will be enjoyed by readers of memoirs by Dennis Bergkamp and Tony Adams, and will also appeal to football fans everywhere who enjoy classic sports books such as The Damned United.\r\n\r\nAmy Lawrence has watched football avidly since her first trip to Highbury at the age of six, and has written about it, mostly for the Guardian and the Observer, for twenty years. She lives in London","torrent":{"xt":"urn:btih:0222c43fa7f8de3a9b2c28daba4ce09a294da3d0","amp;dn":"Invincible+-+Inside+Arsenal%27s+Unbeaten+2003-2004+Season+-+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0222c43fa7f8de3a9b2c28daba4ce09a294da3d0","infoHashBuffer":{"type":"Buffer","data":[2,34,196,63,167,248,222,58,155,44,40,218,186,76,224,154,41,77,163,208]},"announce":[],"urlList":[]}}