{"title":"[PS3] Rapala Pro Bass Fishing 2010","uid":9917464,"size":4351914286,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:02ca1bb8f3dad5d301a1f969ea9b65d40160bfc8&amp;dn=%5BPS3%5D+Rapala+Pro+Bass+Fishing+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"fuckface69","files":-1,"time":1396918101,"description":"* For the first time ever, compete against real life pro fishermen in authentic tournament action and prove you're the best of the best!\n* Authentic pro experience: use the same tools that the pros use including an unequaled assortment of Rapala lures and licensed boats, motors, and gear to fish over 25 species of trophy fish\n* Simultaneous multiplayer: challenge your friends in a variety of competitive fishing and angling challenges\n* Experience exciting pro tournament action as you compete against the Rapala pro staff in over 20 tournament events\n* &quot;Sports TV&quot; style presentation includes announcer commentary, live updates, competitive leader boards, analysis, and heart-pounding final weigh-ins!\n\nRapala Pro Bass Fishing 2010 pits players against real-life fishing pros on top freshwater lakes across North America - only the finest techniques and equipment will determine who is the best of the best. For the first time ever in a fishing game, the competition is set up in a professional tournament structure and the action is presented as a live TV event with announcers (including Barry Brueland, the voice of InFisherman TV), live updates, competitive leader boards, analysis, and heart-pounding final weigh-ins. The competition gets tough as you fish through over 20 tournament events on your quest for the season trophy.","torrent":{"xt":"urn:btih:02ca1bb8f3dad5d301a1f969ea9b65d40160bfc8","amp;dn":"%5BPS3%5D+Rapala+Pro+Bass+Fishing+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02ca1bb8f3dad5d301a1f969ea9b65d40160bfc8","infoHashBuffer":{"type":"Buffer","data":[2,202,27,184,243,218,213,211,1,161,249,105,234,155,101,212,1,96,191,200]},"announce":[],"urlList":[]}}