{"title":"Lois McMaster Bujold - Borders of Infinity (all three stories)","uid":4887826,"size":214855720,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:02ff1f860f8c1f47daa44a95a3a8bb7b2bd5a5b4&amp;dn=Lois+McMaster+Bujold+-+Borders+of+Infinity+%28all+three+stories%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Atilla82","files":20,"time":1241810641,"description":"Borders of Infinity (1989) (Collection of &quot;The Mountains of Mourning&quot;, &quot;Labyrinth&quot; and &quot;The Borders of Infinity&quot;, tied together with an original frame story interspliced between them, which is set shortly after Brothers in Arms.)\n\n___\n&quot;Mountains of Mourning&quot; (novella)\n\nA woman from the isolated village of Silvy Vale walks to Vorkosigan Surleau to report the suspected murder of her baby, who was born with a hare lip and cleft palate. Miles' father sends him to investigate as his Voice to gain experience. Miles solves the mystery and exercises justice and mercy in appropriate measure.\n___\n&quot;Labyrinth&quot; (novella)\n\nMiles takes the Dendarii cruiser Ariel on a mission to Jackson's Whole ostensibly to buy weapons, but in actuality to smuggle geneticist Dr. Hugh Canaba away from his current employer and into Barrayaran hands. Canaba throws a wrench into the works when he refuses to leave without certain experimental samples which he has injected into one of his earlier projects, a prototype &quot;super-soldier&quot; created from human, wolf and horse DNA. Even worse, it has been sold to the paranoid and sadistic Baron Ryoval whom Miles has recently offended.........\n____\n&quot;Borders of Infinity&quot; (short story)\n\nMiles goes undercover as a Marilacan soldier, allows himself to be captured by the Cetagandans, who have invaded and occupied Marilac, and is deposited in a maximum-security POW camp on Dagoola IV. His mission is to get a single man out of the camp, but he has to improvise when his target proves to be comatose. With a little help from Suegar, an apparent religious fanatic, and Tris, the leader of the female prisoners, he reinstitutes order and civilisation in the camp, gets the POWs to rehearse quick transport embarkation, and stages a mass breakout.....\n_____\n\nInfo from Wikipedia\n\nall files are 48kbps/44100 Hz sampel rate","torrent":{"xt":"urn:btih:02ff1f860f8c1f47daa44a95a3a8bb7b2bd5a5b4","amp;dn":"Lois+McMaster+Bujold+-+Borders+of+Infinity+%28all+three+stories%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02ff1f860f8c1f47daa44a95a3a8bb7b2bd5a5b4","infoHashBuffer":{"type":"Buffer","data":[2,255,31,134,15,140,31,71,218,164,74,149,163,168,187,123,43,213,165,180]},"announce":[],"urlList":[]}}