{"title":"Clinical Nutrition in Practice","uid":8238591,"size":1436537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:032a0656e5db51a87bd27e993c73f81b410a2b7a&amp;dn=Clinical+Nutrition+in+Practice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1362911501,"description":"Nikolaos Katsilambros, Charilaos Dimosthenopoulos, Meropi D. Kontogianni, Evangelia Manglara, Kalliopi-Anna Poulia, &quot;Clinical Nutrition in Practice&quot;\n2010 | ISBN: 1405180846 | 232 pages | PDF | 1,4 MB\n\nAn easy-to-use book with questions on clinical nutrition clearly posed and answers based on real-life studies, this is a ready reference for the busy healthcare professional.\nClinical Nutrition in Practice opens with introductory chapters on the basis of healthy nutrition, malnutrition and nutritional assessment. These are followed by chapters addressing the nutritional needs of patients with obesity, diabetes, cardiovascular disease, rheumatoid and neurologic disorders, as well as diseases of various organ systems, such as the GI tract, renal and pulmonary systems. Special attention is given to describing nutrition in cancer patients and those with HIV/AIDS and the book concludes with a discussion of enteral and parenteral nutrition.\n\nNutritionists, dietitians and other health professionals working with patients with impaired nutrition or special nutritional requirements, such as diabetologists, endocrinologists (especially those treating obesity), cardiologists and oncologists will find this a refreshing approach to an important subject. Nurses, medical students and those working in the food industry will also find this a handy guide.\n","torrent":{"xt":"urn:btih:032a0656e5db51a87bd27e993c73f81b410a2b7a","amp;dn":"Clinical+Nutrition+in+Practice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"032a0656e5db51a87bd27e993c73f81b410a2b7a","infoHashBuffer":{"type":"Buffer","data":[3,42,6,86,229,219,81,168,123,210,126,153,60,115,248,27,65,10,43,122]},"announce":[],"urlList":[]}}