{"title":"Japon 2002 DVDRip Sonata Premiere","uid":8816135,"size":797378899,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0407af3222db6e318d3972a3d8b062c2623eed6e&amp;dn=Japon+2002+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"klinho","files":3,"time":1376590915,"description":"A man on the brink of suicide regains the will to live under decidedly unusual circumstances in this drama from Mexico. A quietly despondent man (Alejandro Ferretis) leaves behind the city for a journey into a quiet village in the valley, telling anyone who cares to know that once he's settled in, he intends to kill himself. The man takes a room with Ascen (Magdalena Flores), and elderly woman who lost her husband some years ago. Keeping to himself, the man paints, thinks, and prepares himself for death, while Ascen slowly becomes aware of the depth of his depression. As Ascen's nephew attempts to rob her of her share of the family estate, the man feels a desire to live waking inside him again -- as well as the desire for a woman. Improbably, the man turns to Ascen for physical affection, and sensing his need for comfort, she complies, though the seduction lacks a great deal in the way of romance. The first feature film from writer and director Carlos Reygadas, Japon received an enthusiastic response when it was screened as part of the Directors' Fortnight series at the 2002 Cannes Film Festival.\n\n\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:0407af3222db6e318d3972a3d8b062c2623eed6e","amp;dn":"Japon+2002+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0407af3222db6e318d3972a3d8b062c2623eed6e","infoHashBuffer":{"type":"Buffer","data":[4,7,175,50,34,219,110,49,141,57,114,163,216,176,98,194,98,62,237,110]},"announce":[],"urlList":[]}}