{"title":"iTunes AudioBook - John Eldredge - Wild at Heart","uid":4536561,"size":141002362,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:04270842d7ac352a91b4ef49b40c09028ffa9c9b&amp;dn=iTunes+AudioBook+-+John+Eldredge+-+Wild+at+Heart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TGIFNC","files":1,"time":1227760248,"description":"THE GOSPEL IS FREE - NOT CHEAP\nClick on my username to see more torrents.\n\n\n\niTunes AudioBook - John Eldredge - Wild at Heart\n\n\n\nPLEASE ONLY DOWNLOAD IF YOU INTEND TO SEED FOR 2 WEEKS.\nPlay your part in keeping the Gospel FREE.\nAll my torrents are ENCRYPTED. Turn on encryption in your client if you want to download or you won't see anything.\n\n\n\nLike any uploader, I like to see appreciative comments below :)\t\n\n\n\nAmazon.com Review\nIf Christian men are going to change from a pitiful, wimpy bunch of &quot;really nice guys&quot; to men who are made in the image of God, they must reexamine their preconceptions about who God is and recover their true &quot;wild&quot; hearts, writes bestselling author John Eldredge in Wild at Heart: Discovering a Life of Passion, Freedom, and Adventure. Eldredge throws down the gauntlet--men are bored; they fear risk, they refuse to pay attention to their deepest desires. He challenges Christian men to return to authentic masculinity without resorting to a &quot;macho man&quot; mentality. Men often seek validation in venues such as work, or in the conquest of women, Eldredge observes. He urges men to take time out and come to grips with the &quot;secret longings&quot; of their hearts. Although the book succeeds best in its slant toward a male audience, it also strives to help women understand the implications of authentic masculinity in their relationships with men. Eldredge frames the book around his outdoor experiences and appealing anecdotes about his family, sprinkling the text with touches of humor and overlying everything with heartfelt passion. Even as he mixes eclectic ideas about masculinity from popular movies such as Braveheart with classic words from Oswald Chambers, and lyrics from the Dixie Chicks with stories from the Bible, he points to only one answer for men searching for their true wildness of heart. Writes Eldredge, &quot;The only way to live in this adventure ... with all its danger and unpredictability and immensely high stakes ... is in an ongoing, intimate relationship with God.&quot; --Cindy Crosby\n\n\nProduct Description\nGod designed men to be dangerous, says John Eldredge. Simply look at the dreams and desires written in the heart of every boy: To be a hero, to be a warrior, to live a life of adventure and risk. Sadly, most men abandon those dreams and desires-aided by a Christianity that feels like nothing more than pressure to be a 'nice guy.' It is no wonder that many men avoid church, and those who go are often passive and bored to death. In this provocative book, Eldredge gives women a look inside the true heart of a man and gives men permission to be what God designed them to be-dangerous, passionate, alive, and free.","torrent":{"xt":"urn:btih:04270842d7ac352a91b4ef49b40c09028ffa9c9b","amp;dn":"iTunes+AudioBook+-+John+Eldredge+-+Wild+at+Heart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04270842d7ac352a91b4ef49b40c09028ffa9c9b","infoHashBuffer":{"type":"Buffer","data":[4,39,8,66,215,172,53,42,145,180,239,73,180,12,9,2,143,250,156,155]},"announce":[],"urlList":[]}}