{"title":"My Family Season 2","uid":3663116,"size":2386255872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:044c4312b00c366921f23a5e2988a972f32b6a41&amp;dn=My+Family+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"*Criminal*","files":13,"time":1176474270,"description":"Episode 1: All Roads Lead to Ramon\n\nNick needs a job and Susan volunteers to hire him to work with her. Meanwhile Ben inadvertently calls Janey a prostitute as the two discuss her boyfriends.\n\nEpisode 2: The Unkindest Cut\n\nSusan thinks she has become pregnant and Ben is disappointed about the prospect of having another child. When they realize it was a false alarm, Susan decides that the answer is surgery - on Ben!\n\nEpisode 3: Parisian Beauty\n\nA French exchange student causes havoc with the Harper men. Nick joins a science experiment. Michael must sleep in Nick&amp;#039;s room with interesting results.\n\nEpisode 4: Trust Never Sleeps\n\nWhen Susan finds that Janey doesn&amp;#039;t trust her, she lets her have a teenage party alone while she is in Oxford with Ben. However the two lose confidence and return, only to be trapped in their bedroom when the guests arrive. When Ben needs to use the toilet, and the one in their bedroom is broken, things only get worse!\n\nEpisode 5: Death and Ben Take a Holiday\n\nWhen Aunt Margaret dies, Ben has to travel to Leeds for the funeral with Nick. However, things descend into chaos as the two have to share a bed in a hotel! Worse still, Susan has acquired some &quot;flu medicine&quot; from one of Janey&amp;#039;s friends.\n\nEpisode 6: Driving Miss Crazy\n\nBen feuds with his neighbor, Mr Casey, and the two become involved in a lengthy battle for moral supremacy. Meanwhile, Janey has her driving test but cannot find a responsible adult to practice with.\n\nEpisode 7: I Second That Emulsion\n\nThe Harpers quarrel over new home decor. Nick takes jobs as a piano tuner and assistant at the hardware shop. Janey and Stupid Brian&amp;#039;s relationship reaches a new stage.\n\nEpisode 8: Age of Romance\n\nSusan is disapproving of Nick&amp;#039;s new girlfriend, Amanda, and invites her to dinner to express her feelings on the matter. Things become heated, however, when Susan realizes that she&amp;#039;s married! Meanwhile, Michael has a new computer, and Janey feels neglected.\n\nEpisode 9: Get Cartier\n\nBen fears for his life when he becomes dentist to the mob but Susan doesn&amp;#039;t seem to mind. Her opinion changes, however, on seeing Michael selling off the mob&amp;#039;s gifts by phone. Meanwhile, it&amp;#039;s their anniversary, and Susan&amp;#039;s determined to find what Ben bought her.\n\nEpisode 10: &amp;#039;Tis Pity She&amp;#039;s a Whore\n\nSusan sends Janey in her place to visit her mother, where Janey finds out a family secret. Meanwhile, Michael stands in his school elections and Ben is on a quest to find excitement in his family tree.\n\nEpisode 11: The Last Supper\n\nSusan invites her American boss to discuss the direction the company is heading; however, when she begins to argue with him, his &quot;acid reflux&quot; is triggered. When he suffers a heart attack, Susan feels guilty and is determined to confess.\n\nEpisode 12: Ben Wants to Be a Millionaire\n\nWhen Ben meets one of his old school-friends he considers the idea of investing some money, and asks him for advice. Meanwhile Nick tries to sell his body parts on eBay!\n\nEpisode 13: Breakable\n\nNick&amp;#039;s decision to form a Motorcycle Stunt Display Team leads to him winding up in hospital with numerous injuries. However, he soon enjoys being able to call a nurse at the press of a button! Meanwhile Susan decides that Ben needs to tell Nick that he loves him.\n\n\nPLEASE DONT TELL ME TO SEED, I TURN MY COMPUTER OFF AT NIGHTS (TZ: +2:00) SO BE PATIENT!\n\n\nENJOY!!!","torrent":{"xt":"urn:btih:044c4312b00c366921f23a5e2988a972f32b6a41","amp;dn":"My+Family+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"044c4312b00c366921f23a5e2988a972f32b6a41","infoHashBuffer":{"type":"Buffer","data":[4,76,67,18,176,12,54,105,33,242,58,94,41,136,169,114,243,43,106,65]},"announce":[],"urlList":[]}}