{"title":"Munir Bachir (Iraq) - Master Of The Ud (Arab Lute) 3CD TQMP","uid":4675581,"size":618368811,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:049e8c1de8dcf7af12c24b9113097e2647c16015&amp;dn=Munir+Bachir+%28Iraq%29+-+Master+Of+The+Ud+%28Arab+Lute%29+3CD+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Breezin","files":29,"time":1232891578,"description":"A Must Have for everyone who loves either Music from the East or Music from Stringed Instruments \n\nInfo extracted from CD BOX Booklet \n\n&quot;Munir Bachir (1930-1997) was born in Mosul (Iraq), into a long established family of musicians. His father taught him to play the Ud at a very young age. He then spent six years studying at the Baghdad Institute of Music, directed by Sharif Muhyiddin. Later, he completed a doctorate of musicology in Budapest. As a passionate defender of Arab music, Munir Bachir was in constant rebellion against the misrepresentation of this music and its use for commercial ends. He spent several years fighting to establish his lute as a solo recital instrument and travelled the world as a true ambassador for Arab classical music, bringing it to specialists as well as to a larger audience and restoring credentials to a music that had become debased through bending to the tastes of colonial nostalgia. Faithful to the letter and the spirit of traditional Arab music, Munir Bachir improvised from fully authenticated sources. As much creator as performer, his music was forever evolving, never repetitive.&quot; \nCHERIF KHAZNADAR\n\nLive in Paris CD:\n&quot;When I hold my Ud, I do not have a clear idea of what I am going to play. A few moments pass before the plectrum begins to strike the strings softly yet with majestic assurance. At this moment, I embark on a musical journey where the melody is never repeated. I delve inwardly into the depths of my mind, travelling far into the past, into my personal heri- \ntage and into history. The human picture, the mental description, reflecting a tradition of thousands of years, and a personal philosophy, combine with the urge to communicate with the public before me. The musical journey followed by the audience and myself wells up from this innermost consdousness rooted in the different aspects of my personnality. The improvisations and my spontaneous musical creation break out in a profusion of multi-coloured shapes and follow free rhythmical patterns, soaring far beyond any limited esthetic framework. Ovations do not affect me although noise among the public does. I love to listen to the music of the Maqiim and to live the pure musical time when I am transported into the hearts of the listeners.&quot; MUNIR BACHIR\n\nMaqamat CD:\n&quot;Munir Bachir stands out as the greatest Arab lutenist of the late twentieth century. As he grew older, his playing was divesting itself of the inessential, attaining that ineffable purity which is the hallmark of every great creative artist. In this second CD, far from any western mirage, Munir Bachir invites us to embark on a journey to the innermost sources of Iraqi culture, from Mesopotamia to the Abbasid golden age through the rich offerings from popular traditions. In this spirit, he offers us two of his compositions: nzaqCinz bashiri and maqCim al asil. The Arab maqCim is a complex structure, resulting from the combination of a scale of distinctive sounds with a set of specific rules of organisation and finally the manner in which these rules are applied to achieve a work of art, a creation of the moment since the piece is usually improvised. Following this principle, for each maqCim there is a corresponding particular emotional state, a modal array of feeling which the musician uses like an artist's palette to convey a certain state of interiority to his listeners.&quot; PIERRE BOIS\n\nMeditations CD: \n&quot;In this third compact disc, Munir Bachir offers a musical exploration of mystical sensibility. Deeply attached to a broader vision of Arabic music, Munir Bachir placed himself from the outset in a dynamic current embracing both history and geography, since he considered the Golden Age of Arabic music from the Abbasside era as the result of elements integrated from Aramean, Mesopotamian, Persian, Syrian and Arabic culture. Then other elements - Byzantine, Turkish, late Persian - were added. These four meditations, although they claim their roots in the Muslim mysticism which has elevated the concept of the &quot;spiritual concert&quot; to a high art, have also borrowed elements from the oriental Churches, some of which still manifest the melodic vestiges of the ancient Assyrian civilization in their liturgies. The vision of Munir Bachir, thus transcending the Sufi quest for the union of the individual with God, bears witness to a contemplation on the essence of Man beyond time and space, and asserts its attachment to those civilizations which have acquired a universal value with history. In the final analysis, this music is a recognition of human genius. If man has been created in the image of God, and if he aspires to be united with Him through love and the gift of self, then it is through music, more than any other form of art, that man is allowed to escape from everyday contingencies, to feel the breath of the divine within himself, and to assert his own capacity to give and create. Improvisation, or composition? Munir Bachir presented these recordings as composed improvisations. Having long ago understood the extent to which a recording fixes the musical moment in time, the artist could no longer claim the transience, the fleetingness found in traditional taqsfm. Moreover, under the double influence of Indian raga and Western recitals, the taqsfm has acquired a new status. This interlude, intended to prepare the audience for the ambiance of a musical mode in a suite of sung poems, has become the core of instrumental recitals. By accustoming his listeners over the years to improvisations which were ever longer and more complex, as much in form as in modal system, Munir Bachir has, in the end, achieved composed works which nevertheless retain an impromptu, unpredictable character which is the very soul of improvisation.&quot; PIERRE BOIS\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;91f3e3f4f4ebf8ffd1fdf8e7f4bffffd&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:049e8c1de8dcf7af12c24b9113097e2647c16015","amp;dn":"Munir+Bachir+%28Iraq%29+-+Master+Of+The+Ud+%28Arab+Lute%29+3CD+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"049e8c1de8dcf7af12c24b9113097e2647c16015","infoHashBuffer":{"type":"Buffer","data":[4,158,140,29,232,220,247,175,18,194,75,145,19,9,126,38,71,193,96,21]},"announce":[],"urlList":[]}}