{"title":"The Customer Rules: The 39 Essential Rules ","uid":8337651,"size":2100996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05e032a2b65020b3c7b16adb2b5093837dbf21c8&amp;dn=The+Customer+Rules%3A+The+39+Essential+Rules+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365016957,"description":"The Customer Rules: The 39 Essential Rules for Delivering Sensational Service By Lee Cockerell\n2013 | 208 Pages | ISBN: 1781251223 , 0770435602 | EPUB | 2 MB\n\n\n\nToday, consumers have more choice than ever before. It's no longer enough to simply provide a service - companies who want to stay in business must also provide impeccable service with such consistency, integrity and creativity that people who experience it will not only keep coming back for more, but recommend your business to their friends, families, and colleagues. The Customer Rules is entirely focused on one ultimate goal: to help you, no matter what your position or job title, secure the most revenue-boosting asset you could wish for: a reputation for excellent service. Lee Cockerell, former Executive Vice President of Operations at Disney World - a company which has redefined what a business can do for their customers - shows you how: from why you should 'Never say no - except No Problem' to asking yourself 'What Would Mum Do?'. His 39 easy-to-follow rules apply to any industry and any company, large, small, public, private, online or High Street. The principles revealed in this book, tried and tested in one of the world's happiest environments, can give you everything you need to truly connect with your customers.","torrent":{"xt":"urn:btih:05e032a2b65020b3c7b16adb2b5093837dbf21c8","amp;dn":"The+Customer+Rules%3A+The+39+Essential+Rules+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05e032a2b65020b3c7b16adb2b5093837dbf21c8","infoHashBuffer":{"type":"Buffer","data":[5,224,50,162,182,80,32,179,199,177,106,219,43,80,147,131,125,191,33,200]},"announce":[],"urlList":[]}}