{"title":"David Quammen - The Boilerplate Rhino- Nature in the Eye of the ","uid":10108414,"size":1579297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0659ae0a5b54cfc53f3d1d7e12fd7a7be6eb0e92&amp;dn=David+Quammen+-+The+Boilerplate+Rhino-+Nature+in+the+Eye+of+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"krystine","files":-1,"time":1399488297,"description":"In 1981 David Quammen began what might be every freelance writer's dream: a monthly column for Outside magazine in which he was given free rein to write about anything that interested him in the natural world. His column was called &quot;Natural Acts,&quot; and for the next fifteen years he delighted Outside's readers with his fascinating ruminations on the world around us. The Boilerplate Rhino brings together twenty-six of Quammen's most thoughtful and engaging essays from that column, none previously printed in any of his earlier books. \nIn lucid, penetrating, and often quirkily idiosyncratic prose, David Quammen takes his readers with him as he explores the world. His travels lead him to rattlesnake handlers in Texas; a lizard specialist in Baja; the dinosaur museum in Jordan, Montana; and halfway across Indonesia in search of the perfect Durian fruit. He ponders the history of nutmeg in the southern Moluccas, meditates on bioluminescent beetles while soaking in the waters of the Amazon, and delivers &quot;The Dope on Eggs&quot; from a chicken ranch near his hometown in Montana. \nQuammen's travels are always jumping-off points to explore the rich and sometimes horrifying tension between humankind and the natural world, in all its complexity and ambivalence. The result is another irrepressible assortment of ideas to explore, conundrums to contemplate, and wondrous creatures to behold.\n","torrent":{"xt":"urn:btih:0659ae0a5b54cfc53f3d1d7e12fd7a7be6eb0e92","amp;dn":"David+Quammen+-+The+Boilerplate+Rhino-+Nature+in+the+Eye+of+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0659ae0a5b54cfc53f3d1d7e12fd7a7be6eb0e92","infoHashBuffer":{"type":"Buffer","data":[6,89,174,10,91,84,207,197,63,61,29,126,18,253,122,123,230,235,14,146]},"announce":[],"urlList":[]}}