{"title":"Friends Without Benefits (Book #2, Knitting in The City Series) ","uid":10189806,"size":894474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:065c333c919877e1c869e94ac4ab397d99adabbf&amp;dn=Friends+Without+Benefits+%28Book+%232%2C+Knitting+in+The+City+Series%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1400622000,"description":"Friends Without Benefits can be read as a standalone, is a full length 120k word novel, and is book #2 in the Knitting in the City Series.\n\nThere are three things you need to know about Elizabeth Finney: 1) She suffers from severe sarcastic syndrome, especially when she's unnerved, 2) No one unnerves her like Nico Manganiello, and 3) She knows how to knit.\n\nElizabeth Finney is almost always right about everything: the musical merits of boy bands are undervalued by society, &quot;benefits&quot; with human Ken dolls are better without friendship, and the sun has set on her once-in-a-lifetime chance for true love. But when Elizabeth's plans for benefits without friendship are disarmed by the irritatingly charismatic and chauvinistic Nico Manganiello- her former nemesis- she finds herself struggling to maintain the electric fence around her heart while avoiding electrocution or, worse, falling in love.\n\nOctober 2013: 10% of profits go to the PCD Foundation for pediatric rare disease research: pcdfoundation.org/\nNovember 2013: 10% of profits go to the International Rhett Syndrome Foundation for pediatric rare disease research: rettsyndrome.org/\n\nReview\n\n&quot;*This book tops my list of best books of 2013.&quot; Sexy Book Times *sexybooktimes.com\n\n&quot;Y'all need to put on your fire proof panties while reading this because this sexy Italian stallion will quite literally set them on fire.&quot; Page Trotter Book Review\n\n&quot;*Reid blends outrageous humor, eccentric characters, and sexy, crazy plots to produce an addictive story you won't want to put down. &quot; Tori at Smexybooks *smexybooks.com\n\n&quot;The only complaint I have with this book is that it ended.&quot; **Dirty Girl Book Club dirtygirlbookclub.com\n\nAbout the Author\n\nABOUT PENNY:\nPenny Reid is a part time author of romantic fiction. When she is not immersed in penning smart romances she works full time in the biotech industry as a researcher. She's also a full time mom to two diminutive adults (boy-6 and girl-4), wife, daughter, knitter, crocheter, sewer, general crafter, and thought hijacker.\n\n","torrent":{"xt":"urn:btih:065c333c919877e1c869e94ac4ab397d99adabbf","amp;dn":"Friends+Without+Benefits+%28Book+%232%2C+Knitting+in+The+City+Series%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065c333c919877e1c869e94ac4ab397d99adabbf","infoHashBuffer":{"type":"Buffer","data":[6,92,51,60,145,152,119,225,200,105,233,74,196,171,57,125,153,173,171,191]},"announce":[],"urlList":[]}}