{"title":"Song for a raggy boy (DivX) moviesbyrizzo","uid":6039280,"size":660890181,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06a62411ee7b807be55d072e02abcc39b4a21ef0&amp;dn=Song+for+a+raggy+boy+%28DivX%29+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1292333499,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0339707/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0339707/&lt;/a&gt;\n\n720 x 480 DivX 800k video 128k audio\n\nWe have literally dozens of movies waiting to launch of special interest such as \nthis one here. We have eight times as much upload speed as we did this time last\nyear, however please note that we are on minimal speed during late night hours \n(due to throttling of our server - this occurs mainly on weekdays and an hour\nor so on saturdays).\n\n&quot;Song for a raggy boy&quot; is a sad movie indeed to have to endure sitting through.\nIt is btw a Film Board of Ireland presentation in conjunction with production\nthat is Irish-Danish-Spanish and UK combined.\n\nThere is some comparison that could be made to the movie Rope (Hitchcock 1948)\nin what is the theme of this movie. That &quot;lesser beings&quot; can be targeted for brutal\ninsane cruelty so as to feed the appetites of the inane. That this can be so with\nimpunity - even acquiesence of religious figures who harbour abusers in their midst\nwho have no right on our turf in fact - and this is most of all true where we are\nto be concerned for women and children as both are equally treated as expendable in\nthis movie tale in what are horrifying images of bestial cruelty towards our best\nof both.\n\nOh well! - so much for Nietzsche's idea of &quot;souper-man&quot;.\n\n\nThat all said, the idea of boarding school in the hands of a competent\nadministration, in full defence of the true Irish spirit, real Christianly\ngoodness for which we have no equal example in its radiating brilliance\nto us all, we cannot be persuaded to &quot;throw the baby out with the bath water&quot;\nsurely! \n\nMany children around the world where we take these issues to be our personal\nproblem, are in homes that have sadistic or inane parenting situations.\nThere are in fact a great many incompetents who hold and wield too much power\nover human beings that are fragile enough to be crushed in spirit or even murdered \nin mental deformity as a result - a word I choose with care - although the movie \nshows this to be quite literally so in some very rare cases where avoidance of the \nlaw is so possibly capable of being perpetrated by the offenders involved. these\nmindsets are only seen for who they are when they are in a position where they\ndon't think anyone is watching (really) or anyone cares enough - or that they will\nbe punished in any way tangible relative to their offences of the mind mainly\nbent on sadistic gratification.\n\nIf we consider the example of the greatly spirited Irish schoolteacher who\ncomes as saviour to the children in this movie, then we must accept that it\nmight be possible to staff instead with good folk who have real wisdom to teach \nthat is true to what is actually Irish as the opposers of this spirit are not\nIrish - but in fact an invader from some other form of being in what is considered\ntrue virtue. The Irish are Christianly in beauty and it is they that should be\nresponsible to ensure that there are boarding schools and reformatory schools\nthat hold to true Irish standards of Christianly goodness.\n\n\nWere this to be so, we could actually raise greatest kids that have been nourished\nadequately in all respects with love and care and familial; love warmth and \nacceptance that virtue is protected in Ireland and elsewhere this spirit is to \nrule.\n\nI was personally much fortunate in my British boarding school education to have\nbeen befriended by a headmaster who used to read to us few (personally) that were\nthe leaders of the individual dormitories in fact. he gave the greatest sense of \nwarmth and care that is true of the real spirit of Australia in fact! What greatest\nIrish folk there!\n\nTo these folks I say entrust the world in the future of our children - whether\nin Ireland proper, Italy Spain Germany Australia Sweden Holland or elsewhere!\n\nImagine the power we have potentially to create greatness through proper schooling\nby those with the rightly straight mind to teach human care and genuine idealism \ninstead!\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:06a62411ee7b807be55d072e02abcc39b4a21ef0","amp;dn":"Song+for+a+raggy+boy+%28DivX%29+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06a62411ee7b807be55d072e02abcc39b4a21ef0","infoHashBuffer":{"type":"Buffer","data":[6,166,36,17,238,123,128,123,229,93,7,46,2,171,204,57,180,162,30,240]},"announce":[],"urlList":[]}}