{"title":"Rise of Nations (Esp Full)","uid":4121605,"size":580546450,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0839068b887b6cf59af72057464f7c0dc9a175af&amp;dn=Rise+of+Nations+%28Esp+Full%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lelo_eet","files":4,"time":1207586102,"description":"[b]Analisis[/b]\nPlataforma: PC \nDesarrollador: Big Huge Games \nLanzamiento: 5/21/2003 [i](elegido Juego del AÃƒÂ±o por PC Games y otras publicaciones importantes)[/i]\nGenero: Estrategia \nNota: 8,5/10\n\t\n[i]Estrategia a traves de 6.000 aÃƒ?Ã‚Â±os de historia![/i]\nLa primera vez que vi imagenes e informacion de Rise of Nations pense \\&quot;Bueno, otro Age of Empires mas...\\&quot;, pero tras haber jugado rectifico mis ideas: Rise of Nations es un juego de estrategia muy al estilo Age of Empires, pero que aporta nuevas e interesantes ideas al genero de la estrategia en tiempo real. Estas nuevas ideas parecen tomadas de otros titulos como Civilization y Risk. Ãƒ?Ã‚Â¿Como se pueden combinar juegos tan dispares? Aqui esta la gracia y la grandeza del titulo: todo empieza en un tablero al mas puro estilo Risk, con naciones que se reparten los diferentes territorios del mundo y con una ficha de ejercito situada en nuestra capital. Cuando decidimos atacar o somos atacados por algun vecino con ganas de guerra la accion deja de lado el tablero y empieza el juego al mas puro estilo Age of Empires: una ciudad, pobladores, recursos, edificios y unidades militares. Pero aqui no queda todo. Si bien anteriormente habiamos tenido la oportunidad de construir nuevos centros urbanos, ahora nos encontramos con que es casi una necesidad, que cada ciudad tiene su economia y que podemos realizar comercio entre ellas, que ademas empujaran la frontera de nuestro territorio un poco mas lejos... Ãƒ?Ã‚Â¿No os recuerda a Civilization? A esto hay que aÃƒ?Ã‚Â±adirle una evolucion historica muy extensa. Podemos empezar en la epoca de los antiguos Romanos y acabar en la actualidad, con misiles nucleares y bombarderos invisibles.\nRise of Nations es un juego complejo, lleno de matices y con una cantidad de opciones muy superior a lo que estamos acostumbrados. La estrategia se ve representada de forma pura aqui, donde la velocidad y acierto de nuestras decisiones pueden suponer la victoria o la derrota. El enemigo no se andara con chiquitas y en ocasiones nos veremos envueltos en un sitio a una ciudad que puede durar hasta 20 minutos.\n\n[b]A favor[/b]\n+ El modo tablero\n+ La evolucion historica\n+ La cantidad de unidades\n+ Los nuevos conceptos de frontera\n+ Las bombas atomicas\n\t\n[b]En contra[/b]\n- No aporta nada nuevo a nivel grafico\n- En algunos momentos puede hacerse repetitivo\n\nRequerimientos minimos:\n\n    * Sistema operativo: Win98/ME/2000/XP\n    * Procesador: 500 MHz\n    * Video: 16 MB\n    * Memoria: 128 MB RAM\n    * Rigido: 500 MB de espacio libre","torrent":{"xt":"urn:btih:0839068b887b6cf59af72057464f7c0dc9a175af","amp;dn":"Rise+of+Nations+%28Esp+Full%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0839068b887b6cf59af72057464f7c0dc9a175af","infoHashBuffer":{"type":"Buffer","data":[8,57,6,139,136,123,108,245,154,247,32,87,70,79,124,13,201,161,117,175]},"announce":[],"urlList":[]}}