{"title":"Selected Letters of Charlotte Bronte (2007) (306p) [Inua].pdf","uid":11602187,"size":2495560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08f198c6c71dac34d1d58e17fb223c1e4be07261&amp;dn=Selected+Letters+of+Charlotte+Bronte+%282007%29+%28306p%29+%5BInua%5D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417367231,"description":"Title: Selected Letters of Charlotte Bronte\nAuthor: Charlotte Bronte\nEditor: Margaret Smith\nHardcover: 350 pages\nPublisher: Oxford University Press; First Edition edition (October 11, 2007)\nLanguage: English\nISBN-10: 0199205876\nISBN-13: 978-0199205875\n\nDescription:\nThese letters give an insight into the life of a writer whose novels continue to be bestsellers. They reveal much about Charlotte Bronte's personal life, her family relationships, and the society in which she lived. Many of her early letters are written with vigour, vivacity, and an engaging aptitude for self-mockery. In contrast, her letters to her &quot;master&quot;, the Belgian schoolteacher Constantin Heger, reveal her intense, obsessive longing for some response from him. Other letters are deeply moving, when Charlotte endures the agony of her brother's and sisters' untimely deaths. We learn also of the progress of her writing, including the astonishing success of Jane Eyre, and of her contacts with her publishers, including the young George Smith; and we recognize in her letters the life-experiences which are transmuted into the art of her novels. Contemporary society is brilliantly described in her letters from London, when she writes of her encounters with famous writers and with critics of her novels. We hear too of her visits to art galleries, operas, and the Great Exhibition of 1851 at the Crystal Palace. Dramatic letters written in December 1852 convey the &quot;turbulence of feeling&quot; in the Haworth curate Arthur Nicholls's proposal of marriage to her and in Mr Bronte's violent reaction to it; and we subsequently hear of her secret correspondence with her suitor, her father's eventual consent, and her tragically brief happy marriage, cut short by her death in March 1855","torrent":{"xt":"urn:btih:08f198c6c71dac34d1d58e17fb223c1e4be07261","amp;dn":"Selected+Letters+of+Charlotte+Bronte+%282007%29+%28306p%29+%5BInua%5D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08f198c6c71dac34d1d58e17fb223c1e4be07261","infoHashBuffer":{"type":"Buffer","data":[8,241,152,198,199,29,172,52,209,213,142,23,251,34,60,30,75,224,114,97]},"announce":[],"urlList":[]}}