{"title":"Nate Powell - Swallow Me Whole","uid":7725562,"size":112001683,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:09209a30d9b6e90c1b8dbcf1cbfb3e5086d89950&amp;dn=Nate+Powell+-+Swallow+Me+Whole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1350208473,"description":"'Swallow Me Whole'\n\nTop Shelf Productions, 2008, 204 pages\n\nWritten and Illustrated by Nate Powell\n\nSwallow Me Whole is an award-winning love story carried by rolling fog, terminal illness, hallucination, apophenia, insect armies, and unshakeable faith.\n\nIn his most ambitious book to date, Powell quietly explores the dark corners of adolescence - not the cliched melodramatic outbursts of rebellion, but the countless tiny moments of madness, the vague relief of medication, and the mixed blessing of family ties. As the story unfolds, two stepsiblings hold together amidst schizophrenia, obsessive compulsive disorder, family breakdown, animal telepathy, misguided love, and the tiniest hope that everything will someday make sense.\n\nDeliberately paced, delicately drawn, and drenched in shadows, Swallow Me Whole is a landmark achievement for Nate Powell and a suburban ghost story that will haunt readers long after its final pages.\n\n2009 Eisner Award Winner for Best Graphic Album (New), Eisner Award Nominee for Best Writer/Artist and Best Lettering, 2009 Los Angeles Times Book Prize Finalist for Young Adult Fiction, Ignatz Award Winner for Outstanding Artist and Outstanding Debut, and official selection of YALSA's Great Graphic Novels For Teens.","torrent":{"xt":"urn:btih:09209a30d9b6e90c1b8dbcf1cbfb3e5086d89950","amp;dn":"Nate+Powell+-+Swallow+Me+Whole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09209a30d9b6e90c1b8dbcf1cbfb3e5086d89950","infoHashBuffer":{"type":"Buffer","data":[9,32,154,48,217,182,233,12,27,141,188,241,203,251,62,80,134,216,153,80]},"announce":[],"urlList":[]}}