{"title":"Adriana Chechik Is Evil 2016 XXX Split Scenes WebGift","uid":15446793,"size":5260205440,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0939ec6ca06c40a4b766573d067fae72696fa2fd&amp;dn=Adriana+Chechik+Is+Evil+2016+XXX+Split+Scenes+WebGift&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SudoSu","files":9,"time":1469897933,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n――――――――――――――――――――――――― \nhttp://imgkiss.com/image/1IzcS \nhttp://imgkiss.com/image/1I3di \nhttp://imgkiss.com/image/1IKCv \nhttp://imgkiss.com/image/1ITY9 \nhttp://imgkiss.com/image/1IoS8 \nhttp://imgkiss.com/image/1I8wA \nhttp://imgkiss.com/image/1IGGU \nhttp://imgkiss.com/image/1IOjK \nhttp://imgkiss.com/image/1Ii1r \nhttp://imgkiss.com/image/1IkDq\r\n\r\nCast: Abella Danger, Adriana Chechik, Dana Vespoli, India Summer, Karlee Grey\r\n\r\n Natural beauty, spunky charm and volcanic lust created a porn superstar, and now fans have the ultimate showcase for her multi-faceted erotic talent: &quot;Adriana Chechik Is Evil&quot; collects nine eclectic scenes representing the star's most electric performances for eight diverse Evil Angel directors. Jonni Darkko captures Adriana with thick fountains of rectally churned butter pluming from her flexing, pink intestinal innards. She rims Chris Strokes, nose under buttered balls; as he sodomizes her, a half-melted stick plops from her gaping bunghole! In a second graphic scene for Jonni, she drinks her deep-throat gag spit and his cum from a martini glass. Aiden Riley caught Adriana's lesbian threesome with ass-blessed Abella Danger and naturally stacked Karlee Grey. The passionate sluts squirt like crazy! Sexy director Dana Vespoli joins Adriana, two creeps in clown lipstick and femme, dominant TS Vaniity for a gender-bent blow bang. Stud/director Toni Ribas drives Adriana to multiple, flooding female ejaculations - the girl gushers come amid a pounding, three-hole fuck. Jay Sin's underwater footage shows gorgeous Adriana swimming in a mermaid costume; she takes an interracial ass reaming from Sean Michaels' big black cock and sucks him ass-to-mouth. Rocco Siffredi brings out Adriana's personal side in an anal audition. For Joey Silvera, Adriana does a marathon threesome with young, hung Jessy Jones and sexy MILF India Summer. Freaky Mike Adriano gets Adriana to consume an entire cupcake with her prolapsing, blooming asshole!\r\n\r\nTop 0-Day and selected porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:0939ec6ca06c40a4b766573d067fae72696fa2fd","amp;dn":"Adriana+Chechik+Is+Evil+2016+XXX+Split+Scenes+WebGift","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0939ec6ca06c40a4b766573d067fae72696fa2fd","infoHashBuffer":{"type":"Buffer","data":[9,57,236,108,160,108,64,164,183,102,87,61,6,127,174,114,105,111,162,253]},"announce":[],"urlList":[]}}