{"title":"Gas Turbine Heat Transfer and Cooling Technology 2nd ed","uid":15187470,"size":73506278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:095ebf60058759ebc150c8cf1538483ed0bd2c01&amp;dn=Gas+Turbine+Heat+Transfer+and+Cooling+Technology+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1467502088,"description":"Gas Turbine Heat Transfer and Cooling Technology 2nd ed - Je-Chin Han et al. (CRC, 2013).pdf\r\n\r\nISBN 978-1-4665-6490-9\r\n\r\nA comprehensive reference for engineers and researchers, Gas Turbine Heat Transfer and Cooling Technology, Second Edition has been completely revised and updated to reflect advances in the field made during the past ten years. The second edition retains the format that made the first edition so popular and adds new information mainly based on selected published papers in the open literature.\r\n\r\nSee What’s New in the Second Edition:\r\n\r\nState-of-the-art cooling technologies such as advanced turbine blade film cooling and internal cooling\r\nModern experimental methods for gas turbine heat transfer and cooling research\r\nAdvanced computational models for gas turbine heat transfer and cooling performance predictions\r\nSuggestions for future research in this critical technology\r\n\r\nThe book discusses the need for turbine cooling, gas turbine heat-transfer problems, and cooling methodology and covers turbine rotor and stator heat-transfer issues, including endwall and blade tip regions under engine conditions, as well as under simulated engine conditions. It then examines turbine rotor and stator blade film cooling and discusses the unsteady high free-stream turbulence effect on simulated cascade airfoils. From here, the book explores impingement cooling, rib-turbulent cooling, pin-fin cooling, and compound and new cooling techniques. It also highlights the effect of rotation on rotor coolant passage heat transfer.\r\n\r\nCoverage of experimental methods includes heat-transfer and mass-transfer techniques, liquid crystal thermography, optical techniques, as well as flow and thermal measurement techniques. The book concludes with discussions of governing equations and turbulence models and their applications for predicting turbine blade heat transfer and film cooling, and turbine blade internal cooling","torrent":{"xt":"urn:btih:095ebf60058759ebc150c8cf1538483ed0bd2c01","amp;dn":"Gas+Turbine+Heat+Transfer+and+Cooling+Technology+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"095ebf60058759ebc150c8cf1538483ed0bd2c01","infoHashBuffer":{"type":"Buffer","data":[9,94,191,96,5,135,89,235,193,80,200,207,21,56,72,62,208,189,44,1]},"announce":[],"urlList":[]}}