{"title":"Gone Girl.epub","uid":8929513,"size":480822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09d22d4002a8b791dc5b6bc811f59ca5c7bb862b&amp;dn=Gone+Girl.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eBook_Fan","files":1,"time":1379445258,"description":"One of the most critically acclaimed suspense writers of our time, New York Times bestseller Gillian Flynn takes that statement to its darkest place in this unputdownable masterpiece about a marriage gone terribly, terribly wrong. The Chicago Tribune proclaimed that her work &quot;draws you in and keeps you reading with the force of a pure but nasty addiction.&quot; Gone Girl's toxic mix of sharp-edged wit and deliciously chilling prose creates a nerve-fraying thriller that confounds you at every turn. \n\nOn a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne's fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick's clever and beautiful wife disappears from their rented McMansion on the Mississippi River. Husband-of-the-Year Nick isn't doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife's head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge. Under mounting pressure from the police and the media--as well as Amy's fiercely doting parents--the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he's definitely bitter--but is he really a killer?\n\nAs the cops close in, every couple in town is soon wondering how well they know the one that they love. With his twin sister, Margo, at his side, Nick stands by his innocence. Trouble is, if Nick didn't do it, where is that beautiful wife? And what was in that silvery gift box hidden in the back of her bedroom closet?","torrent":{"xt":"urn:btih:09d22d4002a8b791dc5b6bc811f59ca5c7bb862b","amp;dn":"Gone+Girl.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09d22d4002a8b791dc5b6bc811f59ca5c7bb862b","infoHashBuffer":{"type":"Buffer","data":[9,210,45,64,2,168,183,145,220,91,107,200,17,245,156,165,199,187,134,43]},"announce":[],"urlList":[]}}