{"title":"A Viennese Waltz Down Wall Street - Mark Skousen","uid":11709443,"size":1147925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a2fd15e85223524aa9a2bb58d0c8255b626eee4&amp;dn=A+Viennese+Waltz+Down+Wall+Street+-+Mark+Skousen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424265637,"description":"A Viennese Waltz Down Wall Street: Austrian Economics for Investors\n\nThe central message of the Austrian school of economics, writes Mark Skousen in this wide-ranging book, is that economics is about human beings. That outlook has direct implications for financial markets and personal investing. And this is why the Austrian school has had a huge impact on Wall Street.\nA Viennese Waltz Down Wall Street, then, is a tutorial on both economics and investment that sheds new light on both fields.\nConsider the opening metaphor of the dance. This is the image that Skousen uses to illustrate the direction of prices in financial markets. It is not random but neither is it entirely scripted. There is a great deal of improvisation and uncertainty. But what makes it all work is that great institution of the mutual benefit of buying and selling. This is what makes markets dance.\nEconomics and investing are the two fields that Skousen has followed closely during his long career. This book weaves the two together to show how you can use good economics to anticipate market turns. But just as importantly, it shows how you can use investing knowledge to understand economics.\nThis is the unique contribution of the book. It takes big ideas in economic theory and illustrates them through real-world examples from financial experience. This approach has the merit of really driving home the point. What is the use of subjective value theory, marginal utility, business-cycle theory, and the rest? Skousen presents applications at every step, even while covering the history of ideas.\nThat economics is about human choice doesn't sound controversial at first reading, but the academic mainstream long ago abandoned this idea. It has been consumed by mathematical mechanics and theories of central management that have little or nothing to do with the reality of human choice. Every attempt to use such methods in predicting stock markets has flopped.\nSkousen clears up many confusions. For example, many people think that rising stock prices signal better economic times. Actually, the opposite can be true. Also, many people think that a good forecast about a coming recession necessarily means you should sell financials. Again, the opposite might be true.\nSkousen covers interest rates in theory and practice, and the relationship between saving and investment, the turning points in the business cycle and the rules of thumb to spot them, the decision to rent or own, the role of precious metals, and much more. He clears up many confusions such as the common belief that Austrians are always bullish on gold or always negative on stocks.\nHe also assesses the records of modern Austrian economists on forecasting. Is it perfect? No, but it is better than most. He has some corrections, too, for &quot;hard-money&quot; investment theory.\nIn most economics texts, micro and macroeconomics are distinct. But in Skousen's book, they are beautifully integrated in theory and practice.\n\n\nAbout the Author:\nMark Skousen, Ph. D., Editor of Forecasts &amp; Strategies, is a nationally known investment expert, economist, university professor, and author of more than 25 books. Currently Skousen is a Presidential Fellow at Chapman University. He recently was named one of the 20 most influential living economists. He earned his Ph. D. in monetary economics at George Washington University in 1977. He has taught economics and finance at Columbia Business School, Columbia University, Grantham University, Barnard College, Mercy College, Rollins College and Chapman University. He also has been a consultant to IBM, Hutchinson Technology and other Fortune 500 companies","torrent":{"xt":"urn:btih:0a2fd15e85223524aa9a2bb58d0c8255b626eee4","amp;dn":"A+Viennese+Waltz+Down+Wall+Street+-+Mark+Skousen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2fd15e85223524aa9a2bb58d0c8255b626eee4","infoHashBuffer":{"type":"Buffer","data":[10,47,209,94,133,34,53,36,170,154,43,181,141,12,130,85,182,38,238,228]},"announce":[],"urlList":[]}}