{"title":"Dungeon - Early Years # 1-2","uid":8640273,"size":246287572,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0a67fef6a65ccf13598c23fffad25e9d5507f8de&amp;dn=Dungeon+-+Early+Years+%23+1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fudoh101","files":2,"time":1372870220,"description":"Lewis Trondheim, Joann Sfar and Christophe Blain\n\n96 pages each\nNBM\n\nThrilling action and gentle whimsy nestle comfortably together in this charming import by a trio of French comics superstars, a swashbuckling fantasy starring anthropomorphic animals. A boyhood in the country didn't prepare idealistic, bird-headed Hyacinthe for his move to the city. He soon recognizes how corrupt the place is. His scheming uncle is oppressing the underclass elves while organizing a civic festival where a towering arboress will be burned alive. Little Hyacinthe feels helpless to intervene directly, and he even develops a crush on one of his uncle's minions, a cold-blooded snake-woman assassin. He escapes his moral frustration by becoming the Night Shirt, a masked fighter for justice who behaves like a mixture of Errol Flynn and Opus the penguin. Sfar and Trondheim's script creates a marvelous world in which the characters can startle readers by being genuinely strange but also human. Blain's loose but highly skilled art makes silly scenes poignant or exciting. When, after rescuing the arboress, the Night Shirt must urge his steed to leap across a polluted canal, his silhouette against the moon is simultaneously absurd and heroic. Somehow, the parody actually reinforces the adventure. \n\n","torrent":{"xt":"urn:btih:0a67fef6a65ccf13598c23fffad25e9d5507f8de","amp;dn":"Dungeon+-+Early+Years+%23+1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a67fef6a65ccf13598c23fffad25e9d5507f8de","infoHashBuffer":{"type":"Buffer","data":[10,103,254,246,166,92,207,19,89,140,35,255,250,210,94,157,85,7,248,222]},"announce":[],"urlList":[]}}