{"title":"Isaac Asimov, Robert Silverberg - The Ugly Little Boy (Child of ","uid":4732684,"size":338740156,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0b2e6024f7e89d8ba755c537c76ba9d664b0343b&amp;dn=Isaac+Asimov%2C+Robert+Silverberg+-+The+Ugly+Little+Boy+%28Child+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RamJamSam","files":9,"time":1235119816,"description":"Isaac Asimov, Robert Silverberg - The Ugly Little Boy (Child of Time) - Unb\nRead by:  Richard Davidson\nRuntime:  11 Hours 45 Minutes\n\n\n\n\nFirst published in Galaxy Fan Magazine, Isaac Asimov's short story &quot;The Ugly Little Boy&quot; is a science fiction classic. Now, in the second collaboration between the late, great Isaac Asimov and Hugo award-winning author Robert Silverberg, we have The Ugly Little Boy, the novel, a remarkably moving and chilling tale of what happens when past and present collide. \n\nWhen Stasis Technologies, Ltd., plucks a Neanderthal child off the prehistoric tundra and transports it into the twenty-first century, the scientific conglomerate gives no thought to the creature's human feelings. The nurse assigned to the case must somehow bridge the 40,000-year gap to forge an emotional bond that transcends time. And, when Miss Fellowes learns of the intended disposition of the &quot;Timmie experiment,&quot; it is up to her to travel back through time with the &quot;ape-boy&quot; as he rejoins his tribe on the cutting edge of civilization. \n\nExquisitely crafted, with compelling scenes of life from prehistory and the not-so-distant future, The Ugly Little Boy is a grand sweep through time that gives us humanity both in its infancy and at its most &quot;civilized.&quot; \n\n\n\nGooD SeeDinG!\t\n\n","torrent":{"xt":"urn:btih:0b2e6024f7e89d8ba755c537c76ba9d664b0343b","amp;dn":"Isaac+Asimov%2C+Robert+Silverberg+-+The+Ugly+Little+Boy+%28Child+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b2e6024f7e89d8ba755c537c76ba9d664b0343b","infoHashBuffer":{"type":"Buffer","data":[11,46,96,36,247,232,157,139,167,85,197,55,199,107,169,214,100,176,52,59]},"announce":[],"urlList":[]}}