{"title":"The Portable MBA [Qwerty80]","uid":7908603,"size":5770350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b68520100dac0adedfcfc0f8531ff0049e0eb8b&amp;dn=The+Portable+MBA+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"KatQwerty","files":3,"time":1355156567,"description":"A totally revised new edition of the bestselling guide to business school basics\n\nThe bestselling book that invented the &quot;MBA in a book&quot; category, The Portable MBA Fifth Edition is a reliable and information-packed guide to the business school curriculum and experience. For years, professionals who need MBA-level information and insight-but don't need the hassle of business school-have turned to the Portable MBA series for the very best, most up-to-date coverage of the business basics.\n\nThis new revised and expanded edition continues that long tradition with practical, real-world business insight from faculty members from the prestigious Darden School at the University of Virginia. With 50 percent new material, including new chapters on such topics as emerging economies, enterprise risk management, consumer behavior, managing teams, and up-to-date career advice, this is the best Portable MBA ever.\n\nCovers all the core topics you'd learn in business school, including finance, accounting, marketing, economics, ethics, operations management, management and leadership, and strategy.\nEvery chapter is totally updated and seven new chapters have been added on vital business topics\nIncludes case studies and interactive web-based examples\nWhether you own your own small business or work in a major corporate office, The Portable MBA gives you the comprehensive information and rich understanding of the business world that you need.","torrent":{"xt":"urn:btih:0b68520100dac0adedfcfc0f8531ff0049e0eb8b","amp;dn":"The+Portable+MBA+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b68520100dac0adedfcfc0f8531ff0049e0eb8b","infoHashBuffer":{"type":"Buffer","data":[11,104,82,1,0,218,192,173,237,252,252,15,133,49,255,0,73,224,235,139]},"announce":[],"urlList":[]}}