{"title":"Alex Grey - Artmind - The Healing Power Of Sacred Art","uid":4367621,"size":546267136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b7f889d2978295ba34924db9a7d98abaa4ada6e&amp;dn=Alex+Grey+-+Artmind+-+The+Healing+Power+Of+Sacred+Art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kisps","files":1,"time":1219968943,"description":"Another Alex Grey DVD from kisps :)\n\nFrom Amazon.com:\n\nDuring the course of this exquisite mind expanding DVD renowned teacher and visionary artist Alex Grey discusses his artistic vision life experiences metaphysical journeys sacred teachings and painters that have influenced his work . While exploring the sacred art of spiritual traditions from around the world he offers insight into the power of sacred art to assist us in revitalizing our health and sense of well-being so that we may open the doors of our perception into the luminous nature of reality and discover our divine potential.Included are scores of his paintings and sculptures going back over twenty years of creation.Is it possible that art has the power to heal? Could it be that the sacred paintings sculptures and monuments from ancient civilizations around the work were created to evoke more than just beauty alone? Do they also have the power to heal and enlighten us expand our visionary capacity and bring us face to face with divine reality? Join Alex Grey as he takes us on an amazing transformative journey into his unique artistic and spiritual vision.\n","torrent":{"xt":"urn:btih:0b7f889d2978295ba34924db9a7d98abaa4ada6e","amp;dn":"Alex+Grey+-+Artmind+-+The+Healing+Power+Of+Sacred+Art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b7f889d2978295ba34924db9a7d98abaa4ada6e","infoHashBuffer":{"type":"Buffer","data":[11,127,136,157,41,120,41,91,163,73,36,219,154,125,152,171,170,74,218,110]},"announce":[],"urlList":[]}}