{"title":"Ambush Bug + Appearances","uid":5139707,"size":902073327,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0b85cca5ef8dd81c06e70f84a72bbafb7838afa6&amp;dn=Ambush+Bug+%2B+Appearances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"brodahisou","files":-1,"time":1256813836,"description":"Ambush Bug was created by Keith Giffen as a goofy fun character and made his first appearance in DC Comics Presents #52. \n\nAmbush Bug's true name was supposedly Irwin Schwab, but it must be noted that he suffered from mental problems that prevented him from truly understanding reality around him, so even his true identity might be no more than a delusion on his part.  His origin is disputed, although the most commonly accepted origin is that Brum-El (a historical allusion to Beau Brummel, as well as a reference to Superman's father Jor-El) of the planet Schwab sent his clothes from his supposedly doomed planet, hoping that his wardrobe would survive, only to have it intercepted by a giant radioactive space spider. In the resulting crash, only two articles of clothing survived: the Ambush Bug suit, which was subsequently found by Irwin Schwab, and Argh!Yle!, an argyle sock with a Dr. Doom-like complex, complete with metal mask.\n\nAt first, Ambush Bug was a villain, named after a type of insect, and dressed in a green, skintight suit (with two orange antennae) that covered his whole body.  After attacking Superman and other heroes (and being little more than an annoyance to them) Ambush Bug decided instead to be a superhero as well. He also fancied himself Superman's friend, which only annoyed the hero even more. \n\nAmbush Bug is largely considered an absurd character and is rarely used by other writers, though he still exists in the DC Universe and occasionally still appears in some DC Comics. His popularity amongst creators has led to many 'cameos', sometimes with as little as his antennae being visible. In the comics he has become something of a joke to other characters, and has been described as being to real heroes what Ed Wood was to Alfred Hitchcock.\n\nThe character and his series have won recognition in the comics industry, including nominations for the R.A.C. &quot;Squiddy&quot; Award for Favorite Limited Series and the R.A.C. &quot;Squiddy&quot; Award for Favorite Graphic Novel in 1992 for the Ambush Bug Nothing Special. The character was also nominated for the R.A.C. &quot;Squiddy&quot; Award for Favorite Character in 1992.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:0b85cca5ef8dd81c06e70f84a72bbafb7838afa6","amp;dn":"Ambush+Bug+%2B+Appearances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b85cca5ef8dd81c06e70f84a72bbafb7838afa6","infoHashBuffer":{"type":"Buffer","data":[11,133,204,165,239,141,216,28,6,231,15,132,167,43,186,251,120,56,175,166]},"announce":[],"urlList":[]}}