{"title":"Dave Matthews &amp; Tim Reynolds - Live At Radio City (2xDVD)","uid":4065561,"size":7975671808,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0c028e0de25086974e431232a1651db39dd93721&amp;dn=Dave+Matthews+%26+Tim+Reynolds+-+Live+At+Radio+City+%282xDVD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jotun_82","files":2,"time":1204777990,"description":"Okay, this upload is for all you suckers that have problems with my previously release of Live At Radio City. This post is with both DVD&amp;#039;s ripped (yes I did it one more time) in DVD5. That is....you will have no problem burning with single layer DVD. I only did this because of all the idiotic comments... you are all suckers, but unfortunately I love DMB fans and I do whatever it takes to recruit some more...\nRemember!!! The material on the DVD&amp;#039;s is owned by DMB, please support them by purchasing the orignals!!! So now! you do not need TRY convert a DVD9 into DVD5 and receive a failure of some kind.... \nanyhow....please enjoy the dvd\n\n\nDave Matthews &amp; Tim Reynolds: Live at Radio City Music Hall (2007)\nBoth DVD&amp;#039;s  (included the Documentary)\n\nFormat: DVD-Video, Enhanced, Live, NTSC\nLanguage: English\nRegion: Region 1 (U.S. and Canada only. Read more about DVD formats.)\nNumber of discs: 2\nStudio: RCA\nDVD Release Date: August 14, 2007\n\nThis DVD is absolutley one of the best purchases I have ever made. The performances are stunning, the musical connection between Reynolds and Matthews is unbelievable and borders on clairvoyant. The song selection and production are among the best of any concert DVD I have purchased, and as I watch I am constantly saying &quot;how does he do that&quot; about Reynolds guitar prowess.\n\n***********************************************************************************\n\nP.S.\nOkay this is just to clarify. All the Dave Matthews Band DVD&amp;#039;s are recorded on dual layer DVD&amp;#039;s due to its vast amount of data. The concerts are usually somewhere over 3 hours, in addition to that there are often some bonus material. Therefor it wont fit to a single layer DVD. But it is fully possible for you to convert it. A dual layer DVD is by standard called DVD9 and a single layer DVD is called DVD5, some programs gives you the opportunity to convert a dvd9 into dvd5 so it may fit for you people that is not in possession of a dual layer DVD-rom. And all the concert DVD&amp;#039;s i post here on pirate bay is working. I have tested them. And some of the users have commented that they work and they are grateful.\n\nref user: jbrittmartin:\nthis is so money. thanks again jotun_82. now all i need is the Gorge DVD if you ever get the chance. And just fyi, all other jotun_82 DVDs have worked beautifully for me so i feel sure this one will as well.\n\nby the way jbrittmartin. There is no exclusive Gorge DVD, just the one that comes with the CD set. I will post it in the near future....","torrent":{"xt":"urn:btih:0c028e0de25086974e431232a1651db39dd93721","amp;dn":"Dave+Matthews+%26+Tim+Reynolds+-+Live+At+Radio+City+%282xDVD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c028e0de25086974e431232a1651db39dd93721","infoHashBuffer":{"type":"Buffer","data":[12,2,142,13,226,80,134,151,78,67,18,50,161,101,29,179,157,217,55,33]},"announce":[],"urlList":[]}}