{"title":"King's Quest Collection XP + Mask + Remakes","uid":4525321,"size":3031267702,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c17c4e2606885567847ad78e05db34714f0f955&amp;dn=King%5C%27s+Quest+Collection+XP+%2B+Mask+%2B+Remakes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"KingOtar","files":-1,"time":1227328292,"description":"=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\nKING'S QUEST COLLECTION FOR WINDOWS\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\n\nOVERVIEW:\nThese are the latest/most compatable editions of each game that are available today. You may still encounter the occasional problem, but by and large all 8 games should be in working order. In the event that you're downloading this and haven't played them, King's Quest is gaming legend, and the forbear of an entire genre. These games, sequentially, are a lesson in game development and sophistication of the artform. Plus, they're just really fun and memorable stories.\n\n\nCONTENTS:\n\n1. King's Quest Collection for Windows XP\nA self-extracting executable of the recent repackage from Vivendi, it contains King's Quests 1-7 with pre-configured DOSBox emulation and a handy launcher. PDF documentation is included, and necessary for games 3, 4 and 6 because of archaic copy protection. You may find it handier to print these pages off for physical reference.\n\n2. King's Quest 8: Mask of Eternity\nThe final official installment in the series, and the grand finale to Roberta Williams' decades-long career, is contained in this ISO, so you'll need a virtual drive/mounting program like Alcohol to run it. I had trouble getting this to run on Vista, but with some finagling it can work. It should work fine on XP.\n\n3. King's Quest I-III remakes\nThese are the fan-made remakes crafted in the style of King's Quest 5 and 6, complete with the digitized speech/music kits for each one. Each comes in a self-extracting installer with straight-forward instructions, and should run fine. You may find that you have to adjust the video settings for each game in the setup to 640x480 rather than the native 320x240 because some modern graphics cards don't support such low resolutions.\n\n4. King's Quest IX Demo\nFrom the forthcoming fan-made follow-up &quot;The Silver Lining&quot; (formerly King's Quest 9), this is a short-but-sweet playable demo. Please make sure to install the accompanying patch as well, the demo doesn't work without it.\n\nPlease download/seed/give feedback! This is another retro game torrent of hopefully several more to come.\n\n\n--- --- ---\n\nFULL GAMES LIST:\n\nKing's Quest I EGA Remake (1990)\nKing's Quest I VGA Remake (2001)\nKing's Quest II (1985)\nKing's Quest III (1986)\nKing's Quest III VGA Remake (2006)\nKing's Quest IV (1989)\nKing's Quest V (1990)\nKing's Quest VI (1992)\nKing's Quest VII (1994)\nKing's Quest VIII (1998)\nKing's Quest IX Demo (2007 / forthcoming)\n\n--- --- ---\n\nPlease note: I don't guarantee functionality of all the games on your setup, but these are the most compatible editions with modern computers. Remember that some of these games are very old (the oldest nearing its 25th birthday, the newest, over a decade!), and emulation is not always 100% reliable. Functionality may very from system to system.\n\nIn other words, please don't bombard this torrent thread with complaints about which games didn't work.\n\n--- --- ---\n\nFOR TECHNICAL SUPPORT, PLEASE VISIT THE SIERRA HELP FORUMS AT HTTP://WWW.SIERRAHELP.COM","torrent":{"xt":"urn:btih:0c17c4e2606885567847ad78e05db34714f0f955","amp;dn":"King%5C%27s+Quest+Collection+XP+%2B+Mask+%2B+Remakes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c17c4e2606885567847ad78e05db34714f0f955","infoHashBuffer":{"type":"Buffer","data":[12,23,196,226,96,104,133,86,120,71,173,120,224,93,179,71,20,240,249,85]},"announce":[],"urlList":[]}}