{"title":"Der GroÃƒÅ¸e Ausverkauf - The Big Sellout (2007)","uid":4497940,"size":1233952938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c2451e05a8aa94f934afc33d1f11aafb248e66d&amp;dn=Der+Gro%C3%83%C5%B8e+Ausverkauf+-+The+Big+Sellout+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sutur","files":-1,"time":1226274139,"description":"This movie shows four examples of the drastic effects which privatization of formerly public goods and services had and has on the lives of real people: Electricity in South Africa, railway transport in England, water in Bolivia and health services on the Philippines. Interwoven you get to see statements of a World Bank representative, a computer-animated cartoon by the International Monetary Fund (because they are not available for comment in flesh and blood) and former World Bank Chief Economist and Economic Nobel laureate Joseph Stiglitz, who today is very critical of the role theses institutions play in the globalised world.\n\nIn all of the four examples privatization had negative and sometimes devastating effects on people's lives. There is for example the English train driver who gets paid less for more work and has lost the pride in his profession since punctuality and safety offered to the passengers have severely suffered through the process. And there is the poor Philippine mother who has to fight every single day so that her son can get a dialysis at least once a week, which he needs to survive. Those who profit from privatization remain in the dark.\n\nIn all cases the decisions for those privatizations have been made either by politicians who firmly believe in free market ideology (like Maggie Thatcher) or have been due to pressure by the World Bank and the IMF who also follow this ideology and have made privatizations of public sector services a condition for granting credits to developing countries.\n\nThe essence is that real humans have to suffer from a religion-like ideology which benefits the wealthy an threatens the poor. And ideology it is: after all the formerly public goods and services were the common property of all people in the respective countries and served them very well. There was absolutely no need to take this property away from them and put it in the hands of a few anonymous so-called investors. As the English train driver put it: When the people were offered to buy shares in the British railway they were in fact offered to buy something they already owned. And as you can see from the Bolivian example it requires massive police force (funded by the taxes of the people) to rob the people of its public property, while actually police should protect its interests.\n\nThis free market-ideology often masks as irrefutable science in the form of neoclassical economic theory. However this theory is based on the premise of a &quot;homo oeconomicus&quot;, the assumption that all humans only act in their personal self-interest. Under that premise this theory seems to show that it's best or most efficient if governments don't interfere with markets, i.e. the voluntary exchange of goods and services. So basically this theory says that if everybody only acts in his personal self-interest, it's best if everybody only acts in his personal self-interest. It's clear to see that this is a logically circular and thus meaningless result. But apart from that the whole premise of this theory isn't even true. People do not only act in their personal self-interest. It's been proved that humans pretty often behave altruistically, i.e. they help others even when they can't expect anything in return for their help. As another Economic Nobel Laureate, George A. Akerlof, has recently pointed out, all the &quot;scientific&quot; results of neoclassical economic theory fall apart completely without the assumption of the &quot;homo oeconomicus&quot;. Thus this theory turns out to be pure religion, which however serves those of the wealthy well, who don't want to acknowledge any responsibility for the rest of society. (Even if this society enabled them to accumulate and preserve their wealth in the first place.)","torrent":{"xt":"urn:btih:0c2451e05a8aa94f934afc33d1f11aafb248e66d","amp;dn":"Der+Gro%C3%83%C5%B8e+Ausverkauf+-+The+Big+Sellout+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c2451e05a8aa94f934afc33d1f11aafb248e66d","infoHashBuffer":{"type":"Buffer","data":[12,36,81,224,90,138,169,79,147,74,252,51,209,241,26,175,178,72,230,109]},"announce":[],"urlList":[]}}