{"title":"McCoy Tyner Trio - Inception (1962) [Jazz][mp3 320][h33t][schon5","uid":4918783,"size":79067165,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d63d416abb6993b10b58faa7c576cea6c069e5e&amp;dn=McCoy+Tyner+Trio+-+Inception+%281962%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":10,"time":1243552798,"description":"McCoy Tyner Trio - Inception \nOriginal Release Date: January 10, 1962\nLabel: Impulse! \nFormat: Original recording remastered \nLabel: Grp Records \nAudio CD: March 25, 1997\nBitrate: 320 kbps \n\nMcCoy Tyner has been one of the best-known and most revered pianists in jazz for well over 30 years.   Though he appeared on the first recording by the Jazztet, an ensemble founded by saxophonist Benny Golson and trumpeter Art Farmer, Tyner first garnered serious attention through his work with John Coltrane.   Tyner literally invented an entirely new vocabulary for his instrument - a vocabulary that was ultimately absorbed into mainstream jazz piano by the many players who were inspired by his daring and innovative work.   This album is one of several trio sessions that Tyner recorded while he was working with Coltrane, and it demonstrates an altogether different side of this immensely talented and profoundly influential artist.   The impossibly fluid lines that Tyner spins on virtually every track are even more intricate and sustained than those which he produced in the confines of the Coltrane group, and they are executed with a touch that is almost unbelievably light.   Tyner seems to dance his way effortlessly through this material, and the result is a sublimely joyful, almost rapturous listening experience.   Those who are familiar primarily with the extraordinarily dense and powerful style which Tyner cultivated from the 1970s onwards may be somewhat surprised - and no doubt delighted - by this earlier work.   ~ Alexander Gelfand\n\nTyner was Coltrane's pianist off and on between the years 1960 and 1965, particularly during Trane's stint at Impulse Records and a much celebrated performance with Trane at the Newport Jazz Festival in 1965.  Since--or rather because--his neighbors in Philly were the Powells (Bud and Richard) in this debut recording you can hear the Richard Powell influence, the similar harmonics (which Tyner has said he was impressed by) and the chord clusters and arpeggios he was known for in his work with Trane.\n\nThe recording was done in January 1962 in the infamous Englewoods Cliffs New Jersey (I'm not sure if it was Creed Taylor or not) and engineered by the famous Rudy Van Gelder.  Accompanied by Tyner are Art Davis, bass and Elvin Jones, drums .  ( I dig the bass solo on &quot;Effendi&quot; ).\n\nA classic 60's jazz album for those who don't mind going back in time a bit to broaden their horizons. ~ &quot;yygsgsdrassil&quot;\n\nPersonnel:\nArt Davis bass\nElvin Jones drums\n\nMcCoy Tyner Trio - Inception Tracks:\n01  Inception 4:28     \n02  There Is No Greater Love 6:21     \n03  Blues For Gwen 4:26     \n04  Sunset 4:41     \n05  Effendi 6:39     \n06  Speak Low 6:15 \n\n","torrent":{"xt":"urn:btih:0d63d416abb6993b10b58faa7c576cea6c069e5e","amp;dn":"McCoy+Tyner+Trio+-+Inception+%281962%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d63d416abb6993b10b58faa7c576cea6c069e5e","infoHashBuffer":{"type":"Buffer","data":[13,99,212,22,171,182,153,59,16,181,143,170,124,87,108,234,108,6,158,94]},"announce":[],"urlList":[]}}