{"title":"Nurse Betty","uid":3754244,"size":734130176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d641ed9d9a5224d9a3ebd01083ebaf609ec1225&amp;dn=Nurse+Betty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elemento.x","files":1,"time":1185531384,"description":"NURSE BETTY is a fiery comedy from director Neil LaBute (IN THE COMPANY OF MEN, YOUR FRIENDS &amp; NEIGHBORS). Betty Sizemore, a waitress in a small Kansas town who lives vicariously through her favorite soap opera stars, fantasizes about a perfect life like that of the doctors and nurses on the TV show A REASON TO LOVE. When her insensitive husband brings an illegal business deal into their home and is brutally murdered, Betty escapes into her soap opera fantasy and begins a search for the dashing Dr. Ravell, whom she believes to be her long-lost love. Meanwhile, the killers realize Betty was a witness to the crime and begin a cross-country pursuit to find her. A spry, touching film, NURSE BETTY&amp;#039;s absurdity is contagiously funny.\n\nBetty Sizemore (Renee Zellweger) Eh uma garconete que mora em uma pequena cidade e vive sonhando com seu verdadeiro amor: David Ravell (Greg Kinnear), o medico da novela &quot;Uma Razao Para Amar&quot;, que ela assiste todos os dias. Soh que, depois de testemunhar o assassinato de seu marido, numa transacao de drogas que saiu errada, Betty comeca a viver como se estivesse dentro de sua novela predileta, quando se transforma da garconete Betty para a enfermeira Betty. Resolve entao partir rumo a Hollywood para encontrar o medico dos seus sonhos, mas passa a ser perseguida pelos traficantes que mataram seu marido e, principalmente, por um impiedoso pistoleiro (Morgan Freeman).","torrent":{"xt":"urn:btih:0d641ed9d9a5224d9a3ebd01083ebaf609ec1225","amp;dn":"Nurse+Betty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d641ed9d9a5224d9a3ebd01083ebaf609ec1225","infoHashBuffer":{"type":"Buffer","data":[13,100,30,217,217,165,34,77,154,62,189,1,8,62,186,246,9,236,18,37]},"announce":[],"urlList":[]}}