{"title":"[Carl_Rollyson]Marilyn Monroe A Life of the Actress (pdf){Zzzzz}","uid":11104788,"size":8638784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d66b2ed2888b9fe6cc671bceaef3f13d49f57c7&amp;dn=%5BCarl_Rollyson%5DMarilyn+Monroe+A+Life+of+the+Actress+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1411710645,"description":"Book Description\nPublication Date: June 4, 2014\n\nIn American popular culture, Marilyn Monroe(19261962) has evolved in stature from movie superstar to American icon. Monroe's own understanding of her place in the American imagination and her effort to perfect her talent as an actress are explored with great sensitivity in Carl Rollyson's engaging narrative. He shows how movies became crucial events in the shaping of Monroe's identity. He regards her enduring gifts as a creative artist, discussing how her smaller roles in The Asphalt Jungle and All About Eve established the context for her career, while indepth chapters on her more important roles in Bus Stop, Some Like It Hot, and The Misfits provide the centerpiece of his examination of her life and career.\n\nThrough extensive interviews with many of Monroe's colleagues, close friends, and other biographers, and a careful rethinking of the literature written about her, Rollyson is able to describe her use of Method acting and her studies with Michael Chekhov and Lee Strasberg, head of the Actors' Studio in New York. The author also analyzes several of Monroe's own drawings, diary notes, and letters that have recently become available. With over thirty black and white photographs (some published for the first time), a new foreword, and a new afterword, this volume brings Rollyson's 1986 book up to date.\n\nFrom this comprehensive, yet critically measured wealth of material, Rollyson offers a distinctive and insightful portrait of Marilyn Monroe, highlighted by new perspectives that depict the central importance of acting to the authentic aspects of her being.\n\n\nISBN: 1617039780 | 2014 | PDF | 256 pages | 8 MB\n\nMore About the Author\nBiography\nCarl Rollyson, Professor of Journalism at Baruch College, The City University of New York, has published more than forty books ranging in subject matter from biographies of Marilyn Monroe, Lillian Hellman, Martha Gellhorn, Norman Mailer, Rebecca West, Susan Sontag, and Jill Craigie to studies of American culture, genealogy, children's biography, film, and literary criticism. He has authored more than 500 articles on American and European literature and history. His work has been reviewed in newspapers such as The New York Times and the London Sunday Telegraph and in journals such as American Literature and the Dictionary of Literary Biography. For four years (2003-2007) he wrote a weekly column, &quot;On Biography,&quot; for The New York Sun and was President of the Rebecca West Society (2003-2007). His play, THAT WOMAN: REBECCA WEST REMEMBERS, has been produced at Theatresource in New York City. Amy Lowell Anew: A Biography (awarded a &quot;We the People&quot; NEH grant) will be published in August 2013. . &quot;Hollywood Enigma: Dana Andrews, a biography of Dana Andrews was published in September 2012 by University Press of Mississippi. His biography, &quot;American Isis: The Life and Death of Sylvia Plath&quot; was published in February 2013, the fiftieth anniversary of her death. His reviews of biography appear regularly in The Wall Street Journal, The Minneapolis Star Tribune, The Raleigh News &amp; Observer, The Kansas City Star, and The New Criterion. He is currently advisory editor for the Hollywood Legends series published by the University Press of Mississippi. He welcomes queries from those interested in contributing to the series. Read his column, &quot;Biographology,&quot; and his blog on http://carlrollyson.com.\nWatch the book trailer for Hollywood Enigma: Dana Andrews:\nWatch the book trailer for American Isis: The Life and Art of Sylvia Plath:\nAudition script for NORMAN MAILER: THE LAST ROMANTIC: http://www.carlrollyson.com/_i_norman_mailer__the_last_romantic__i__113276.htm\n","torrent":{"xt":"urn:btih:0d66b2ed2888b9fe6cc671bceaef3f13d49f57c7","amp;dn":"%5BCarl_Rollyson%5DMarilyn+Monroe+A+Life+of+the+Actress+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d66b2ed2888b9fe6cc671bceaef3f13d49f57c7","infoHashBuffer":{"type":"Buffer","data":[13,102,178,237,40,136,185,254,108,198,113,188,234,239,63,19,212,159,87,199]},"announce":[],"urlList":[]}}