{"title":"Humphry Slocombe Ice Cream Book - Jake Godby, Sean Vahey, Paolo ","uid":10556145,"size":34120358,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0efff32fe63d18280dab999d46e0588d2394ab28&amp;dn=Humphry+Slocombe+Ice+Cream+Book+-+Jake+Godby%2C+Sean+Vahey%2C+Paolo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1405393564,"description":"With more than 310,000 Twitter followers, a heaping helping of controversy, and a rich supply of attitude and humor, Humphry Slocombe is not your average ice cream shop. Yet the ice cream is what matters, and they make it in dozens of glorious, unique, and delightful flavors. This tasty book collects 50 recipes for these idolized and iconoclastic flavors, as well as surprising sundae combinations and popular toppings such as marshmallow and crumbled curry cookie. More than 50 color photographs, dozens of graphics and drawings, and first-person essays and scenes from the shop present a delicious foray into this scoop of San Francisco's incredible food scene.\n\n**\n\nReview\n\n&quot;I see this as my little child, in a way. This is fantastic.&quot; - Ferran Adria\n\n&quot;These guys make their living creating the most fantastic ice cream and the only possible reasons that they'd sell you the recipes for their bourbon-and-cornflake flavor and the others in this book are that a) they are banking on the fact that the people who buy recipe books are too goddamn lazy to ever make the recipes or b) they are on a nihilistic quest to destroy their own business or c) they are completely insane.&quot;\n--Ira Glass, NPR's This American LIfe","torrent":{"xt":"urn:btih:0efff32fe63d18280dab999d46e0588d2394ab28","amp;dn":"Humphry+Slocombe+Ice+Cream+Book+-+Jake+Godby%2C+Sean+Vahey%2C+Paolo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0efff32fe63d18280dab999d46e0588d2394ab28","infoHashBuffer":{"type":"Buffer","data":[14,255,243,47,230,61,24,40,13,171,153,157,70,224,88,141,35,148,171,40]},"announce":[],"urlList":[]}}