{"title":"The Seminole Wars, 1818-58","uid":11767305,"size":25659699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fe2d4ddbc3852c55c5b716bb34ef519d03092af&amp;dn=The+Seminole+Wars%2C+1818-58&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426897442,"description":"This volume details the crucial chapter in the history of the Indian Wars. The Seminole of Florida were one of the largest tribes of Native Americans living in peace with settlers. They traded with the Americans, the English and the Spanish, lived in cabins, planted crops and raised cattle. However, by 1815, frontier Americans had grown increasingly envious of their relative wealth and land, and resentful of their harboring of former slaves. They entered into three successive wars with the Seminole tribes, the second, seven-year-long war proving extremely costly in terms of money and manpower as the Seminole emerged as a stubborn and effective fighting force, especially in forest and swamp conditions. Ultimately, however, the sheer weight of the opposing forces overwhelmed them, and only a few dogged resistors clung to the idea of freedom until the third war led to the surrender of the chief. This book reveals the dramatic stories behind the three fierce Seminole wars, fought over a period of 41 years. Illustrated with careful reconstructions of the colorful and varied clothing and uniforms worn by both sides, the author discusses the organization and history of a tribe that fought to the bitter end, albeit unsuccessfully, in the pursuit of freedom","torrent":{"xt":"urn:btih:0fe2d4ddbc3852c55c5b716bb34ef519d03092af","amp;dn":"The+Seminole+Wars%2C+1818-58","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe2d4ddbc3852c55c5b716bb34ef519d03092af","infoHashBuffer":{"type":"Buffer","data":[15,226,212,221,188,56,82,197,92,91,113,107,179,78,245,25,208,48,146,175]},"announce":[],"urlList":[]}}