{"title":"Love Spit Love - Love Spit Love [1994]","uid":9589266,"size":342463139,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:10954d68b94f3a18e890ded0908d2e73cfcc8a01&amp;dn=Love+Spit+Love+-+Love+Spit+Love+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GenXRock","files":15,"time":1391876472,"description":"Review by Ned Raggett  [-]\nPerhaps it's significant that one lyric goes &quot;I don't want your talk, talk, talk,&quot; but reading too much into it might be a danger as well. Setting aside any questions regarding how much of a distance needed to be placed from the Psychedelic Furs, Love Spit Love's debut effort is at points a bit of a lost classic. If not quite up to the Furs at their absolute best, it's certainly better than that band's worst efforts, and more than once the quartet achieves a particular magic all its own. More than once, it's audible that in ways Richard and Tim Butler were trying with this what contemporaries Ian McCulloch and Will Sergeant were aiming for with Electrafixion -- a sometimes raucous attempt to stay in line with the alternative explosion of the early '90s and its accompanying fallout, though still shot through with their own cool elegance instead of rough rampage. Fortus does his best to give Butler the right sort of musical support throughout -- he's a good enough guitarist, with a thick, slow rush tone at his loudest, but he's not truly a great one in comparison to John Ashton, not quite so inventive and special. That said, ultimately the chief problem with the album is that many of the songs are fairly anonymous, enjoyable enough to listen to then and there but not given over to sticking in the memory like they should (or instead suggesting other songs, like &quot;Half a Life,&quot; which is halfway to Rod Stewart's &quot;Maggie Mae&quot;). At its best, though, Love Spit Love comes up with some crackerjack songs such as the odd boulevardier swing of &quot;Jigsaw&quot; and the fragmented ballad &quot;Wake Up.&quot; The real winner, though, was the lead single &quot;Am I Wrong,&quot; with a wonderful, just delicate enough arrangement the bed for another Butler-sung classic of emotional questioning and melancholia. (3/5)","torrent":{"xt":"urn:btih:10954d68b94f3a18e890ded0908d2e73cfcc8a01","amp;dn":"Love+Spit+Love+-+Love+Spit+Love+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10954d68b94f3a18e890ded0908d2e73cfcc8a01","infoHashBuffer":{"type":"Buffer","data":[16,149,77,104,185,79,58,24,232,144,222,208,144,141,46,115,207,204,138,1]},"announce":[],"urlList":[]}}