{"title":"Sound Reproduction: The Acoustics and Psychoacoustics of Loudspe","uid":4714226,"size":20548552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1183bc415f246001533457eb4b7f9a28606045d2&amp;dn=Sound+Reproduction%3A+The+Acoustics+and+Psychoacoustics+of+Loudspe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234201370,"description":"Floyd Toole, a leading expert in the field of sound reproduction, explains how to design the best possible listening experience for recording control rooms and home entertainment systems. This comprehensive work considers the whole sound reproduction chain from multi channel audio configurations and the loudspeaker/room system to acoustics and psychoacoustics and the evaluation process.\n\nPart 1 shows the reader how to create the best listening experience, offering practical approaches to the sound reproduction chain. Parts 2 and 3 are an in-depth consideration of acoustics and psychoacoustics - the science behind Part 1.\n\n* How to design a great audio system - for a home entertainment system or a professional recording control room\n* Offers a comprehensive look at the sound reproduction chain offering practical advice and helpful graphics throughout\n* Learn from a leading expert in sound reproduction - Floyd Toole provides essential knowledge in a highly readable and entertaining style","torrent":{"xt":"urn:btih:1183bc415f246001533457eb4b7f9a28606045d2","amp;dn":"Sound+Reproduction%3A+The+Acoustics+and+Psychoacoustics+of+Loudspe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1183bc415f246001533457eb4b7f9a28606045d2","infoHashBuffer":{"type":"Buffer","data":[17,131,188,65,95,36,96,1,83,52,87,235,75,127,154,40,96,96,69,210]},"announce":[],"urlList":[]}}