{"title":"The Cambridge History of the Native Peoples of America (6 Vol)","uid":7991294,"size":238922121,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1207c34de3d533d1b3a698836e1e623ce6053d64&amp;dn=The+Cambridge+History+of+the+Native+Peoples+of+America+%286+Vol%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1357425785,"description":"   The Cambridge History of the Native Peoples of America (6 Vol) - 2010kaiser\n   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~       \n\nThe Cambridge History of the Native Peoples of the Americas is the first comprehensive survey of the history of the indigenous inhabitants of the Western Hemisphere. The work's combination of archaeology, anthropology, and history raises new and important questions for scholars in the field, while also promoting a better understanding of Native American history by historians and anthropologists whose main concerns lie elsewhere. Volume I provides a comprehensive history of the native peoples of North America from their arrival in the western hemisphere to the present. It describes how indigenous peoples have dealt with the environmental diversity of North America and have responded to the different European colonial regimes and national governments that have established themselves in recent centuries. Volume II gives an authoritative overview of the important native civilizations of the Mesoamerican area, beginning with archaeological discussions of paleoindian, archaic and preclassic societies and continuing to the present. Volume III: South America, is the first major survey of research on the indigenous peoples of South America from the earliest peopling of the continent to the present since Julian Steward's Handbook of South American Indians was published half a century ago.\n\n1) The Cambridge History of the Native Peoples of the Americas Vol. 1, part 1. North America. Bruce G. Trigger and Wilcomb E. Washburn. 1996.\n\n2) The Cambridge History of the Native Peoples of the Americas Vol. 1, part 2. North America. Bruce G. Trigger and Wilcomb E. Washburn. 1996.\n\n3) The Cambridge History of the Native Peoples of the Americas Vol. 2, part 1. Mesoamerica. Richard E. W. Adams and Murdo J. MacLeod. 2000.\n\n4) The Cambridge History of the Native Peoples of the Americas Vol. 2, part 2. Mesoamerica. Richard E. W. Adams and Murdo J. MacLeod. 2000.\n\n5) The Cambridge History of the Native Peoples of the Americas Vol. 3, part 1. South America. Frank Salomon and Stuart B. Schwartz. 1999.\n\n6) The Cambridge History of the Native Peoples of the Americas Vol. 3, part 2. South America. Frank Salomon and Stuart B. Schwartz. 1999.\n\nMore info on the books below:\n\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/gp/product/0521790549/ref=olp_product_details/279-4922903-2709423?ie=UTF8&amp;me=&amp;seller=&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/gp/product/0521790549/ref=olp_product_details/279-4922903-2709423?ie=UTF8&amp;me=&amp;seller=&lt;/a&gt;\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n          &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:1207c34de3d533d1b3a698836e1e623ce6053d64","amp;dn":"The+Cambridge+History+of+the+Native+Peoples+of+America+%286+Vol%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1207c34de3d533d1b3a698836e1e623ce6053d64","infoHashBuffer":{"type":"Buffer","data":[18,7,195,77,227,213,51,209,179,166,152,131,110,30,98,60,230,5,61,100]},"announce":[],"urlList":[]}}