{"title":"Touch the Sound","uid":4137229,"size":972533444,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1233db75f939c88866ec9176617f8255b75561a6&amp;dn=Touch+the+Sound&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Infinitex2","files":1,"time":1208314106,"description":"Subtitled &quot;A Sound Journey with Evelyn Glennie,&quot; German director Thomas Riedelsheimer&amp;#039;s exquisite Touch the Sound is nominally a portrait of the Scottish musician known as &quot;the first full-time solo percussionist.&quot; Glennie is certainly a fascinating subject. Profoundly deaf since childhood, she disdains the use of hearing aids and sign language, relying instead on lip reading and, more crucially, on the use of all of her senses, especially touch, to &quot;hear&quot; with her entire body. The film reveals Glennie&amp;#039;s extraordinary skills in a variety of settings: playing a snare drum for bemused New Yorkers in cavernous Grand Central Station; improvising with guitarist Fred Frith in an empty warehouse in Cologne, Germany (their final vibes-guitar duet is one of the film&amp;#039;s musical highlights); working with hearing-impaired students in her native Aberdeenshire; jamming with taiko drummers in Japan, and later delighting customers in a Tokyo bar with a spontaneous workout involving chopsticks, dishes, cans, and glassware (the woman can make music with virtually anything). But Riedelsheimer, who was also the film&amp;#039;s editor and cinematographer, has a broader agenda here--namely, to intensify our awareness of the sounds that surround us everywhere, in every moment. From the streets of New York to the beaches of Santa Cruz, from the rocky Scottish coastline to a tranquil Japanese rock garden, he links heightened audio, as clear and natural as the best ECM recordings, to a succession of gorgeous visual images to create a balance of complex detail and overall sparseness, resulting in a kind of Zen feast. Even more of the same is found in a &quot;making of&quot; featurette that&amp;#039;s the highlight of the bonus material, making Touch the Sound easily one of the most rewarding documentaries in recent years. --Sam Graham  ","torrent":{"xt":"urn:btih:1233db75f939c88866ec9176617f8255b75561a6","amp;dn":"Touch+the+Sound","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1233db75f939c88866ec9176617f8255b75561a6","infoHashBuffer":{"type":"Buffer","data":[18,51,219,117,249,57,200,136,102,236,145,118,97,127,130,85,183,85,97,166]},"announce":[],"urlList":[]}}