{"title":"The Cobra Event by Richard Preston [retail] {dwg}","uid":10858740,"size":4297145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:127a5c1a39f487a7f11b35e3e13c014bdf85eed2&amp;dn=The+Cobra+Event+by+Richard+Preston+%5Bretail%5D+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408868619,"description":"The Cobra Event is a petrifying, fictional account of a very real threat: biological terrorism.\nSeventeen-year-old Kate Moran wakes one morning to the beginnings of a head cold but shrugs it off and goes to school anyway. By her midmorning art class, Kate's runny nose gives way to violent seizures and a hideous scene of self-cannibalization. She dies soon after. When a homeless man meets a similarly gruesome Â— and mystifying Â— fate, the Centers for Disease Control in Atlanta sends pathologist Alice Austen to investigate. What she uncovers is the work of a killer, a man who calls himself Archimedes and is intent on spreading his deadly Cobra virus throughout New York City. A silent crisis erupts, with Austen and a secret FBI forensic team rushing to expose the terrorist.\n\nEven more frightening than Preston's story about the fictitious Cobra virus, however, is the truth that lies beneath it. As the author writes in his introduction, &quot;The nonfiction roots of this book run deep.... My sources include eyewitnesses who have seen a variety of biological-weapons installations in different countries, and people who have developed and tested strategic bioweapons.&quot; In fact, the only reason The Cobra Event was not written as nonfiction is that none of Preston's sources would go on record.\n\nWoven throughout the novel are sections of straight nonfiction reporting that reveal the terrifying truth about the development of biological weapons and the clandestine operations of Russia and Iraq. Three years of research and more than 100 interviewswithhigh-level sources in the FBI, the U.S. military, and the scientific community went into The Cobra Event. The result is sure to shock you.","torrent":{"xt":"urn:btih:127a5c1a39f487a7f11b35e3e13c014bdf85eed2","amp;dn":"The+Cobra+Event+by+Richard+Preston+%5Bretail%5D+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"127a5c1a39f487a7f11b35e3e13c014bdf85eed2","infoHashBuffer":{"type":"Buffer","data":[18,122,92,26,57,244,135,167,241,27,53,227,225,60,1,75,223,133,238,210]},"announce":[],"urlList":[]}}