{"title":"Boxing - A Cultural History (2008).pdf Gooner","uid":13211121,"size":6980453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:136494f6c4eb49a34fb4b1509b3e776b53120323&amp;dn=Boxing+-+A+Cultural+History+%282008%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452640167,"description":"Publisher: Reaktion Books; 1 edition (May 15, 2008)\r\nLanguage: English\r\nISBN-10: 1861893698\r\nISBN-13: 978-1861893697\r\n\r\nBoxing is one of the oldest and most exciting of sports: its bruising and bloody confrontations have permeated Western culture since 3000 BC. During that period, there has hardly been a time in which young men, and sometimes women, did not raise their gloved or naked fists to one other. Throughout this history, potters, sculptors, painters, poets, novelists, cartoonists, song-writers, photographers and film-makers have been there to record and make sense of it all.\r\n \r\nIn her encyclopaedic investigation, Kasia Boddy sheds new light on an elemental sports and struggle for dominance whose weapons are nothing more than fists. Boddy examines the shifting social, political and cultural resonances of this most visceral of sports, and shows how from Daniel Mendoza to Mike Tyson, boxers have embodied and enacted our anxieties about race, ethnicity, gender and sexuality. Looking afresh at everything from neoclassical sculpture to hip-hop lyrics, Boxing explores the way in which the history of boxing has intersected with the history of mass media, from cinema to radio to pay-per-view. The book also offers an intriguing new perspective on the work of such diverse figures as Henry Fielding, Spike Lee, Charlie Chaplin, Philip Roth, James Joyce, Mae West, Bertolt Brecht, and Charles Dickens.\r\n \r\nAn all-encompassing study, Boxing ultimately reveals to us just how and why boxing has mattered so much to so many","torrent":{"xt":"urn:btih:136494f6c4eb49a34fb4b1509b3e776b53120323","amp;dn":"Boxing+-+A+Cultural+History+%282008%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136494f6c4eb49a34fb4b1509b3e776b53120323","infoHashBuffer":{"type":"Buffer","data":[19,100,148,246,196,235,73,163,79,180,177,80,155,62,119,107,83,18,3,35]},"announce":[],"urlList":[]}}