{"title":"Dismantling the Big Bang - John Hartnett","uid":11773187,"size":17779902,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:145cffcfba87185c5175b0d06ddc8f82f5f96570&amp;dn=+Dismantling+the+Big+Bang+-+John+Hartnett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1427157717,"description":"\n-Why did Ptolemy's theory cause problems for the church?\n-What is the big secret concerning the &quot;Age&quot; of the earth?\n-Why do many scientists reject the use of design in explaining origins?\n\nThe seemingly absurd idea that all matter, energy, space, and time once exploded from a point of extreme density has captured the imagination of scientists and laypersons for decades. The big bang has provided a central teaching for the eons of time of &quot;cosmic evolution&quot;, undermining the history and cosmology of the Bible.\n\nIt is a theory that fails, even violating the very physical laws on which it is purportedly based. In this easy-to-read format, authors Alex Williams and John Hartnett explode this naturalistic explanation for the universe, and show that the biblical model provides a far better explanation of our origins. This fully indexed, illustrated analysis of the big bang theory is an invaluable help in understanding and countering a world view that is as chaotic and destructive as its name implies.\n\n\nAbout the author:\nDr. John Hartnett received both his B.Sc. and his Ph.D. with distinction from the University of Western Australia. He currently works as an ARC QE II post-doctoral research fellow with the frequency standards and metrology research group there. He has published more than 98 scientific papers in secular journals and has two patents. Alex Williams is a part-time science writer for Answers in Genesis. With a master of science degree in radioecology and a licentiate in theology, his career spans 26 years as a government botanist and 7 years in missionary work. He is married to Barbara and they reside in Beeliar, Western Australia","torrent":{"xt":"urn:btih:145cffcfba87185c5175b0d06ddc8f82f5f96570","amp;dn":"+Dismantling+the+Big+Bang+-+John+Hartnett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"145cffcfba87185c5175b0d06ddc8f82f5f96570","infoHashBuffer":{"type":"Buffer","data":[20,92,255,207,186,135,24,92,81,117,176,208,109,220,143,130,245,249,101,112]},"announce":[],"urlList":[]}}