{"title":"John Adams","uid":4728073,"size":2468648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14a618c24faca94ac291e014cf5e6a2d45efbc92&amp;dn=John+Adams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philmccrevice","files":1,"time":1234852920,"description":"Amazon.com Review\nLeft to his own devices, John Adams might have lived out his days as a Massachusetts country lawyer, devoted to his family and friends. As it was, events swiftly overtook him, and Adams--who, David McCullough writes, was &quot;not a man of the world&quot; and not fond of politics--came to greatness as the second president of the United States, and one of the most distinguished of a generation of revolutionary leaders. He found reason to dislike sectarian wrangling even more in the aftermath of war, when Federalist and anti-Federalist factions vied bitterly for power, introducing scandal into an administration beset by other difficulties--including pirates on the high seas, conflict with France and England, and all the public controversy attendant in building a nation.\nOvershadowed by the lustrous presidents Washington and Jefferson, who bracketed his tenure in office, Adams emerges from McCullough's brilliant biography as a truly heroic figure--not only for his significant role in the American Revolution but also for maintaining his personal integrity in its strife-filled aftermath. McCullough spends much of his narrative examining the troubled friendship between Adams and Jefferson, who had in common a love for books and ideas but differed on almost every other imaginable point. Reading his pages, it is easy to imagine the two as alter egos. (Strangely, both died on the same day, the 50th anniversary of the Declaration of Independence.) But McCullough also considers Adams in his own light, and the portrait that emerges is altogether fascinating. --Gregory McNamee \n\nFrom Publishers Weekly\nHere a preeminent master of narrative history takes on the most fascinating of our founders to create a benchmark for all Adams biographers. With a keen eye for telling detail and a master storyteller's instinct for human interest, McCullough (Truman; Mornings on Horseback) resurrects the great Federalist (1735-1826), revealing in particular his restrained, sometimes off-putting disposition, as well as his political guile. The events McCullough recounts are well-known, but with his astute marshaling of facts, the author surpasses previous biographers in depicting Adams's years at Harvard, his early public life in Boston and his role in the first Continental Congress, where he helped shape the philosophical basis for the Revolution. McCullough also makes vivid Adams's actions in the second Congress, during which he was the first to propose George Washington to command the new Continental Army. Later on, we see Adams bickering with Tom Paine's plan for government as suggested in Common Sense, helping push through the draft for the Declaration of Independence penned by his longtime friend and frequent rival, Thomas Jefferson, and serving as commissioner to France and envoy to the Court of St. James's. The author is likewise brilliant in portraying Adams's complex relationship with Jefferson, who ousted him from the White House in 1800 and with whom he would share a remarkable death date 26 years later: July 4, 1826, 50 years to the day after the signing of the Declaration. (June) Forecast: Joseph Ellis has shown us the Founding Fathers can be bestsellers, and S&amp;S knows it has a winner: first printing is 350,000 copies, and McCullough will go on a 15-city tour; both Book-of-the-Month Club and the History Book Club have taken this book as a selection.\n\n","torrent":{"xt":"urn:btih:14a618c24faca94ac291e014cf5e6a2d45efbc92","amp;dn":"John+Adams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14a618c24faca94ac291e014cf5e6a2d45efbc92","infoHashBuffer":{"type":"Buffer","data":[20,166,24,194,79,172,169,74,194,145,224,20,207,94,106,45,69,239,188,146]},"announce":[],"urlList":[]}}