{"title":"[BestRepack.net]_Max Payne 3_[R.G. Catalyst]","uid":7354354,"size":16926098669,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:14ba49dc546031b3c185f9e6da7e288fc4822232&amp;dn=%5BBestRepack.net%5D_Max+Payne+3_%5BR.G.+Catalyst%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"host92","files":12,"time":1339708941,"description":"INFORMATION:\n\nâ–ª Released:\n2012\nâ–ª Genre:\nAction / TPS\nâ–ª Developed by:\nRockstar Vancouver\nâ–ª Published by:\nRockstar Games / 1C-SoftKlab\n\nâ–ª Type of publication:\nRepak\nâ–ª Language:\nRussian, English, French, German, Italian, Spanish, Portuguese, Polish\nâ–ª Language:\nEnglish\nâ–ª Medicine:\nby THETA\n\n\nSYSTEM REQUIREMENTS:\n\nâˆš Operating System: Windows Â® XP SP3 / Windows Â® Vista SP2 / Windows Â® 7 SP1\nâˆš Processor: Intel Dual Core 2.4 GHz or AMD Dual Core 2.6 GHz\nâˆš Memory: 2 Gb\nâˆš Video: NVIDIA GeForce 8600 GT 512MB RAM or AMD Radeon HD 3400 512MB RAM\nâˆš Sound Card: compatible with DirectX 9\nâˆš Free hard drive space: 24 GB\n\nDESCRIPTION:\n\nAfter the events of Max Payne 2 was eight years old. Max did not cop - he drunken, unemployed sitting on painkillers. Broken. Crushed. Without a goal. But, by chance after moving to Brazil, he entered the service in a private security agency and is assigned to protect the family of successful real estate dealer. Soon Max in their own skin will feel, not only in New York, and Sao Paulo live by their own laws ...\n\nGAME FEATURES\n\n&quot;Like in the movies. Unique action scenes Max Payne 3 are due to advanced technology: the physical system Euphoria, brand deceleration time Bullet Time, and &quot;smart&quot; cameras Bullet-Cams. No advance figure animation - Max moves, evades bullets and overcomes obstacles to full compliance with the surroundings and situation, and the opponents of &quot;fair&quot; to respond to every shot.\n&quot;Better safe than sorry. One of the features of Max Payne 3 is a system of shelters, in the shootout privnosyaschaya strategic element and allows players to battle in every new act according to the situation.\n&quot;If a friend suddenly appeared. A large role in Max Payne 3 assigned a partner and opponents of the hero. To create a character on the court motion capture have been recorded hundreds of hours of video, and it allowed every skirmish, every episode of the game to make truly unique.\n&quot;In the style of Rockstar. All in Max Payne 3 elaborated to the smallest detail. Shooting does not pass without leaving a trace: each bullet fired affects the appearance of a level on the face and body of Max playing in the heat of battle sweat, trickling from the wounds of the opponents of the blood. Detail is incredible weapon: the trigger works, the shutter clicks, jump out of the chamber liner.\n&quot;Heroes do not go away. The role of Max Payne sang familiar to fans of the series, James MakKeffri, the voice of Detective Novels in the original. However, in Max Payne 3 of its role is not confined to only one voice - James gave Max his appearance, but also made in the actor's role on the court motion capture.\n\nFeatures repack:\n\nDo not cut / no recoded\nInstallation time ~ 90-150 minutes\n\nRePacked by [R.G. Catalyst]\n\ni dont take any credit for this repack","torrent":{"xt":"urn:btih:14ba49dc546031b3c185f9e6da7e288fc4822232","amp;dn":"%5BBestRepack.net%5D_Max+Payne+3_%5BR.G.+Catalyst%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ba49dc546031b3c185f9e6da7e288fc4822232","infoHashBuffer":{"type":"Buffer","data":[20,186,73,220,84,96,49,179,193,133,249,230,218,126,40,143,196,130,34,50]},"announce":[],"urlList":[]}}