{"title":"The Man Behind the Microchip - (Malestrom)","uid":4802817,"size":4648100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14c4e3515b9324ef5a31d448e403755dedef65ac&amp;dn=The+Man+Behind+the+Microchip+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238097054,"description":" &lt;a href=&quot;http://www.image-upload.net/images/7o9w1l4db6tjlms6tmjy.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/7o9w1l4db6tjlms6tmjy.jpeg&lt;/a&gt;\n\nLeslie Berlin, &quot;The Man Behind the Microchip: Robert Noyce and the Invention of Silicon Valley&quot;\nPublisher: Oxford University Press, USA | 2005-05-12 | ISBN 0195163435 | PDF | 440 pages\n\n\nHailed as the Thomas Edison and Henry Ford of Silicon Valley, Robert Noyce was a brilliant inventor, a leading entrepreneur, and a daring risk taker who piloted his own jets and skied mountains accessible only by helicopter. Now, in The Man Behind the Microchip, Leslie Berlin captures not only this colorful individual but also the vibrant interplay of technology, business, money, politics, and culture that defines Silicon Valley. Here is the life of a giant of the high-tech industry, the co-founder of Fairchild Semiconductor and Intel who co-invented the integrated circuit, the electronic heart of every modern computer, automobile, cellular telephone, advanced weapon, and video game. With access to never-before-seen documents, Berlin paints a fascinating portrait of Noyce: he was an ambitious and intensely competitive multimillionaire who exuded a &quot;just folks&quot; sort of charm, a Midwestern preacher's son who rejected organized religion but would counsel his employees to &quot;go off and do something wonderful,&quot; a man who never looked back and sometimes paid a price for it. In addition, this vivid narrative sheds light on Noyce's friends and associates, including some of the best-known managers, venture capitalists, and creative minds in Silicon Valley. Berlin draws upon interviews with dozens of key players in modern American business--including Andy Grove, Steve Jobs, Gordon Moore, and Warren Buffett; their recollections of Noyce give readers a privileged, first-hand look inside the dynamic world of high-tech entrepreneurship. A modern American success story, The Man Behind the Microchip illuminates the triumphs and setbacks of one of the most important inventors and entrepreneurs of our time. ","torrent":{"xt":"urn:btih:14c4e3515b9324ef5a31d448e403755dedef65ac","amp;dn":"The+Man+Behind+the+Microchip+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c4e3515b9324ef5a31d448e403755dedef65ac","infoHashBuffer":{"type":"Buffer","data":[20,196,227,81,91,147,36,239,90,49,212,72,228,3,117,93,237,239,101,172]},"announce":[],"urlList":[]}}