{"title":"Ecodefense: A Field Guide To Monkeywrenching","uid":4795882,"size":4939940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14f64defeb882d12303225f5ca1a518f193b9c01&amp;dn=Ecodefense%3A+A+Field+Guide+To+Monkeywrenching&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1237877590,"description":"&quot;An extensive, practical, and hands on guide to direct action in regards to protecting forests from development. You know what's really refreshing about this book? It actually dares to take seriously the &quot;I-don't-give-a-damn-I've-got-mine&quot; attitude that's destroying the planet. Too many of us are content to talk, talk, talk about the ecocide we see going on around us daily. We lament global warming, the loss of species, the deforestation of the earth, the pollution of land and water and air, and frequently become so overwhelmed by it all that we throw up our hands and adopt an &quot;apres moi, le deluge&quot; cynicism. And in the meantime, by the way, we continue to drive our SUVs, blithely drink our plastic-bottled water, and keep realtors in business (did you know that 46 acres of prime farm land is developed every hour in this country?!) as if there's no tomorrow--which of course there won't be if all we do is talk and waste! The folks who put &quot;Ecodefense&quot; together are tired of talk and collaboration. They advocate a NONVIOLENT defense of imperiled nature, and they're willing to belly up to the bar and pay the price of their convictions.&quot;\n\nRegardless if you agree with their point of view or not, they have some damn good ideas for sabotage.\n\nHere is the link if you want to read it while it is downloading. &lt;a href=&quot;\nhttp://www.omnipresence.mahost.org/inttxt.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.omnipresence.mahost.org/inttxt.htm&lt;/a&gt;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:14f64defeb882d12303225f5ca1a518f193b9c01","amp;dn":"Ecodefense%3A+A+Field+Guide+To+Monkeywrenching","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14f64defeb882d12303225f5ca1a518f193b9c01","infoHashBuffer":{"type":"Buffer","data":[20,246,77,239,235,136,45,18,48,50,37,245,202,26,81,143,25,59,156,1]},"announce":[],"urlList":[]}}