{"title":"NCSS.PASS.2008.v8.0.15-BEAN","uid":5822981,"size":34544962,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:15322e67a838b37a12d7dcf5671ab01fbab96d3f&amp;dn=NCSS.PASS.2008.v8.0.15-BEAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MAFIAA.","files":9,"time":1284146495,"description":"Disks: 7 x 5mb                                Date : September 10, 2010\nOS  : Windows                                Type : Serial\n\nRelease Description\n\nPASS performs power analysis and calculates sample sizes. Use it before\nyou begin a study to calculate an appropriate sample size (it meets the\nrequirements of  government agencies that demand technical justification\nof the sample size you have used). Use it after a study to determine if\nyour sample size was large enough.\n\nPASS lets you solve for power, sample size, effect size, and alpha\nlevel. It automatically displays charts and graphs along with numeric\ntables and text summaries in a portable format that is cut and paste\ncompatible  with all word processors so you can easily include the\nresults in your proposal.\n\nPASS is a standalone system. Although it is integrated with NCSS, you do\nnot have to own NCSS to run it. You can use it with any statistical\nsoftware you want. PASS 2008 runs under Windows Vista, XP, 2000, NT, ME,\n98, and 95.\n\nPASS is accurate. It has been extensively verified using books and\nreference articles. Proof of the accuracy of each procedure is included\nin the extensive documentation\n\nPASS comes with three manuals that contain tutorials, examples,\nannotated  output, references, formulas, verification, and complete\ninstructions on each procedure. And, if you cannot find an answer in the\nmanual, our free technical support staff (which includes three PhD\nstatisticians) is available\n\nNo other program calculates sample sizes and power for as many different\nstatistical procedures as does PASS. Specifying your input is easy,\nespecially with the online help and manual\n\nInstallation\n\nJust unpack&amp;install. Register with the serial in serial.txt","torrent":{"xt":"urn:btih:15322e67a838b37a12d7dcf5671ab01fbab96d3f","amp;dn":"NCSS.PASS.2008.v8.0.15-BEAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15322e67a838b37a12d7dcf5671ab01fbab96d3f","infoHashBuffer":{"type":"Buffer","data":[21,50,46,103,168,56,179,122,18,215,220,245,103,26,176,31,186,185,109,63]},"announce":[],"urlList":[]}}