{"title":"Green Arrow Rise and Fall (digital) (OkC.O.M.P.U.T.O.-Novus-HD) ","uid":10670358,"size":1207879949,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1579a8105dd7c7985e4f44d3a0bd3c139549b14b&amp;dn=Green+Arrow+Rise+and+Fall+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1406860942,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the HD versions.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\nGather's Rise and Fall which includes Justice League: Cry for Justice 1-7, Justice League:  Rise of Arsenal 1-4 and Special, plus Green Arrow 31-32.  I have included the TPBs from these series.\n\n\n\nJustice League: Cry for Justice is a seven-issue comic book limited series, written by James Robinson, drawn by Mauro Cascioli, and published by DC Comics in 2009. It follows the adventures of a spin-off Justice League, led by Justice League veterans Green Lantern (Hal Jordan) and Green Arrow, and composed of Starman (Mikaal Tomas), Congorilla, Freddy Freeman, the Atom (Ray Palmer), and Supergirl (Kara Zor-El). They are seeking a more proactive stand for seeking justice following the apparent deaths of long-standing Justice League members Batman[1] and Martian Manhunter[2] during the Final Crisis event.\n\nThe Justice League of America must hunt down Green Arrow for murdering the villain Prometheus in a storyline that leads directly into BRIGHTEST DAY, written by comics superstar Geoff Johns.\nGreen Arrow has become a fugitive after killing the villain Promethus for destroying Star City and murdering the daughter of his former sidekick, Arsenal. Now, the Justice League of America must hunt down their former teammate while Arsenal must come to grips with the losses of both his daughter and his arm at the hands of Prometheus.\n\nGreen Arrow #31  &quot;The Fall of Green Arrow&quot; part 1! Spinning out of the shocking events of JUSTICE LEAGUE: CRY FOR JUSTICE and JUSTICE LEAGUE: THE RISE AND FALL SPECIAL comes the destruction of Green Arrow. As Oliver Queen's inner turmoil and guilt overwhelms him, secrets are revealed that will tear him asunder.\n\nGreen Arrow #32  In &quot;The Fall of Green Arrow&quot; part 2, the series final issue, Oliver Queen is a fugitive from justice. But what happens when the Justice League of America learn of his crime and what life-changing decision will the Emerald Archer make in return?\n\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O this release.","torrent":{"xt":"urn:btih:1579a8105dd7c7985e4f44d3a0bd3c139549b14b","amp;dn":"Green+Arrow+Rise+and+Fall+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1579a8105dd7c7985e4f44d3a0bd3c139549b14b","infoHashBuffer":{"type":"Buffer","data":[21,121,168,16,93,215,199,152,94,79,68,211,160,189,60,19,149,73,177,75]},"announce":[],"urlList":[]}}