{"title":"(PSX-PSP) Bushido Blade 1 &amp; 2 converted properly [ResourceRG Gam","uid":5048821,"size":678951250,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:15ce184f02a4ff0be879775b6eba95642568e2bb&amp;dn=%28PSX-PSP%29+Bushido+Blade+1+%26+2+converted+properly+%5BResourceRG+Gam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"toxicjuggalo","files":3,"time":1249786702,"description":"BUSHIDO BLADE:\n\nBUSHIDO BLADE is a revolutionary 3D fighter from Squaresoft, which lets you play from either the first or third-person perspective. This game is also serial linkable, so you can connect two PlayStation game consoles together via a link cable and fight against your friends. Choose from six different modes of play: Story, Versus, Slash, Training, POV, and Link. Select any of the six skilled warriors: Red Shadow, Tatsumi, Mikado, Black Lotus, Utsusemi, and Kannuki. Equip them with one of the eight ancient swords and weapons: Katana, Rapier, Naginata, Sledgehammer, Nodachi, Long Sword, Saber, or Broadsword. Combat takes place throughout an old Japanese castle, where you can move around at will and make your stand wherever you wish. The game's Story mode encourages fighting with honor; certain endings are unavailable if you have dishonored yourself throughout the course of the game. If you strike an opponent while they are climbing or on the ground is considered dishonorable. BUSHIDO BLADE's fighting system is a little different from most fighting games as well, as a single, well-placed blow can bring instant death to an adversary.\n\nBUSHIDO BLADE 2:\n\nBUSHIDO BLADE 2 for the PlayStation brings back sword and weapon fighting action from the original BUSHIDO BLADE. There is no time limit and there are no health meters and one shot can kill you. At your disposal are the weapons you've mastered, your wits, your blocking ability, and an open fighting area where you can run and reposition yourself to better take on the enemy. There are six characters to choose from, with 12 more to unlock, and three modes of play including Story, Versus, and Training. With the link option, you and a friend can play each with your own screen by using a link cable. The Story mode pits you against other ninja, samurai and bosses, while Training lets you perfect your fighting style, which you will definitely need to do to master this game.\n\nBoth games tested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS... Like my work?? Please read the NFO and support me ;)\n\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com","torrent":{"xt":"urn:btih:15ce184f02a4ff0be879775b6eba95642568e2bb","amp;dn":"%28PSX-PSP%29+Bushido+Blade+1+%26+2+converted+properly+%5BResourceRG+Gam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15ce184f02a4ff0be879775b6eba95642568e2bb","infoHashBuffer":{"type":"Buffer","data":[21,206,24,79,2,164,255,11,232,121,119,91,110,186,149,100,37,104,226,187]},"announce":[],"urlList":[]}}