{"title":"The Firm Cardioweight System - x264 - MP4 - DVDrip","uid":9660950,"size":2539361454,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1633b42da8754abaaad9a1220983333f01a6dad2&amp;dn=The+Firm+Cardioweight+System+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MrTVGuy","files":-1,"time":1393279282,"description":"THE FIRM: CARDIOWEIGHT SYSTEM\n\nAll workouts are encoded for maximum compatibility, small file size and good quality. As always, Softmodded Wii compatible.\n\nABOUT THE WORKOUTS\n\nThe FIRM CardioWeight System is a series of total body workouts that combine cardio with body sculpting in a revolutionary method to sculpt your muscles and tone your body, burning up to three times more fat than cardio alone! Using adjustable hand weights, you gradually increase resistance as you become stronger, leaner and more confident. Consists of four great videos to kick-start your fitness. \n\n(1) Hi-Def Sculpt with Annie provides the perfect introduction to the FIRM body shaping exercises at a slower pace. Upper and lower body moves are designed to maximize effectiveness, while minimizing your time commitment. Approx. 55 minutes. \n\n(2) Cardio Overdrive will kick your weight loss into high gear. Unique low impact cardio and body shaping exercises burn calories both during and after this dynamic workout. Tone your legs, arms and waist to the high-energy beat with easy-to-follow steps and Alison's expert coaching. Approx. 52 minutes. \n\n(3) Hard Core Fusion is The FIRM's innovative hybrid of aerobics and weight training with body-transforming power. Allie guides you through this incredible, fat-burning, heart-pumping cardio and sculpting workout with The FIRM's signature moves and exercises. Have fun while you burn fat, revealing a leaner, tighter body. Approx. 63 minutes. \n\n(4) The Firm Cardio Party bonus workout is expecially for those days when you need an extra boost. Burn calories while you sculpt your body slim and party with your favorite FIRM Master Instructors. Approx. 40 minutes. Each workout also includes an express option for extra-busy days! ","torrent":{"xt":"urn:btih:1633b42da8754abaaad9a1220983333f01a6dad2","amp;dn":"The+Firm+Cardioweight+System+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1633b42da8754abaaad9a1220983333f01a6dad2","infoHashBuffer":{"type":"Buffer","data":[22,51,180,45,168,117,74,186,170,217,161,34,9,131,51,63,1,166,218,210]},"announce":[],"urlList":[]}}