{"title":"R.E.M. 24 Bit Vinyl Pack","uid":8711926,"size":3373773251,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:16582eb2eee08e865f3f62ab5afa582b0237b3e4&amp;dn=R.E.M.+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1374254992,"description":"  R.E.M. 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, College Rock, Jangle Pop\n  Source: Vinyl, HD Tracks\n  Codec: FLAC\n  Bit Rates: ~ 1,500 - 3,200 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1986 Live's Rich Pageant (180g LP)\n  1987 Document\n  1991 Automatic for the People (24 bit HD Tracks)\n  2011 Collapse Into Now (German Original vinyl)\n\n  R.E.M. marked the point when post-punk turned into alternative rock. When their first single, &quot;Radio Free Europe,&quot; was released in 1981, it sparked a back-to-the-garage movement in the American underground. While there were a number of hardcore and punk bands in the U.S. during the early '80s, R.E.M. brought guitar pop back into the underground lexicon. Combining ringing guitar hooks with mumbled, cryptic lyrics and a D.I.Y. aesthetic borrowed from post-punk, the band simultaneously sounded traditional and modern. Though there were no overt innovations in their music, R.E.M. had an identity and sense of purpose that transformed the American underground. Throughout the '80s, they worked relentlessly, releasing records every year and touring constantly, playing both theaters and backwoods dives. Along the way, they inspired countless bands, from the legions of jangle pop groups in the mid-'80s to scores of alternative pop groups in the '90s, who admired their slow climb to stardom.\n\n  It did take R.E.M. several years to break into the top of the charts, but they had a cult following the release of their debut EP, Chronic Town, in 1982. Chronic Town established the haunting folk and garage rock that became the band's signature sound, and over the next five years, they continued to expand their music with a series of critically acclaimed albums. By the late '80s, the group's fan base had grown large enough to guarantee strong sales, but the Top Ten success in 1987 of Document and &quot;The One I Love&quot; was unexpected, especially since R.E.M. had only altered their sound slightly. Following Document, R.E.M. slowly became one of the world's most popular bands. After an exhaustive international tour supporting 1988's Green, the band retired from touring for six years and retreated into the studio to produce their most popular records, Out of Time (1991) and Automatic for the People (1992). By the time they returned to performing with the Monster tour in 1995, the band had been acknowledged by critics and musicians as one of the forefathers of the thriving alternative rock movement, and they were rewarded with the most lucrative tour of their career. Toward the late '90s, R.E.M. was an institution, as its influence was felt in new generations of bands.","torrent":{"xt":"urn:btih:16582eb2eee08e865f3f62ab5afa582b0237b3e4","amp;dn":"R.E.M.+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16582eb2eee08e865f3f62ab5afa582b0237b3e4","infoHashBuffer":{"type":"Buffer","data":[22,88,46,178,238,224,142,134,95,63,98,171,90,250,88,43,2,55,179,228]},"announce":[],"urlList":[]}}