{"title":"RailWorks - Northeast Corridor Expansion Pack","uid":6640384,"size":279796131,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:165a2a37dffebbde2ab2f4cb5d9e0d6e7af49651&amp;dn=RailWorks+-+Northeast+Corridor+Expansion+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RailGamer","files":-1,"time":1314719966,"description":"About the Game\nThe Northeast Corridor is the United States premier passenger railroad line, linking Boston to Washington DC and moving thousands of passengers daily through this extremely busy part of the country. It ia also North Americas only high-speed line operating at speeds up to 150mph. Now available for RailWorks 2, the Northeast Corridor Expansion Pack puts you in the cab of the classic EMD AEM-7 locomotive along the 90-mile core section between Philadelphia and New York City.\n\nThe railroad known today as the Northeast Corridor was in place from the early years of the 20th Century, with electric services between New York City and New Brunswick beginning in 1932, and with electrification as far as Trenton by 1933. The line was operated by New York Central and the Pennsylvanian Railroad (merging to form Penn Central Transportation) for many years until Amtrak took over intercity services in the early 1970s. In the late 1990s the Northeast High Speed Rail Improvement Program (NHRIP) was implemented in preparation for the high speed Acela Express service. The EMD AEM-7 electric locomotives, as featured in this expansion pack, were produced by the Electro-Motive Division of General Motors between 1978 and 1988, and the AEM-7 soon became a familiar sight as the workhorse of the Northeast Corridor.\n\nThe Northeast Corridor Expansion Pack is a faithful recreation of this bustling high-speed line, with fabulous skylines, miles of railroad to explore and hours of challenging driving for you to enjoy!\n\n\nIncludes\n90-mile route from Philadelphia 30th Street Station to New York Pennsylvania Station, with realistic signalling and track work, stations, cities and scenery.\nAEM-7 in Amtrak livery, with accurately recreated cab and controls including functioning in-cab signalling system.\nAmfleet steel-bodied passenger coaches in Amtrak livery, including Coach and Cafe variants.\nAmtrak is a registered service mark of the National Railroad Passenger Corporation. All rights reserved. Used with Permission.\n\n8 Scenarios:\nFree Roam Scenarios\nGo Newark\nNew Jersey Trenton\nSpirit or Transportation\nThe Big Apple\nEarly Clocker - Philadelphia to New York with multiple intermediate stops.\nEvening Clocker - New York to Philadelphia with multiple intermediate stops.\nLucky Northeast Regional - Friday night direct service along the mainline. Its a Friday, and its the 13th. How does your luck run?\nThe Keystone - Run Amtraks express service between New York and Philadelphia, with only one call en-route at Newark.","torrent":{"xt":"urn:btih:165a2a37dffebbde2ab2f4cb5d9e0d6e7af49651","amp;dn":"RailWorks+-+Northeast+Corridor+Expansion+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"165a2a37dffebbde2ab2f4cb5d9e0d6e7af49651","infoHashBuffer":{"type":"Buffer","data":[22,90,42,55,223,254,187,222,42,178,244,203,93,158,13,110,122,244,150,81]},"announce":[],"urlList":[]}}