{"title":"The Jury (DVDRip) 2002 (6 episodes)","uid":4290065,"size":2195611648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:16b24af4512d35e319205c5117ad200668d0275a&amp;dn=The+Jury+%28DVDRip%29+2002+%286+episodes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AlfieNoakes","files":6,"time":1215871290,"description":"In London's imposing Old Bailey courthouse, a gruesome crime is brilliantly prosecuted, ingeniously defended, and then painstakingly judged...\n\nA 15 year-old white boy has been killed in cold blood. His classmate, a quiet, reclusive Sikh boy, is on trial for murder. It is a trial that becomes a tinderbox for the justice system and race relations in the country. The decision hangs on a knife-edge and falls to the twelve jurors who find themselves the focus of national attention. They have to cope with intense pressure, threats and intimidation as they embark on the biggest soul searching experience of their lives. Probing the personal stories of the ordinary citizens who are given the ultimate authority over truth, The Jury weaves a fascinating tale of troubled lives in a racially charged case.\n\nSir Derek Jacobi (I,Claudius; Cadfael) stars as defence counsel George Cording, who represents a Sikh teenager charged with killing a fellow pupil with 28 blows from a ceremonial sword. Also starring is Sir Antony Sher (Her Majesty, Mrs. Brown) as crown prosecutor Gerald Lewis, known to hapless defendants as &quot;the bastard of the Bailey.&quot; And then there is the jury: &quot;a real mixed bag,&quot; says Cording approvingly. &quot;Women, men, young, old, black, white. A real jury. A real London jury.&quot;\n\nAmong the twelve are Rose Davies (Helen McCrory: Lucky Jim, Anna Karenina), a beautician desperate to escape her dead-end marriage; Johnnie Donne (Gerard Butler: Mrs. Brown, The Phantom of the Opera, 300, Timeline), a recovering alcoholic who becomes Rose's soul mate; Marcia Thomas (Nina Sosanya: Prime Suspect), a single mother who is the first target of jury intimidation mounted by the family of the victim; and Peter Segal (Michael Maloney: Me &amp; Mrs. Jones), a dishevelled businessman.\n\nAlso on the panel are Charles Gore (Stuart Bunce: All the King's Men), a Catholic seminarian having doubts about his chosen vocation; Elsie Beamish (Sylvia Syms), an elderly widow drawn to Charles because of their shared faith; and Jeremy Crawford (Nicholas Farrell: Bramwell), a family man with a disastrous gambling streak.\n\nAuthenticity and gravitas were enhanced by shooting in the magnificent Great Hall of the Old Bailey -- the first time filming has been permitted inside the historic structure, which was built in the early 1900s on the site of the old Newgate Prison.\n\nThe Jury draws viewers deeply into the psychological stresses and shifting alliances that ultimately lead a jury to choose guilt or innocence. \n\n\nEpisode Details\n\nThe Jury Episode 1:\nFirst aired: 2/17/2002    \n\nJohn Maher was brutally stabbed to death as he walked to school. A bloodstained, three-foot sword lay next to the 15 year-old boy's body. Witnesses reported seeing his Sikh classmate, Duvinder Singh, frantically running from the scene. Now a jury must decide his fate, but no matter what the verdict, it is clear Duvinder isn't the only one on trial.\n\nFilename.....: The_Jury_e01.avi\nFilesize.....: 348 MB\nRuntime......: 00:47:04\nVideo Codec..: Xvid\nAudio Codec..: MPEG Layer 3\nFrame Size...: 640 x 432\n\nThe Jury Episode 2:\nFirst aired: 2/24/2002\n\nEmotions run high as the trial gets underway. Enraged Sihk and Anglo communities face off in angry protests as a prison guard delivers a painful message to young Duvinder and damning evidence fills the courtroom. Meanwhile, the jurors struggle with the harsh reality of holding another person's live in their hands.\n\nFilename.....: The_Jury_e02.avi\nFilesize.....: 349 MB\nRuntime......: 00:46:37\nVideo Codec..: Xvid\nAudio Codec..: MPEG Layer 3\nFrame Size...: 640 x 432\n\nThe Jury Episode 3:\nFirst aired: 3/3/2002\n\nThere are two sides to every story, and two ways to rob someone of their life. A sword is on way. Mental and physical abuse is another. When alleged killer Duvinder Singh gives his testimony, a new victim emerges. Years of bullying took its toll on Duvinder until the pain was unbearable. But he didn't kill John Maher. However John's brothers see it differently and plot to sway the jury.\n\nFilename.....: The_Jury_e03.avi\nFilesize.....: 348 MB\nRuntime......: 00:46:33\nVideo Codec..: Xvid\nAudio Codec..: MPEG Layer 3\nFrame Size...: 640 x 432\n\nThe Jury Episode 4:\nFirst aired: 3/10/2002\n\nStartling evidence deflates the prosecution's allegations. The same morning John was stabbed, a deranged man attacked a jogger nearby. There are surprising similarities between the two attacks - could this psychopath have struck twice? The jury will have to decide, but sifting through the evidence becomes more difficult as their lives spiral out of control.\n\nFilename.....: The_Jury_e04.avi\nFilesize.....: 349 MB\nRuntime......: 00:46:49\nVideo Codec..: Xvid\nAudio Codec..: MPEG Layer 3\nFrame Size...: 640 x 432\n\nThe Jury Episode 5:\nFirst aired: 3/17/2002 \n\nOnly 11 fateful minutes are unaccounted for on the morning John Maher was brutally murdered. After both sides lay out their cases, the jury must decide guilt or innocence based on what they believe happened during those 11 crucial minutes. The arguments are compelling and the decision quite onerous as it will change numerous lives forever.\n\nFilename.....: The_Jury_e05.avi\nFilesize.....: 348 MB\nRuntime......: 00:46:36\nVideo Codec..: Xvid\nAudio Codec..: MPEG Layer 3\nFrame Size...: 640 x 432\n\nThe Jury Episode 6:\nFirst aired: 3/24/2002\n\nIs Duvinder a vengeful murderer or a confused, frightened schoolboy? Guilty or innocent? Just one word will change his life forever. Anger between the Anglo and Sikh protesters engulfs the sidewalk outside the courthouse as the verdict is announced. For some it brings overwhelming relief, for others, overwhelming pain. No one walks away from The Jury unchanged.\n\nFilename.....: The_Jury_e06.avi\nFilesize.....: 348 MB\nRuntime......: 00:46:59\nVideo Codec..: Xvid\nAudio Codec..: MPEG Layer 3\nFrame Size...: 640 x 432\n","torrent":{"xt":"urn:btih:16b24af4512d35e319205c5117ad200668d0275a","amp;dn":"The+Jury+%28DVDRip%29+2002+%286+episodes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b24af4512d35e319205c5117ad200668d0275a","infoHashBuffer":{"type":"Buffer","data":[22,178,74,244,81,45,53,227,25,32,92,81,23,173,32,6,104,208,39,90]},"announce":[],"urlList":[]}}