{"title":"Bob Dylan - Love And Theft","uid":3288333,"size":127019000,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:16bc28b14d53e836f108093aa5da5c793bf27716&amp;dn=Bob+Dylan+-+Love+And+Theft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pippin","files":12,"time":1108075267,"description":"When we last left the ever-confounding saga that is Bob Dylan's now-superhuman recording career, he'd reunited with producer Daniel Lanois, with whom he cut 1997's Time Out of Mind, his most coherent and appealing collection in nearly a decade. Now the still-reigning prince of musical contrariety and potent wordplay is back with his most focused, well-played collection since 1989's Oh Mercy, another Lanois production. One listen to the fade-in of the opener &quot;Tweedle Dee &amp; Tweedle Dum&quot; and it's clear that all Dylan's roadwork has shaped him and his band (including guitarist Charlie Sexton) into a mighty musical weapon. And while his craggy howl continues to resonate, it's the songs here that astonish. A sturdy midtempo melody makes &quot;Mississippi&quot; the equal of the best numbers on Time, which it was actually written for. He convincingly puts over the R&amp;B swing (yes, swing) number &quot;Summer Days.&quot; &quot;Honest with Me&quot; (&quot;I'm not sorry for nuthin' I've done / I'm glad I fight, I only wished we'd won&quot;) is a driving rocker that packs a genuine punch. And the light, lounge-like &quot;Bye and Bye&quot; and the southland ramble &quot;Floater (Too Much to Ask)&quot; show extraordinary confidence. He's labeled these songs &quot;blues-based,&quot; but in typical Dylan fashion what would promise to be the most overtly blues number here--&quot;High Water (for Charlie Patton)&quot;--sounds like a banjo-based gunfighter ballad. But then that's this artist's gift: confounding expectations.\n&lt;p&gt;\nNote: This is an mp4 encode of Love And theft. You may have to download a plugin to play this, but windows media player usually takes care of that automatically. \n&lt;/p&gt;\n If theres any Dylan album, you want, just tell me.","torrent":{"xt":"urn:btih:16bc28b14d53e836f108093aa5da5c793bf27716","amp;dn":"Bob+Dylan+-+Love+And+Theft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16bc28b14d53e836f108093aa5da5c793bf27716","infoHashBuffer":{"type":"Buffer","data":[22,188,40,177,77,83,232,54,241,8,9,58,165,218,92,121,59,242,119,22]},"announce":[],"urlList":[]}}