{"title":"May Blitz - May Blitz [1970][EAC/FLAC]","uid":10570505,"size":228737443,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17abc823a400a4e1b07c73c6d745ba1622c99afc&amp;dn=May+Blitz+-+May+Blitz+%5B1970%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":-1,"time":1405569996,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Akarma Records / 253 / Remastered\nCountry: UK\nYear: 2003\nGenre: rock\nFormat: CD,Album\n\n\n\n\n\n1. Smoking the Day Away (8:19)\n2. I Don't Know? (4.52)\n3. Dreaming (6:40)\n4. Squeet (6:51)\n5. Tomorrow May Come (4:47)\n6. Fire Queen (4:14)\n7. Virgin Waters (6:56)\n\n\n\nMay Blitz (alongside Rory Gallagher's Taste) were among the first of the newly formed hard rock power trios to take up the challenge of Cream and the Jimi Hendrix Experience; that is, making the biggest possible noise with the smallest available lineup, but never losing sight of melody and finesse while they did so. Certainly anyone catching their early live show was guaranteed to leave with their ears ringing but their brainbox humming, and the band's debut album was a seamless reiteration of their in-concert impact, all the way down to the extended riffing and miniature solos. May Blitz's strongest point, in terms of audience recognition, was drummer Tony Newman, and fans of the jazz-inflected style that he injected into the Jeff Beck Group certainly won't be disappointed by what they find here -- indeed, with guitarist James Black beside him, it's not difficult to compare May Blitz to the Beck band's Beck-Ola, and find the better-known disc come up wanting every time. The epic &quot;Smoking the Day Away&quot; kicks things off in dynamic form, laying down the grinding, almost proto-metallic assault that was May Blitz's raison d'etre; later in the set, &quot;Dreaming,&quot; &quot;Virgin Waters,&quot; and &quot;Squeet&quot; all howl with a vengeance that might sound a little old-fashioned today, but was breathtakingly fresh at the time. Even better is &quot;Fire Queen,&quot; which essentially blueprints the best parts of every metal act from Judas Priest to the Cult, except it doesn't hang around long enough to spoil the effect. Rather like May Blitz themselves, in fact.","torrent":{"xt":"urn:btih:17abc823a400a4e1b07c73c6d745ba1622c99afc","amp;dn":"May+Blitz+-+May+Blitz+%5B1970%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17abc823a400a4e1b07c73c6d745ba1622c99afc","infoHashBuffer":{"type":"Buffer","data":[23,171,200,35,164,0,164,225,176,124,115,198,215,69,186,22,34,201,154,252]},"announce":[],"urlList":[]}}