{"title":"Wild Island -  Jennifer Livett [EN EPUB] [ebook] [p_s]","uid":15634439,"size":1246553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1900b06f46c94e3a8c0ac2257de84f4dfaac0d90&amp;dn=Wild+Island+-++Jennifer+Livett+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"perfect_stan","files":1,"time":1471976021,"description":"Wild Island by Jennifer Livett \r\nEnglish | 2016 | Literary Fiction | 1.2 MB \r\n\r\n‘My name is Harriet Adair, and forty years ago on that ship I was Jane Eyre’s companion. That voyage also brought me friendship with another intrepid Jane: Lady Franklin. Her husband, Sir John, the Arctic Lion, was Lieutenant Governor of Van Diemen’s Land during the six turbulent years when Jane Eyre and Edward Rochester had good reason to be closely interested in the island.’ \r\nHarriet Adair has come to Van Diemen’s Land with Mrs Anna Rochester, who is recovering from years of imprisonment in the attic of ‘Thornfield Hall’. Sent to the colony by Jane and Rochester, they are searching for the truth about Anna’s past, trying to unearth long-buried secrets. \r\nCaptain Charles O’Hara Booth, Commandant of Port Arthur Penal Settlement, fears some secrets of his own will be discovered when Sir John Franklin replaces Colonel Arthur as Governor. Franklin and his wife Jane arrive in Hobart Town to find the colony is run by a clique of Arthur’s former army officers who have no intention of relinquishing their power. \r\nThis dazzling modern recreation of a nineteenth century novel ingeniously entwines Jane Eyre’s iconic love story with Sir John Franklin’s great tale of exploration and empire. A brilliant and historically accurate depiction of Van Demonian society in the 1800s, as well as a vivid portrayal of the human cost of colonisation, Wild Island shows us that fiction and history are not so different after all. Each story, whether it be truth or fiction, is shaped by its teller. \r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:1900b06f46c94e3a8c0ac2257de84f4dfaac0d90","amp;dn":"Wild+Island+-++Jennifer+Livett+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1900b06f46c94e3a8c0ac2257de84f4dfaac0d90","infoHashBuffer":{"type":"Buffer","data":[25,0,176,111,70,201,78,58,140,10,194,37,125,232,79,77,250,172,13,144]},"announce":[],"urlList":[]}}