{"title":"Escape from Camp 14: One Man's Remarkable Odyssey from North Kor","uid":8119297,"size":1125873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:190726cb127665e933dc7d6f5d558eee071bfe2d&amp;dn=Escape+from+Camp+14%3A+One+Man%27s+Remarkable+Odyssey+from+North+Kor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jm2013","files":1,"time":1360358628,"description":"A New York Times bestseller, the shocking story of one of the few people born in a North Korean political prison to have escaped and survived.\n\nNorth Korea is isolated and hungry, bankrupt and belligerent. It is also armed with nuclear weapons. Between 150,000 and 200,000 people are being held in its political prison camps, which have existed twice as long as Stalin's Soviet gulags and twelve times as long as the Nazi concentration camps. Very few born and raised in these camps have escaped. But Shin Donghyuk did.\n\nIn Escape from Camp 14, acclaimed journalist Blaine Harden tells the story of Shin Dong-hyuk and through the lens of Shin's life unlocks the secrets of the world's most repressive totalitarian state. Shin knew nothing of civilized existence-he saw his mother as a competitor for food, guards raised him to be a snitch, and he witnessed the execution of his own family. Through Harden's harrowing narrative of Shin's life and remarkable escape, he offers an unequaled inside account of one of the world's darkest nations and a riveting tale of endurance, courage, and survival.","torrent":{"xt":"urn:btih:190726cb127665e933dc7d6f5d558eee071bfe2d","amp;dn":"Escape+from+Camp+14%3A+One+Man%27s+Remarkable+Odyssey+from+North+Kor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"190726cb127665e933dc7d6f5d558eee071bfe2d","infoHashBuffer":{"type":"Buffer","data":[25,7,38,203,18,118,101,233,51,220,125,111,93,85,142,238,7,27,254,45]},"announce":[],"urlList":[]}}