{"title":"Heroes Of The Pacific","uid":4316687,"size":1213523968,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1916aa477b488096d8a0dfd6ec07edc77bc986ce&amp;dn=Heroes+Of+The+Pacific&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"dersubyn","files":2,"time":1217125174,"description":"With World War II still burning up the charts as the war people are most likely to watch exhaustive documentaries of and play video games about, it&amp;#039;s only natural that we see another take on the airborne conflicts of the war&amp;#039;s Pacific theater. Ubisoft&amp;#039;s Heroes of the Pacific is such a game, and it combines well-conceived controls and gameplay with solid visuals and audio. It&amp;#039;s not the sort of thing that&amp;#039;s likely to knock your socks off, but if you&amp;#039;ve been watching a lot of The History Channel lately and you&amp;#039;re not after a frustratingly realistic flight model, Heroes is a good package. \nThe game&amp;#039;s main mode is a campaign that puts you in the role of a Navy flyboy named Crowe, who, along with his brother, signs up for military service and gets caught up in the Japanese sneak attack on Pearl Harbor. You get up in the air and make it out of there alive, taking down planes in what is essentially a tutorial mission. Your brother, however, isn&amp;#039;t so lucky and gets killed when his ship is sunk by Zeroes. This plot development is an attempt to make it personal and leads to some confrontations with the squadron responsible for the attack a little later on. From there, the game works in chronological order, taking you through many of the region&amp;#039;s major battles and, from time to time, cutting in with stock World War II footage. You&amp;#039;ll help evacuate Wake Island, partake in battles at Midway, and so on. While light on cursing, the game does attempt to use period-accurate dialogue, but all this boils down to is hearing the term &quot;Japs&quot; over and over again. \nWhile you&amp;#039;ll do most of your flying in light, maneuverable fighters, you&amp;#039;ll also fly dive-bombers, torpedo planes, and heavy bombers at various points in the campaign. Often, dropping ordnance on enemy targets is one of the least exciting parts of a game like this. But Heroes of the Pacific handles bomb dropping and torpedo launching very well, which makes these activities a lot of fun. Onscreen indicators appear when you&amp;#039;re preparing to drop, and they light up green when, for instance, you&amp;#039;ve gotten low enough to launch a torpedo or have tilted down to the proper angle to do a little dive-bombing. \nThe game&amp;#039;s campaign seems like it has a lot to it, but the default difficulty is such a breeze that anyone with basic dogfighting skills will probably cruise through in a day or two. There are four difficulty settings in all, so by all means, turn things up a bit. It never gets fiendishly difficult, but you&amp;#039;ll certainly find the higher settings to be tougher. The game&amp;#039;s difficulty is also a bit different depending on how you&amp;#039;re controlling the action. As a game that was also released on consoles, it feels like it was made for a gamepad, preferably one with two analog sticks. It&amp;#039;s possible to play with the mouse and keyboard, also. The control schemes for these are functional, but the control isn&amp;#039;t as satisfying. \nAside from the campaign, you can enter into a battle with the instant-action option, you can unlock a number of historical missions that are more closely based on actual events, and you can jump online to play competitive games with up to seven other players. These range from a basic free-for-all dogfight to team games, such as capture the flag or scratch one flattop, which gives each team a carrier to defend against the other team. Planes you&amp;#039;ve unlocked in the campaign mode are available here, including a number of Japanese planes. The online play is basic but functional. That said, we found it difficult to find other players, so don&amp;#039;t expect a huge community of always-ready pilots to be at your fingertips. \nNice plane models and good-looking clouds are the things that stand out about Heroes of the Pacific&amp;#039;s visuals. The game maintains a smooth frame rate most of the time and has decent-looking ground textures and targets. Things like the sun glinting off of the water and black smoke pouring out of damaged planes help make the whole game look good. The game supports fairly high resolutions and has support for wide-screen monitors as well, though at higher resolutions, you&amp;#039;ll really notice how ugly some of the textures look up close. \nOn the audio side, the sounds of combat are well done. You&amp;#039;ll be flying over a lot of heavy battles, and you&amp;#039;ll hear things like antiaircraft fire exploding all around you. The game has a lot of speech, and while it&amp;#039;s disappointing that the orders you give to your wingmen are repeated so frequently, the performances are solid. \nWhile the online mode is a little too standard for its own good, the game&amp;#039;s campaign is compelling, and the game plays well overall. Some flight-combat buffs will probably dislike the game&amp;#039;s loose style, but people who aren&amp;#039;t necessarily looking for a pitch-perfect flight simulation of the conflict will probably enjoy Heroes of the Pacific. ","torrent":{"xt":"urn:btih:1916aa477b488096d8a0dfd6ec07edc77bc986ce","amp;dn":"Heroes+Of+The+Pacific","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1916aa477b488096d8a0dfd6ec07edc77bc986ce","infoHashBuffer":{"type":"Buffer","data":[25,22,170,71,123,72,128,150,216,160,223,214,236,7,237,199,123,201,134,206]},"announce":[],"urlList":[]}}