{"title":"The Guy Game [DVD5] [Pal/Ntsc], Ps2","uid":5470213,"size":3969468860,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:1960afa4fe814664ab6515a9f6896f9af943907c&amp;dn=The+Guy+Game+%5BDVD5%5D+%5BPal%2FNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big_dude","files":-1,"time":1269854160,"description":"The Guy Game for the Ps2                                          Rel. 08/31/2004\n\n\nFormat:        DVD5 PAL/NTSC SELECTOR\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Trivia Game Show\nRating:        M (Mature)\nConversion:    DVD9 To DVD5\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes: This is the original NTSC-USA Release but has been Converted to \n               DVD5, and has been patched with Paradox Patch for Pal or Ntsc\n               option. Press O for Ntsc or X for Pal. I shouldn't take credit for \n               this as the source was downloaded from Snesorama.\n              \n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nThe Guy Game takes the wild girls of Spring Break and challenges up to four players in the most extreme party game of all time! Answer trivia challenges, bet on hot college co-eds and compete in multi player mini-games and unlock sexy clips and uncensored Spring Break stunts!\n\nAn FMV-based trivia game, The Guy Game pits you and up to three other players in a series of rounds in which you must answer multiple-choice trivia questions for top scores. Whether you play alone or with friends, you'll also be playing in the company of a couple of comic relief voice-overs that provide commentary, as well as dozens of co-eds out for spring break, who are more than happy to drop their tops off should they lose the questions. Their naughty bits are obscured by &quot;Guy Game&quot; logos, but depending on how much bonus score you get, you can remove the censoring from the clips and unlock them for uhm... further analysis.\n\nYou get bonus points by figuring out if the girls are going to answer right or wrong, what they answer, and also by betting on the outcome of mini-games where the girls compete in races, and assorted beach activities.\n\n\nFeatures:\n\n* 20 different episodes, each featuring interviews, stunts, and challenges with\n  hot college babes!\n\n* Top scorer becomes &quot;President&quot; and can make rules and control the game, while \n  the low scorer loses influence and respect.\n\n* Choose from 8 sexy cheerleaders with outfits that become more revealing the \n  better you do.\n\n* Compete between trivia rounds in challenging mini-games with high-speed action.\n\n* Test your knowledge with over 1000 unique trivia questions in a variety of \n  subjects.\n\n* Complete an episode and unlock new episodes, pictures, girls, videos and more \n  Spring Break insanity. \n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:1960afa4fe814664ab6515a9f6896f9af943907c","amp;dn":"The+Guy+Game+%5BDVD5%5D+%5BPal%2FNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1960afa4fe814664ab6515a9f6896f9af943907c","infoHashBuffer":{"type":"Buffer","data":[25,96,175,164,254,129,70,100,171,101,21,169,246,137,111,154,249,67,144,124]},"announce":[],"urlList":[]}}