{"title":"Slutty &amp; Sluttier #3 (2007,xvid) - anal, DP, squirt, Bobbi Star,","uid":4818944,"size":1473290240,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:19b92753e5aae78ea665deb1d19906e40ff8c786&amp;dn=Slutty+%26+Sluttier+%233+%282007%2Cxvid%29+-+anal%2C+DP%2C+squirt%2C+Bobbi+Star%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"the_skid","files":1,"time":1238664091,"description":"Slutty &amp; Sluttier #3 (DVD.xvid)\n\n\n\n\n\n\nall 5 screens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://x4x.blogbugs.org/8263893/Slutty-And-Sluttier-3---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://x4x.blogbugs.org/8263893/Slutty-And-Sluttier-3---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nActresses\n\n    * Annette Schwarz            [Anal Facial DP Bald A2M]\n    * Bobbi Starr                [Anal Facial DP Bald A2M]\n    * Jada Fire                  [Anal Facial A2M IR]\n    * Lela Star                  [Facial Squirt Bald Swallow]\n    * Lexi Belle                 [Bald]\n    * Marie Luv                  [Anal Facial A2M IR]\n    * Nyomi Banxxx               [Bald IR]\n    * Phyllisha Anne             [Anal Facial DP A2M]\n    * Regan Reese                [Facial Bald]\n\n   \nScene Breakdowns\n\n    * Scene 1. Annette Schwarz, Bobbi Starr, Ian Scott, Lexi Belle, Steve Holmes\n    * Scene 2. Manuel Ferrara, Regan Reese\n    * Scene 3. Jada Fire, Marie Luv, Manuel Ferrara, Nyomi Banxxx\n    * Scene 4. Ian Scott, James Deen, Lela Star, Manuel Ferrara, Mark Wood, Phyllisha Anne, Steve Holmes\n    * Scene 5. Lela Star, Manuel Ferrara\n\n\nStudio:        Evil Angel\nDirector:      Manuel Ferrara\nReleased:      2007\nLanguage:      English\nDuration:      02:47:16\nFormat:        Xvid\n\n\n\nReview:\n\nManuel Ferrara is one of the few gonzo performer turned directors that makes me believe the ladies truly appreciate when he stretches their limits with hardcore antics. Other directors use pay to do this and like the performers that are &quot;gay for pay&quot;, the results are simply not the same so when he, Erik Everhard, or a few others showcase the extremer forms of gonzo, I don't feel the slightest of guilt pangs given what I've been told by the ladies themselves for enjoying the type of action they direct. Now that Manuel is distributed by Evil Angel, his profile is that much higher, the legendary company proving to be the perfect place for his movies, including his recently released Slutty &amp; Sluttier 3: Special Extended Set; the thematic sequel to Slutty &amp; Sluttier 2. The five scenes of the movie showcase some of the best gonzo sex I've seen all week, the ladies a wide variety of diverse talents with each appearing to have a different set of skills in evidence. As a guy that often likes lighter sex and features, movies like this really cater to my darker side, allowable as much because the impression that the ladies are enjoying themselves as anything else. That said, here's a quick look at the scenes by cast and action, noting that no condoms were used:\n\nScene One: Annette Schwarz, Lexi Belle, Bobbie Starr, Steve Holmes, and Ian Scott, were up first. Steve puffed away on a cigar while fingering Bobbie who was blowing him; the scene cutting away to Ian driving along with Manuel behind the camera as the limited dialogue began. Annette and Regan Reese played stripper-esque body guards sporting assault weapons, all part of the scenario where a hugely successful Steve secluded himself from the world as he enjoyed his riches from porn. The gals thoroughly searched the men in the kind of way that I would find acceptable were hotties doing it to me, the relative orgy beginning after Steve banished Manuel. The oral was plentiful by all, with kissing, rubbing, and assorted hardcore acts like a cigar in the ass to give it flavor. There was a fair amount of rimming too but the majority of the scene was devoted to anal and vaginal penetration (including DP's) with oral as a topper. The rough stuff like choking, spanking, or other acts was minimal here; the friendly dynamic catered to more than usual in this day of gonzo, over the top action. There was some almost believable squirting (getting a gal really juicy instead of the urine flying all over the place) and the gals were just as aggressive sexually as the men, with some begging as they impaled themselves on the cock of choice. The gals cumswapped to close things up, ending with their lovely asses in the air as the heated, chemistry filled scene closed up. It was a solid opening scene with Annette coming off like she was the best of the bunch.\n\nScene Two: Regan Reese, having led Manuel Ferrara to the bedroom at the beginning of the last scene, took advantage of him as the two went at one another with great passion; eating and satisfying each other thoroughly as though on a tear. Manuel ate her out and the over the top performance she gave was indicative of a different type of sexual dynamic than the last scene; the duo appearing to be into each other more than a little as if two sexual athletes on the make. Her blowjob was limited here at first but she went back a number of times as they screwed like possessed little bunnies; Regan's ass cheeks rippling like wild as she impaled herself on the cock she loved so much. The vaginal sex was better than most scenes and her titty fucking with additional oral added as much fun as her face sitting for me. The closing facial capped the scene nicely and while it might not have had enough lighting for my tastes, I found myself really liking this gal more than I usually do (she's not generally my type).\n\nScene Three: Jada Fire, Marie Luv, and Naomi Banxxx, were up next as they showed a reverse interracial scene could be fun with white Manuel Ferrara (technically, it was simply an interracial scene per general ideas but they were all human so even that stretches it for me). Marie, the lean black gal on the front cover, portrayed a ballerina in training that introduced Manuel to the fine ass of Naomi and the two ladies did some appealing toy work in lesbian fashion. That did not last long as the gals preferred cock as provided in POV fashion by the studly director. The gals made too many humming noises and such as they went to work on his dick but I gave them a modicum of room to explore this option while waiting to see if they could get back to a straightforward gonzo scene. The scene showed Manuel willing to eat them out too, the gals sitting on his lucky face as they smothered him with ass cheek heaven. Relishing their tastes as much as they did, he was soon tapping into them with gusto, actively drilling their pussies until Jada entered the picture. I make no apologies for finding her the most desirable of the trio of ladies; her skills, physical attributes, and personality work better for me on numerous levels so aside from the anal antics that ensued, she juiced up an already pleasing scene after some silly circus act tricks involving milk poured on her body for Marie to enjoy. The three way ass rub on Manuel's face was classic but the active manner in which the ladies pounded on his cock was very arousing and the rest of the oral tricks they enhanced the scene with were solid too. It might not have been the best scene of the movie but it held its own nicely, keeping the stroke value high. The scene ended with him jerking off using Naomi's fleshy ass cheeks; Jada and Marie savoring the taste with some cumswapping.\n\nScene Four: Phyllisha Anne, a gal better known for her lengthy career in porn and curvy body than her beautiful face, was up next in a scene including cute brunette Lela Starr, Mark Wood, James Deen, Ian Scott, Steve Holmes, and Manuel Ferrara. Initially, Phyllisha was sucking off Manuel in POV fashion but other men entered the picture, including James bringing in Lela so that the competition angle could be addressed. The ladies began trying to top each other in terms of sexual stimulation, resulting in oral, vaginal, anal and various other tricks including a blow bang by Phyllisha as she sought to prove her sexual skills being superior. Lela got little of the cock here as the blonde took on all the men to do DP's and an airtight act, filling her holes with some moderately active screwing as an extreme queen in search of the ultimate lay. Lela masturbated on the floor but was left largely untouched sexually while the men drilled her comrade in so many permutations that keeping up with it all was nearly impossible. The lighting was on the yellow side here too (like much of the movie only somewhat worse) but the raw energy and enthusiasm showed a gal proving herself to be over the top rather than just acting like she was (as most gals in porn seem to try). It ended when the men coated her face and tonsils like a glazed donut; Phyllisha approving of this and relishing her ability to set the bar so high.\n\nScene Five: Lela Starr, the cute brunette with the leaner body, was up last as she sought to prove she could handle hardcore action too in a scene with Manuel Ferrara. She thought the action of the last scene &quot;was hot&quot; and while she did not take on the rest of the pack, she seemed quite content that she was able to handle Manuel as they orally pleased one another before the major fucking began. It was actually rougher as he spanked her and the choking appeared to be deeper than any of the prior scenes, making her look light headed as a result. This did not slow her down in the slightest as she power sucked his rod using hand to gland action as if seeking an early load of population pudding before impaling herself rapidly on his blood engorged cock. The scene went a bit overboard with him diddling her to a urine soaked climax but her playful demeanor was a nice way to end the movie with the gal swallowing his load so very easily.\n\nSummary: Slutty &amp; Sluttier 3: Special Extended Set by director Manuel Ferrara for Evil Angel was a bit weak on the camera work and lighting but every other aspect; from the extras, the ladies, the chemistry and passion, were all top notch; earning a rating of Highly Recommended. The strokability and replay value were such that Slutty &amp; Sluttier 3: Special Extended Set, like Slutty &amp; Sluttier 2 before it, showed Manuel at his sexual peak, the ladies each embracing the way he shoots his movies with them in mind. In the future, I hope he ramps up his technical expertise or at least hires a crew that can assist him in doing so to make the picture look better but in terms of raw energy and enthusiasm, Manuel Ferrara is the unpolished gem of gonzo at this time. Good work! \n\n\n\n\n\n.\n\n\n\n","torrent":{"xt":"urn:btih:19b92753e5aae78ea665deb1d19906e40ff8c786","amp;dn":"Slutty+%26+Sluttier+%233+%282007%2Cxvid%29+-+anal%2C+DP%2C+squirt%2C+Bobbi+Star%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19b92753e5aae78ea665deb1d19906e40ff8c786","infoHashBuffer":{"type":"Buffer","data":[25,185,39,83,229,170,231,142,166,101,222,177,209,153,6,228,15,248,199,134]},"announce":[],"urlList":[]}}