{"title":"ALIEN PLANET--Documentary(WTC-SWE)","uid":4413965,"size":737726464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19cf4ce8aa25f7abf511a238eb2237d66e3c4d08&amp;dn=ALIEN+PLANET--Documentary%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1222413292,"description":"\n                             ALIEN PLANET\n                            --------------\n\n\n\nWhat happens when we find life outside our own planet? Discovery Channel brings viewers on a virtual mission of the future. Right now, the search for planets with &quot;life signatures&quot; goes on. These efforts are global, and experts tell us on camera how this search for life is progressing around the world. No longer just the domain of science fiction, what could alien life really look like? Alien Planet dramatizes an exciting ? and possible ? answer.\n\nThe drama takes place on Darwin IV, a fictional planet 6.5 light-years from Earth, with two suns and 60 percent gravity. Having identified Darwin as a world that could support life, Earth sends a pilot mission consisting of the mothership Von Braun and three probes: Balboa, Da Vinci and Newton. This unmanned fleet is responsible for finding and assessing any life-forms on Darwin IV. Initially, the expectation is to find microscopic life, but the probes soon find themselves in the middle of a developed ecosystem teeming with life of all sizes.\n\nThe viewer experiences Darwin IV through the &quot;eyes&quot; of the probes Ike (Newton) and Leo (Da Vinci), whose data is relayed back to the mothership and then communicated to Earth. The biological and atmospheric data from the probes and mothership are relayed to viewers through computer voice simulation and on-screen readouts.\n\nReal scientists consider data in this planetary environment. They discuss the larger issues of the possibilities of life outside our solar system and deconstruct the animals on Darwin IV, basing the analysis on the laws of evolution and physics. Where possible, life-size animal images and the real probe prototypes will help the audience to understand the current, real basis of the search for other planets. Stephen Hawking, Michio Kaku and other big thinkers and scientists will participate in the discussion of where science is today. Other participants include Jack Horner, Craig Venter, George Lucas and NASA's chief scientist, Jim Garvin.\n\nThe drama on Darwin IV is motivated by real science missions, such as the NASA Origins Program and the NASA/JPL Planet-Finder Mission, as well as the European Space Agency's Darwin Project. The Discovery Channel's founder, John Hendricks, recently announced that Discovery is helping to fund a planet-finding telescope, at Lowell Observatory in Flagstaff, Ariz. Rooted in real-life endeavors, scientists have designed the planet of Darwin IV (which lies in a known star system), the probes and spacecraft, as well as the various life-forms found. \n\n\n\n\n\n\nFile Size: 703 MB \nVideo Length: 01:33:42\nVideo Codec: XviD MPEG-4\nVIdeo Bitrate: 1024 kbit/s\nAudio Bitrate: 127 kbit/s\nAudio Codec:  MPEG Layer -3 (AC3)\nSubtitles: (N/A) \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0453446/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0453446/&lt;/a&gt;\n\n\n\nEnjoy:\n\n\nYOUR CHOICE\n                                       \nWTC-SWE\t\t\n\n\n\n(Please help seed so others can enjoy it)\n","torrent":{"xt":"urn:btih:19cf4ce8aa25f7abf511a238eb2237d66e3c4d08","amp;dn":"ALIEN+PLANET--Documentary%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19cf4ce8aa25f7abf511a238eb2237d66e3c4d08","infoHashBuffer":{"type":"Buffer","data":[25,207,76,232,170,37,247,171,245,17,162,56,235,34,55,214,110,60,77,8]},"announce":[],"urlList":[]}}