{"title":"Tom Cochrane - Take It Home [2015][320 KBPS]","uid":11753486,"size":112648029,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1a21c0628af5b573db6bf5b7d8a863aadfe36231&amp;dn=Tom+Cochrane+-+Take+It+Home+%5B2015%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"LameDuck69","files":15,"time":1426283688,"description":"Tom Cochrane - Take It Home [2015]\n\n\n\n01 Can't Stay Here\n02 Sunday Afternoon Hang\n03 Diamonds\n04 Country Girls Never Get Old\n05 When The Light Starts To Fade\n06 Pink Time \n07 First Time Around\n08 The One's That I've Known\n09 Another Year\n10 A Prayer For Hope \n11 Back In The Game (Bonus Track)\n------------------------------------\n**320 KBPS CBR\n**Cover Art\n------------------------------------\nThomas William &quot;Tom&quot; Cochrane, OC (born May 14, 1953) is a Canadian musician, best known for his hit songs &quot;Life Is a Highway&quot;, &quot;Lunatic Fringe&quot;, &quot;Human Race&quot;, and &quot;I Wish You Well&quot;. Cochrane fronted the Canadian rock band Red Rider and has won seven Juno Awards. He is a member of the Canadian Music Hall of Fame, an Officer of the Order of Canada, has an Honorary Doctorate from Brandon University and is an Honorary Colonel in the Royal Canadian Air Force. In September 2009, he was inducted onto the Canadian Walk of Fame.\n\nEarlier Life:\n\nCochrane was born in Lynn Lake, Manitoba, to Violet and Tuck Cochrane, a bush pilot. The family relocated to Acton, Ontario, when Tom was four years old and later to Etobicoke, Ontario. He purchased his first guitar at age 11 by selling a toy train set. Cochrane attended Martingrove Collegiate Institute in the late 1960s. In the early 1970s, Tom was performing in coffee houses across Canada. He eventually made his way to Los Angeles where he found a job writing theme music for the movie My Pleasure Is My Business, the Xaviera Hollander story. Unable to find steady income from music, Cochrane returned to Toronto, where he drove a taxi cab and later took a job on a Caribbean cruise liner.\n\nRed Rider:\n\nAfter meeting at the El Mocambo Tavern in Toronto, Cochrane joined the Canadian Rock Band Red Rider in 1978 and served as their lead singer and main songwriter for more than ten years. Red Rider included Ken Greer, Jeff Jones, Peter Boynton and Rob Baker. Bruce Allen managed the band from their debut until 1985. Cochrane recorded six studio albums with Red Rider plus a live album, a best of album, and a box set. By 1986, the band was billed as &quot;Tom Cochrane &amp; Red Rider&quot;.\n\nIn 2002, Cochrane reunited with his former Red Rider bandmates Greer and Jones and continues to perform with them today. A complete listing of Red Rider's recordings is included below.\n\nSolo Career:\n\nAlready a household name in Canada from his time with Red Rider, Cochrane launched his solo career in 1991 with the release of the song &quot;Life is a Highway.&quot; The single became a global success and was followed by the release of his Mad Mad World album, which would reach the six million mark in worldwide sales. The albums Ragged Ass Road, Songs of a Circling Spirit, X-Ray Sierra and No Stranger followed. Cochrane's massive body of music and energetic live shows have established him as one of Canada's most treasured artists.\n\nToday:\n\nAn avid golfer, pilot, and hockey buff, Cochrane currently lives in Oakville, Ontario. He spends summers at his cottage/studio on the shores of Georgian Bay in Northern Ontario and winters part-time at his home outside of Austin, Texas. Tom and his wife Kathleene have two daughters, Cody and Evanne. Cochrane continues to tour and perform in Canada where he remains a popular live act. In 2006, the group Rascal Flatts charted in the top 10 of the Hot 100 with a cover of Tom Cochrane's &quot;Life Is a Highway,&quot; which they recorded for the Pixar film Cars. Although &quot;Life Is a Highway&quot; was not released to country radio, several country stations began playing the song, causing it to chart within the top 20 of Hot Country Songs. Chris Ledoux also had a country hit with Life Is A Highway","torrent":{"xt":"urn:btih:1a21c0628af5b573db6bf5b7d8a863aadfe36231","amp;dn":"Tom+Cochrane+-+Take+It+Home+%5B2015%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a21c0628af5b573db6bf5b7d8a863aadfe36231","infoHashBuffer":{"type":"Buffer","data":[26,33,192,98,138,245,181,115,219,107,245,183,216,168,99,170,223,227,98,49]},"announce":[],"urlList":[]}}