{"title":"Overcoming Tracking and Graphics Integration Issues in After Eff","uid":10995472,"size":2023081542,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1a23b45e1d87be7a1497b353da1ce301c4110729&amp;dn=Overcoming+Tracking+and+Graphics+Integration+Issues+in+After+Eff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"NepsterJay","files":160,"time":1410058813,"description":"Digital Tutors - Overcoming Tracking and Graphics Integration Issues in After Effects\n\nIn this series of After Effects tutorials, we are going to learn all of the steps you need to integrate graphic particles into our snowboarding shot. \n\nWhen you are doing a project like this, there are a couple of different workflows that are possible. If you shoot the footage yourself, then you have a lot more control over mapping what you want the particles to do. \n\nThe shot that we begin with however, is not something that we shot ourselves, and so we have to overcome many difficulties to make our particles feel integrated in this scene. We'll learn a few different ways to track using the Mocha tracker which is bundled with After Effects CS6. We also use the tracker inside of After Effects to take care of some of the easier tracks. We use a particle system that comes standard with After Effects to generate some particles, and we learn how to tweak those particles to look like they have the depth of our scene. \n\nThis After Effects tutorial is perfect for you if you want to know how to solve some of the real problems that you run into with a difficult track, and, also, how to use some other tricks to further the integration of graphics into a shot. \n\nBy the end of this tutorial, you'll be able to apply the knowledge you learn, and have a lot more success in your own projects that require a little more hard work to make them shine.","torrent":{"xt":"urn:btih:1a23b45e1d87be7a1497b353da1ce301c4110729","amp;dn":"Overcoming+Tracking+and+Graphics+Integration+Issues+in+After+Eff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a23b45e1d87be7a1497b353da1ce301c4110729","infoHashBuffer":{"type":"Buffer","data":[26,35,180,94,29,135,190,122,20,151,179,83,218,28,227,1,196,17,7,41]},"announce":[],"urlList":[]}}