{"title":"Druscilla's Halloween (Carolrhoda Picture Books)(pdf){Zzzzz}","uid":11336472,"size":26997747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a32be7a155782074a9c6c1aeb28a4963aecf544&amp;dn=Druscilla%27s+Halloween+%28Carolrhoda+Picture+Books%29%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1414748177,"description":"Druscilla's Halloween (Carolrhoda Picture Books)\n\n\nPoor Druscilla. Her sore, ancient knees are so creaky and loud that she can't sneak up on anyone to play witchy tricks on Halloween. She and her faithful cat, Drizzle, try to find a way for her to sneak quietly - riding her donkey, enchanting her wheelbarrow, making wings - yet all fail miserably.\n\nBut when she picks up a broom to sweep up the scattered feathers, she has an idea that just might work!\n\nThis charming Halloween picture book finally solves the mystery of why witches fly on broomsticks.\n\nFrom the Inside Flap\nDid witches always ride brooms?\n\nNo! In fact, long, long ago, witches crept about on tiptoe. On Halloween, they would scare children and cast spells...but always from the ground. No witch ever thought of flying -- no witch until Druscilla.\n\nDruscilla was an old witch with the loudest, creakiest knees anyone had ever heard. But she was determined not to let anything spoil her element of surprise. One Halloween, after many failed attempts at sneaking up on unsuspecting villagers, Druscilla made a discovery that changed the course of witch history.\nAbout the Author\nAbout the Author.\nSally M. Walker is the author of more than 50 nonfiction books for children, including the 2006 Robert F. Sibert Informational Book Medal winner, Secrets of a Civil War Submarine: Solving the Mysteries of the H.L. Hunley. When Sally was a little girl, one of her favorite pastimes was making mysterious potions from twigs, leaves, berries, and other ingredients. To her dismay, none of them made the family's broom fly. Sally lives in DeKalb, Illinois, with her husband and three cats.\n\nAbout the Artist\nLee White's first illustration job was to create a picture for a billboard along Highway 101 in San Jose. He has since learned that he likes illustrating children's books much better! An honors graduate of the Art Center College of Design, he lives in Portland with his wife, Lisa, and their three crazy cats. Druscilla's Halloween is his eighth book. \n\nPublisher: Carolrhoda Books (1 August 2009)\nLanguage: English\nISBN-10: 0822589419\nISBN-13: 978-0822589419","torrent":{"xt":"urn:btih:1a32be7a155782074a9c6c1aeb28a4963aecf544","amp;dn":"Druscilla%27s+Halloween+%28Carolrhoda+Picture+Books%29%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a32be7a155782074a9c6c1aeb28a4963aecf544","infoHashBuffer":{"type":"Buffer","data":[26,50,190,122,21,87,130,7,74,156,108,26,235,40,164,150,58,236,245,68]},"announce":[],"urlList":[]}}