{"title":"Born Series (1-2) by Tara Brown [MU]","uid":8552202,"size":2648099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a7f5a8c9f34cfe949224e4f73b89412a272a3c1&amp;dn=Born+Series+%281-2%29+by+Tara+Brown+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1370670143,"description":"Born Series (1-2) by Tara Brown in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \nCalibre - http://calibre-ebook.com/download \nOnline - http://ebook.online-convert.com \n\nBorn (Born #1) by Tara Brown (September 19th 2012)\n\n&quot;It's us and them, Em. There are no regular people anymore.&quot;\n\n\nTen years ago when the world ended she ran for her life.\n\nFive weeks ago the world she'd hidden from came knocking on the door of her secluded cabin.\n\nTen days ago she found salvation hiding amongst the dead.\n\nYesterday she went back for the living.\n\nToday she wonders if she will live to see tomorrow.\n\nWhat do you do when the world you were born to is gone?\n\nWhere do you hide when even your own body isn't safe?\n\n\nEmma ran when her daddy told her to. She hid like he said she should. He was the first person she turned her back on. The first one she let die.\nTen years has gone by and she still lives by the simple rules he taught her when she was nine years old.\n\n&quot;Don't help anyone. Don't go where other people are unless you have to. Trust no one. Always pull the trigger.&quot;\n\nUntil one night she hears the worst sound in the world, a knock. A simple, timid knock, on the door to her cabin.\nOnly the voice of the brave little girl, ready to die for her brother, persuades Emma to open the door.\nAs her fingers turn the lock, she has a terrible feeling she will regret her decision.\nBut even as regret fills her world, so do love and companionship. Things she never imagined she would ever have again.\n\nEverything comes at a cost, you decide what you'll pay.\n\nBorn to Fight (Born #2) by Tara Brown (April 14th 2013)\n\nWhen Emma wakes strapped to a cold metal table she has only one name on her lips, &quot;Marshall!&quot; What she doesn't expect is discovering that he is only one of the disturbing people in her small world who deserves to die in a fiery death. \n\nTwenty years ago scientists made some remarkable discoveries with genetics and the ability to perfect the babies we gave birth to.\n\nTen years ago the governments of the world made a hard choice, earth or people.\n\nNine weeks ago the choices they made came full circle.\n\nFourteen days ago the truth of their mutations leaked out into the borderlands and other areas.\n\nYesterday the worst thing they ever made learned about what she was.\n\nToday she's coming for them and she knows about the strengths they gave her.\n\nTomorrow she plans on destroying everything.\n\nShe plans on starting with her her own creator. Her own father.\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:1a7f5a8c9f34cfe949224e4f73b89412a272a3c1","amp;dn":"Born+Series+%281-2%29+by+Tara+Brown+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7f5a8c9f34cfe949224e4f73b89412a272a3c1","infoHashBuffer":{"type":"Buffer","data":[26,127,90,140,159,52,207,233,73,34,78,79,115,184,148,18,162,114,163,193]},"announce":[],"urlList":[]}}