{"title":"Muddy Waters ( 1967 ) - Brass and the Blues - CAPTAiN_24","uid":8128778,"size":82730862,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1a95407acc2b4e0834112bfd8b55395d1d3860a7&amp;dn=Muddy+Waters+%28+1967+%29+-+Brass+and+the+Blues+-+CAPTAiN_24&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CAPTAiN_24","files":-1,"time":1360545349,"description":"=====================================================================================\n\n    *** Muddy Waters ( 1967 ) - Brass and the Blues [ mp3@320 ] - CAPTAiN_24 ***\n\n\n                           === Includes ArtWork ===\n\n=====================================================================================\nENJOY.\n\nThis is a strange -- though in large part, successful -- album on a number of counts. Appearing after the release of the singles compilation Real Folk Blues, Brass and the Blues (also sometimes known as Muddy, Brass, and the Blues) was Chess Records' effort to give some fresh momentum to Muddy Waters' current recordings. It was only his third original LP following his tribute album to Big Bill Broonzy and the Folk Singer album -- like them, it was a concept album, but with a difference. Those earlier albums had been built around Waters simply returning to sounds and influences out of his past, but for Brass and the Blues the label tried to give him a new sound, somewhere close to that of B.B. King (who was selling a lot of records at the time). The presence of the brass and the prominent organ on some songs was manageable. Stripped of his guitar once again (the cover photo notwithstanding), Waters proved what a great R&amp;B singer he was -- there are moments on this album where he almost crosses over into Otis Redding territory. Sammy Lawhorn and Pee Wee Madison's guitars come through the dubbed-on brass reasonably well, and this is more of a real &quot;band&quot; sound than was achieved on, say, Electric Mud, an even more extreme attempt at reshaping Waters' sound. The album was reasonably successful, though the reality in terms of Waters's sound and history is that, when this material has been compiled, the producers have often tried to use the undubbed versions without the brass.","torrent":{"xt":"urn:btih:1a95407acc2b4e0834112bfd8b55395d1d3860a7","amp;dn":"Muddy+Waters+%28+1967+%29+-+Brass+and+the+Blues+-+CAPTAiN_24","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a95407acc2b4e0834112bfd8b55395d1d3860a7","infoHashBuffer":{"type":"Buffer","data":[26,149,64,122,204,43,78,8,52,17,43,253,139,85,57,93,29,56,96,167]},"announce":[],"urlList":[]}}