{"title":"The Siege of Vienna: Great Trial Between Cross &amp; Crescent","uid":11825649,"size":5284501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b1e4d438987dcf12acbabcebd9c1ccb14847956&amp;dn=The+Siege+of+Vienna%3A+Great+Trial+Between+Cross+%26amp%3B+Crescent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1429486219,"description":"The Siege of Vienna: The Last Great Trial Between Cross &amp; Crescent 2008 \n\nepub\n\n\n &quot;In his splendid study The Siege of Vienna, the Oxford historian John Stoye provides a detailed account of the intricate machinations between the Habsburgs and the Ottomans. Mr. Stoye's description of the siege itself is masterly. He seems to know every inch of ground, every earthwork and fortification around the Imperial City, and he follows the action meticulously.&quot;--The Wall Street Journal\n\n &quot;Worthy of the pen of Herodotus. . . . It is a measure of the fascination of Mr. Stoye's subject that one should think of comparing his treatment of it with the work of the greatest historians.&quot;--The Times Literary Supplement\n\n &quot;John Stoye is the master of every aspect of his subject.&quot;--Daily Telegraph\n\n The siege of Vienna in 1683 was one of the turning points in European history. So great was its impact that countries normally jealous and hostile sank their differences to throw back the armies of Islam and their savage Tartar allies.\n\n The consequences of defeat were momentous: The Ottomans lost half of their European territories, which led to the final collapse of their empire, and the Habsburgs turned their attention from France and the Rhine frontier to the rich pickings of the Balkans. That hot September day in 1683 witnessed the last great trial of strength between the East and the West-and opened an epoch in European history that lasted until the First World War","torrent":{"xt":"urn:btih:1b1e4d438987dcf12acbabcebd9c1ccb14847956","amp;dn":"The+Siege+of+Vienna%3A+Great+Trial+Between+Cross+%26amp%3B+Crescent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1e4d438987dcf12acbabcebd9c1ccb14847956","infoHashBuffer":{"type":"Buffer","data":[27,30,77,67,137,135,220,241,42,203,171,206,189,156,28,203,20,132,121,86]},"announce":[],"urlList":[]}}