{"title":"From Byzantium to Italy","uid":4183300,"size":44377571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b4042f8da824286d06d18a31eb3043026b13656&amp;dn=From+Byzantium+to+Italy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"oddball71","files":205,"time":1210526574,"description":"From Byzantium to Italy: Greek Studies in the Italian Renaissance\nN. G. Wilson\n\nDuckworth 1992\nISBN  0715624180\n\n\nJPEG scans      \n\n\nWhich famous poet treasured his copy of Homer, but could never learn Greek? What prompted diplomats to circulate a speech by Demosthenes - in Latin translation - when the Turks threatened to invade Europe? Why would enthusiastic Florentines crowd a lecture on the Roman Neoplatonist Plotinus, but underestimate the importance of Plato himself? \n\nHaving all but disappeared from western literacy during the Middle Ages, classical Greek would recover a position of importance - eventually equal to that of classical Latin - only after a series of surprising failures, chance encounters, and false starts. From Byzantium to Italy offers a detailed account of the rediscovery and growing influence of classical Greek scholarship in Italy from the fourteenth to the early sixteenth centuries. \n\nContinuing the story he began in his acclaimed study, Scholars of Byzantium, N.G. Wilson describes how the classical heritage preserved by the Byzantines was transmitted to a vigorous culture, first in fourteenth-century Florence and then throughout Italy. Wilson recounts the early attempts of Petrarch and Boccaccio to master Greek and the efforts of the Byzantine diplomat Chrysoloras to simplify the teaching of the language. He chronicles the work of Bruni and other translators as well as important teachers such as Vittorino, Guarino, Filelfo, and Politian.\n\nHe also follows the spread of Greek studies to cities throughout Italy, including Padua, Bologna, Ferrara, Messina, Rome and Venice. Wilson concludes with the death of Aldus Manutius, the great publisher of Greek texts. \n\nFrom a leading authority on Greek palaeography in the English-speaking world, here is a complete account of the historic rediscovery of Greek philosophy, language, and literature during the Renaissance.\n","torrent":{"xt":"urn:btih:1b4042f8da824286d06d18a31eb3043026b13656","amp;dn":"From+Byzantium+to+Italy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b4042f8da824286d06d18a31eb3043026b13656","infoHashBuffer":{"type":"Buffer","data":[27,64,66,248,218,130,66,134,208,109,24,163,30,179,4,48,38,177,54,86]},"announce":[],"urlList":[]}}