{"title":"Doomsday Book by Connie Willis. Unabridged, Read by Jenny Sterli","uid":6919922,"size":554667027,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c474ed24041d1f313cb9de909a36218655a00b3&amp;dn=Doomsday+Book+by+Connie+Willis.+Unabridged%2C+Read+by+Jenny+Sterli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Oopsje","files":42,"time":1325173725,"description":"Doomsday Book by Connie Willis. Unabridged, Read by Jenny Sterlin.\nSplit into chapters.\nMP3/64Kbps : English\n\nFor Kivrin, preparing an on-site study of one of the deadliest eras in humanity's history was as simple as receiving inoculations against the diseases of the fourteenth century and inventing an alibi for a woman traveling alone. For her instructors in the twenty-first century, it meant painstaking calculations and careful monitoring of the rendezvous location where Kivrin would be received.\n\nBut a crisis strangely linking past and future strands Kivrin in a bygone age as her fellows try desperately to rescue her. In a time of superstition and fear, Kivrin -- barely of age herself -- finds she has become an unlikely angel of hope during one of history's darkest hours.\n\nFive years in the writing by one of science fiction's most honored authors, Doomsday Book is a storytelling triumph. Connie Willis draws upon her understanding of the universalities of human nature to explore the ageless issues of evil, suffering and the indomitable will of the human spirit.","torrent":{"xt":"urn:btih:1c474ed24041d1f313cb9de909a36218655a00b3","amp;dn":"Doomsday+Book+by+Connie+Willis.+Unabridged%2C+Read+by+Jenny+Sterli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c474ed24041d1f313cb9de909a36218655a00b3","infoHashBuffer":{"type":"Buffer","data":[28,71,78,210,64,65,209,243,19,203,157,233,9,163,98,24,101,90,0,179]},"announce":[],"urlList":[]}}