{"title":"Drake &amp; The Weeknd - They Luvin Da Crew","uid":7954451,"size":187997988,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1c74b4143d560bd908fa5a102156c514c8f44472&amp;dn=Drake+%26amp%3B+The+Weeknd+-+They+Luvin+Da+Crew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"larcmusic","files":-1,"time":1356373257,"description":"Both Drake &amp; The Weeknd started off with a huge underground fan base and sold out concerts before they were even signed to a major label. Recently, they collaborated on Drake's sophomore project, Take Care, and created a unique sound that spawned into an instant platinum selling album. Now with the recent release of The Weeknd's Trilogy, Dj BadboySean and Grand Larceny have created a one of a kind OVOXO experience that fans have never heard before. Now you can enjoy an hour plus of exclusive remixes and original production from Drake &amp; The Weeknd. BadboySean and Grand Larceny collaborate these two artists with 24 tracks of continuous smooth music with no gaps or dj shouts.\n\n1.They Luvin da Crew Intro \n2.Drake ft. The Weeknd - Crew Love (BadboySean Rmx) \n3.Drake - Lust for Love (BadboySean Rmx) \n4.Drake ft. The Weeknd - Lonely Loft Music (BadboySean Rmx) \n5.Drake ft. Chris Brown - Rihanna's Room (Grand Larceny Rmx) \n6.The Weeknd - Mercy Me (prod by Grand Larceny \n7.Superhero Interlude (BadboySean Rmx) [listen] download\n8.The Weeknd ft. Drake - Rescue You (BadboySean Rmx) \n9.Tyga ft. Drake - Still got It (BadboySean Rmx) \n10.Drake - Fireworks (BadboySean Rmx) \n11.The Weeknd - Rolling Stone Pt.2 (prod by Grand Larceny) \n12.Drake - Hit it before I'm Gone (BadboySean Rmx) \n13.Drake ft. Big Sean - We Will (Grand Larceny Rmx) \n14.Love and Drugs Interlude (prod by Grand Larceny) \n15.The Weeknd ft. Jay-Z - Gone on that Party Life (Grand Larceny Rmx) \n16.Drake ft. R.Kelly - Who you Laying With (Grand Larcey Rmx) \n17.The Weeknd - Girl put in Work (prod by Grand Larceny) \n18.The Weeknd ft. Melanie Fiona - Make you Fall in Love (Grand Larceny Rmx) \n19.Drake ft. The Weeknd - Its Goin Down (Grand Larceny Rmx) \n20.The Weeknd ft. Drake - Watchin da Zone (BadboySean Rmx) \n21.Drake ft. Aaliyah - Shot for Baby Girl (BadboySean Rmx) \n22.The Weeknd ft. Drake - Summertime (Grand Larceny Rmx) \n23.Drake - Backseat Freestyle (BadboySean Rmx) \n24.Drake ft. Lil Wayne - Yung Money Throne (BadboySean Rmx)","torrent":{"xt":"urn:btih:1c74b4143d560bd908fa5a102156c514c8f44472","amp;dn":"Drake+%26amp%3B+The+Weeknd+-+They+Luvin+Da+Crew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c74b4143d560bd908fa5a102156c514c8f44472","infoHashBuffer":{"type":"Buffer","data":[28,116,180,20,61,86,11,217,8,250,90,16,33,86,197,20,200,244,68,114]},"announce":[],"urlList":[]}}