{"title":"Gene Scott - Lectures Removed From His Website Immediately After","uid":3839244,"size":673147933,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1c87c00187bc38421bcec43d7ed1a40ac52945cb&amp;dn=Gene+Scott+-+Lectures+Removed+From+His+Website+Immediately+After&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aaronhahn777","files":84,"time":1192200198,"description":"Before Gene Scott died, many of his lectures were freely available at \nhis website DrGeneScott.com.  Immediately after his death, however,\nhis wife Melissa took over all the operations of the church and removed all\nrecordings of Gene Scott's lectures from public availability.    Not only the \nfree online lectures were removed, but Melissa also ordered all of the thousands\nof cassette tape recordings of Dr. Scott's teachings to be permanently removed\nfrom circulation so that no one would ever hear them again.\n\nGene Scott himself warned that once he died, those who took over the church\nwould destroy his entire life work.  This was because his teachings frequently went\ninto territory far beyond what one would normally expect from an ostensibly &quot;Christian&quot;\npreacher.  Indeed, he spent much time educating his listeners on subjects which were highly\npolitically sensitive even to this day, and he knew that only he himself could guarantee the\ncontinued availability of his teachings.\n\nHis prophecy has unfortunately been fulfilled.\n\nNow if you go to his church, all you will see will be his wife Melissa prancing around\non stage in front of a huge American flag which spans the entire back wall.  That is, if \nyou can get in the door at all.   The church is guarded by a virtual army of private\nsecurity goons masquerading as &quot;ushers,&quot; wearing three-piece suits and ear-phone\ncommunication systems.   This has all the earmarkings of a government-sponsored cult \noperation, working as expected to mind-control its followers and destroy the truth.  \n\nFortunately, before Dr. Scott's free lectures were removed from the website, someone able\nto see the handwriting on the wall was able to download and save many of them.  The original\nRealAudio files have been converted to MP3 for maximum portability and convenience to the listener.\nThis collection contains almost all the lectures which were on the website from the categories\nof:\n\nAtlantis (14 lectures),\nDemonology (23 lectures),\nGreat Pyramid (10 lectures),\n&quot;More Mysteries&quot; (19 lectures),\nThe Stars, (10 lectures), and\nUFOs (7 lectures),\n\nfor a total of 95 lectures in this collection.\n\nThere were a few lectures on the website, however, that did not download correctly and\nso are not preserved here.   Also note that there are -- or at least WERE -- many many\nmore talks by Dr. Scott on these subjects available in huge albums of 12 cassette tapes each.\nThese, as noted above, are no longer available from the church and now command exorbitant prices\nwhen they are offered for sale used on eBay.   Hopefully, we will be able to make much of that\ninformation freely available on the internet as well.  \n\nMelissa Scott is ABUSING her ownership of the copyright to this material as a means to\nDESTROY AND ERASE the life work of Dr. Gene Scott from the face of the Earth.  We feel that\nDr. Scott did not produce his lifetime of work simply so that his former porn-producer wife\nMelissa aka &quot;Barbie Bridges&quot; could shut it all down the moment he passed on, in order to appease her\nhandlers.  Dr. Scott's work rightfully belongs to the world now, and so we are making it\navailable to everyone free of charge.  \n\n","torrent":{"xt":"urn:btih:1c87c00187bc38421bcec43d7ed1a40ac52945cb","amp;dn":"Gene+Scott+-+Lectures+Removed+From+His+Website+Immediately+After","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c87c00187bc38421bcec43d7ed1a40ac52945cb","infoHashBuffer":{"type":"Buffer","data":[28,135,192,1,135,188,56,66,27,206,196,61,126,209,164,10,197,41,69,203]},"announce":[],"urlList":[]}}