{"title":"Bizarre Magazine UK September 2012 Uncensored","uid":7491087,"size":75347589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cbdb531ace103c958a1070a16dbdbb4d027a257&amp;dn=Bizarre+Magazine+UK+September+2012+Uncensored&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"azizex666","files":-1,"time":1343745993,"description":"Bizarre is a self-described &quot;alternative&quot; and &quot;non-mainstream&quot; magazine. It is a sister publication to Fortean Times. It has no connection to the fetish publication also known as &quot;Bizarre&quot; published between 1946-1959. The magazine has a wide variety of features and articles which include unusual news events from around the world, drug usage, different types of fetishistic and deviant behavior, interviews with famous counterculture figures and showcases of cult directors, musicians and authors. Bizarre has also covered legislation regarding sex offences and civil liberties, along with issues like censorship and human rights abuses, both domestically and abroad. It has also started a campaign to raise awareness of prejudice towards subcultures following the murder of Sophie Lancaster. From the start the publication had much in common with more mainstream lad's mags, typically featuring a semi-nude model on the front cover, nude photography in special sealed 'x rated' sections inside, and frequent reviews of weird gadgets, films, music, and websites. They regularly cover art, gay culture, the avant-garde and the Cinema of Transgression in their art and music reviews.\n\n\n                      English | HQ PDF |124 Pages | 72 MB\n\n\nBe Sure to check out My other Uploads for The Latest and Greatest Magazines of All Kind!","torrent":{"xt":"urn:btih:1cbdb531ace103c958a1070a16dbdbb4d027a257","amp;dn":"Bizarre+Magazine+UK+September+2012+Uncensored","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cbdb531ace103c958a1070a16dbdbb4d027a257","infoHashBuffer":{"type":"Buffer","data":[28,189,181,49,172,225,3,201,88,161,7,10,22,219,219,180,208,39,162,87]},"announce":[],"urlList":[]}}