{"title":"History of Continental Philosophy (8 vols., 2010)","uid":8473351,"size":12777511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cf0a471d2b8f33c852a4c4fe41c1a1877816f40&amp;dn=History+of+Continental+Philosophy+%288+vols.%2C+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1368546364,"description":"Alan D. Schrift, general editor - The History of Continental Philosophy, 8 vols. (University of Chicago Press, 2010).\n\nISBN: 9780226740492 | 3,040 pages | PDF\n\n\nFrom Kant to Kierkegaard, from Hegel to Heidegger, continental philosophers have indelibly shaped the trajectory of Western thought since the eighteenth century. Although much has been written about these monumental thinkers, students and scholars lack a definitive guide to the entire scope of the continental tradition. The most comprehensive reference work to date, this eight-volume &quot;History of Continental Philosophy&quot; both encapsulates the subject and reorients our understanding of it. \n\nBeginning with an overview of Kant's philosophy and its initial reception, the History traces the evolution of continental philosophy through major figures as well as movements such as existentialism, phenomenology, hermeneutics, and poststructuralism. The final volume outlines the current state of the field, bringing the work of both historical and modern thinkers to bear on such contemporary topics as feminism, globalization, and the environment. Throughout, the volumes examine important philosophical figures and developments in their historical, political, and cultural contexts.\n\nThe first reference of its kind, &quot;The History of Continental Philosophy&quot; has been written and edited by internationally recognized experts with a commitment to explaining complex thinkers, texts, and movements in rigorous yet jargon-free essays suitable for both undergraduates and seasoned specialists. These volumes also elucidate ongoing debates about the nature of continental and analytic philosophy, surveying the distinctive, sometimes overlapping characteristics and approaches of each tradition. Featuring helpful overviews of major topics and plotting road maps to their underlying contexts, A History of Continental Philosophy is destined to be the resource of first and last resort for students and scholars alike.\n\nThis PDF incorporates the following 8 volumes:\n\n* Volume 1: Kant, Kantianism, and Idealism: The Origins of Continental Philosophy (edited by Thomas NenonÂ )\n\n* Volume 2: Nineteenth-Century Philosophy: Revolutionary Responses to the Existing Order (edited by Alan D. Schrift and Daniel Conway)\n\n* Volume 3: The New Century: Bergsonism, Phenomenology and Responses to Modern Science (edited by Keith Ansell-Pearson and Alan D. Schrift)\n\n* Volume 4: Phenomenology: Responses and Developments (edited by Leonard Lawlor)\n\n* Volume 5: Critical Theory to Structuralism: Philosophy, Politics and the Human Sciences (edited by David Ingram)\n\n* Volume 6: Poststructuralism and Critical Theory's Second Generation (edited by Alan D. Schrift)\n\n* Volume 7: After Poststructuralism: Transitions and Transformations (edited by Rosi Braidotti)\n\n* Volume 8: Emerging Trends in Continental Philosophy (edited by Todd May)\n\n\nReviews\n\n&quot;A superb and absolutely unique project that will be an invaluable resource for students and teachers of continental philosophy. The academic rigor and quality of the work is truly exemplary and is unlike anything currently on the market. I cannot imagine a more competent group of editors and authors or a more thoughtful presentation of the material. This landmark series provides the first comprehensive history of continental philosophy in the English language -- probably the first in any language. Every library will want to own a copy and every scholar of continental philosophy will have occasion to turn to it often.&quot; -- Michael Naas, DePaul University\n\n&quot;While Gilles Deleuze complained that 'the history of philosophy plays a patently repressive role' in philosophical education, this outstanding eight-volume work will have the opposite effect on readers. It opens up new vistas and possibilities by bringing canonical figures (Kant, Hegel, Nietzsche, Heidegger, Sartre, Derrida), the necessary supporting cast (Herder, Schelling, Kierkegaard, Peirce), and marginal voices (Freud, Dostoevsky, utopian socialists, black existentialists) often given short shrift in less comprehensive histories into sharp focus. It traces a motley heritage -- from Kant and Hegel through phenomenology, existentialism, critical theory, structuralism, and poststructuralism -- noting resonances, convergences, and trends along the way. The volumes follow a chronological progression, as one would expect, with each volume collecting a well-thought-out sequence of essays by highly regarded international and American scholars. . . The writing is usually clear, succinct, and accurate, and all contributors do a commendable job of summarizing their primary subject matter and placing it in the context of current scholarship while avoiding being overly technical. . . Essential.&quot; -- Choice\n","torrent":{"xt":"urn:btih:1cf0a471d2b8f33c852a4c4fe41c1a1877816f40","amp;dn":"History+of+Continental+Philosophy+%288+vols.%2C+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf0a471d2b8f33c852a4c4fe41c1a1877816f40","infoHashBuffer":{"type":"Buffer","data":[28,240,164,113,210,184,243,60,133,42,76,79,228,28,26,24,119,129,111,64]},"announce":[],"urlList":[]}}