{"title":"Dusty Fingers - vol 01 a 15.rar","uid":4053013,"size":905349368,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d39eb4a62494b9a07198f46d7570bd7a08d7ceb&amp;dn=Dusty+Fingers+-+vol+01+a+15.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"korogho","files":1,"time":1204239027,"description":"Dusty Fingers is the name of a series of compilation records of songs that are widely admired as breakbeats. Some of the songs featured contain &quot;open breaks&quot; which are solo drum passages which enable DJs to easily transition into them, as well as attractive to producers who loop or rearrange them to create new compositions. Following in the tradition of the &quot;Ultimate Breaks and Beats&quot; series, the Dusty Fingers records contain an eclectic range of musical styles: mainly funk and jazz, but also including soul, rock, disco, and pop. Most are obscure tracks treasured by music conoisseurs and DJs, including several from European recordings. The common, but hard to define thread in all of these songs is that they are &quot;funky&quot;. The Dusty Fingers selection is even more obscure than that of &quot;Ultimate Breaks and Beats&quot; or Strictly Breaks. Many of the songs in the Dusty Fingers series have been sampled into new musical compositions, mainly by hip hop producers. Popular songs sampling &quot;Dusty Fingers&quot; compositions include &quot;Guilty Conscience&quot; by Eminem, &quot;Find Your Wealth&quot; by Nas and &quot;Rowdy, Rowdy&quot; by 50 Cent.","torrent":{"xt":"urn:btih:1d39eb4a62494b9a07198f46d7570bd7a08d7ceb","amp;dn":"Dusty+Fingers+-+vol+01+a+15.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d39eb4a62494b9a07198f46d7570bd7a08d7ceb","infoHashBuffer":{"type":"Buffer","data":[29,57,235,74,98,73,75,154,7,25,143,70,215,87,11,215,160,141,124,235]},"announce":[],"urlList":[]}}