{"title":"Zero Six Bravo: 60 Special Forces. 100,000 Enemy. The Explosive ","uid":9901569,"size":5441574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d3ded4f44b7b3418814d54250e152799dd3ccc0&amp;dn=Zero+Six+Bravo%3A+60+Special+Forces.+100%2C000+Enemy.+The+Explosive+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1396777309,"description":"Zero Six Bravo: 60 Special Forces. 100,000 Enemy. The Explosive True Story\nby Damien Lewis\n\nDESCRIPTION:\n\nSunday Times No.1 bestseller. They were branded as cowards and accused of being the British Special Forces Squadron that ran away from the Iraqis. But nothing could be further from the truth. Ten years on, the story of these sixty men can finally be told. In March 2003 M Squadron - an SBS unit with SAS embeds - was sent 1,000 kilometres behind enemy lines on a true mission impossible, to take the surrender of the 100,000-strong Iraqi Army 5th Corps. From the very start their tasking earned the nickname 'Operation No Return'. Caught in a ferocious ambush by thousands of die-hard fanatics from Saddam Hussein's Fedayeen, plus the awesome firepower of the 5th Corps' heavy armour, and with eight of their vehicles bogged in Iraqi swamps, M Squadron launched a desperate bid to escape, inflicting massive damage on their enemies. Running low on fuel and ammunition, outnumbered, outmanoeuvred and outgunned, the elite operators destroyed sensitive kit and prepared for death or capture as the Iraqis closed their deadly trap. Zero Six Bravo recounts in vivid and compelling detail the most desperate battle fought by British and allied Special Forces trapped behind enemy lines since World War Two. It is a classic account of elite soldiering that ranks with Bravo Two Zero and the very greatest Special Forces missions of our time.","torrent":{"xt":"urn:btih:1d3ded4f44b7b3418814d54250e152799dd3ccc0","amp;dn":"Zero+Six+Bravo%3A+60+Special+Forces.+100%2C000+Enemy.+The+Explosive+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d3ded4f44b7b3418814d54250e152799dd3ccc0","infoHashBuffer":{"type":"Buffer","data":[29,61,237,79,68,183,179,65,136,20,213,66,80,225,82,121,157,211,204,192]},"announce":[],"urlList":[]}}