{"title":"SharePoint 2010 Enterprise Applications on Windows Phone 7","uid":6495496,"size":7258479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d4ce5bcba19d219f2aad0fc7a3267a223049b91&amp;dn=SharePoint+2010+Enterprise+Applications+on+Windows+Phone+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheBookie","files":-1,"time":1309048488,"description":"Microsoft SharePoint 2010 Enterprise Applications on Windows Phone 7\n\n\nMicrosoft SharePoint 2010 Enterprise Applications on Windows Phone 7 /By Todd Spatafore. icrosoft Windows Phone 7 is a reinvention of the Windows Mobile platform and improves productivity by taking a fresh approach to the most common Smartphone business usage scenarios such as e-mail, calendar, contacts, and collaboration.\nMicrosoft SharePoint is a Web technology-based server that can be used to build portals, collaboration sites, and also content management sites.\nMicrosoft Windows Phone 7 allows you to integrate with Microsoft SharePoint 2010 and create enterprise-ready websites and applications that access SharePoint Server on Windows Phone 7.\nThe book starts by providing an overview of the out-of-the-box features of Windows Phone 7 for enterprises then moves on to an overview of the web browser that is included on the phone, Internet Explorer Mobile, covering the improvements found over the desktop version of Internet Explorer 7 and the limitations of the browser. The book then dives deep into topics such as Windows Phone 7 Web Development, building SharePoint Sites for Windows Phone 7, building SharePoint Pages for Windows Phone 7, and SharePoint Communities amongst others.\n","torrent":{"xt":"urn:btih:1d4ce5bcba19d219f2aad0fc7a3267a223049b91","amp;dn":"SharePoint+2010+Enterprise+Applications+on+Windows+Phone+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d4ce5bcba19d219f2aad0fc7a3267a223049b91","infoHashBuffer":{"type":"Buffer","data":[29,76,229,188,186,25,210,25,242,170,208,252,122,50,103,162,35,4,155,145]},"announce":[],"urlList":[]}}