{"title":"(PSX-PSP) Grand Theft Auto &amp; Mission Pack #1-London 1969 convert","uid":4957974,"size":1238038526,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:1d5fdd3623d93fd243f07a0cc4f59586b050d7cc&amp;dn=%28PSX-PSP%29+Grand+Theft+Auto+%26+Mission+Pack+%231-London+1969+convert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"toxicjuggalo","files":3,"time":1245190145,"description":"If anyone remembers you use to have to put the GTA 1 disc in before you could start the London 1969 one.. NOT ANYMORE JUST START THE LONDON UP AND PLAY LIKE A NORMAL GAME :)\n\n\nGRAND THEFT AUTO:\n\nTry to become a crime lord in GRAND THEFT AUTO. You start out as small time hood, where all you have to do is answer your beeper and complete the tasks that the boss assigns to you. Tasks include delivering stolen cars, dropping off drug money, or completing contract hits. Every mission requires stealing cars, but every car in the game handles differently, so pilfering the right car is important. If a mission calls for you to break roadblocks, a lightweight sports car is not a good idea; you'll want to steal a bus or a truck. Stealing the right car for the situation should not be too difficult, since every car in the game can be stolen including police cruisers. Will you be able to climb the ranks of the underworld, or will you be underwater with cement shoes? Try to stay alive in GRAND THEFT AUTO.\n\nGTA Mission pack #1 - London 1969:\n\n\nWhile expansion packs have been common on the PC, there has never been adequate technology for expansion disks on a console. GRAND THEFT AUTO: London 1969 changes that, as it's the first expansion pack to hit a console (you must own the original GRAND THEFT AUTO to play London 1969). As an expansion for the popular GRAND THEFT AUTO, London 1969 places you as a small time hood in swinging London. You must complete simple tasks as you move through the various levels of the British underworld. However, most of the tasks require pilfering automobiles. Keep in mind that you are in London, so the driver enters and exits on the right, and you'll want to stay on the left side of the road to avoid the coppers. All of the music and voices of the original game have been replaced with British rock and slang from the era to further thrust the player into 1969 London. Anyone who enjoyed the original GRAND THEFT AUTO should rush out and buy London 1969.\n\n\nBoth games Tested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn ","torrent":{"xt":"urn:btih:1d5fdd3623d93fd243f07a0cc4f59586b050d7cc","amp;dn":"%28PSX-PSP%29+Grand+Theft+Auto+%26+Mission+Pack+%231-London+1969+convert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d5fdd3623d93fd243f07a0cc4f59586b050d7cc","infoHashBuffer":{"type":"Buffer","data":[29,95,221,54,35,217,63,210,67,240,122,12,196,245,149,134,176,80,215,204]},"announce":[],"urlList":[]}}