{"title":"Scapa Flow: The Defences of Britain's Great Fleet Anchorage 1914","uid":11851241,"size":34838038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1dc37c1e519faefe45fc0b0e3f5bf13d3d364f7c&amp;dn=Scapa+Flow%3A+The+Defences+of+Britain%27s+Great+Fleet+Anchorage+1914&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1430100459,"description":"A strategically important natural harbor in the Orkney Islands, Scapa Flow served as Britain's main fleet anchorage during World Wars I and II. It held Jellicoe's Grand Fleet from 1914-18, and it was from here that it sailed out to do battle with the Germans at Jutland in 1916. In 1914 the British began building a comprehensive defensive network by fortifying the entrances to Scapa Flow and then extending these defenses to cover most of Orkney. These static defenses were augmented with boom nets, naval patrols and minefields, creating the largest fortified naval base in the world.\n\nWith the outbreak of the Second World War, Scapa Flow again proved ideally situated to counter the German naval threat and served as the base for Britain's Home Fleet. Despite constant attacks from aircraft and U-boats, one of which managed to sink the British battleship Royal Oak, the defenses of Scapa Flow were again augmented and improved. By 1940, Orkney had become an island fortress, the largest integrated defensive network of its kind in Europe, manned by as many as 50,000 Commonwealth troops.\n\nBacked by newly commissioned artwork, naval historian Angus Konstam tells the story of this mighty naval fortress, many pieces of which can still be seen on the island today","torrent":{"xt":"urn:btih:1dc37c1e519faefe45fc0b0e3f5bf13d3d364f7c","amp;dn":"Scapa+Flow%3A+The+Defences+of+Britain%27s+Great+Fleet+Anchorage+1914","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc37c1e519faefe45fc0b0e3f5bf13d3d364f7c","infoHashBuffer":{"type":"Buffer","data":[29,195,124,30,81,159,174,254,69,252,11,14,63,91,241,61,61,54,79,124]},"announce":[],"urlList":[]}}