{"title":"iTunes Library Toolkit v1.1.0.1 with KeyGen -BeAN [TDM]","uid":10316568,"size":1343661,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1f0b020be5c5437a2c1544968b8c310732c13072&amp;dn=iTunes+Library+Toolkit+v1.1.0.1+with+KeyGen+-BeAN+%5BTDM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Tom_Da_Man","files":3,"time":1402250531,"description":"iTunes Library Toolkit (for Windows) has been developed by the makers of iTunes Folder Watch, a well established and proven iTunes utility. The iTunes Library Toolkit will greatly simplify the ongoing maintenance of your iTunes library. The following functions are part of the toolkit:\n\nNew Media - detects new media under watched folders and adds them to iTunes.\nDead Links - removes references to media files which no longer exist from your iTunes library.\nUpdate Attributes - detects modified attributes in the media files and updates the iTunes track attributes to match.\nCustom Browse - allows you to generate iTunes playlists in a folder structure based on media attributes (tags), or based on the source folder/file structure. This provides a new customisable way to browse your media library hierarchically.\nGenerate Catalog - allows you to generate a web-ready HTML catalog for your music library with embedded youtube-instant links (example using vanilla theme) - it is fast and responsive even for large collections.\nAutomate! - allows you to run any or all of the above functions as automatic background tasks.\nThe Automate function leverages the power of the core functions. Once you have configured the settings for the core functions to your preference, the Library Toolkit can be left running in the background, monitoring your system and performing the library organisational tasks completely automatically as it needs to.\n\nThis means that you can add new media files to your chosen media folder structure and they will be added to iTunes automatically (and optionally organised into configurable playlists). Delete media files and they will be removed from the library. You can even move your media files around, rename them, or their folders, and the Library Toolkit can synchronise these changes automatically with the iTunes database (retaining dynamic user-based information like Rating, Playcount, etc).\n\nInstall using setup.\nUse KeyGen to generate license.\nHold down ALT and CTRL key when clicking OK to activate license!!","torrent":{"xt":"urn:btih:1f0b020be5c5437a2c1544968b8c310732c13072","amp;dn":"iTunes+Library+Toolkit+v1.1.0.1+with+KeyGen+-BeAN+%5BTDM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f0b020be5c5437a2c1544968b8c310732c13072","infoHashBuffer":{"type":"Buffer","data":[31,11,2,11,229,197,67,122,44,21,68,150,139,140,49,7,50,193,48,114]},"announce":[],"urlList":[]}}