{"title":"Letters to Cristina - Paulo Freire - Reflections on My Life and","uid":11602161,"size":45481937,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f34209875345b005a6d92ed60b0cd44588fb3a2&amp;dn=Letters+to+Cristina+-+Paulo+Freire+-+Reflections+on+My+Life+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Inua1","files":1,"time":1417366897,"description":"Title: Letters to Cristina: Reflection on My Life and Work \nAuthor: Paulo Freire\nPaperback: 272 pages\nPublisher: Routledge; 1 edition (July 4, 1996)\nLanguage: English\nISBN-10: 0415910978\nISBN-13: 978-0415910972\n\nDescription:\nAuthor of the seminal Pedagogy of the Oppressed, Freire further defines his philosophy of education and politics in 18 letters to his niece, Cristina. With Pedagogy now in a newly revised 20th anniversary edition, Freire looks back from his home in Brazil upon a life interrupted by 20 years of exile after the coup d'etat in 1964. He still insists on the right of the poor and illiterate to an education that will enable them &quot;to be&quot;?to become everything it is within their potential to be. Not a formally organized book, nor a series of essays, Letters to Cristina is necessarily discursive and sometimes repetitive as Freire stresses the themes that comprise his life's work. As relevant for Americans as it is for Brazilians, Freire's new work attacks a continuing pedagogy that would have students merely rely on memorization of facts instead of developing the critical-thinking skills necessary for becoming fully invested citizens, thus turning them into workers who will support the dominant affluent class. As a school administrator, Freire built a school community culture in which students, parents, teachers, administrators, custodians and other workers formed a close-knit family?one in which it is hard to imagine any role for &quot;privatization&quot; experts. Parents in developed nations may check the methodologies in their own schools to ascertain that students are as actively involved as Freire's student/teacher in their own learning. Although Freire's pedagogical terminology can sometimes be daunting, Letters to Cristina is an important read for educators and parents.\nCopyright 1996 Reed Business Information, Inc. \n\n\nSummary:\nPaulo Freire is regarded by many as the most significant educational thinker of the twentieth century. This volume offers Freire's own intimate retrospection of his life and work. These reflections, dedicated to his niece Cristina, provide a backdrop for a deeper understanding of how his experiences are linked to his philosophical and pedagogical work","torrent":{"xt":"urn:btih:1f34209875345b005a6d92ed60b0cd44588fb3a2","amp;dn":"Letters+to+Cristina+-+Paulo+Freire+-+Reflections+on+My+Life+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f34209875345b005a6d92ed60b0cd44588fb3a2","infoHashBuffer":{"type":"Buffer","data":[31,52,32,152,117,52,91,0,90,109,146,237,96,176,205,68,88,143,179,162]},"announce":[],"urlList":[]}}