{"title":"Men From The Ministry","uid":8866564,"size":2666196684,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1f972d72cd35f346d4647ada34fb0bab84abd74c&amp;dn=Men+From+The+Ministry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Pigman58","files":147,"time":1377928065,"description":"Men From the Ministry was a BBC radio comedy series broadcast in 13 series from 1962 to 1977. A 14th series was broadcast on the BBC World Service in 1980 and only broadcast in the UK in 2011. The BBC wiped all recordings until the later series, thus some series are incomplete; this collection has been assembled with help from other collectors and is as comprehensive as it is believed possible. The quality is mixed, but all should be at least &quot;listenable&quot; and others are very good.\n\nThe programme concerns two bungling civil servants in the &quot;General Assistance Department&quot; an imaginary arm of the UK civil service tasked with helping out other departments. Inevitably, things always go wrong, partly through others not questioning what the two lead characters tell them, the whole process repeated again in the next episode. All very silly, but most amusing.\n\nThe characters of number 1 and Sir Gregory were replaced from Series 3 onwards and in my view, the series went up several gears after the change of personnel.\n\nSuch was the success of the series that local versions were broadcast in South Africa (over 900 episodes I believe) and in Finland. These though, arte the originals!","torrent":{"xt":"urn:btih:1f972d72cd35f346d4647ada34fb0bab84abd74c","amp;dn":"Men+From+The+Ministry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f972d72cd35f346d4647ada34fb0bab84abd74c","infoHashBuffer":{"type":"Buffer","data":[31,151,45,114,205,53,243,70,212,100,122,218,52,251,11,171,132,171,215,76]},"announce":[],"urlList":[]}}