{"title":"Indeed Smart PopUp for WordPress","uid":10365953,"size":7780909,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:201a0ae9f11d81065b34d6c563ddc3c2ab8b2bd2&amp;dn=Indeed+Smart+PopUp+for+WordPress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nulledGOD","files":-1,"time":1402876415,"description":"Indeed Smart Pop-Up for WordPress is a great plugin that will allow you to create unlimited pop-ups with a friendly user interface. You will then be able to use the shortcode or PHP code in your content items (posts, pages) or templates.\n\nWith over 40 options grouped in 7 sections this plugin will allow you to create fully customized pop-ups.\n\nYou can set each element in absolute values (number of pixels) or relative values (% based on relevant element).\n\nThe idea behind this plugin was to create a really useful tool for people that have a real interest in their audience and one of the most important feature of this plugin is the ability to filter though the visitors and only be displayed to the targeted audience. For example you can select to display the pop-up only to unregistered users, or only to first time visitors. You can imagine that making such decisions requires some kind of information about the visit and the visitor to be stored, so you even have this information available in the admin section.\n\nIf you want to be super aggressive with your pop-ups you can hide the close button and disable the escape key and mouse click outside of the pop-up and make the visitor watch the message for the duration you set.\n\nProduct page: http://codecanyon.net/item/indeed-smart-popup-for-wordpress/6634330\n\nProduct video:\n\nThis plugin has been fully nulled, to install simply upload it to your host like you would any other wordpress plugin. \n","torrent":{"xt":"urn:btih:201a0ae9f11d81065b34d6c563ddc3c2ab8b2bd2","amp;dn":"Indeed+Smart+PopUp+for+WordPress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201a0ae9f11d81065b34d6c563ddc3c2ab8b2bd2","infoHashBuffer":{"type":"Buffer","data":[32,26,10,233,241,29,129,6,91,52,214,197,99,221,195,194,171,139,43,210]},"announce":[],"urlList":[]}}