{"title":"It's Pat Saturday Night Live Remake","uid":6066679,"size":718087016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2039a620837487dbdf25e8f2e8757e05117d1db7&amp;dn=It%5C%27s+Pat+Saturday+Night+Live+Remake&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"The_Iron_E","files":1,"time":1293393253,"description":"It's Pat, also known as It's Pat: The Movie, is a 1994 American comedy film directed by Adam Bernstein that stars Julia Sweeney, Dave Foley, Charles Rocket, and Kathy Griffin. The film was based on the Saturday Night Live (SNL) character Pat created by Sweeney, an androgynous misfit whose gender is never revealed.\n\nDave Foley plays Pat's partner, Chris, and Charles Rocket, another SNL alumnus, plays Pat's neighbor, Kyle Jacobsen.\n\n\n\nPlot:\n\nPat Riley, of indeterminable gender, is an obnoxious job-hopper who is searching for a steady foundation in his/her life. Throughout the film, Pat encounters Chris, a person of similarly indeterminable sex, and falls in love. As Chris and Pat begin to develop stronger feelings for one another, Pat's numerous career failures begin to affect how Chris views their relationship. They break up, leaving Pat sulking alone at home.\n\nMeanwhile, Pat's neighbor, Kyle Jacobsen, develops an obsession with unveiling Pat's gender. Wacky adventures ensue, ultimately leading Pat and Kyle to a Ween concert in which Pat's sex is revealed to the concert audience (though not to the film's viewers nor to Kyle).","torrent":{"xt":"urn:btih:2039a620837487dbdf25e8f2e8757e05117d1db7","amp;dn":"It%5C%27s+Pat+Saturday+Night+Live+Remake","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2039a620837487dbdf25e8f2e8757e05117d1db7","infoHashBuffer":{"type":"Buffer","data":[32,57,166,32,131,116,135,219,223,37,232,242,232,117,126,5,17,125,29,183]},"announce":[],"urlList":[]}}