{"title":"Greensleeves: A Collection of English Lute Songs","uid":4900586,"size":295265348,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:21687d88dc685f0f772dd74265e171b2dc106595&amp;dn=Greensleeves%3A+A+Collection+of+English+Lute+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eddie1969","files":26,"time":1242592936,"description":"Music : Classical : Lossless\n\n\n\nGreensleeves: A Collection of English Lute Songs\n\nThe lute is a string instrument with a fretted neck and a deep, round back. In many ways, it is related to later similar instructments such as the guitar and banjo. It descends from a Middle Eastern instrument similar to the oud. The lute was one of the major musical instruments of the Middle Ages, and much music was composed for the lute, both as a stand-alone instrument as well as an accompaniment for singers. \n\nThis disc has some samples of both. Some songs are anonymous compositions, often derivative of much older folk tunes. Others are original compositions whose composers are known by name. Among these names are John Dowland, Thomas Morley, Alfonso Ferrabosco, Michael Cavendish, Thomas Campion, Nicholas Lanier, and Anthony Holborne, all of the 1500s/1600s. The music here involves both the 8-course lute and the 10-course lute (during the later Baroque time, lutes could have as many as 28 strings!). \n\nThe lute was eventually displaced by keyboard and other instruments, so in many ways its life is that of the music of the past. However, with recordings such as these, the lute lives again in vibrant form. Ronn McFarlane learned to play on a cheap steel-string guitar, but continued to study in a rather eclectic fashion, eventually studying at the Shenandoah Conservatory and the Peabody Conservatory prior to settling upon the lute as his primary instrument. In this recording, he is paired with Julianne Baird, a soprano with significant recording experience. \n\nMcFarlane and Baird emphasise the simplicity and lightness of the songs here; while some lute music and some folk tunes can be very elaborately arranged, here the performers strive for a more direct elegance. The particular period emphasised is Elizabethean; McFarlane and Baird sound as if they have come directly from the Queen's court directly. \n\nThis is a beautiful recording. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:21687d88dc685f0f772dd74265e171b2dc106595","amp;dn":"Greensleeves%3A+A+Collection+of+English+Lute+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21687d88dc685f0f772dd74265e171b2dc106595","infoHashBuffer":{"type":"Buffer","data":[33,104,125,136,220,104,95,15,119,45,215,66,101,225,113,178,220,16,101,149]},"announce":[],"urlList":[]}}