{"title":"Stossel.2014.04.17.[A Practical Earth Day].FBN.CF.avi","uid":9994506,"size":343542376,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:220378055b588e51bf8c8a744b4e1fd2306a53cf&amp;dn=Stossel.2014.04.17.%5BA+Practical+Earth+Day%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1397900619,"description":"----------\n\nSTOSSEL - [A Practical Earth Day] - Fox Business Network\n2014, April 17, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nEARTH DAY MYTHS: Our president says &quot;we can break our dependence on oil with biofuels and become the first country to have a million electric vehicles on the road by 2015.&quot; Nonsense. James Taylor of the Heartland Institute debates Paul Gallay of Riverkeeper.\n\nEARTH DAY REALITY CHECK: Environmentalist Bjorn Lomborg says global warming is a &quot;real problem.&quot; But the world has much bigger problems. We need to get our priorities straight.\n\nFARMER VS. THE ARMY CORPS OF ENGINEERS: Government got &quot;clean water&quot; right; rivers and lakes are cleaner than they used to be. But they always go too far. Farmer John Duarte joins lawyer Tony Francois of the Pacific Legal Foundation to talk about how &quot;clean water&quot; bureaucrats act like tyrants.\n\nNUCLEAR ENERGY: Greenpeace co-founder Patrick Moore used to fight nuclear energy. But now he says &quot;nuclear energy is the most important energy source for the continuation of civilization.&quot; I argue: if it's so great, why do we need to give it loan guarantees?\n\nHUMAN RACISM: Alex Epstein of Center for Industrial Progress celebrates Earth Day this year by fighting what he calls &quot;Human Racism.&quot; Epstein says global warming alarmists target all human beings.\n\nSTOSSEL'S TAKE: This Earth Day, instead of attacking those who sell fossil fuels, I applaud them for overcoming constant environmental hysteria and providing affordable energy that allows us to fight poverty, the real threat to the people of the world.","torrent":{"xt":"urn:btih:220378055b588e51bf8c8a744b4e1fd2306a53cf","amp;dn":"Stossel.2014.04.17.%5BA+Practical+Earth+Day%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220378055b588e51bf8c8a744b4e1fd2306a53cf","infoHashBuffer":{"type":"Buffer","data":[34,3,120,5,91,88,142,81,191,140,138,116,75,78,31,210,48,106,83,207]},"announce":[],"urlList":[]}}