{"title":"Dark Reign - The List","uid":5305600,"size":310487837,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:221f465141d8d334d30955f8594f4659ba856f5c&amp;dn=Dark+Reign+-+The+List&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ParrowJack","files":8,"time":1264373988,"description":"Dark Reign: The List is a series of eight interconnected one-shots heralding the next major chapter in the Marvel Universe's current saga.\n\nNorman Osborn composes a To-Do List - a list of things, not necessarily people to be targeted, but situations that have to be dealt with or addressed in one way, shape or form.  In the course of each of these stories, different characters will become involved, not because they've specifically been targeted but because a particular objective on Norman's list falls within their sphere of activity.\n\n\nDark Reign: The List - Avengers\nAfter the events of Utopia, Clint Barton (Ronin), enraged that Osborn has been able to continue his rule despite his best efforts, decides to storm Avengers Tower and kill Osborn himself.\nWritten by by Brian Michael Bendis and illustrated by Marko Djurdjevic.\n\n\nDark Reign: The List - Daredevil\nAfter a group of black-clad ninjas kill a group of crooked cops and lawyers, Osborn turns his attention to the Hand and their new leader: Daredevil. \nWritten by by Andy Diggle and penciled Billy Tan.\n\n\nDark Reign: The List - Uncanny X-Men\nAfter Emma Frost and Namor's betrayal, Osborn decides to send Namor's former lover Marrina Smallwood to kill the Atlanteans. \nBy Matt Fraction and Alan Davis.\n\n\nDark Reign: The List - Secret Warriors \nNick Fury goes to Avengers Tower and walks into Osborn's office when Ares just lets him in.  Osborn tries to frighten Nick by showing him his List.\nWritten by by Jonathan Hickman and illustrated by Ed McGuiness.\n\n\nDark Reign: The List - Hulk\nIn order to get rid of Bruce Banner and his son Skaar, Osborn sends a heavily armed Victoria Hand and Moonstone to attack the duo. \nWritten by by Greg Pak, with art by Ben Oliver.\n\n\nDark Reign: The List - Punisher \nFollowing repeated failed attempts to kill Frank Castle, Norman Osborn sends Daken and a platoon of H.A.M.M.E.R troops to complete this mission.\nBy Rick Remender and John Romita Jr.\n\n\nDark Reign: The List - Wolverine \nDuring his tenure as leader of HAMMER, Norman Osborn tries to take control of The World and the Weapon Plus creations. \nWritten by Jason Aaron and illustrated by Esad Ribic.\n\n\nDark Reign: The List - Spider-Man\nPeter Parker teams-up with several other members of The Front Line, to expose Norman Osborn as the maniac he truly is. \nBy Dan Slott and Adam Kubert.\n\n\n\nReleased on http://ComicPirates.info\t","torrent":{"xt":"urn:btih:221f465141d8d334d30955f8594f4659ba856f5c","amp;dn":"Dark+Reign+-+The+List","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"221f465141d8d334d30955f8594f4659ba856f5c","infoHashBuffer":{"type":"Buffer","data":[34,31,70,81,65,216,211,52,211,9,85,248,89,79,70,89,186,133,111,92]},"announce":[],"urlList":[]}}