{"title":"A - How Ace Are Buildings","uid":4196357,"size":83413374,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:22ee961204af3491f37c4f87d22a278d370f674f&amp;dn=A+-+How+Ace+Are+Buildings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"billy_stretcher","files":13,"time":1211240599,"description":"A\nHow Ace Are Buildings\nRock/Alternative\n1997\n192Kbps\n\n1.Turn It Up  \n2.Foghorn  \n3.Cheeky Monkey  \n4.No 1  \n5.Bad Idea  \n6.Singalong  \n7.Winter Of &amp;#039;96  \n8.Out Of Tune  \n9.Fistral  \n10.House Under The Ground  \n11.Five In The Morning  \n12.Ender  \n\nFront Cover Included.\n\n\nThose familiar with the dialect of A&amp;#039;s native eastern England will recognise &quot;How Ace Are Buildings&quot; grammatically as a statement rather than a question. Although its meaning is never totally revealed, it typifies the band&amp;#039;s intent to race into rock&amp;#039;s psyche with a powerful debut, rather than tip-toe onto the stage with the feelers out. Rock is the passion here: their logo is Aerosmith-esque, AC/DC have taught them well, and no sooner has the leading track invited you to &quot;Turn It Up&quot; than it&amp;#039;s headlong into &quot;Foghorn,&quot; one of the most impressive tracks and definitive of A&amp;#039;s raucous sound. The gesture of an introductory bio in the form of &quot;Cheeky Monkey&quot; is served up, as if it were needed by now, to familiarize you with the group. &quot;My name is Jason/I&amp;#039;ll rock your face in/&amp;#039;Cause I&amp;#039;ve got relations in my band/We like Van Halen and Iron Maiden/And I&amp;#039;ll do the talking, understand,&quot; yaps Adam Perry, who&amp;#039;s infant-like vocal helps put across juvenile lyrical themes coupled with poppy harmonies. An almost visible energy has been pumped into delivering seven of the most mercilessly fast-paced songs you&amp;#039;re ever likely to hear in succession, before taking a breather with the summery &quot;Fistral.&quot; Superseded with a couple more potential singles (this album is flush with them), and the melancholic farewell &quot;Ender,&quot; A&amp;#039;s unveiling is a suitable one. In comparison to later efforts, there&amp;#039;s little evidence of the impending electro input on 1999&amp;#039;s A vs. Monkey Kong, and it&amp;#039;s surprisingly several miles from A&amp;#039;s powerful metal approach on 2002&amp;#039;s Hi-Fi Serious, though there are hints of the shamelessly American style, which comes to the fore in the latter release. Still, it&amp;#039;s of its time and it&amp;#039;s clear to see how they managed to join hands with Kerrang! magazine and British bands like Feeder and Ash into mainstream rock fame in the early 2000s. It&amp;#039;s difficult to section this title, but a mention for Billy Joel&amp;#039;s &quot;My Life&quot; on the superbly catchy single &quot;No1&quot; and name-checking Eddie Van Halen, Faith No More, the U.K.&amp;#039;s notorious Wildhearts and the Sex Pistols, Simpsons creator Matt Groening, and Marvel comics in the sleeve credits should give you some idea of whether you would enjoy this record or not. Generally, it&amp;#039;s nice to hear a band having so much fun, especially on the self-indulgent hidden track at the end, which if nothing else gives the band a chance to have a final heavy guitar flourish. And why not? It&amp;#039;s your first album; don&amp;#039;t hold back. \n\nEnjoy! :)\n","torrent":{"xt":"urn:btih:22ee961204af3491f37c4f87d22a278d370f674f","amp;dn":"A+-+How+Ace+Are+Buildings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22ee961204af3491f37c4f87d22a278d370f674f","infoHashBuffer":{"type":"Buffer","data":[34,238,150,18,4,175,52,145,243,124,79,135,210,42,39,141,55,15,103,79]},"announce":[],"urlList":[]}}