{"title":"Bob Woodward - Bush At War (America-911-WTC-Bush-Neocons-Terrori","uid":3630338,"size":1426077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:239f540433577af897102978aa559af30d764c7d&amp;dn=Bob+Woodward+-+Bush+At+War+%28America-911-WTC-Bush-Neocons-Terrori&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sampooran","files":1,"time":1172856310,"description":"With his unmatched investigative skill, Bob Woodward tells the behind-the-scenes story of how President George W. Bush and his top national security advisers, after the initial shock of the September 11 attacks, led the nation to war. \n\nExtensive quotations from the secret deliberations of the National Security Council -- and firsthand revelations of the private thoughts, concerns and fears of the president and his war cabinet -- make Bush at War an unprecedented chronicle of a modern presidency in time of grave crisis. \n\nBased on interviews with more than a hundred sources and four hours of exclusive interviews with the president, Bush at War reveals Bush&amp;#039;s sweeping, almost grandiose, vision for remaking the world. &quot;I&amp;#039;m not a textbook player, I&amp;#039;m a gut player,&quot; the president said. \n\nWoodward&amp;#039;s virtual wiretap into the White House Situation Room reveals a stunning group portrait of an untested president and his advisers, three of whom might themselves have made it to the presidency. \n\nVice President Dick Cheney, taciturn but hard-line, always pressing for more urgency in Afghanistan and toward Iraq. \n\nSecretary of State Colin Powell, the cautious diplomat and loyal soldier, tasked with building an international coalition in an administration prone to unilateralism. \n\nDefense Secretary Donald Rumsfeld, the brainy agitator and media star who led the military through Afghanistan and, he hopes, through Iraq. \n\nNational security adviser Condoleezza Rice, the ever-present troubleshooter who surprisingly emerges as perhaps the president&amp;#039;s most important adviser. \n\nBush at War includes a vivid portrait of CIA director George Tenet, ready and eager for covert action against terrorists in Afghanistan and worldwide. It follows a CIA paramilitary team leader on a covert mission inside Afghanistan to pay off assets and buy friends with millions in U.S. currency carried in giant suitcases.\n\nAbout the Author\nBob Woodward, an assistant managing editor of The Washington Post, has been a newspaper reporter and editor for 30 years. He has authored or coauthored eight No. 1 national non-fiction bestsellers. They include four books on the presidency -- All the President&amp;#039;s Men, The Final Days, The Agenda, and Shadow -- and books on the Supreme Court (The Brethren), the Hollywood drug culture (Wired), the CIA (Veil), and the Pentagon (The Commanders). He is also author of national bestsellers on the presidential campaign (The Choice) and Federal Reserve chairman Alan Greenspan (Maestro). He has two daughters, Tali and Diana, and lives in Washington, D.C. with his wife, Elsa Walsh, a writer for The New Yorker.\n\n\n(America-911-WTC-Bush-Neocons-Terrorism-Fascism-Iraq)","torrent":{"xt":"urn:btih:239f540433577af897102978aa559af30d764c7d","amp;dn":"Bob+Woodward+-+Bush+At+War+%28America-911-WTC-Bush-Neocons-Terrori","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"239f540433577af897102978aa559af30d764c7d","infoHashBuffer":{"type":"Buffer","data":[35,159,84,4,51,87,122,248,151,16,41,120,170,85,154,243,13,118,76,125]},"announce":[],"urlList":[]}}