{"title":"Dwight Twilley - Sincerely / Twilley Don't Mind [2007][EAC,log,c","uid":8152320,"size":522414390,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2407584bd8d70010569e437c7b1cb786f71ddeeb&amp;dn=Dwight+Twilley+-+Sincerely+%2F+Twilley+Don%27t+Mind+%5B2007%5D%5BEAC%2Clog%2Cc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":27,"time":1361076961,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\n&quot;Sincerely&quot; Review by Mark Deming (from AllMusic.com)\n5 out of 5 stars\n\nDwight Twilley's first album, Sincerely, opens with &quot;I'm on Fire,&quot; a pop tune so unstoppable that it became a Top 20 single even though Twilley and his partner Phil Seymour didn't have an album to go with it when it hit radio in the spring of 1975. It would be close to a year before Sincerely finally emerged, after sessions at London's Trident Studio were scrapped in favor of material recorded in Twilley's hometown of Tulsa, OK. Commercially, the decision was nearly fatal to Twilley's career momentum, but it's hard to argue with what he and Seymour came up with; with the two handling nearly all the vocals and instruments themselves, they crafted a power pop masterpiece, one that merged their Anglophile leanings with the Southern roots of rock &amp; roll better than any of their contemporaries (including Big Star, who never seemed as comfortable with Memphis soul as they were with Liverpool pop). While nothing on the album quite matches the genius of &quot;I'm on Fire&quot; (what does?), the rest of the album is a consistently impressive, nodding towards a number of rock &amp; roll touchstones while sounding confidently original at all times; the Raspberries-on-downs glide of &quot;Baby, Let's Cruise,&quot; the loping updated rockabilly of &quot;T.V.,&quot; the funky groove of &quot;Feeling in the Dark,&quot; the Searchers-esque jangle of &quot;Three Persons,&quot; and the broken-hearted melancholy of &quot;I'm Losing You&quot; could each be the work of a different band, but the strength of Twilley's songwriting and Seymour's versatile vocal chops bring a welcome unity to these many shades of pop perfection. While Twilley and Seymour would both enjoy long careers with a certain degree of success, neither ever made an album quite as good as Sincerely -- though they came close.\n\n\n&quot;Twilley Don't Mind&quot; Review by Mark Deming (from AllMusic.com)\n4 out of 5 stars\n\nThe Dwight Twilley Band's first album, Sincerely, suffered through a long, drawn-out gestation before Twilley and Phil Seymour simply holed up in an Oklahoma studio and cranked it out themselves, handling all the instruments through the wonders of overdubbing. By contrast, their follow-up, Twilley Don't Mind, came much faster and easier; Twilley and Seymour had already been playing most of the material that would make up Twilley Don't Mind on the road touring behind their debut LP, and while the sophomore album's technique is as unassailable as Sincerely, it sounds less like studio craftsmanship than a tight band knocking out their songs in real time. Twilley Don't Mind also pares back a bit of the eclecticism of Sincerely in favor of a more unified and energetic musical approach, embracing the joys of simple but hooky guitar-based rock on &quot;Here She Comes,&quot; &quot;Invasion,&quot; &quot;Rock and Roll '47&quot; and the title track, though the cool and moody &quot;That I Remember,&quot; the neo-psychedelic &quot;Sleeping&quot; and the sparkling folk-rocker &quot;Chance to Get Away&quot; made it clear Twilley still had plenty of ideas left in his bag of tricks. He didn't opt to reveal as many of them on this album, however; featuring only nine tunes, the album feels unnecessarily short, one of the key reasons it feels a bit pale in comparison to Sincerely. However, what Twilley and Seymour did bring to the table on Twilley Don't Mind was first rate power pop every bit as satisfying as Badfinger and Big Star at their best, and anyone with a yen for a smart hook will revel in this.\n\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:2407584bd8d70010569e437c7b1cb786f71ddeeb","amp;dn":"Dwight+Twilley+-+Sincerely+%2F+Twilley+Don%27t+Mind+%5B2007%5D%5BEAC%2Clog%2Cc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2407584bd8d70010569e437c7b1cb786f71ddeeb","infoHashBuffer":{"type":"Buffer","data":[36,7,88,75,216,215,0,16,86,158,67,124,123,28,183,134,247,29,222,235]},"announce":[],"urlList":[]}}