{"title":"Arena One : Slaverunners by Morgan Rice - epub","uid":9421845,"size":287818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:243f72ae50c893e876e7ca2072b77a2688ce36d9&amp;dn=Arena+One+%3A+Slaverunners+by+Morgan+Rice+-+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1388603620,"description":"Overview:\n\nHaving just escaped from the treacherous island that was once Manhattan, Brooke, Ben, Logan, Bree and Rose make their way up the Hudson river in their stolen boat, low on fuel, low on food, and desperately needing shelter from the cold. On their tails are the slaverunners, who will stop at nothing until they capture them and bring them back.\nAs they make their way upriver in this post-apocalyptic, action-packed thriller, on their way to try to find the mythical city in Canada, they will need to use all their ingenuity and survival skills to stay alive. Along the way they will encounter crazed survivors, roving gangs of predators, cannibals, wild animals, a desolate wasteland, and an unstoppable blizzard. They sustain injuries, get sick, and the Hudson freezes over as they do their best to salvage what they can and avoid the slaverunners? pursuit. They find a small island and think they have found respite?until events don?t go their way. It is not until they board a mysterious train to nowhere that they find that things can always get worse.\nAlong the way, Brooke?s feelings for Logan intensify, as do her feelings for Ben. Torn between these two boys, caught between their jealousy, she is unsure how she feels?until events choose for her.\nAs they find themselves thrown back into an arena, they are shocked to discover that Arena Two is even worse. Thrown into a barbaric fighting stage, equipped with weapons, pitted against other teenagers?and against themselves?Brooke and the others will be forced to choose what?s important, and to make the most difficult sacrifices of their lives. Because in Arena Two, no one survives. Ever.\n\nGenre:  Sci-fi\n","torrent":{"xt":"urn:btih:243f72ae50c893e876e7ca2072b77a2688ce36d9","amp;dn":"Arena+One+%3A+Slaverunners+by+Morgan+Rice+-+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"243f72ae50c893e876e7ca2072b77a2688ce36d9","infoHashBuffer":{"type":"Buffer","data":[36,63,114,174,80,200,147,232,118,231,202,32,114,183,122,38,136,206,54,217]},"announce":[],"urlList":[]}}