{"title":"Standup Comedy - First Family - Vaughn Meader","uid":4316929,"size":118633270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:246edfda0ee5a0222d3305ab5ef056f092ff34d5&amp;dn=Standup+Comedy+-+First+Family+-+Vaughn+Meader&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":36,"time":1217143191,"description":"For some reason, this torrent is causing no end of problems. The original went unseeded by the OP, and the second attempt was lost due to a computer crash. There seems no choice but to try yet again.\n\n?The older torrents of this on different trackers have either died off or become flawed, so I am repackaging it once again. Here is the OP?s description:\n\nIn the late 50&amp;#039;s, all the talk was about the charismatic John Fitzgerald Kennedy and how inevitable it seemed that he&amp;#039;d be elected our next President...everyone knew a change was in the air and in 1960, we did elect JFK. After a stint in the Armed Forces and based in Germany, Vaughn Meader returned to the U.S. and in the early 60&amp;#039;s, started performing a stand-up routine in night clubs. One evening, he tried something new, breaking into his now famous impression of the newly elected JFK...and his audience loved it. Soon, his eerie knack for capturing the pacing and timbre of Kennedy&amp;#039;s distinct voice caught the eye of Bob Booker and Earle Doud and on October 22, 1962, they entered Fine Recording Studios in New York City and before a live audience, they recorded the legendary The First Family album. No one could have anticipated the overwhelming response to Meader&amp;#039;s spot-on impression...the LP sold in excess of 300,000 copies in the first three weeks of release and over 7.5 million copies in the first few months. Meader appeared on high profile TV shows such as the Jack Paar hosted Tonight Show, What&amp;#039;s My Line and The Ed Sullivan Show, filled nightclubs in Vegas and went back into the studios on March 18, 1963 to record a second volume of The First Family. On November 22, 1963, JFK was assassinated and inside of a week, not a single copy of the LP was to be found in record stores. People removed the albums from their collections in horror...and Vaughn Meader&amp;#039;s career ended as quickly as it began. While he dabbled in music and comedy for years afterward, eventually returning to his actual name (Abbott Vaughn Meader), he could never match the success he enjoyed satirizing JFK. The action takes place in all the important and familiar places and with the people connected with The First Family...listening the these CD&amp;#039;s will bring these events and people back to life.\n\nThis torrent contains both, Vol 1+2.\n\nOh and... the rubber swan is MINE!?\n","torrent":{"xt":"urn:btih:246edfda0ee5a0222d3305ab5ef056f092ff34d5","amp;dn":"Standup+Comedy+-+First+Family+-+Vaughn+Meader","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246edfda0ee5a0222d3305ab5ef056f092ff34d5","infoHashBuffer":{"type":"Buffer","data":[36,110,223,218,14,229,160,34,45,51,5,171,94,240,86,240,146,255,52,213]},"announce":[],"urlList":[]}}