{"title":"Caveman (2013) [FLAC]","uid":8350725,"size":273263096,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:24bcdfbc343443ea4ddf184596450746e3cd593f&amp;dn=Caveman+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1365294334,"description":"\n  Caveman (2013) [FLAC]\n\n  Released: 2013\n  Duration:445:20\n  Genre: Pop/Rock\n  Style: Indie Pop, Alternative\n  Source: CD (log + cue)\n  Codecd: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Strange To Suffer\n  02 In The City\n  03 Shut You Down\n  04 Where's The Time\n  05 Chances\n  06 Over My Head\n  07 Ankles\n  08 Pricey\n  09 I See You\n  10 Never Want To Know\n  11 The Big Push\n\nNew York indie quintet Caveman's 2011 debut CoCo Beware was a softly psyched-out affair of neon-flecked atmospheres and '70s-inspired rock tracks. The slow-burning album was largely slept on, but not overlooked, and the band gained a following without the typical rush of press coverage or hype. On their self-titled second album, the soft lens on watery psych textures is still in place, but the pace and volume of the songs get toned down for a much more relaxed, reflective ride. This shift in tone is set by the layered harmonies of the brief, mantra-like album opener &quot;Strange to Suffer.&quot; Tracks like &quot;Where's the Time&quot; and the eerie hooks of the electro-pop-infused &quot;In the City&quot; meld the searching melodies of the Shins with the cloudy experimentation of Fleet Foxes offshoots like Poor Moon and Father John Misty. \n\n  Caveman often sound like a band playing from the other side of some ephemeral wall, tapping into a very dialed-down version of the mysterious aura of early 4AD bands rather than hiding behind reverb plug-ins. The looming synths of &quot;Ankles&quot; wrap around Matthew Iwanusa's patient vocals and create a hushed, washy feeling as drums, bass, and all manner of electronic elements gel into a spacious mix. The washy quality of the production can sometimes read listless or sleepy, as on the plodding &quot;Pricey.&quot; Even in its more meandering moments, the album manages to drift by rather than run out of steam, lingering in its more ambient patches and filling out its more upbeat material with the same unique, cohesive sense of melodic atmosphere that colors the entire album. By the end, Caveman studies an exacting gradient of textures and sounds. The songs don't stand out as much themselves as they do blur into a wintery whole, creating an environment of subtle experimentation and daydream-like dynamics.","torrent":{"xt":"urn:btih:24bcdfbc343443ea4ddf184596450746e3cd593f","amp;dn":"Caveman+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24bcdfbc343443ea4ddf184596450746e3cd593f","infoHashBuffer":{"type":"Buffer","data":[36,188,223,188,52,52,67,234,77,223,24,69,150,69,7,70,227,205,89,63]},"announce":[],"urlList":[]}}