{"title":"Redbeard-Might is Right or Survival of Fittest(final version)(18","uid":4732912,"size":11447565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2522349d324052e970e5a64106e3f8eda84cf2de&amp;dn=Redbeard-Might+is+Right+or+Survival+of+Fittest%28final+version%29%2818&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235090861,"description":"This is Ragnar Redbeard's monumental book Might is Right or The Survival of the Fittest (1896) which outright rejects conventional ideas of human and natural rights and argues that only strength or physical might can establish moral right. Certainly one of the most controversial books ever written, it is considered the definitive statement on Social Darwinism, a philosophy that exalts the self over all others and advocates that the strong must forever rule over the weak. Not being a philosophical treatise in the strict sense, but more of a &quot;manifesto&quot; for racism, sexism, the worship of strength and the virtues of war, such as unbridled rapine, extreme unscrupulousness, joy in risk and contempt of danger. Author makes it clear that he is a foe to weakness, servility, Christianity and &quot;turning the other cheek&quot;. Impassioned, and at times, quite inspiring, it is characterised by its enamelled nineteenth century prose, its rhetorical splendours and thunderous declamations. Redbeard's message - that &quot;you can go further with a handful of might than a bagful of right&quot; - is repeated with very little variation throughout his treatise. Written in lightening-like prose, it is a thunderous mental punch to the face, and is as electrifying as anything that has been written in history. Author's guns are clearly aimed at the slave morality of the masses. Religious philosophies and their secular equivilents demand that we have &quot;empathy&quot; for the people we happen to share this world with - and that includes the tyrants that happen to rule that day. In Might is Right the immutable laws of nature are explained, defined and expounded upon in detail in eloquent 19th century English. Redbeard makes it clear that &quot;rights&quot; can only exist when people have the power to claim them - and they must demonstrate this every single day. Learn the secrets that the strong know and the weak fear to understand. You may love or hate this book, but you will never forget it. 190 pages. A must read for everyone. Note: This is the updated (and final) version, so please replace it with any previous.\n","torrent":{"xt":"urn:btih:2522349d324052e970e5a64106e3f8eda84cf2de","amp;dn":"Redbeard-Might+is+Right+or+Survival+of+Fittest%28final+version%29%2818","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2522349d324052e970e5a64106e3f8eda84cf2de","infoHashBuffer":{"type":"Buffer","data":[37,34,52,157,50,64,82,233,112,229,166,65,6,227,248,237,168,76,242,222]},"announce":[],"urlList":[]}}