{"title":"The Anthony Cumia Show 2015-05-21 Ari Shaffir, Kendra Sunderland","uid":11954164,"size":422330325,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2637184473d109aee5cd89f353c510c7130d71c7&amp;dn=The+Anthony+Cumia+Show+2015-05-21+Ari+Shaffir%2C+Kendra+Sunderland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mothergoose58","files":2,"time":1432316756,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Ari Shaffir, Kendra Sunderland\n\nEpisode 167 - TACS week ends with Ari Shaffir joining Anthony poolside to chat about his trip to Thailand that included the things gals shoot out of their pussy there, Thai hookers, STD's, and the food. They then get into chicken consumption, horse meat consumption, Locked Up Abroad, police brutality in other countries, language barriers, overseas city life, and Joe Rogan. Ant brings up attempting to get into the SiriusXM building, they talk about freedom of speech, suspended ESPN reporter Britt McHenry, analyzing social media pictures, free thinking in comedy, allowing open debate, insincere apologies, living in a vengeful society, &quot;social justice warriors&quot;, and Ant recalls FCC violations. Kendra Sunderland joins the guys to talk about how she got into &quot;camping&quot;, why she dropped out of school, how she lost her virginity, the reactions from her first video, and the police charging her with public indecency. Ant brings up cat shit crazy, they talk relationships, the porn industry, rude cam girls, cam requests, vagina bongs, being adventurous, threesomes, and interracial sex. The trio take it to the (scalding) hot tub and continue to talk about Kendra's NY trip, dancing at Headquarters Gentlemen's Club, Ari and Ant give her tips on what guys like in a stripper, they chat about last place awards, girl on girl experiences, Twitter, dick pics, getting pictures with famous people, future plans, speedos, random flashing, how cruel kids can be, the perfect dancing music, and the importance of manscaping.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:2637184473d109aee5cd89f353c510c7130d71c7","amp;dn":"The+Anthony+Cumia+Show+2015-05-21+Ari+Shaffir%2C+Kendra+Sunderland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2637184473d109aee5cd89f353c510c7130d71c7","infoHashBuffer":{"type":"Buffer","data":[38,55,24,68,115,209,9,174,229,205,137,243,83,197,16,199,19,13,113,199]},"announce":[],"urlList":[]}}