{"title":"Finding Nemo PS2[SLUS 206 28]","uid":6583044,"size":1190993551,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:26964b6742ffcbab11e035e1d39c805573eea1fb&amp;dn=Finding+Nemo+PS2%5BSLUS+206+28%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"razalgul1979","files":13,"time":1312496031,"description":"THQ\nTraveller's Tales\nFantasy Action Adventure\nRelease: May 9, 2003 Ã‚Â»\nESRB: Everyone\n\nFinding Nemo Review\n\nFinding Nemo is an average Disney game with a few kinks that mar an otherwise decent experience.\n\nTraveller's Tales, the developer behind the game adaptation of Finding Nemo, is no stranger to making games out of Pixar properties. In the past, the company has been responsible for bringing A Bug's Life and Toy Story to consoles, and while the company's experience is evident in Finding Nemo, this 3D action adventure game is not quite as fun as it could have been.\n\nYou'll instantly recognize the characters from the film.\n\nWhile Finding Nemo does a fine job of re-creating the lighthearted story of the film by alternating between gameplay and FMV taken directly from the movie, the game is a short ride that is fraught with frustration and repetition. Set in a lush underwater world, the game gives you several objectives in each level, the most important of which is simply finding the end of the level and moving the story along to the next chapter. For those who care to dig a little deeper, you can replay each level as many times as you like in an effort to complete a variety of optional objectives, such as collecting every floating ring scattered throughout the levels, disposing of every enemy, or placing colored pearls in corresponding holes in the sea floor. Upon completing a certain number of these objectives, you'll unlock a simple minigame. Complete all of a level's objectives and you'll be presented with a slide show of various production sketches from the film.\n\nSince the game is geared toward the casual player, the controls and gameplay are very simple. You move your character with the analog stick and interact with the environment using two buttons. Even the most novice of players should be able to pick the game up quickly. But while Finding Nemo isn't necessarily difficult, it can certainly be frustrating and overly repetitive, especially if you're devoted enough to complete every task each level has to offer. Since the levels are broken up by cutscenes, once you've passed a certain point in a particular level, you can no longer backtrack to pick up something you may have missed, so most players will have to replay the different levels numerous times to complete every level objective. Additionally, the game employs just a few different styles of gameplay: side-scrolling sequences, sequences where you're either swimming away from or toward the end of a level, and sequences where you'll have to bounce on blocks, much like in the arcade classic Q*Bert.\n\nUnfortunately, the gameplay isn't that great.\n\nWhile the gameplay might not be as good as it could have been, Finding Nemo does a fine job of re-creating the experience of the movie, both in the way that the story unfolds and in the way that the game looks and sounds. The graphics in Finding Nemo are detailed and well animated, and the characters from the film look just like you'd expect them to. Plant life on the ocean floor undulates with the tide, and at times you'll even notice a gentle pull from either direction while you're swimming. The game is available for all three major console platforms, and as you'd expect, it's largely identical on them all, with the lone difference being the graphics--the Xbox version of the game looks slightly cleaner than its PlayStation 2 and GameCube counterparts. On any platform, however, Finding Nemo does a great job of making you feel like you're underwater, and for a game that is set entirely in the ocean, that's a good thing. The game's subtle sound effects also add much to its atmosphere.\n\nFinding Nemo is a game that looks good and stays true to the material it's based on, but won't last long and isn't always much fun. Fans of the film will enjoy interacting with the lovable characters and playing through the movie-inspired sequences, but those diligent enough to go through and complete every objective will probably come away from the game feeling a little disappointed. While there have certainly been worse Disney games in the past, this adaptation of Finding Nemo is just an average game with a few kinks that mar an otherwise decent experience.\n\nBy Tim Tracy, GameSpotPosted Jun 3, 2003 2:40 pm PT ","torrent":{"xt":"urn:btih:26964b6742ffcbab11e035e1d39c805573eea1fb","amp;dn":"Finding+Nemo+PS2%5BSLUS+206+28%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26964b6742ffcbab11e035e1d39c805573eea1fb","infoHashBuffer":{"type":"Buffer","data":[38,150,75,103,66,255,203,171,17,224,53,225,211,156,128,85,115,238,161,251]},"announce":[],"urlList":[]}}