{"title":"SoftwareCompanions ViewCompanion Premium v7.44 with Key [TorDigg","uid":8583436,"size":25950651,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:269a43a3554137d75073b1beca2ae6a3d4351c94&amp;dn=SoftwareCompanions+ViewCompanion+Premium+v7.44+with+Key+%5BTorDigg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":11,"time":1371474984,"description":"ViewCompanion Premium\n\nViewCompanion Premium is the most powerful member of the ViewCompanion familiy. ViewCompanion Premium can view, print and convert HPGL, HPGL/2, HP-RTL, Adobe PDF, Postscript, EPS, TIFF, CALS and other formats.\nConversion is one of the most important features in ViewCompanion, and the following output formats are supported: \n\nAdobe PDF\nAdobe Postscript\nAutoDesk DWF\nAutoDesk DXF\nCALS Group 4 Raster\nComputer Graphics Metafile\nGerber RS-274X\nHP-RTL Raster\nJPEG Raster\nJPEG2000 Raster\nPaintbrush PCX (PCX)\nPortable Network Graphics (PNG)\nScalable Vector Graphics (SVG)\nTIFF Raster\nWindows Bitmap (BMP)\nWindows Enhanced Metafile (EMF)\nWindows Metafile (WMF)\n\nNo extra applications or drivers are needed for conversion to the different formats. More details about the conversion formats can be found here.\nIf you need to distribute drawings, e.g. on the Internet, you can convert your drawings to Autodesk Drawing Web Format (DWF), Scalable Vector Graphics (SVG) or Adobe PDF. All these formats are very popular for distributing drawings. \nYou can even convert multiple files of different formats to a single multi-page PDF file.\nHPGL/2 plotter files can be converted to AutoDesk DXF format, which can be read by almost all CAD application, e.g.: Autodesk AutoCAD and Microstation.\nBoth batch conversion and printing is included. The software can be configured to monitor a user selected folder, and all files copied to that folder will be automatically printed.\n\nWith ViewCompanion Premium you can add markups to the loaded file. Supported markup elements include rectangles, lines, dimension lines, area measurements, ellipses, polygons, text, arrows, stamps and images. \nYou can select one of the predefined stamps or create your own. User defined symbol libraries makes it easy to add frequently used symbols as markups. Hyper links can be added to markup elements, and a hyper link can either open another drawing in ViewCompanion, or open an Internet location using the default browser.\nAll markup elements are stored in a separate file. The original file will be left unchanged.\nThe markup elements can optionally be included when the viewed file is printed or converted.\nThe markup elements can be exported to a DXF file.\n\nYou can use ViewCompanion Premium to add markups/comments to your drawings.\nViewCompanion gives you advanced functions for zooming and panning, so that you can view your files fast and accurate, before printing or converting them.\n\nSupported OS:\n\nWindows XP (SP3), Windows Vista, Windows 7 and Windows 8\n\nHomepage: http://www.softwarecompanions.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with any name and given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:269a43a3554137d75073b1beca2ae6a3d4351c94","amp;dn":"SoftwareCompanions+ViewCompanion+Premium+v7.44+with+Key+%5BTorDigg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"269a43a3554137d75073b1beca2ae6a3d4351c94","infoHashBuffer":{"type":"Buffer","data":[38,154,67,163,85,65,55,215,80,115,177,190,202,42,230,163,212,53,28,148]},"announce":[],"urlList":[]}}