{"title":"Forbidden Holywood Collection Vol. 2 - Disk 2 - Xvid 1cd - Femal","uid":9260550,"size":734287872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:272182120fcb4aa9357fdd51dc5091854bf3db47&amp;dn=Forbidden+Holywood+Collection+Vol.+2+-+Disk+2+-+Xvid+1cd+-+Femal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SaM","files":-1,"time":1385618517,"description":"Forbidden Holywood Collection Vol. 2 - Disk 2 - Xvid 1cd - Female (1933) [DDR]\n\nFemale is a 1933 Warner Bros. pre-code film directed by Michael Curtiz and starring Ruth Chatterton and George Brent. It is based on the novel of the same name by Donald Henderson Clarke.\n\n    CAST:- \n    Ruth Chatterton as Alison Drake\n    George Brent as Jim Thorne\n    Lois Wilson as Harriet Brown, a schoolmate of Drake's\n    Johnny Mack Brown as George Cooper, an employee Drake invites to her mansion\n    Ruth Donnelly as Miss Frothingham, Drake's new secretary, after she decides \n     that male ones are too distracting\n    Ferdinand Gottschalk as Pettigew, Drake's office manager\n    Phillip Reed as Claybourne\n    Gavin Gordon as Briggs, another Drake conquest, transferred to Montreal when \n     he becomes lovestruck\n    Kenneth Thomson as Red\n    Huey White as Puggy, Drake's chauffeur\n    Douglas Dumbrille as Mumford, one of Drake's car dealers, who proposes as a \n     sort of business merger\n    Spencer Charters as Tom\n    Robert Greig as James, Drake's butler (uncredited)\n\n    Directed by Michael Curtiz, William Dieterle, William A. Wellman\n    Produced by Robert Presnell Sr.\n    Written by Donald Henderson Clarke (story), Gene Markey, Kathryn Scola\n\nSYNOPSIS:- Female (1933)\nAlison Drake (Ruth Chatterton) is the wealthy owner and hard-driving, no-nonsense head of a large automobile company, inherited from her father. Her work has caused her to lose her youthful romanticism, and she has casual affairs with men, including her own employees.\n\nAlison hosts a party at her mansion, but becomes fed up with the men out to either sell her things or marry her for her money. She dresses down and goes to an amusement park, where she picks up a man at a shooting gallery. They have fun together, but he refuses her offer to go home with him.\n\nThe next day, they meet again at her factory. To their mutual astonishment, he turns out to be Jim Thorne (George Brent), a gifted engineer she has ordered her underlings to hire away from her competition. Saying that she has no time now, Alison has him come to her mansion that night, supposedly to discuss his plans for the company in detail. She attempts to seduce him, but he rejects her as anything other than his employer.\n\nAnnoyed, she turns to her assistant, Pettigew (Ferdinand Gottschalk), for advice. He tells her that men want women who are softer and less independent, so she adjusts her tactics. \n\nShe tricks Jim into a picnic and wears him down. In the end, he succumbs to her charms.\n\nThe next day, he shows up at her office with a marriage license, but she informs him that she likes their relationship just the way it is. Outraged, he quits.\n\nAlison has another problem on her hands. Her company needs more financing to survive, but another firm is intent on taking advantage of the situation to take over and has gotten the local banks to turn her down. She sets up an appointment to meet with bankers in New York City, but then breaks down when she realizes that she cannot live without Jim.\n\nShe has the police track down which way he went and drives off after him. She eventually finds him (at another shooting gallery) and tells him that she is willing to get married. Then, he realizes that they can fly to New York in time to save her company. Even so, she tells him that he will run the firm, while she has nine children.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 1:00:00\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 1:00:00","torrent":{"xt":"urn:btih:272182120fcb4aa9357fdd51dc5091854bf3db47","amp;dn":"Forbidden+Holywood+Collection+Vol.+2+-+Disk+2+-+Xvid+1cd+-+Femal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"272182120fcb4aa9357fdd51dc5091854bf3db47","infoHashBuffer":{"type":"Buffer","data":[39,33,130,18,15,203,74,169,53,127,221,81,220,80,145,133,75,243,219,71]},"announce":[],"urlList":[]}}