{"title":"Stephen Baxter - Transcendent (Destiny's Children #3)","uid":12722168,"size":605181922,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2759e77b067d0c15bfadd6f00a9fa19730415936&amp;dn=Stephen+Baxter+-+Transcendent+%28Destiny%27s+Children+%233%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":17,"time":1447005726,"description":"Stephen Baxter’s gripping page-turners are feats of bold speculation and big ideas that, for all their time-and-space-spanning grandeur, remain firmly rooted in scientific fact and cutting-edge theory. Now Baxter is back with the final volume in his monumental Destiny’s Children trilogy, a tour de force in which parallel stories unfold–and then meet as humanity stands poised on the brink of divine providence . . . or extinction.\r\n\r\n\r\nIt is the year 2047, and nuclear engineer Michael Poole is still in the throes of grief. His beloved wife, Morag, died seventeen years ago, along with their second child. Yet Michael is haunted by more than just the memory of Morag. On a beach in Miami, he sees his dead wife. But she vanishes as suddenly as she appears, leaving no clue as to her mysterious purpose.\r\n\r\nAlia was born on a starship, fifteen thousand light years from Earth, five hundred thousand years after the death of Michael Poole. Yet she knows him intimately. In this distant future, when humanity has diversified as a species and spread across the galaxy, every person is entrusted with the duty of Witnessing the life of one man, woman, or child from the past, recovered by means of a technology able to traverse time itself. Alia’s subject is Michael Poole.\r\n\r\nWhen his surviving, estranged son is injured, Michael tries to reconnect with him–and to stave off a looming catastrophe. Vast reservoirs of toxic gases lie buried beneath the poles, trapped in crystals of ice. Now that ice is melting. Once it goes, the poisons released will threaten all life on Earth. A bold solution is within reach, if only Michael can convince a doubting world. Yet as Morag’s ghostly visitations continue, Michael begins to doubt his own sanity.\r\n\r\nIn the future, Alia is chosen to become a Transcendent, an undying member of the group mind that is shepherding humanity toward an evolutionary apotheosis. The Witnessings are an integral part of their design, for only by redeeming the pain of every human who has lived and died can true Transcendence be achieved. Yet Alia discovers a dark side to the Transcendents’ plans, a vein of madness that may lead to an unthinkable renunciation.\r\n\r\nSomehow, Michael Poole holds the fate of the future in his hands. Now, to save that future, Alia must undertake a desperate journey into the past. . . .\r\n\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:2759e77b067d0c15bfadd6f00a9fa19730415936","amp;dn":"Stephen+Baxter+-+Transcendent+%28Destiny%27s+Children+%233%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2759e77b067d0c15bfadd6f00a9fa19730415936","infoHashBuffer":{"type":"Buffer","data":[39,89,231,123,6,125,12,21,191,173,214,240,10,159,161,151,48,65,89,54]},"announce":[],"urlList":[]}}