{"title":"Fire Department Trilogy","uid":5678340,"size":3188826112,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:281abbc92980b77b29246db29043f868254dd5ee&amp;dn=Fire+Department+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"kabsat","files":3,"time":1278697085,"description":"Titles:\n1) Fire Chief (a.k.a. Fire Department)\n2) Fire Captain (a.k.a. Fire Department 2)\n3) Fire Department 3\n\nDeveloper: Monte Cristo Multimedia\n\nPublishers:\n1) FC - DreamCatcher Interactive\n2) FCpt - Brigades\n3) FD3 - Monte Cristo Multimedia\n\nGenre: Firefighting RTT\n\nReleased:\n1) FC - 2003\n2) FCpt - 2004\n3) FD3 - 2006\n\nDescriptions:\n1) FC - Fire Chief takes a new spin on the tactical strategy genre. Take command of a full team of firefighters and lead them through 34 missions of intense heat. Different situations from poisonous fumes, toxic materials to rapid fire spreads require different tactics. Work with distinct firefighters and fire specialists with different skills and support vehicles to get the job done.\n\n2) FCpt - In the successor to Fire Chief you have the control over a fully operational Fire Department. You can choose a nationality (Germany, USA, England and France) with abilities for the force like dog handlers, emergency ambulances, firemen, engine companies and more. Several vehicles such as aerial ladders, fire engines, caterpillar bulldozers, helicopters and more are under your control. Although baring similar gameplay, compared to its predecessor it has improved AI, more detailed graphics and new features such as the reaction of toxic gas and more.\n\n3) FD3 - The third game in the Fire Department series once again follow the life of fire fighters - this time in 13 missions in five locations: France, United States, United Kingdom, Germany, and Ukraine - the home country of the developers. The game uses a dynamic fire and smoke dynamics system. Fire does not follow a scripted path and is influenced by the wind or flammable substance. Smoke follows ventilation paths and suppresses oxygen levels. Players manage a fire fighter crew with different classes and 15 different vehicles, all in real-time. Each class has a specific set of abilities. Regular fire fighters break doors and save victims while putting out the fires, medics provide first aid, others are able to get through obstacles, repair machines, command dogs, specialize in toxic substances or wear special suits that withstand extreme temperatures.\n\nInstallation:\n1) Mount or burn game images;\n2) Install the games;\n3) Play the games without the CDs.\n\nIf you like the games, buy the originals.","torrent":{"xt":"urn:btih:281abbc92980b77b29246db29043f868254dd5ee","amp;dn":"Fire+Department+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"281abbc92980b77b29246db29043f868254dd5ee","infoHashBuffer":{"type":"Buffer","data":[40,26,187,201,41,128,183,123,41,36,109,178,144,67,248,104,37,77,213,238]},"announce":[],"urlList":[]}}