{"title":"The Allman Brothers Band - Seven Turns (1990)","uid":8625919,"size":334420602,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:285abbf11d8a5365e8c83a3211d55878340e8706&amp;dn=The+Allman+Brothers+Band+-+Seven+Turns+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":24,"time":1372466925,"description":"This is the same torrent that was uploaded to Demonoid in August 2008.\n\n\nThe Allman Brothers Band - Seven Turns (1990)\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 8 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nThe story of the Allman Brothers Band is one of triumph, tragedy, redemption, dissolution, and a new redemption. Over nearly 30 years, they've gone from being America's single most influential band to a has-been group trading on past glories, to reach the 21st century as one of the most respected rock acts of their era.\n\nFor the first half of the 1970s, the Allman Brothers Band was the most influential rock group in America, redefining rock music and its boundaries. The band's mix of blues, country, jazz, and even classical influences, and their powerful, extended on-stage jamming altered the standards of concert performance -- other groups were known for their on-stage jamming, but when the Allman Brothers stretched a song out for 30 or 40 minutes, at their best they were exciting, never self-indulgent. They gave it all a distinctly Southern voice and, in the process, opened the way for a wave of '70s rock acts from south of the Mason-Dixon Line, including the Marshall Tucker Band, Lynyrd Skynyrd, and Blackfoot, whose music, at least initially, celebrated their roots. And for a time, almost single-handedly, they also made Capricorn Records into a major independent label. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jifwxqw5ldae~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jifwxqw5ldae~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nThe Allman Brothers Band's comeback album, and their best blues-based outing since Idlewild South that restored a lot of their reputation. With Tom Dowd running the session, and the group free to make the music they wanted to, they ended up producing this bold, rock-hard album, made up mostly of songs by Dickey Betts (with contributions by new keyboardman Johnny Neel and lead guitarist Warren Haynes), almost every one of them a winner. Apart from the rippling opening number, &quot;Good Clean Fun,&quot; which he co-authored, Gregg Allman's contribution is limited to singing and the organ, but the band seem more confident than ever, ripping through numbers like &quot;Low Down Dirty Mean,&quot; &quot;Shine It On,&quot; and &quot;Let Me Ride&quot; like they were inventing blues-rock here, and the Ornette Coleman-inspired &quot;True Gravity&quot; is their best instrumental since &quot;Jessica.&quot;\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hifpxq95ld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hifpxq95ld0e&lt;/a&gt;\n\nTrack List:\n\n01. Good Clean Fun\n02. Let Me Ride\n03. Low Down Dirty Mean\n04. Shine It On\n05. Loaded Dice\n06. Seven Turns\n07. Gambler's Roll\n08. True Gravity\n09. It Ain't Over Yet\n","torrent":{"xt":"urn:btih:285abbf11d8a5365e8c83a3211d55878340e8706","amp;dn":"The+Allman+Brothers+Band+-+Seven+Turns+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"285abbf11d8a5365e8c83a3211d55878340e8706","infoHashBuffer":{"type":"Buffer","data":[40,90,187,241,29,138,83,101,232,200,58,50,17,213,88,120,52,14,135,6]},"announce":[],"urlList":[]}}