{"title":"Introduction to Logic - Stanford University - Coursera","uid":8715259,"size":343177732,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:288807fc6417f5866cb5df84933fe2f9d842427f&amp;dn=Introduction+to+Logic+-+Stanford+University+-+Coursera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"mrbugsmr","files":315,"time":1374317429,"description":"Introduction to Logic\nProfessor: Michael Genesereth\n\n\nIntroductory video:\n\n\nAbout the Course\n\nLogic is one of the oldest intellectual disciplines in human history. It dates back to the times of Aristotle; it has been studied through the centuries; and it is still a subject of active investigation today.\n\nThis course is a basic introduction to Logic. It shows how to formalize information in form of logical sentences. It shows how to reason systematically with this information to produce all logical conclusions and only logical conclusions. And it examines logic technology and its applications - in mathematics, science, engineering, business, law, and so forth.\n\nThe course differs from other introductory courses in Logic in two important ways. First of all, it teaches a novel theory of logic that improves accessibility while preserving rigor. Second, the material is laced with interactive demonstrations and exercises that suggest the many practical applications of the field.\n\n\nWhat is the format of the class?\n\nThe class consists of videos, notes, and a few background readings. The videos include interactive demonstrations and exercises. There are also standalone quizzes that are not part of video lectures. Workload: one to two hours of video content per week.\nWhat should I know to take this class?\n\nThe course has no prerequisites beyond high school mathematics. You should be comfortable with symbolic manipulation techniques, as used, for example, in solving simple algebra problems. And you need to understand sets, functions, and relations. However, that's all. If you have this background, you should be fine.\nDo I need to buy any textbooks?\n\nNone is required, as the course is self-contained.\n &lt;a href=&quot;\nhttps://www.coursera.org/course/intrologic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.coursera.org/course/intrologic&lt;/a&gt;\n","torrent":{"xt":"urn:btih:288807fc6417f5866cb5df84933fe2f9d842427f","amp;dn":"Introduction+to+Logic+-+Stanford+University+-+Coursera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"288807fc6417f5866cb5df84933fe2f9d842427f","infoHashBuffer":{"type":"Buffer","data":[40,136,7,252,100,23,245,134,108,181,223,132,147,63,226,249,216,66,66,127]},"announce":[],"urlList":[]}}