{"title":"The Chambers Brothers - The Time Has Come (2000 remaster with bo","uid":4759023,"size":385889281,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28b04bbaf759f4aa0688607003861907177241de&amp;dn=The+Chambers+Brothers+-+The+Time+Has+Come+%282000+remaster+with+bo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"travld2","files":15,"time":1236620316,"description":"Track Listings\n1. All Strung Out over You\n2. People Get Ready\n3. I Can't Stand It\n4. Romeo and Juliet\n5. In the Midnight Hour\n6. So Tired\n7. Uptown\n8. Please Don't Leave Me\n9. What the World Needs Now Is Love\n10. Time Has Come Today\n11. Dinah\n12. Falling in Love\n13. Love Me Like the Rain\n14. Time Has Come Today \n\nIf there is one sound that characterizes the music of 'The Chambers Brothers - The Time Has Come', it is the cowbell. It is used to great effect on many of their songs, frequently propelling the music into a funk groove, or as on 'The Time Has Come', acting as a timepiece that morphs into a psychedelic metronome. While The Chambers Brothers first formed in the year I was born, 1954, commercial success eluded them until the release of this album in 1967, and even that success was short-lived. They are something more than a flash-in-the-pan or a one-trick pony, but not by a long-shot, and most of the quality music they did produce is available right here.\n\nBut what a great album this was, and still is. Somewhat swamped by the tide of psychedelia that characterized 1967, this album had to battle for recognition with the likes of The Beatles 'Sgt. Peppers' and Jimi Hendrix's 'Are You Experienced'. But The Chambers Brothers brought to the table a mix of so many genres, that any other artist would be hard pressed to match them at this crossroads in music.\n\nOriginally steeped in Southern Gospel music, the Brothers offer Curtis Mayfield's 'People Get Ready' on this disc, and it takes you back to a whitewashed wooden church on a hot Sunday morning. Influenced by the explosion of soul music in the 1960's, Wilson Pickett's 'In the Midnight Hour' is given an uptempo treatment that may be the very best version of the song available anywhere. It will take you back to a Motown recording studio in the mid-1960's, complete with &quot;do it to it&quot; and &quot;sock it to me&quot; utterances that actually sound sincere, not cheesy.\n\n'Uptown' will take you back to a Harlem rent party, complete with &quot;chitlins, black-eyed peas, barbeque ribs, and collared greens&quot;. 'Please Don't Leave Me' sits you down in a smokey blues club, or in the midst of a harmonizing quartet on a street corner. Even 'What the World Needs Now', a Hal David and Burt Bacharach number manages to generate a funk groove under the Brothers exquisite harmonies. 'I Can't Stand It' and Roy Clarks' 'All Strung Out Over You' rock hard, while 'Romeo and Juliet' and 'So Tired' temper the rampage through soulful respites.\n\nOf course the key song that puts the album over-the-top is the mind-blowing 'Time Has Come Today', all 11 minutes of it. The lead vocal declares that &quot;the soul has been psychedelicized&quot;, and that phrase is an apt description of the song. Bookended by verses, the central section of the song is an exercise in all that psychedelia was, complete with fuzzy guitars squelching, drums rolling, and a sinister laugh that could send shivers up Bela Lugosi's spine. Aside from Iron Butterfly's 'In-a-Gadda-Da-Vida' or The Byrds 'Eight Miles High', it may be the best acid-rock song ever produced.\n\nThis remastered disc also offers four mono recordings by the Brothers. 'Dinah' borrows directly from 'I've Been Working On the Railroad', but the brothers funk it up a bit and take the credit for composing it. 'Love Me Like the Rain' is a nice country-blues song. But the highlight among the bonus tracks is an early recording of 'Time Has Come Today', labeled '(single version one)', though this is different from the abridged album track that moved to number 11 on the national charts in 1968. The track was recorded almost a year to the day that the lengthy album version was recorded. The biggest difference is the sound of the lead guitar, which in some ways is even more psychedelic on the earlier version. The disc concludes with what sounds like a radio advertisement for 'The Time Has Come'. If I didn't know better, I would guess the narrator is Morgan Freeman.\n\nThe Chambers Brothers only charted two other songs in their career, 'I Can't Turn You Loose' (#37 in 1968) and 'Love, Peace, and Happiness' (#96 in 1970). Despite their great success in recording cover songs, the Brothers possessed composing talent. Some of their best songs, such as 'I Can't Stand It', and the title track were their own compositions. The two capabilities mixed with a bit of magic in 1967 to produce an album unlike any other from this era. 'The Time Has Come' is a unique gift of music. The CD is a gift itself, featuring informative liner notes, and a number of quality pictures of the band. Oddly enough the running times for the songs are not listed, though the track listings appear three seperate times.","torrent":{"xt":"urn:btih:28b04bbaf759f4aa0688607003861907177241de","amp;dn":"The+Chambers+Brothers+-+The+Time+Has+Come+%282000+remaster+with+bo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b04bbaf759f4aa0688607003861907177241de","infoHashBuffer":{"type":"Buffer","data":[40,176,75,186,247,89,244,170,6,136,96,112,3,134,25,7,23,114,65,222]},"announce":[],"urlList":[]}}