{"title":"The Real Housewives Of New York City S05E11 This Party Is Toast ","uid":7532563,"size":482265953,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:28ce7d20a7d7e0eead1a9138d25ccf22b0939e7a&amp;dn=The+Real+Housewives+Of+New+York+City+S05E11+This+Party+Is+Toast+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FatFreddy638","files":1,"time":1344985979,"description":"Episode 11: This Party Is Toast \nThe holiday parties continue to be dramatic, with Ramona and Heather facing off again.\nTo celebrate the holidays, Carole hosts a &quot;White Elephant&quot; party for the ladies and their husbands. Aviva brings her father George, who happens to be in town and LuAnn and Heather get their first dose of the sex-crazed patriarch. Sonja arrives to her toaster oven photo shoot over an hour late -- which immediately ticks off Heather, who has organized the entire thing. When they finally begin shooting both campaigns, Heather and her team know their campaign is better, but will Sonja?\n\n Carole has all the ladies over to her apartment to tell them some big news. She finally finished her book and wants to celebrate -- by inviting all the ladies to come with her to St. Barth's for a vacation. The women can't wait to go, minus Aviva who also has a phobia of flying. \n\n Sonja invites all the women to a friend's party and Aviva finds this a perfect time to ask LuAnn about the wine incident with Ramona, which confuses LuAnn as she's already hashed it out with Ramona, and she questions Aviva's intentions. Ramona overhears Heather talking to Aviva and she assumes Heather is talking about her. Ramona goes off screaming at Heather and then storms off.","torrent":{"xt":"urn:btih:28ce7d20a7d7e0eead1a9138d25ccf22b0939e7a","amp;dn":"The+Real+Housewives+Of+New+York+City+S05E11+This+Party+Is+Toast+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28ce7d20a7d7e0eead1a9138d25ccf22b0939e7a","infoHashBuffer":{"type":"Buffer","data":[40,206,125,32,167,215,224,238,173,26,145,56,210,92,207,34,176,147,158,122]},"announce":[],"urlList":[]}}