{"title":"Ophthalmic Lenses {BBS}","uid":7541004,"size":4345695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28df8b72d5ddc594d38a5a93c04c36b68b21e85f&amp;dn=Ophthalmic+Lenses+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345215805,"description":"Dispensing opticians, eye care professionals and the students of optometry are looking for more practical approach to ophthalmic lenses; how they are dispensed and fitted, and what are their applications. With the introduction of this book, probably their search would be over. Days of selling ophthalmic lenses without knowledge are virtually over. Today with so much technology associated behind them, selling approach has to be replaced by dispensing approach. Newer technologies have already come and many more will come. There is a huge necessity of comprehensive information in this field. This book presents information on most of the varieties of ophthalmic lenses available today in the optical market. It will provide you information about how these lenses are made and dispensed to the ultimate user. Detailed information is given in very lucrative language, allowing you to choose the right lens for the people involved in different occupations. Ajay Kumar Bhootra born and brought up in Kolkata, is associated with Himalaya Optical Group, India. The author has a practical experience of more than two decades in ophthalmic lens dispensing and during his work, he has tackled many typical cases with respect to dispensing suitable glasses. He is also one of the pioneers in establishing the Sportvision Optometry in India. Besides this, he has the following books after his name: Opticians Guide, Low Vision Aids Practice, Elite Sport and Vision. 1. Basic Optical Principle 2. Ophthalmic Lens Material and Design 3. Spherical Lenses 4. Astigmatic Lenses 5. Prisms 6. Lens Aberrations 7. Tinted Lens 8. Anti-reflection Coated Lens 9. Aspheric Lenses 10. Bifocal Lenses 11. Progressive Addition Lenses 12. Safety Lenses 13. Surface Treatments 14. Sports Lenses 15. New Development in Spectacle Lenses\n\n# Pdf 228 pages\n# Publisher: Jaypee Brothers Medical Publishers (P) Ltd.; 1ST edition (August 1, 2009)\n# Language: English\n# ISBN-10: 8184486049\n# ISBN-13: 978-8184486049","torrent":{"xt":"urn:btih:28df8b72d5ddc594d38a5a93c04c36b68b21e85f","amp;dn":"Ophthalmic+Lenses+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28df8b72d5ddc594d38a5a93c04c36b68b21e85f","infoHashBuffer":{"type":"Buffer","data":[40,223,139,114,213,221,197,148,211,138,90,147,192,76,54,182,139,33,232,95]},"announce":[],"urlList":[]}}