{"title":"The Truth About Sex, by Gloria Brame, pdf, ebook","uid":11968792,"size":58194808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29acdddeac4974f6a4a47e381de2f734a8988b30&amp;dn=The+Truth+About+Sex%2C+by+Gloria+Brame%2C+pdf%2C+ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tdfj90","files":1,"time":1432763205,"description":"The Truth About Sex, A Sex Primer for the 21st Century Volume I: Sex and the Self, by Gloria Brame Ph.D\n\nBook Description:\n\nHave you ever wondered why we think one type of sex is better than another? Are inhibitions or confusion about sex holding you back? Do you think you're a sex addict? Have you given up on having good orgasms with your partner? Are you worried sex will break up your relationship? The Truth About Sex will set you free.\n\nBrame addresses the most intimate, complicated questions about sex in page-turning, warmly empathic prose. Using cutting-edge sex and medical studies, historical research, and composite case studies from her private practice, she teaches adults how to make sexual ecstasy a reality.\n\nVolume 1, SEX AND THE SELF, is a complete primer on masturbation, orgasm and new models for talking about, thinking about and understanding your inner sexual identity. It includes Dr. Brame's best clinical techniques for improving sexual performance and increasing every adult's potential for complete sexual satisfaction.\n\nISBN-10: 192691855X\nISBN-13: 978-1926918556\n\n\nUploader's Note: Book is in the form of a pdf. All text should be selectable and copyable. I spent many, many hours scanning every page by hand for this upload. Please, do the internet a favour and seed. Also, please, do the the Earth a favour and don't print sections of this book: Save Paper!","torrent":{"xt":"urn:btih:29acdddeac4974f6a4a47e381de2f734a8988b30","amp;dn":"The+Truth+About+Sex%2C+by+Gloria+Brame%2C+pdf%2C+ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29acdddeac4974f6a4a47e381de2f734a8988b30","infoHashBuffer":{"type":"Buffer","data":[41,172,221,222,172,73,116,246,164,164,126,56,29,226,247,52,168,152,139,48]},"announce":[],"urlList":[]}}