{"title":"Shackleton (2002)(dvd5)(Nl subs) RETAIL SAM TBS","uid":8700933,"size":4457831136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:29b07fbd0712a5783b6abdead5b49e16860ec1a7&amp;dn=Shackleton+%282002%29%28dvd5%29%28Nl+subs%29+RETAIL+SAM+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sammynet","files":-1,"time":1374066927,"description":"Shackleton (2002)\n\nDutch\nIn 1914, aan de vooravond van de Eerste Wereldoorlog, vertrekt Sir Ernest\nShackleton met zijn gezelschap naar de Zuidpool, een expeditie die een\nlegendarische reputatie verwierf als de meest barre overlevingstocht aller\ntijden. Nadat zijn schip is vastgelopen en door het ijs wordt verbrijzeld,\nstaat Shackleton voor de moeilijke taak zijn bemanning in veiligheid te\nbrengen. Wij volgen de 28 mannen op hun barre overlevingstocht over de\neindeloze ijsvlakte, de woeste zee en de hoge bergen. Wij zien hoe zij samen\nde elementen trotseren en hun gevaarlijke avontuur uiteindelijk weten te\noverleven. 'Shackleton' is opgenomen op locatie in Antarctica en op\naangrijpende wijze verfilmd.\n\nEnglisch\nAll but forgotten at the time of his death in 1922, controversial British\nexplorer Ernest Shackleton would enjoy a rediscovery of sorts decades later,\nwith dozens of books and filmed documentaries devoted to his &quot;magnificent\nblunder&quot; -- the failed Imperial Trans-Antarctic Expedition of 1914-1916. On\nthe sheer weight of his dynamic personality, Shackleton was able to mount an\nexploratory journey to the Antarctic, accompanied by a crew of 27 men, among\nthem celebrated Australian photographer Frank Day. Alas, Shackleton's ship was\ncrushed by packing ice early in the expedition, forcing the crew to brave the\nmerciless polar elements for a full ten months. Making matters worse, public\nconcern over Shackleton's plight was shunted aside when Great Britain entered\nWWI. First telecast in England on January 2 and 3, 2002, the two-part TV\nbiopic Shackleton stars Kenneth Branagh in the title role. The script does not\nshirk away from the subject's less savory character traits, including his\ndisastrous financial dealings and his blatant unfaithfulness to wife Emily\n(Phoebe Nicholls). Nonetheless, one emerges from the film with a renewed\nrespect and admiration for the visionary Shackleton and his bedraggled\ncompanions. Much of the imagery in Shackleton was based upon the still-\nsurviving films made on the scene by Frank Day, adding extra authenticity to the\ndrama even though the film was made in Greenland and Iceland rather than the\nAntarctic.\n\nSpot Information\nSource............: RETAIL\nFormaat...........: DVD5\nVideo.............: PAL / 16:9\nAudio.............: Dolby Digital 5.1, DTS\nGenre.............: Adventure / Biography / Drama \nSubs..............: Dutch\nMenu..............: Yes\njaar uitgave......: 2002\nCover &amp; label.....: Yes\nAudio.............: Englisch\nSpeelduur.........: 206 minutes\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0272839/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0272839/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/10471&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/10471&lt;/a&gt;\n\nSeeden wordt op prijs gesteld, om deze torrent in leven te houden\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:29b07fbd0712a5783b6abdead5b49e16860ec1a7","amp;dn":"Shackleton+%282002%29%28dvd5%29%28Nl+subs%29+RETAIL+SAM+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29b07fbd0712a5783b6abdead5b49e16860ec1a7","infoHashBuffer":{"type":"Buffer","data":[41,176,127,189,7,18,165,120,59,106,189,234,213,180,158,22,134,14,193,167]},"announce":[],"urlList":[]}}