{"title":"Aleksei Balabanov - Of Freaks and Men (1998)","uid":3756559,"size":735885312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29cf66c9a833f78f149785a59fb16287ef8f3e1c&amp;dn=Aleksei+Balabanov+-+Of+Freaks+and+Men+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clownmonkey","files":3,"time":1185703621,"description":"Alexei Balabanov&amp;#039;s 1998 proto-Freudian bad dream Of Freaks and Men (Pro urodov i lyudey) stands out as a compelling experience, sinuously original and deeply refreshing - although refreshing is perhaps not the exact word for this uniquely unsettling movie. Balabanov&amp;#039;s brutal study of modern Russian gangsterism, Brother, and now this director&amp;#039;s later picture marks him out as a distinctive and very remarkable talent.\n\nShot in a glittering, wintry monochrome, which attains a heavy sepia tint, Of Freaks and Men is set in turn-of-the-century St Petersburg. It imagines the bourgeois origins of Russia&amp;#039;s fledgling porn industry: specifically that catering for images of flagellation and sado-masochism - catching this industry on the cusp of its movement from still photography to rudimentary moving pictures. The film&amp;#039;s periodic silent-movie captions and its daguerreotype-hue are in homage to both media.\n\nFor this flourishing new porn culture, Balabanov invents a milieu of secrecy, exoticism and aberrant strangeness. The result is a disturbing, erotically creepy, funny and touching film whose images will live in your memory.\n\nIt concerns a doctor and his beautiful, blind wife who have adopted a pair of Siamese twins joined at the hip - Tolya and Kolya. The twins&amp;#039; singing ability in adolescence is exploited by their adoptive parents on the stage and they inspire an obsessive following with musical audiences, becoming the toast of polite society.\n\nNearby, a widowed engineer lives with his daughter Lisa in slightly less genteel circumstances, and the two households become connected by a below-stairs taste in pornography. Elaborate studies of naked women being spanked and thrashed with birch twigs are being turned out with fanatical artistic care by the glacial, deadpan Johann (Sergei Makovetsky) and his sinister, grinning sidekick Victor Ivanovich (Victor Sukhorukhov), as a sideline to their respectable portraiture business.\n\nJohann and Victor insinuate themselves into both houses: and their influence coincides with the descent of one of the twins into alcoholism, and the other&amp;#039;s erotic obsession with Lisa. Victor, too, conceives an interest in Ekaterina, the doctor&amp;#039;s wife, and the scene in which he tweaks up her skirts to examine her genitalia - while she appears to stare glassily, ambiguously ahead - is an extraordinary moment.\n\nThere is something very gamey and very kinky in the way Balabanov represents the consumers of Johann&amp;#039;s wares as being women, and this conceit has its own element of pornographic whimsy. Balabanov&amp;#039;s juxtaposition of pornography with the trim, prim world of stage performance and bourgeois musical taste - in the form of Tolya and Kolya&amp;#039;s sensational career on the stage - endows this secret theatre of sexuality with a vulnerability and a terrible pathos.\n\nThe weird rapture of the beatings, which are first photographed, and then filmed, are overlaid with a sadness and an absurdity as Balabanov reveals the emotional relationship that exists between Johann and the old woman - &quot;nanny&quot; - who is wheeled out on camera to administer the punishment.\n\nBalabanov&amp;#039;s St Petersburg is shown as having something in common with Arthur Schnitzler&amp;#039;s Vienna, in which heavily furnished front parlours, upright pianos, mob-capped maids and antimacassars are the primal scenes for unacknowledged yearnings and sexual awakenings, both real and imagined. In Of Freaks and Men, Balabanov parodically invents a kind of prehistory of pornography, or a prehistory of sexual modernity: a deadpan world of suppression, displacement and exclusion in which nameless desires have an intensity for being hidden, but also a mortal and overwhelming sadness.\n\nOf Freaks and Men is close to early David Lynch in its grotesqueness and Balabanov&amp;#039;s images are faintly reminiscent of the photographs of Diane Arbus, with a suggestion of Joel-Peter Witkin, though they have always the solvent of tenderness. And, as in Balabanov&amp;#039;s early movie Happy Days (released here last year), the bowler-hatted Johann and Victor have Beckettian severity and absurdity.\n\nThe extended sequence in which Johann is silently conducted by riverboat to Lisa&amp;#039;s house, where he intends to propose marriage, icily impassive at the prow with his bunch of flowers, is riveting. It is a tremendous performance from Makovetsky, whose inscrutable mien gives him Buster Keaton&amp;#039;s eerie self-possession. Balabanov&amp;#039;s regular player Sukhorukhov is similarly watchable as Johann&amp;#039;s subordinate, displaying low cunning and bad teeth. This is a film of pungent and distinctive flavour, maybe not to all tastes; but, for its originality and style, it must be seen.\nPeter Bradshaw, The Guardian\n\n\nIn Russian with English hardsubs\n\nMy rip\n\n\n--- File Information ---                                                        \n         \nFile Size (in bytes):                           735,623,168                     \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             33          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned               \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid              \nVideo Codec Name(e.g. &quot;DivX 3, Low-Motion&quot;):    XviD                \nDuration (hh:mm:ss):                            01:28:57                \nFrame Count:                                    159960             \nFrame Width (pixels):                           464                  \nFrame Height (pixels):                          288                  \nFrame Aspect Ratio (e.g &quot;1.3333&quot;):                        \nFrame Aspect Ratio (e.g. &quot;4:3&quot;):                             \nPixel Aspect Ratio (&quot;SAR&quot;):                                          \nDisplay Aspect Ratio (&quot;DAR&quot;):                   1.611                     \nFrames Per Second:                              23.96\nVideo Bitrate (kbps):                           933                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP              \n                                                                                \n--- Audio Information ---                                                                  \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3                          \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            116                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2      \n\n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\nwww.freakyflicks.tk\n\nIf we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;      ","torrent":{"xt":"urn:btih:29cf66c9a833f78f149785a59fb16287ef8f3e1c","amp;dn":"Aleksei+Balabanov+-+Of+Freaks+and+Men+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29cf66c9a833f78f149785a59fb16287ef8f3e1c","infoHashBuffer":{"type":"Buffer","data":[41,207,102,201,168,51,247,143,20,151,133,165,159,177,98,135,239,143,62,28]},"announce":[],"urlList":[]}}