{"title":"Sarah Vowell - Unfamiliar Fishes unabridged","uid":6274584,"size":431098030,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2aaf981868654ff1deb5f4f0c9b80b49a49065c9&amp;dn=Sarah+Vowell+-+Unfamiliar+Fishes+unabridged+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rmctmrx6","files":2,"time":1301208767,"description":"Sarah Vowell - Unfamiliar Fishes unabridged 128 kbps\n\n\nRecounting the brief, remarkable history of a unified and independent Hawaii, Vowell, a public radio star and bestselling author (The Wordy Shipmates), retraces the impact of New England missionaries who began arriving in the early 1800s to remake the island paradise into a version of New England. In her usual wry tone, Vowell brings out the ironies of their efforts: while the missionaries tried to prevent prostitution with seamen and the resulting deadly diseases, the natives believed it was the missionaries who would kill them: &quot;they will pray us all to death.&quot; Along the way, and with the best of intentions, the missionaries eradicated an environmentally friendly, laid-back native culture (although the Hawaiians did have taboos against women sharing a table with men, upon penalty of death, and a reverence for &quot;royal incest&quot;). Freely admitting her own prejudices, Vowell gives contemporary relevance to the past as she weaves in, for instance, Obama's boyhood memories. Outrageous and wise-cracking, educational but never dry, this book is a thought-provoking and entertaining glimpse into the U.S.'s most unusual state and its unanticipated twists on the familiar story of Americanization. (Mar.) \n\n\nRead by the author a cast that includes Fred Armisen, Bill Hader, John Hodgman, Catherine Keener, Edward Norton, Keanu Reeves, Paul Rudd, Maya Rudolph, and John Slattery. Music by Michael Giacchino with Grant Lee-Phillips. The score contains excerpts from &quot;Hawai'i Pono'i&quot; (words by David Kalakaua and music by Henri Berger) performed by Grant-Lee Phillips.","torrent":{"xt":"urn:btih:2aaf981868654ff1deb5f4f0c9b80b49a49065c9","amp;dn":"Sarah+Vowell+-+Unfamiliar+Fishes+unabridged+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aaf981868654ff1deb5f4f0c9b80b49a49065c9","infoHashBuffer":{"type":"Buffer","data":[42,175,152,24,104,101,79,241,222,181,244,240,201,184,11,73,164,144,101,201]},"announce":[],"urlList":[]}}