{"title":"Howard Chaykin: Cyberella (Helix)","uid":8667912,"size":75351445,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2adc5207c66f6c8a024cba61dca5bd37e1b1ef7e&amp;dn=Howard+Chaykin%3A+Cyberella+%28Helix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fudoh101","files":12,"time":1373439955,"description":"Cyberella is a comic book series first published in 1996 as part of the short-lived DC Comics imprint, Helix. The title was initially scheduled to be an on-going monthly, but owing to poor sales figures for both it and the Helix line generally, was cancelled after twelve issues in 1997. Written by Howard Chaykin and drawn by Don Cameron the title has been variously described as a techno-satire and a populist cyberpunk dystopia.\n\nSunny Winston is an 'ordinary citizen' who exhibits aberrant behaviour living in the insular consumer-driven society of a near-future Earth.\nKaroshi/Macrocorp has designed a program to keep the human masses under its sway by exploiting their affinity with popular culture. This program is based on 'Lil Ella a cartoon character created by Kelton Mosby the founder of Karoshi/Macrocorp, based on Ella Fiscus, a child star who died in a factory accident. Following Mosby's death, Karoshi/Macrocorp falls under the sway of Bronson Travis and his descendents including Bronson Travis III, the one time lover of Sunny Winston.\nThe Karoshi/Macrocorp plan back-fires and leads to the merging of the persona of Sunny Winston with the 'Lil Ella program. The end-product of this fusion is 'Cyberella' a being imbued with various 'super-powers' (including the ability to meld her mind with others) and who sets about undermining the ambitions of Karoshi/Macrocorp.\nThe events narrated by the comic take place in Slangeliego, &quot;the capital of the twenty first century [and] the greatest city in the world&quot;, a megalopolis stretching the length of the west coastline of the North American continent, from Vancouver in Canada southwards down to Tijuana in Mexico.","torrent":{"xt":"urn:btih:2adc5207c66f6c8a024cba61dca5bd37e1b1ef7e","amp;dn":"Howard+Chaykin%3A+Cyberella+%28Helix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2adc5207c66f6c8a024cba61dca5bd37e1b1ef7e","infoHashBuffer":{"type":"Buffer","data":[42,220,82,7,198,111,108,138,2,76,186,97,220,165,189,55,225,177,239,126]},"announce":[],"urlList":[]}}