{"title":"SIN-ister Secrets - 01 - Arrival of The AntiChrist - Doc Marquis","uid":15695340,"size":2715048568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2b2d6828790d01e7b9f0842248bd0b7f0b1fbc8e&amp;dn=SIN-ister+Secrets+-+01+-+Arrival+of+The+AntiChrist+-+Doc+Marquis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"POtHS11","files":7,"time":1472439260,"description":"SIN-ister Secrets - 01 - Arrival of The AntiChrist - Doc Marquis - 2 discs\r\n\r\nDoc Marquis is a former witch &amp; Illuminati member that was born into this secret society. This dvd give you an inside look at the Illuminati; it's a fountain-head of occult and esoteric knowledge revealed and exposed. Doc is known as an expert in the occult. But this dvd, it is a little pricey but it is well worth is for the knowledge. Sir Francis Bacon coined the term, &quot;knowledge is power!&quot; And in order to understand the enemy, you have to study it and kno how it works from the inside out, you have to research it and read there own writings to understand how it works. Just like cancer, to fight cancer you have you know how it works. Plus if you haven't seen any of Chris Pinto's other videos, then your missing out. He is a awesome directer and film maker. Well Thanks you, and may God bless!!!\r\n\r\n\r\nis DVD is really done as &quot;research material&quot; for those who study the Bible, prophecy, and information on the groups working to create the New World Order. It was not produced for entertainment, and is driven by information rather than production value.\r\n\r\nDoc Marquis is considered an expert on the occult, and presents unique insights that you simply will not find anywhere else. Nevertheless, the DVD is shot as a &quot;talking head&quot; presentation, with minimal graphics and no special effects. In the past, Marquis appeared on Oprah Winfrey, Geraldo Rivera (along with shows like Hard Copy and Inside Edition) -- back in the 80's when they used to do stories on cults, etc. If you value unique research, and the rather &quot;peculiar&quot; personality of Marquis himself, then you will find the presentation fascinating. If you are looking for a &quot;History Channel type&quot; documentary, then this is not for you. If you are looking to be entertained, then this is not for you. But if you want to understand the working of occult societies and how they manipulate the world around us to achieve their aim of creating a global society, this is a great DVD","torrent":{"xt":"urn:btih:2b2d6828790d01e7b9f0842248bd0b7f0b1fbc8e","amp;dn":"SIN-ister+Secrets+-+01+-+Arrival+of+The+AntiChrist+-+Doc+Marquis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b2d6828790d01e7b9f0842248bd0b7f0b1fbc8e","infoHashBuffer":{"type":"Buffer","data":[43,45,104,40,121,13,1,231,185,240,132,34,72,189,11,127,11,31,188,142]},"announce":[],"urlList":[]}}