{"title":"The Power of Small - Why Little Things Make All the Difference","uid":8703243,"size":3572102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b7e404da207d0edc3f7d8d70bd85cca45b36372&amp;dn=The+Power+of+Small+-+Why+Little+Things+Make+All+the+Difference&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"R0thschild","files":5,"time":1374097613,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n\n          Crystal Clean files - Fast Speed! No Virus! No Fake! Enjoy!\n    \n              ***********************************************\nThe Power of Small - Why Little Things Make All the Difference\n\nDetails:\n\nThe Power of Small: Why Little Things Make All the Difference\nEnglish | 160 pages | ISBN-10: 0385526555 | Epub | 2 MB\n\nThe authors of the national bestseller THE POWER OF NICE once again tackle conventional wisdom with a provocative and counterintuitive book about the importance of sweating the small stuff in our lives and in our careers. \n\nOur smallest actions and gestures often have outsized impact on our biggest goals, say Linda Kaplan Thaler and Robin Koval. Did you double-check that presentation one last time, or hold the elevator for a stranger? Going that extra inch - whether with a client, customer, family member, or friend - speaks volumes to others about our talent, personality, and motivations. After all, if we can't take care of the small details, how can we be counted on to deliver when it really matters? \n\nIn today's challenging times, bigger isn't always better. In fact, it's often the baby steps that put us on the path to delivering a true competitive advantage. The real secret to getting ahead in life and in our careers is to refocus our attention on the small details that, if disregarded, can sabotage a multimillion-dollar ad campaign or undermine your most important relationships. Kaplan Thaler and Koval show how to get more of what you want with surprisingly less than you'd imagine. \n\nWritten in the same entertaining, story-driven style that made THE POWER OF NICE the go-to book for finishing first, THE POWER OF SMALL demonstrates how all of us can harness the power of small to improve and reinvent our lives. It's the ultimate guide to shrinking your outlook to broaden your horizons. ","torrent":{"xt":"urn:btih:2b7e404da207d0edc3f7d8d70bd85cca45b36372","amp;dn":"The+Power+of+Small+-+Why+Little+Things+Make+All+the+Difference","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b7e404da207d0edc3f7d8d70bd85cca45b36372","infoHashBuffer":{"type":"Buffer","data":[43,126,64,77,162,7,208,237,195,247,216,215,11,216,92,202,69,179,99,114]},"announce":[],"urlList":[]}}