{"title":"Elseworlds Titles 01 - Justice League of America","uid":7382802,"size":765375365,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2be8e689fb80704f9ae9b0d2b2d37a8c94f31e02&amp;dn=Elseworlds+Titles+01+-+Justice+League+of+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GunningHawk90","files":30,"time":1340553347,"description":"This is a collection of all Justice League comics under the Elseworlds banner.\n\nElseworlds is the publication imprint for a group of comic books produced by DC Comics that take place outside the company's canon. The imprint presents narratives in which existing characters, such as Batman, or storylines are introduced to an entirely new idea or concept.\n\nJLA: Act of God (2001) - When a strange energy hits Earth, heroes and villains alike lose their superpowers. Some refuse to give in to defeat, while others disappear into the woodwork, and still others undergo a &quot;rebirth&quot; as the Phoenix Group. (3 issues)\n\nJLA: Age of Wonder (2003) - A Justice League created during the Industrial Age. (2 issues)\n\nJLA: Created Equal (2000) - A cosmic plague hits Earth, killing all men except for Superman and Lex Luthor. (2 issues)\n\nJLA: Destiny (2002) - In a world where Superman and Batman never existed, Thomas Wayne creates his own Justice League. (4 issues)\n\nJLA: The Island of Dr. Moreau (2002) - Set in the 1880s, the League is combined with Dr. Moreau's animal-men.\n\nJLA: The Nail (1998) - The world is without Superman after a punctured tire prevents the discovery of baby Kal-El by the Kents. The Justice League is a group of heroes whom the media deem as dangerous aliens as a lethal conspiracy seeks to undermine all they stand for. (3 issues, collected)\n\nJLA: Another Nail (2004) - With the discovery of Superman and his addition to the JLA, the heroes must maintain their good face to the public. (3 issues)\n\nJLA: Riddle of the Beast (2001) - High fantasy story as young Robin Drake leads the armies of the World against Etrigan. (HC)\n\nJLA: The Secret Society of Super-Heroes (2000) - Superpowered beings keep their existence quiet; the JLA becomes an unaccountable conspiracy. (2 issues)\n\nJLA: Shogun of Steel (2002) - Set in feudal Japan.\n\nJustice Riders (1997) - The JLI as a group of marshals, gamblers, inventors, and various other characters in the Old West.\n\nLeague of Justice (1996) - A quartet of teenagers find themselves joined up with fantasy fiction versions of the Justice League heroes. (2 issues)\n\nPlanetary/JLA: Terra Occulta (2002) - An alternate version of the Planetary team meet an alternate version of the JLA triumvirate - Batman, Superman and Wonder Woman.\n\nWhom Gods Destroy (1997) - is a series, about Superman and Wonder Woman, involves Greek mythology and alternate history projected into the future.\n\nJLA Seven Caskets","torrent":{"xt":"urn:btih:2be8e689fb80704f9ae9b0d2b2d37a8c94f31e02","amp;dn":"Elseworlds+Titles+01+-+Justice+League+of+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be8e689fb80704f9ae9b0d2b2d37a8c94f31e02","infoHashBuffer":{"type":"Buffer","data":[43,232,230,137,251,128,112,79,154,233,176,210,178,211,122,140,148,243,30,2]},"announce":[],"urlList":[]}}