{"title":"The Standard Model and Beyond - (Malestrom)","uid":6335767,"size":75732072,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d920bfbe7be1886a2bf2e75c95f501f39e2dbc1&amp;dn=The+Standard+Model+and+Beyond+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1303459063,"description":"\n\nPaul Langacker, &quot;The Standard Model and Beyond (Series in High Energy Physics, Cosmology and Gravitation)&quot;\nHardcover: 675 pages\nPublisher: Taylor &amp; Francis (December 1, 2009)\nLanguage: English\nISBN-10: 1420079069\nISBN-13: 978-1420079067\n\n\nThe Standard Model and Beyond presents an advanced introduction to the physics and formalism of the standard model and other non-abelian gauge theories. It provides a solid background for understanding supersymmetry, string theory, extra dimensions, dynamical symmetry breaking, and cosmology.\n\n\nThe book first reviews calculational techniques in field theory and the status of quantum electrodynamics. It then focuses on global and local symmetries and the construction of non-abelian gauge theories, before explaining the structure and tests of quantum chromodynamics. The book also describes the electroweak interactions and theory, including neutrino masses. The final chapter discusses the motivations for extending the standard model and examines supersymmetry, extended gauge groups, and grand unification.\n\n\nThoroughly covering gauge field theories, symmetries, and topics beyond the standard model, this text equips readers with the tools to understand the structure and phenomenological consequences of the standard model, to construct extensions, and to perform calculations at tree level. It establishes the necessary background for readers to carry out more advanced research in particle physics.","torrent":{"xt":"urn:btih:2d920bfbe7be1886a2bf2e75c95f501f39e2dbc1","amp;dn":"The+Standard+Model+and+Beyond+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d920bfbe7be1886a2bf2e75c95f501f39e2dbc1","infoHashBuffer":{"type":"Buffer","data":[45,146,11,251,231,190,24,134,162,191,46,117,201,95,80,31,57,226,219,193]},"announce":[],"urlList":[]}}