{"title":"Harrie Jekkers Met een goudvis naar zee.avi","uid":4735249,"size":1439188480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d96d897c63757560bcd65fdf74aa990b8239ddc&amp;dn=Harrie+Jekkers+Met+een+goudvis+naar+zee.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rocco64","files":1,"time":1235246144,"description":"In zijn derde theaterprogramma zingt en vertelt Harrie Jekkers over zijn eigen leven. Regelmatig roept hij op het podium zijn ikken bij elkaar. Al deze ikken komen tijdens nachterlijke vergaderingen aan de keukentafel met verhalen en liederen aan het woord. Zijn ik van 9 jaar, die langs het vliegertouw telegrammen verstuurt naar God, zijn opstandige ik van 20 jaar die als kritisch dienstplichtig soldaat het leger van binnenuit verandert, zijn ik van 30 die de wereld beschouwt vanuit de kroeg en de zaken door de bodem van zijn bierglas wat genuanceerder bekijkt. Als zijn ikken te ver gaan, grijpt Jekkers in en af en toe pakt hij zelf als ik van 40 ook nog flink uit. \nHij keert zich in liedjes tegen eenzame leeftijdsgenoten die radeloos op zoek zijn naar een partner en tegen ingeslapen stelletjes die, bij gebrek aan beter, vluchten in onzinnige hobby's zoals b.v. treinspotten. Tijdens deze reis door de tijd vertelt hij regelmatig over zijn Haagse oom Jan, die de verschillende ikken van Harrie Jekkers rijkelijk voorziet van goede raad en zinvolle adviezen: Als je teveel tegenwind hebt, kun je beter zelf gaan liggen, In deze tijd waarin goden en ideologen van hun voetstuk zijn gevallen, zet Jekkers een goudvis op de leeggekomen sokkel: zijn dromen en idealen uit zijn kindertijd die hij nog altijd met zich meedraagt. Of zoals hij zelf zingt: Je moet vliegen in je dromen om later van de grond te komen. \nOndertitelsporen: Nederlands Doven en Slechthorenden\nBeeldformaat: 4:3\nMenuschermen beschikbaar in: Nederlands\nAudio: Stereo Nederlands \n\n","torrent":{"xt":"urn:btih:2d96d897c63757560bcd65fdf74aa990b8239ddc","amp;dn":"Harrie+Jekkers+Met+een+goudvis+naar+zee.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d96d897c63757560bcd65fdf74aa990b8239ddc","infoHashBuffer":{"type":"Buffer","data":[45,150,216,151,198,55,87,86,11,205,101,253,247,74,169,144,184,35,157,220]},"announce":[],"urlList":[]}}