{"title":"Lowell George - Thanks I'll Eat It Here [1979] [FLAC]","uid":8046336,"size":201841076,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d9dc1cf30e286da969be2d7792db8fdfdbb9e8d&amp;dn=Lowell+George+-+Thanks+I%27ll+Eat+It+Here+%5B1979%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1358756043,"description":"Artist: Lowell George\nRelease: Thanks I'll Eat It Here\nDiscogs: 1420436\nReleased: 1979-03-23 / 1992\nLabel: Warner Bros. Records\nCatalog#: BSK 3194 / 7599-26755-2\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Germany\nStyle: Rock, Southern Rock, Classic Rock\n\nTracklisting:\n\n01. What Do You Want The Girl To Do (4:49)\n02. Honest Man (3:45)\n03. Two Trains (4:37)\n04. Can't Stand The Rain (3:22)\n05. Cheek To Cheek (2:24)\n06. Easy Money (3:32)\n07. 20 Million Things (2:51)\n08. Find A River (3:45)\n09. Himmler's Ring (2:28)\n\nThanks I'll Eat it Here is strikingly different from the fusion-leanings of Little Feat's last studio album, Time Loves a Hero. Lowell George never cared for jazz-fusion, so it should be little surprise that there's none to be heard on Thanks. Instead, he picks up where Dixie Chicken left off (he even reworks that album's standout &quot;Two Trains&quot;), turning in a laid-back, organic collection of tunes equal parts New Orleans R&amp;B, country, sophisticated blues, and pop. George wasn't in good health during the sessions for Thanks, which you wouldn't tell by his engaging performances, but from the lack of new tunes. Out of the nine songs on the album, only three are originals, and they're all collaborations. That's a drawback only in retrospect -- it's hard not to wish that the last album George completed had more of his own songs -- but Lowell was a first-rate interpreter, so even covers of Allen Toussaint (&quot;What Do You Want the Girl to Do&quot;), Ann Peebles (&quot;I Can't Stand the Rain&quot;) and Rickie Lee Jones (&quot;Easy Money&quot;) wind up sounding of piece with the original songs. George's music rolls so easy, the album can seem a little slight at first, but it winds up being a real charmer. Yes, a few songs drift by and, yes, Jimmy Webb's vaudevellian &quot;Himmler's Ring&quot; feels terribly out of place, but Lowell's style is so distinctive and his performances so soulful, it's hard not to like this record if you've ever had a fondness for Little Feat. After all, it's earthier and more satisfying than any Feat album since Feats Don't Fail Me Now and it has the absolutely gorgeous &quot;20 Million Things,&quot; the last great song George ever wrote.\n\nUnusually for a first solo album from a singer-songwriter, of the nine tracks on the original release only four were written by George, and of these three were collaborations. &quot;Two Trains&quot;, &quot;Easy Money&quot; and &quot;Can't Stand the Rain&quot; were cover versions.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:2d9dc1cf30e286da969be2d7792db8fdfdbb9e8d","amp;dn":"Lowell+George+-+Thanks+I%27ll+Eat+It+Here+%5B1979%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d9dc1cf30e286da969be2d7792db8fdfdbb9e8d","infoHashBuffer":{"type":"Buffer","data":[45,157,193,207,48,226,134,218,150,155,226,215,121,45,184,253,253,187,158,141]},"announce":[],"urlList":[]}}