{"title":"CloneBrews Clone Brews - 2nd Edition - ***FIXED***","uid":13145611,"size":34422004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2de0d8637132dedf311adf3d83257730af81a3fc&amp;dn=CloneBrews+Clone+Brews+-+2nd+Edition+-+%2A%2A%2AFIXED%2A%2A%2A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hheyyouguys","files":4,"time":1452023291,"description":"CloneBrews Clone Brews - 2nd Edition - ***FIXED***\r\n\r\nnot sure what happened with the first torrent and why files weren't working. regardless, here is a working copy\r\n\r\n---------------------\r\n\r\nCloneBrews, 2nd Edition: Recipes for 200 Commercial Beers \r\nby Szamatulski, Tess and Mark (May 17, 2010)\r\n\r\n\r\nBrewing home versions of popular commercial beers has never been simpler or more fun than it is with the 200 recipes in CloneBrews. Home brewers will find everything they need to brew up a batch of their own clone of Magic Hat #9, Ithaca Brown Ale, Moose Drool, or Samuel Adams Boston Ale. And with 200 possibilities to choose from, home brewers will find the perfect taste for every mood and every season.\r\n\r\nRevised, updated, and expanded, the second edition of CloneBrews contains 50 new recipes that reflect the current popularity of strongly hopped India pale ales and American pale ales as well as the growing interest in brown ales, imperial beers, English bitters, porters, stouts, wheat beers, and Belgian ales. The new edition also contains expanded and updated mashing guidelines and a complete review of ingredients and materials. All new to the second edition is a Food Pairing feature that recommends the best foods for every beer an indispensable feature for the brewer who also loves to barbecue or cook!\r\n\r\nTested and retested, tasted and retasted, Tess and Mark Szamatulskis recipes are the product of 20 years spent running a successful homebrew supply shop and working with customers to create perfect beer clones. They deliver the flavors that home brewers want, described in clear recipes that every brewer will want to make. \r\n\r\n\r\n--------------------------------------------------------------\r\n--------------------------------------------------------------\r\n\r\nCheck out my other Brewing Books, Zymurgy and BYO torrents\r\n                                        \nhttp://thepiratebay.se/user/hheyyouguys\t(NOTE: If TPB keeps changing domains (ie... .org to .sx to .se), you will have to change it yourselves to see my other torrents)\t \r\n\r\n\r\n***************************************\r\n\t\t\t\r\nAlways looking for new brewing books digital or otherwise. If you have ones you want to share, use email above to contact me.\r\n\r\n***************************************","torrent":{"xt":"urn:btih:2de0d8637132dedf311adf3d83257730af81a3fc","amp;dn":"CloneBrews+Clone+Brews+-+2nd+Edition+-+%2A%2A%2AFIXED%2A%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2de0d8637132dedf311adf3d83257730af81a3fc","infoHashBuffer":{"type":"Buffer","data":[45,224,216,99,113,50,222,223,49,26,223,61,131,37,119,48,175,129,163,252]},"announce":[],"urlList":[]}}