{"title":"Next Generation Excel (gnv64)","uid":9214959,"size":130720433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e44ff83f2e3a79ed095aa9c24b8890a4d9c8035&amp;dn=Next+Generation+Excel+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1384847478,"description":"Next Generation Excel: Modeling In Excel For Analysts And MBAs (For MS Windows And Mac OS)(2nd Ed)\nby Isaac Gottlieb \nWiley | March 2013 | ISBN-10: 1118469100 | PDF | 304 pages | 124 mb &lt;a href=&quot;\nhttp://www.amazon.com/Next-Generation-Excel-Modeling-Analysts/dp/1118469100&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Next-Generation-Excel-Modeling-Analysts/dp/1118469100&lt;/a&gt;\n\nTake Excel to the next level in accounting and financial modeling.\nMost Excel users never realize just how powerful the program really is. Featuring more than 400 functions, Excel is packed with an array of complex data mining, analytical, statistical, and graphical representation tools and other powerful features of inestimable value to business professionals. But learning how to exploit those features with confidence can be tricky, even overwhelming, for the casual user: Enter Next Generation Excel, Second Edition.\nGrowing out of Dr. Gottlieb's many years of teaching university classes, as well as his extremely popular corporate workshops, Next Generation Excel, Second Edition is based upon his well-founded conviction that, when it comes to teaching people how to use and get the most out of complex software, &quot;show, don't tell&quot; is the golden rule.\n\nStaying true to that philosophy, he eschews the lengthy, often perplexing, verbal explanations typical of such guides in favor of bite-sized descriptive passages, liberally supplemented with Excel-in-action screenshots, skill-building exercises, and review questions. Also, for ease of reference, each subject-specific chapter is self-contained, affording you the option of focusing on only those features of immediate interest to you. Demystifying the obscure and simplifying the complex, Dr. Gottlieb walks you, step by step, through all of Excel 2010's advanced business and finance functions (with explanations for users of Excel 2007, 2003, and previous versions, as needed), including:\n\n-    Financial tools, including NVP and IRR\n-    Data mining using Pivot Tables\n-    Charting, sparklines, and other advanced charting options\n-    Data analysis tools\n-    What-if analysis\n-    Statistics for non-statisticians\n-    Accounting functions, including amortization tables and depreciation functions\n\nNot just another general how-to Excel guide, this fully updated and expanded Second Edition of Isaac Gottlieb's internationally acclaimed Next Generation Excel shows you how to harness the full power of Excel to help you to perform an array of advanced business decision making, financial, and accounting functions. You'll learn how to quickly create models that deliver accurate, relevant information to boost efficiency, improve your forecasting ability, and perform an array of other crucial business and reporting functions. \n\nAbout the Author &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/9f/ee/d4b940245f0a0ad8976f4d.L._V376238267_SY470_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/9f/ee/d4b940245f0a0ad8976f4d.L._V376238267_SY470_.jpg&lt;/a&gt;\nDr. Isaac Gottlieb earned his PhD in Management Engineering from Columbia University. He is a clinical professor at the Fox Business School of Temple University and has over 15 years of industrial experience. He has taught Excel over the last 15 years to over 30,000 MBA, executive MBA, MS, PhD and undergraduate students at Columbia, NYU, Temple, and other universities. He has conducted numerous corporate seminars in the United States and abroad.\nAs a result of years of teaching, Dr. Gottlieb has found that step-by-step and hands-on approaches are the most effective learning tools.","torrent":{"xt":"urn:btih:2e44ff83f2e3a79ed095aa9c24b8890a4d9c8035","amp;dn":"Next+Generation+Excel+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e44ff83f2e3a79ed095aa9c24b8890a4d9c8035","infoHashBuffer":{"type":"Buffer","data":[46,68,255,131,242,227,167,158,208,149,170,156,36,184,137,10,77,156,128,53]},"announce":[],"urlList":[]}}