{"title":"The Cure for Modern Life - Lisa Tucker.epub","uid":9739800,"size":2197524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e704716960af9fcf8ed22cee80e9db516fcdc44&amp;dn=The+Cure+for+Modern+Life+-+Lisa+Tucker.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1394493966,"description":"From Lisa Tucker, the critically acclaimed author of Once Upon a Day and The Song Reader, comes an extraordinary novel about the way we live now: the choices we make and the decisions we let life make for us.\n\nMatthew and Amelia were once in love and planning to raise a family together, but a decade later, they have become professional enemies. To Amelia, who has dedicated her life to medical ethics, Matthew's job as a high-powered pharmaceutical executive has turned him into a heartless person who doesn't care about anything but money. Now they're kept in balance only by Matthew's best and oldest friend, Ben, a rising science superstar -- and Amelia's new boyfriend.\n\nThat balance begins to crumble one night when, coming home to his upscale Philadelphia loft, Matthew finds himself on a desolate bridge face-to-face with a boy screaming for help. Homeless for most of his life, ten-year-old Danny is as streetwise as he is world-weary, and his desperation to save his three-year- old sister means he will do whatever it takes to get Matthew's help. What follows is an escalating game of one-upmanship between Matthew, Amelia, and Danny, as all three players struggle to defend what is most important to them -- and are ultimately forced to reconsider what they truly want.\n\nDazzlingly written with a riveting story that will resonate with readers everywhere, Lisa Tucker's The Cure for Modern Life is a smart, humorous, big-hearted novel about what it means in the twenty-first century to be responsible, to care about other people, and to do the right thing.","torrent":{"xt":"urn:btih:2e704716960af9fcf8ed22cee80e9db516fcdc44","amp;dn":"The+Cure+for+Modern+Life+-+Lisa+Tucker.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e704716960af9fcf8ed22cee80e9db516fcdc44","infoHashBuffer":{"type":"Buffer","data":[46,112,71,22,150,10,249,252,248,237,34,206,232,14,157,181,22,252,220,68]},"announce":[],"urlList":[]}}