{"title":"Brian Whitaker - Unspeakable Love: Gay Life in the Middle East","uid":6939920,"size":849524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ed25783c6eb6f185b76f0022df456c45e21761f&amp;dn=Brian+Whitaker+-+Unspeakable+Love%3A+Gay+Life+in+the+Middle+East&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1325969364,"description":"Unspeakable Love: Gay and Lesbian Life in the Middle East\n\nHomosexuality is a taboo subject in Arab countries. Clerics denounce it as a heinous sin, while newspapers write cryptically of &quot;shameful acts.&quot; Although many parts of the world now accept sexual diversity, the Middle East is moving in the opposite direction. In this absorbing account, journalist Brian Whitaker calls attention to the voices of men and women who are struggling with gay identities in societies where they are marginalized and persecuted by the authorities. He paints a disturbing picture of people who live secretive, fearful lives and who are often jailed, beaten, and ostracized by their families, or sent to be &quot;cured&quot; by psychiatrists.\n\nWhitaker's exploration of changing sexual behavior in the Arab world reveals that--while deeply repressive prejudices and stereotypes still govern much thinking about homosexuality--there are pockets of change and tolerance. The author combines personal accounts from individuals in the region with a look at recent Arab films and novels featuring gay characters and conducts a sensitive comparative reading of Christian, Jewish, and Islamic strictures around sexuality. Deeply informed and engagingly written, Unspeakable Love draws long overdue attention to a crucial subject. \n\nAuthor: Brian Whitaker\nPublisher: University of California Press\nPublication Date: November 6, 2006\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2ed25783c6eb6f185b76f0022df456c45e21761f","amp;dn":"Brian+Whitaker+-+Unspeakable+Love%3A+Gay+Life+in+the+Middle+East","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ed25783c6eb6f185b76f0022df456c45e21761f","infoHashBuffer":{"type":"Buffer","data":[46,210,87,131,198,235,111,24,91,118,240,2,45,244,86,196,94,33,118,31]},"announce":[],"urlList":[]}}