{"title":"History, Historians, and Conservatism in Britain and America Fro","uid":9406209,"size":3752832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f0cdc30344a96bca01dab9bab26bcf28f4c97c9&amp;dn=History%2C+Historians%2C+and+Conservatism+in+Britain+and+America+Fro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":6,"time":1388164797,"description":": History, Historians, and Conservatism in Britain and America examines the subjects, motives, and personal and intellectual origins of conservative historians who were also successful public intellectuals. In their search for a persuasive and wide appeal, conservatives depended until at least the 1960s upon history and historians to provide conservative concepts with authority and authenticity. Beginning with the Great War in Britain and the Second World War in America, conservative historians participated actively and influentially in debates about the heart, soul, and especially the mind of conservatism. Particular emphasis is placed on four historians in Britain--F. J. C. Hearnshaw, Keith Feiling, Arthur Bryant, and Herbert Butterfield--and three in America-Daniel Boorstin, Peter Viereck, and Russell Kirk-who developed conservative responses to unprecedented and threatening events both at home and abroad. These historians shared basic assumptions about human nature and society, but their subjects, interpretations, conclusions, and prescriptions were independent and idiosyncratic. Uniquely close to powerful political figures, each historian also spoke directly to a large public, which bought their books, read their contributions to newspapers and journals, listened to them on the radio, and watched them on television. \nProvocative and compelling, Reba Soffer's pioneering study provides a comprehensive explanation of the content, context, and consequences of conservative ideas that became dominant in Britain and remained marginal in America until the Reagan ascendancy.","torrent":{"xt":"urn:btih:2f0cdc30344a96bca01dab9bab26bcf28f4c97c9","amp;dn":"History%2C+Historians%2C+and+Conservatism+in+Britain+and+America+Fro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f0cdc30344a96bca01dab9bab26bcf28f4c97c9","infoHashBuffer":{"type":"Buffer","data":[47,12,220,48,52,74,150,188,160,29,171,155,171,38,188,242,143,76,151,201]},"announce":[],"urlList":[]}}