{"title":"CP 11.THE WRATH OF ANGELS.John Connolly.mb4","uid":8761592,"size":430544834,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f74066ca0595236f0e54e7651802e4026dbc251&amp;dn=CP+11.THE+WRATH+OF+ANGELS.John+Connolly.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":1,"time":1375253077,"description":"In the depths of the Maine woods, the wreckage of an aeroplane is discovered. There are no bodies, and no such plane has ever been reported missing, but men both good and evil have been seeking it for a long, long time. What the wreckage conceals is more important than money: it is power. Hidden in the plane is a list of names, a record of those who have struck a deal with the Devil. Now a battle is about to commence between those who want the list to remain secret and those who believe that it represents a crucial weapon in the struggle against the forces of darkness.\n\nThe race to secure the prize draws in private detective Charlie Parker, a man who knows more than most about the nature of the terrible evil that seeks to impose itself on the world, and who fears that his own name may be on the list. It lures others too: a beautiful, scarred woman with a taste for killing; a silent child who remembers his own death; and the serial killer known as the Collector, who sees in the list new lambs for his slaughter.\n\nBut as the rival forces descend upon this northern state, the woods prepare to meet them, for the forest depths hide other secrets.\n\nSomeone has survived the crash.\nSomething has survived the crash.\nAnd it is waiting . . .","torrent":{"xt":"urn:btih:2f74066ca0595236f0e54e7651802e4026dbc251","amp;dn":"CP+11.THE+WRATH+OF+ANGELS.John+Connolly.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f74066ca0595236f0e54e7651802e4026dbc251","infoHashBuffer":{"type":"Buffer","data":[47,116,6,108,160,89,82,54,240,229,78,118,81,128,46,64,38,219,194,81]},"announce":[],"urlList":[]}}