{"title":"Aerosmith - Permanent Vacation (1987) 320 vtwin88cube","uid":6182905,"size":131938578,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:306de57631cb6f653215fc2ff9797da7700bd873&amp;dn=Aerosmith+-+Permanent+Vacation+%281987%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1298018253,"description":"\n\nAerosmith\nPermanent Vacation (1987)\nRemastered\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond.\n\nIn the meantime, they developed a prototype for power ballads with &quot;Dream On,&quot; a piano ballad that was orchestrated with strings and distorted guitars. Aerosmith's ability to pull off both ballads and rock &amp; roll made them extremely popular during the mid-'70s, when they had a string of gold and platinum albums. By the early '80s, the group's audience had declined as the band fell prey to drug and alcohol abuse. However, their career was far from over -- in the late '80s, Aerosmith pulled off one of the most remarkable comebacks in rock history, returning to the top of the charts with a group of albums that equalled, if not surpassed, the popularity of their '70s albums.\n\nIn 1970, the first incarnation of Aerosmith formed when vocalist Steven Tyler met guitarist Joe Perry while working at a Sunapee, NH, ice cream parlor. Tyler, who originally was a drummer, and Perry decided to form a power trio with bassist Tom Hamilton. The group soon expanded to a quartet, adding a second guitarist called Ray Tabano; he was quickly replaced by Brad Whitford, a former member of Earth Inc. With the addition of drummer Joey Kramer, Tyler became the full-time lead singer by the end of year. Aerosmith relocated to Boston at the end of 1970. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tFlac Conversion\n\nThe much-ballyhooed reunion of the original Aerosmith lineup had pretty much fallen flat on its face after 1985's hit-and-miss Done With Mirrors. Realizing that the band simply couldn't do it alone, A&amp;R guru John Kalodner capitalized on the runaway success of Run-D.M.C.'s cover of &quot;Walk This Way&quot; and decided to draft in the day's top hired hands, including knob-twiddler extraordinaire Bruce Fairbairn and career-revitalizing song doctors Desmond Child and Jim Vallance. Together, they would help craft Permanent Vacation, the album which would reinvent Aerosmith as '80s and '90s superstars. Yet, despite the mostly stellar songwriting, which makes it a strong effort overall, some of the album's nooks and crannies haven't aged all that well because of Fairbairn's overwrought production, featuring an exaggerated sleekness typical of most mid-'80s pop-metal albums. Furthermore, Desmond Child's pedantic writing often compromises the timeliness of even the best material. On the other hand, pre-fab radio gems like &quot;Rag Doll&quot; and &quot;Dude (Looks Like a Lady)&quot; remain largely unassailable from a &quot;delivering the goods&quot; perspective. But remember kids, this is Aerosmith, so that can only mean one thing: a guaranteed number of incredible tracks for any time and place. These include the earthy voodoo blues of &quot;St. John&quot; and the excellent hobo-harmonica fable of &quot;Hangman Jury.&quot; And, although some of the remaining cuts lean to the filler side, both the awkwardly Caribbean title track and the cover of the Beatles' &quot;I'm Down&quot; are well executed. Finally, the crowd-pleasing schmaltz of &quot;Angel&quot; showcases the band at the peak of its power ballad cheese. A valiant effort, this album proved to be the crucial catalyst in reintroducing Aerosmith to the masses, but if you're looking for an even better example of the band's renewed strength, check out Pump first. \n\n01.Heart's Done Time\n02.Magic Touch\n03.Rag Doll\n04.Simoriah\n05.Dude (Looks Like A Lady)\n06.St. John\n07.Hangman Jury\n08.Girl Keeps Coming Apart\n09.Angel\n10.Permanent Vacation\n11.I'm Down\n12.The Movie\n\n\nCheers!","torrent":{"xt":"urn:btih:306de57631cb6f653215fc2ff9797da7700bd873","amp;dn":"Aerosmith+-+Permanent+Vacation+%281987%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306de57631cb6f653215fc2ff9797da7700bd873","infoHashBuffer":{"type":"Buffer","data":[48,109,229,118,49,203,111,101,50,21,252,47,249,121,125,167,112,11,216,115]},"announce":[],"urlList":[]}}