{"title":"Happenstance Series - Jamie McGuire","uid":13503502,"size":1128537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30ed286ba46e1130177b9728a3dc24a77a99e38e&amp;dn=Happenstance+Series+-+Jamie+McGuire&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1455228945,"description":"01. Happenstance [Happenstance, #1]- Jamie McGuire\r\n\r\n#1 New York Times Bestseller Jamie McGuire returns to self-publishing with this page-turning YA account of Erin Easter, one of three Erins in the small senior class of rural Blackwell High School who not only share a first name, but also their birthday. Erin Easter, raised by a neglectful single mom, keeps to herself and admires Weston Gates from afar. The other Erins, Erin A. and Erin M. are the darlings of the community: daughters of the two wealthiest families in town, best friends, cheerleaders, and everything Erin Easter isn't—and they never let her forget it. Erin A. has even claimed Weston since the 8th grade.\r\n\r\nWeston is a well-liked star athlete, and the son of two prominent attorneys. He struggles daily with the pressures of living up to his family name and secretly empathizes with Erin Easter's feeling that she belongs somewhere else; in a different life. Not until he begins sneaking nights out with Erin does he gain the courage to buck expectations and acknowledge his feelings... both for his future, and for her.\r\n\r\nBut when a shocking tragedy rocks the tiny town, Erin's life is turned upside down in the best way possible. But when the truth is revealed and everything Erin thinks she wanted falls into her lap, life only becomes more complicated.\r\n\r\n02. Happenstance 2 [Happenstance, #2]- Jamie McGuire\r\n\r\nErin Easter was now Erin Alderman, because Erin Alderman was dead.\r\n\r\nIn the second installment of this USA Today bestselling series, follow protagonist Erin, a high school senior in tiny Blackwell, Oklahoma. After a terrible accident leaves two classmates dead, Erin learns that she was switched at birth. Shortly after, she moves into the home of her true parents, Sam and Julianne Alderman, transforming Erin over night from pariah of Blackwell High School, to the only child of one of the most affluent couples in town.\r\n\r\nAlso being pursued by her childhood crush, Weston Gates, the dream she once had is now reality. But when Erin stumbles upon secrets that give her the answers she’s been searching for, she also finds a truth she never wanted to know.\r\n\r\n\r\n03. Happenstance 3 [Happenstance, #3]- Jamie McGuire\r\n\r\nBe careful what you wish for. You just might get it all.\r\n\r\nNow that Erin has learned the truth about the girls who tortured her, and about the boy she loves, she finds her time before graduation dwindling at an alarming and exciting pace. What used to be summer break was now a countdown to her final days in Blackwell. Her parents, Sam and Julianne struggle with the fear that just when they’ve found Erin, they must let her go, and the tension is higher than it’s been since Erin discovered who she really was.\r\n\r\nFinally with the girl he’s loved since childhood, Weston grows more desperate as the summer days pass. He and Erin will go to separate colleges. His biggest fear is that this means they’ll go their separate ways. Plagued with making the best of the time he has left with Erin, and finding a way to make it last, Weston finds himself in a different state of mind hourly. He is just beginning to realize that hope is like quicksand. The harder Weston struggles, the faster Erin sinks","torrent":{"xt":"urn:btih:30ed286ba46e1130177b9728a3dc24a77a99e38e","amp;dn":"Happenstance+Series+-+Jamie+McGuire","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30ed286ba46e1130177b9728a3dc24a77a99e38e","infoHashBuffer":{"type":"Buffer","data":[48,237,40,107,164,110,17,48,23,123,151,40,163,220,36,167,122,153,227,142]},"announce":[],"urlList":[]}}