{"title":"Real World Adobe Illustrator CS2 (PDF)","uid":8169455,"size":3141365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30f07cef52294a6514a9a0348348805dab9dd338&amp;dn=Real+World+Adobe+Illustrator+CS2+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HighTekky","files":1,"time":1361395260,"description":"From back cover:\n\nHow do you define a serious Illustrator user? How about  one who uses Illustrator to produce robust and professional-looking  vector graphics but also needs the program to be flexible and efficient in workflow and production cycles. If this describes you or  the user you strive to be, then you need this book Filled with the industrial-strength techniques and best practices required to get you up to speed fast on Illustrator CS2 without missing a beat in your production workflow, Real World Adobe Illustrator CS2 is the  definitive reference for the serious Illustrator user. Thoroughly updated for this version of the software, Illustrator pro Mordy Golding offers a complete guide to the new features such as Live Trace, Live Paint, the Control Palette, Custom Workspaces, and expanded  support for Mobile devices, to name a few. You'll also find practical insights on creating type, symbols, graphs, color, effects, Web  graphics, and more. Along with tips, sidebars, and expert commentary, there are also numerous illustrations and screen shots included to offer readers the most complete coverage on this extraordinary application. Designers from all fields--illustrators, animators, package designers, graphic designers, web designers, and more--will  find Real World Adobe Illustrator CS2 their one-stop guide to creating powerful designs in Illustrator CS2.","torrent":{"xt":"urn:btih:30f07cef52294a6514a9a0348348805dab9dd338","amp;dn":"Real+World+Adobe+Illustrator+CS2+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30f07cef52294a6514a9a0348348805dab9dd338","infoHashBuffer":{"type":"Buffer","data":[48,240,124,239,82,41,74,101,20,169,160,52,131,72,128,93,171,157,211,56]},"announce":[],"urlList":[]}}