{"title":"ESET NOD32 Antivirus for Mac beta 2","uid":5624328,"size":34646020,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3102e0517352477555b5b7269d7723f3dcdc3614&amp;dn=ESET+NOD32+Antivirus+for+Mac+beta+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LH-TAIMI","files":1,"time":1276418112,"description":"-----------------------------------------------------------------------------------\nEset Nod 32 For Mac Beta 2\n-----------------------------------------------------------------------------------\nSize: 33.04 Mb\n-----------------------------------------------------------------------------------\nFile: dmg\n-----------------------------------------------------------------------------------\nDownloaded from: http://beta.eset.com/\n-----------------------------------------------------------------------------------\nFile Name: ueav.i386-x86_64.en\n-----------------------------------------------------------------------------------\nNo personal computer exists in a vacuum. As elegantly designed as Macs are, a connected world means that their popularity attracts the attention of malware writers and virus engineers. Not only can malware and other threats attack the Mac OS X platform directly, but Macs can also serve as a carrier of Windows or Linux-based threats. Network shares, email and removable media like USB keys are easy ways for multiplatform malware to spread undetected. Additionally, third party applications which are not consistently patched and updated, are prime targets for hackers to gain control of user systems.\n\nESET NOD32 Antivirus for Mac brings protection that Windows users have trusted in and depended on: the smart proactive detection and small footprint of our ThreatSenseÃ‚Â® technology. ESET NOD32 Antivirus will keep you and your network safe from emerging and cross-platform threats without system slowdowns. Advanced heuristic technology recognizes and nullifies novel threats while other AV solutions are still waiting hours or days for signature updates. \n\n-------------------------------------------------------------------------------------\nESET NOD32 Antivirus for MacIf you are currently using a prior version of the beta software, please download this version, uninstall the prior version and install this version in its place.\n-------------------------------------------------------------------------------------\nFeatures:\n\n\nLatest News\n\nJune 10, 2010\nPublic Beta 2 has been released for ESET NOD32 Antivirus for Mac. The new build features several enhancements and repairs bugs that had been discovered in the first Beta release. For a complete list of enhancements and bug fixes, click the Changelog tab above. To download the latest version, click the download button to the left. If you are using a previous version of ESET NOD32 Antivirus for Mac, be sure to uninstall it before installing the latest version.\n\nMarch 23, 2010\nThe license term for ESET NOD32 Antivirus for Mac Beta has been extended. The previous license key expires on April 1, 2010. All users who would like to extend their license must download and install the latest build of ESET NOD32 Antivirus for Mac. To uninstall any earlier builds before installing the latest version, Force Quit ESET NOD32 Antivirus for Mac, drag the application to the Trash from the Applications window in Finder and then restart your computer.\n\nJanuary 8, 2010\nA new build for ESET NOD32 Antivirus for Mac is now available. Build 4.0.12 addresses the system font errors that had been reported after the first public beta release and other minor bugs in the graphical user interface. The new build also includes improvements to the user interface. \n\nFor a complete list, see the Changelog tab, above.\n\nDecember 2, 2009\nThe first public beta for ESET NOD32 Antivirus for Mac OS X Desktop is now available.\n\nBased on our technology for BSD, Linux, and Solaris servers, ESET NOD32 Antivirus for Mac OS X Desktop has evolved to provide a GUI and feature set similiar to ESET NOD32 Antivirus for Microsoft Windows.\n\nESET NOD32 Antivirus for Mac OS X Desktop (MENA) is built on ThreatSense, the industry's most accurate proactive technology for detecting viruses and other malware, delivering proactive protection against zero-day threats and attacks. Features of ESET NOD32 Antivirus for Mac OS X Desktop include:\n\n    * advanced scanning settings (comparable ESET NOD32 Antivirus v4 for Windows)\n    * detection of threats for Mac OS X, Windows, Linux and other operating systems\n    * informative graphs, statistics and logs\n    * removable media scanning\n    * proxy support\n    * scheduler for automating scans\n    * support for both 32-bit and 64-bit Intel CPUs\n    * ThreatSense.NET sample submission\n\nThis beta test version is a precursor of the final product without full functionality and documentation. It is intended for experienced Mac OS X users and should not be installed on computers that perform critical tasks because it may cause errors or crashes.   We are not testing for compatibility with nor are we able to support ESET NOD32 Antivirus for Mac OS X Desktop on non-Apple hardware.\n\nFor additional information and known bugs for this release, see the Changelog tab, above.\n-----------------------------------------------------------------------------------\nEset Nod 32 For Mac Beta 2\n-----------------------------------------------------------------------------------\nFind Virus, Malware or trojans?\nContact me &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;511d197c0510181c18113d3827347f2234&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; or comment.\n-----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:3102e0517352477555b5b7269d7723f3dcdc3614","amp;dn":"ESET+NOD32+Antivirus+for+Mac+beta+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3102e0517352477555b5b7269d7723f3dcdc3614","infoHashBuffer":{"type":"Buffer","data":[49,2,224,81,115,82,71,117,85,181,183,38,157,119,35,243,220,220,54,20]},"announce":[],"urlList":[]}}