{"title":"CISSP Study Guide 2E- Syngress [Epub]","uid":8806635,"size":9496469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3115acbda29e9c1ab29801501d130760df4db22d&amp;dn=CISSP+Study+Guide+2E-+Syngress+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"F1restorm","files":-1,"time":1376348741,"description":"CISSP Study Guide Second Edition\nAuthors: Eric Conrad, Seth Misenar and Joshua Feldman\nPublished: 2012\nPublisher: Syngress\nFormat: Retail Epub\nISBN: 978-1597499613\n_____________________________________________________________________\n\nThe CISSP certification is the most prestigious, globally-recognized, vendor neutral exam for information security professionals. The newest edition of this acclaimed study guide is aligned to cover all of the material included in the newest version of the exam's Common Body of Knowledge. The ten domains are covered completely and as concisely as possible with an eye to acing the exam.\n\nEach of the ten domains has its own chapter that includes specially designed pedagogy to aid the test-taker in passing the exam, including: Clearly stated exam objectives; Unique terms/Definitions; Exam Warnings; Learning by Example; Hands-On Exercises; Chapter ending questions. Furthermore, special features include: Two practice exams; Tiered chapter ending questions that allow for a gradual learning curve; and a self-test appendix\n\n. Provides the most complete and effective study guide to prepare you for passing the CISSP exam-contains only what you need to pass the test, with no fluff!\n\n. Eric Conrad has prepared hundreds of professionals for passing the CISSP exam through SANS, a popular and well-known organization for information security professionals.\n\n. Covers all of the new information in the Common Body of Knowledge updated in January 2012, and also provides two practice exams, tiered end-of-chapter questions for a gradual learning curve, and a complete self-test appendix.","torrent":{"xt":"urn:btih:3115acbda29e9c1ab29801501d130760df4db22d","amp;dn":"CISSP+Study+Guide+2E-+Syngress+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3115acbda29e9c1ab29801501d130760df4db22d","infoHashBuffer":{"type":"Buffer","data":[49,21,172,189,162,158,156,26,178,152,1,80,29,19,7,96,223,77,178,45]},"announce":[],"urlList":[]}}