{"title":"~! Project Camelot interviews !~ {2010} [UFOs, ETs, Aliens, 2012","uid":6170355,"size":9192266663,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3248bd43cee8b9f789813fa4a7f74d1d9d823807&amp;dn=%7E%21+Project+Camelot+interviews+%21%7E+%7B2010%7D+%5BUFOs%2C+ETs%2C+Aliens%2C+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fymd","files":67,"time":1297546209,"description":"[IMG]http://i161.photobucket.com/albums/t222/dreamsquirrel/Project%20Camelot/project_camelot_witnesses_photomontage_lg.jpg[/IMG]\n\n\n[b][url]http://ProjectCamelot.org/[/url][/b] \n\n\nProject Camelot is based on an idea generated when we first met and spent the weekend in Tintagel, England, overlooking the sea in the home of King Arthur. We named our project in tribute to the vision behind the utopian idea of the Round Table - and have structured all our efforts in this inspiring spirit.\n\nEver since our launch in 2006 we have been financing Project Camelot solely out of our own pockets and with the generous help of donations from visitors to our site. We thank you sincerely all for your help and support, without which we could not do what we do.\n\nTo date, we have traveled widely meeting and interviewing truth-tellers in the effort to provide enlightening testimony about the true nature of our world. We will continue as long as our funds and contributions make this all possible.\n\nNote: for those who are wondering about the Cheetah logo and now the Snow Leopard used here on Kerry's site, Project Camelot Productions, and also on Bill's site Project Avalon. It is a nod to the famous MGM Lion... A nod to the power of film (and video) in making manifest the amazing facets of worlds and realities, to display for scrutiny and analysis and wonder what it means to be human.\n\nCamelot interviews are shot in a guerilla style that captures the interpersonal dynamic as well as enables the viewer to determine whether the truth is being told, some facsimile thereof, or a lie.. The camera reveals this in the facial expression, voice, tone and body language of the subject, and gives us added insight into what resonates and what does not. It gives us a candid picture of not only the person but also reveals the more subtle layers underneath. We pick up subliminal cues and as viewers can come to our own conclusions, without being limited or misled by edited sound bytes, canned commentaries or misdirects by the interviewer that interfere with a determination of what is truth and what is fantasy or simply a lie. \n\n\n[IMG]http://i161.photobucket.com/albums/t222/dreamsquirrel/umbolichtexi5dlqx6.jpg[/IMG]\n\n\n[i]peace, love, truth, light, bliss, honor, and dreams of empathy unto you all...\nultimately, what we do in life.. echoes in eternity~8\n\n*All Is One*\n~ 1LOVE ~\n\nNamaste *_*\nSeek the truth and the truth will set you free~* [/i]","torrent":{"xt":"urn:btih:3248bd43cee8b9f789813fa4a7f74d1d9d823807","amp;dn":"%7E%21+Project+Camelot+interviews+%21%7E+%7B2010%7D+%5BUFOs%2C+ETs%2C+Aliens%2C+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3248bd43cee8b9f789813fa4a7f74d1d9d823807","infoHashBuffer":{"type":"Buffer","data":[50,72,189,67,206,232,185,247,137,129,63,164,167,247,77,29,157,130,56,7]},"announce":[],"urlList":[]}}