{"title":"Efficient Software Efficient Address Book v3.51 build 341 ML wit","uid":8584955,"size":10022818,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:325b301856da19018e04c1c1701369438a390a12&amp;dn=Efficient+Software+Efficient+Address+Book+v3.51+build+341+ML+wit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TorDigger","files":11,"time":1371507151,"description":"Efficient Address Book\n\nEfficient Address Book is a professional, elegant and handy contact management software program.\n\nIt supports endless levels of contact groupings and helps you manage the information of even thousands of contacts rapidly. You can add birthday and anniversaries to a contact and the program will remind you of them on time, so you can better create and keep networking and build customer relationships. By setting importance of your customers, you can always focus on key persons. Custom fields fully meet your special business requirements. The product saves you a lot of time by features such as flash find, fast input of contacts from the same company, copy and paste of contacts as well as bulk import.\n\nBesides, there are various unique features such as the product can display contact list in card view, you can add unlimited number of photos to a contact and you can edit all the fields of a contact profile, etc. A major feature of the Efficient address book software is you can not only add text, but also insert attachments, tables, pictures and URLs to the comment of a contact, just like Microsoft Word does, so it can truly record and track all information of this contact! Besides, you have up to 8 interface styles of different tones of color to choose from!\n\nEfficient Address Book is a must have for people from all walks of life to manage their contact information.\n\nWhy Choose Efficient's Address Book Software?:\n\nMultiple Interface Styles\n8 interface styles are provided to meet your individual needs! They have various tones of color like blue, green or metallic, and have Vista standard and XP standard windows appearances separately.\n\nNetwork Edition Available\nEfficient Address Book is suitable not only for individual users, but also for business users. The Network Edition allows different users in your organization to access the same copy of data, to work in conjunction and improve work efficiency. Besides, the Network Edition uses Firebird, a world leading open source database, so you do not need to pay any additional cost for the database server.\n\nPortable Edition Available\nThe portable edition is designed to run from a USB flash drive. Now, with the USB drive, you can manage your address book on different computers (such as one at home and another at work), and do not need to worry about data synchronization!\n\nFree Edition Available\nTo meet different requirements from our friends, we provide a professional edition together with a free edition. You can upgrade from the free edition to the professional one at any time.\n\nEasy to Search\nEfficient Address Book has powerful search capabilities so you can quickly find your information.\n\nPowerful Document Editor\nEfficient Address Book has embedded a powerful document editor similar to MS-Word, which can be used to write your comments for contacts.\n\nInformation Safety Safeguards\nThere is a Recycle Bin in this contact management software, you do not need to be worried that you may delete some important information by mistake. The functions of Backup and Restore can help you conveniently save and migrate data.\n\nLanguages: English, Bulgarian, Croatian, Czech, Danish, Dutch, Farsi, Finnish, French, German, Greek, Hungarian, Indonesian, Italian, Korean, Lithuanian, Norwegian, Polish, Portuguese, Russian, Simplified Chinese, Slovenian, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian\n\nSupported OS:\n\nWindows 8/7/XP/Vista (32-bit or 64-bit)\n\nHomepage: http://www.efficientsoftware.net/addressbook/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with any name and given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:325b301856da19018e04c1c1701369438a390a12","amp;dn":"Efficient+Software+Efficient+Address+Book+v3.51+build+341+ML+wit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"325b301856da19018e04c1c1701369438a390a12","infoHashBuffer":{"type":"Buffer","data":[50,91,48,24,86,218,25,1,142,4,193,193,112,19,105,67,138,57,10,18]},"announce":[],"urlList":[]}}