{"title":"Landslide: LBJ and Ronald Reagan - Jonathan Darman Audiobook MP3","uid":11196675,"size":404376681,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:33c3f18c3dabbfc3248dd32acf6aee20e5313fba&amp;dn=Landslide%3A+LBJ+and+Ronald+Reagan+-+Jonathan+Darman+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413101114,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nLandslide: LBJ and Ronald Reagan at the Dawn of a New America\n\nWritten by: Jonathan Darman\nNarrated by: Corey M. Snow\nLength: 14 hrs\nUnabridged Audiobook\nRelease Date:09-23-14\n\nThe liberal and the conservative. The deal - making arm twister and the cool communicator. The Texas rancher and the Hollywood star. Opposites in politics and style, Lyndon Johnson and Ronald Reagan shared a defining impulse: to set forth a grand story of America, a story in which he could be the hero. In the tumultuous days after the Kennedy assassination, Johnson and Reagan each, in turn, seized the chance to offer the country a new vision for the future. Bringing to life their vivid personalities and the anxious mood of America in a radically transformative time, Darman shows how, in promising the impossible, Johnson and Reagan jointly dismantled the long American tradition of consensus politics and ushered in a new era of fracture. History comes to life in Darman's vivid, fly - on - the wall storytelling. From Johnson's election in 1964, the greatest popular - vote landslide in American history, to the pivotal 1966 midterms, when Reagan burst forth onto the national stage, Landslide brings alive a country transformed - by riots, protests, the rise of television, and the shattering of consensus - and the two towering personalities whose choices in those moments would reverberate through the country for decades to come.","torrent":{"xt":"urn:btih:33c3f18c3dabbfc3248dd32acf6aee20e5313fba","amp;dn":"Landslide%3A+LBJ+and+Ronald+Reagan+-+Jonathan+Darman+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33c3f18c3dabbfc3248dd32acf6aee20e5313fba","infoHashBuffer":{"type":"Buffer","data":[51,195,241,140,61,171,191,195,36,141,211,42,207,106,238,32,229,49,63,186]},"announce":[],"urlList":[]}}