{"title":"FS9 FS2004 : DreamFleet Boeing 727 and extra liveries","uid":3964398,"size":437889369,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:33e8ed183795683a8b80f0405f98b16e38f3dfb8&amp;dn=FS9+FS2004+%3A+DreamFleet+Boeing+727+and+extra+liveries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"samayot","files":5,"time":1199642760,"description":"DreamFleet has designed their 727 to be representative of the majority of 727s that are / were in service throughout the world. The 727 is a relatively &quot;basic&quot; aircraft when compared to newer aircraft in service today, and many of the automated features found on newer aircraft are not found on the 727. It is truly an airplane for pilots, not systems programmers. Sharpen up your flying skills, get out your paper charts, and be prepared for some real jet flying with the 727!\n\nGreatest Airliners: 727 is the first FS add-on aircraft to feature Reality XP color weather radar as standard equipment. The 727 comes equipped with a special version of Reality XP&amp;#039;s WX500 radar, appearing as the Bendix unit installed in many real 727s.\n\nAircraft Models: Four models are included. Both the 727-100 and 727-200 versions are available in both passenger and freight configurations. These models appear without any winglets or hush kits, as these items were rarely seen during most of the life span of the 727. The models were created in GmaxÂ®, and feature full moving parts, reflective textures and dynamic shine. The aircraft and virtual cockpit were modeled by Paul Springthorpe, a former 727 first officer (now flying the 757), with technical assistance provided by Stan Winke, who is an experienced 727 mechanic / technician.\n\nMoving Parts: Landing gear with detailed gear bay. Rotating wheels, and turning nose wheel. Triple slotted flaps. Leading edge flaps and slats. Spoilers. Cargo doors with detailed cargo bay interior. Passenger doors with detailed interior entrance lobby. Rear airstairs.\n\nAircraft Textures: All textures are photorealistic, and are available in high quality 32-bit, or compressed DXT3 format, to best suit the performance capabilities of your computer. The base textures were created by Rui Cristina, while airline liveries were created by Paul Golding, the 727&amp;#039;s lead designer, and Nick Jacobs, the 727&amp;#039;s programmer.\n\nAirline Liveries &amp; Text-o-Matic: In addition to the numerous airline liveries included with the product, you can create your own airline liveries using our free texture template. Your completed template is then processed with the included Text-o-Matic, Flight One Software&amp;#039;s unique texture and aircraft creation utility. Using your completed texture template and &quot;T-o-M&quot;, with just a few mouse clicks and a wait of under a minute, you&amp;#039;ll have a brand new aircraft, sporting your new livery, ready to fly!\n\n3D Wing Views with full moving parts: You can view the wings right through a photographic image of the real aircraft&amp;#039;s window frame, just as a passenger would.\n\nVirtual Cockpit Features: The VC is extremely well detailed, and is textured using real photographs, not hand drawn or rendered artwork. It features clickable gauges throughout, and two levels of cockpit night lighting.\n\nSounds: All sounds featured in the 727 were recorded from the real aircraft, including engine sounds and various cockpit sounds. These sounds were then expertly processed by one of the leading Flight Simulation sound designers, Mike Hambly. The end result is a realistic audible environment can can only be exceeded by sitting in the real aircraft.\n\nFound on WOS","torrent":{"xt":"urn:btih:33e8ed183795683a8b80f0405f98b16e38f3dfb8","amp;dn":"FS9+FS2004+%3A+DreamFleet+Boeing+727+and+extra+liveries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33e8ed183795683a8b80f0405f98b16e38f3dfb8","infoHashBuffer":{"type":"Buffer","data":[51,232,237,24,55,149,104,58,139,128,240,64,95,152,177,110,56,243,223,184]},"announce":[],"urlList":[]}}