{"title":"Albert Camus - Exile and the Kingdom: Stories (pdf)","uid":8604177,"size":2289440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34880222190f4d30f5648b1809e83dae89ddcac4&amp;dn=Albert+Camus+-+Exile+and+the+Kingdom%3A+Stories+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371960759,"description":"Albert Camus (Carol Cosman, trans.; Orhan Pamuk, foreword) - Exile and the Kingdom: Stories (Vintage, 2006). 166 pages.\n\nSlightly improved version of a scan produced by the legendary CerealRipper. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nThis book (and others) in other formats available here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8590574&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8590574&lt;/a&gt;\n\nI neglected to include this one in that torrent; it's very good quality.\n\n\ndescription:\n\nFrom one of the most brilliant and influential thinkers of the twentieth century-two novels, six short stories, and a pair of essays in a single volume. In both his essays and his fiction, Albert Camus (1913--1960) de-ployed his lyric eloquence in defense against despair, providing an affirmation of the brave assertion of humanity in the face of a universe devoid of order or meaning. &quot;The Plague&quot;-written in 1947 and still profoundly relevant-is a riveting tale of horror, survival, and resilience in the face of a devastating epidemic. &quot;The Fall&quot; (1956), which takes the form of an astonishing confession by a French lawyer in a seedy Amsterdam bar, is a haunting parable of modern conscience in the face of evil. The six stories of &quot;Exile and the Kingdom &quot;(1957) represent Camus at the height of his narrative powers, masterfully depicting his characters-from a renegade missionary to an adulterous wife -at decisive moments of revelation. Set beside their fictional counterparts, Camus's famous essays &quot;The Myth of Sisyphus&quot; and &quot;Reflections on the Guillotine&quot; are all the more powerful and philosophically daring, confirming his towering place in twentieth-century thought.","torrent":{"xt":"urn:btih:34880222190f4d30f5648b1809e83dae89ddcac4","amp;dn":"Albert+Camus+-+Exile+and+the+Kingdom%3A+Stories+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34880222190f4d30f5648b1809e83dae89ddcac4","infoHashBuffer":{"type":"Buffer","data":[52,136,2,34,25,15,77,48,245,100,139,24,9,232,61,174,137,221,202,196]},"announce":[],"urlList":[]}}