{"title":"A Spirituality of Resistance: Finding a Peaceful Heart and Prote","uid":9750791,"size":17355421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34f0132c7db77f7b9e1d0582597630c498a03887&amp;dn=A+Spirituality+of+Resistance%3A+Finding+a+Peaceful+Heart+and+Prote&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1394661586,"description":"A Spirituality of Resistance: Finding a Peaceful Heart and Protecting the Earth - Roger S. Gottlieb PDF\n\n\nWith clarity, humor, detailed scholarship, and passionate eloquence, Roger S. Gottlieb uses a unique range of resources to portray a spiritual path keyed to caring for the earth. This personal and powerful book speaks to anyone who has ever wondered how to be happy when there is so much suffering in the world-anyone who seeks a peaceful heart in a dark time. Its unique combination of spiritual insight, political commitment, and environmental knowledge reveals the deep ties between spiritual aspiration and ecological activism; and makes a critical contribution to both environmentalism and religious studies. Gottlieb begins by describing the gifts which spirituality offers, and how those gifts cannot be realized if we flee into avoidance or denial in the face of ecological peril. In a startling and compelling comparison between the Holocaust and the environmental crisis, he shows how a psychic dependence on &quot;work&quot; can lead us-even against our wills-to take part in genocide or ecocide. Addressing questions about our obligations to the earth, he deepens our understanding of what it is to live an &quot;environmentally correct&quot; life and what we really mean by &quot;nature.&quot; Finally, by connecting personal fulfillment to social activism, he shows how a truly peaceful heart is only possible if we devote some of our energies to resisting the forces of destruction.","torrent":{"xt":"urn:btih:34f0132c7db77f7b9e1d0582597630c498a03887","amp;dn":"A+Spirituality+of+Resistance%3A+Finding+a+Peaceful+Heart+and+Prote","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f0132c7db77f7b9e1d0582597630c498a03887","infoHashBuffer":{"type":"Buffer","data":[52,240,19,44,125,183,127,123,158,29,5,130,89,118,48,196,152,160,56,135]},"announce":[],"urlList":[]}}