{"title":"Fundamentals of Radiation Materials Science - Metals and Alloys","uid":15328760,"size":32110820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:359d0dc9a9b37206971c9b7a4686fe8afda30d44&amp;dn=Fundamentals+of+Radiation+Materials+Science+-+Metals+and+Alloys&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468710982,"description":"Fundamentals of Radiation Materials Science - Metals and Alloys - Gary S. Was (Springer, 2007).pdf\r\n\r\nISBN 978-3-540-49471-3\r\n\r\nRadiation Materials Science teaches readers the fundamentals of the effects of radiation on metals and alloys. When energetic particles strike a solid, numerous processes occur that can change the physical and mechanical properties of the material. Metals and alloys represent an important class of materials that, by virtue of their use in nuclear reactor cores, are subject to intense radiation fields. Radiation causes metals and alloys to swell, distort, blister, harden, soften and deform. This textbook and reference covers the basics of particle-atom interaction for a range of particle types, the amount and spatial extent of the resulting radiation damage, the physical effects of irradiation and the changes in mechanical behavior of irradiated metals and alloys. Concepts are developed systematically and quantitatively, supported by examples, references for further reading and problems at the end of each chapter. Beyond addressing students enrolling for a materials sciences or nuclear engineering degree, the book will benefit professionals in laboratories, reactor manufacturers and specialists working in the utility industry","torrent":{"xt":"urn:btih:359d0dc9a9b37206971c9b7a4686fe8afda30d44","amp;dn":"Fundamentals+of+Radiation+Materials+Science+-+Metals+and+Alloys","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"359d0dc9a9b37206971c9b7a4686fe8afda30d44","infoHashBuffer":{"type":"Buffer","data":[53,157,13,201,169,179,114,6,151,28,155,122,70,134,254,138,253,163,13,68]},"announce":[],"urlList":[]}}