{"title":"The HinterLands Mining Game HD v0.428 APK (Android)","uid":14238470,"size":8669823,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:35cae7f725b29318972406e8d7f6309c2687b797&amp;dn=The+HinterLands+Mining+Game+HD+v0.428+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pahly","files":1,"time":1460117699,"description":"Mine the terrain for resources, build great structures, harvest plants, trees and mobs!\r\n\r\nMine the terrain for resources, build great structures, harvest plants, trees and mobs. \r\nPlay cooperative or competitive multiplayer with friends or random players!\r\n\r\nFeatures:\r\n• Multiplayer, featuring player vs player combat, and cooperative exploration and building \r\n• Parkour style movement- run up walls, do flips, climb over ledges, run and slide under things, wall kick/jump between walls\r\n• Fight with fast combos, slow strong attacks, and block incoming enemy attacks. \r\n• Take no damage, and unlimited blocks in creative mode\r\n★Mine, Craft, Fight and Build!★\r\n• Mine procedurally generated, unique worlds, with randomly generated terrain, and dynamic day/ night cycles\r\n• Craft tons of blocks and items, and use them to build!\r\n• Farm mobs, or destroy them for food to, and stop hunger\r\n• Harvest trees and plants for food, potions, or seeds to replant and grow your own forests\r\n★Multiplayer★\r\nThe HinterLands is an indie sandbox game, built with a heavy emphasis on multiplayer. \r\nYou have more multiplayer options than other games on the market:\r\n• Play on the free public servers and play with tons of people, Google Play, wifi/LAN, or bluetooth!\r\n• Dance with people, or join a team color using chat\r\n★Why Play?★\r\n• Play with other people: create amazing structures, or just battle it out with swords, crossbows and guns.\r\n• Help shape the development of the game, add ideas, and watch the game evolve.\r\n• Explore the world, and see new content added to the game, and like to provide feedback on what you like/ don’t like.\r\n★Who isn’t it for?★\r\n• Someone looking for a completely finished game. The game is in alpha, and will continually be updated to fix bugs/ add content until it is finished.\r\nThe HinterLands was the FIRST (early 2013) multiplayer 2d mining game on Google Play, and was released early in alpha to encourage people to contribute to development, since there was nothing similar on the market. Since then it has grown a ton, and keeps growing thanks to player feedback!\r\n★Features Coming Soon★\r\n• NPC’s: Characters to give you quests, buy and trade items, marry and start a family with!\r\n• More advanced item, armor and weapon crafting system\r\n• Bosses, more mobs, and more biomes\r\n★Planned features★\r\n• Player vs. Player: Free for all, capture the flag, team oriented with different classes, tower defense with creeps and towers\r\n• Pets: Animals to join you on quests and in combat (and mounts!)\r\n• Craftable vehicles, space travel, permanent worlds on servers\r\n★Instructions★\r\n• Customize and create your player and world\r\n• Play on a public server, Google Play, wifi, bluetooth, or single player game\r\n• Mine dirt, stone, ect with the pickaxe. Chop trees and items with the axe.\r\n• Use the fast attack button to combo attacks, or the strong attack for higher damage. Use the shield to become invincible\r\n• Pinch to zoom in/out; Move items by holding them down for 1s\r\n\r\n★ PAID VERSION: For backing the paid game, you get a BACKERS REWARD item for all new characters that you can use to teleport to and from your spawn point, as well as a much bigger inventory than the free version\r\n\r\nWhat's in this version : (Updated : 2 April 2016)\r\n4/2/16\r\n•Fixed bug causing crash when connecting to server list\r\n4/1/16\r\n•Added lighting (thx orangepixels)\r\n•Fixed world items duping\r\n•Changed movement- hold down jump to go higher, joystick allows walking\r\n•BG gfx changed\r\n3/29/16\r\n•bluetooth in\r\n•Fixed worlds not generating ores\r\n•Lowered functions from 62k to 59k\r\n•Changed server list\r\n3/20/16\r\n•Made neutral team/white 2nd option\r\n3/17/16 \r\n\r\nRequired Android O/S : 2.3 and up","torrent":{"xt":"urn:btih:35cae7f725b29318972406e8d7f6309c2687b797","amp;dn":"The+HinterLands+Mining+Game+HD+v0.428+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35cae7f725b29318972406e8d7f6309c2687b797","infoHashBuffer":{"type":"Buffer","data":[53,202,231,247,37,178,147,24,151,36,6,232,215,246,48,156,38,135,183,151]},"announce":[],"urlList":[]}}