{"title":"Jakob Dylan - 2008 - Seeing Things  [EAC - FLAC ]","uid":4654316,"size":224531565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:361483262ede6f931f61951695a29564db7e10cc&amp;dn=Jakob+Dylan+-+2008+-+Seeing+Things++%5BEAC+-+FLAC+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bludStain","files":-1,"time":1232151955,"description":"Review    by Stephen Thomas Erlewine\n\nWhen the songwriter from a songwriter-driven band steps out on his own the question always hangs in the air: did he need to forsake his band in order to cut this set of songs? In the case of Seeing Things, the first album Jakob Dylan has released outside of the confines of the Wallflowers, he most certainly did. Quiet, reflective, based almost entirely on acoustic guitars, Seeing Things is intimate in a way the road-ready Wallflowers never were, although the tunes are as sturdy and plainspoken as Dylan's songs for the band. Indeed, there's always been a modesty at the core of his writing, so he benefits greatly from this humble setting, masterminded -- as so many big-budget down to basics departures are in the 2000s -- by Rick Rubin, known for his stripped-down reinventions of Johnny Cash and Neil Diamond. Seeing Things isn't nearly as spare as American Recordings or 12 Songs; anchored on acoustics though he may be, Dylan isn't on his own, as bass, harmony vocals, and keyboards are gently woven into the fabric. This gives the music warmth, but the simplicity of the setting helps focus on Dylan's unassuming, well-crafted songs, songs where melodies are gently insinuating and words are so carefully sculpted it's easy to overlook how nicely he turns a phrase. Like many of his peers, Dylan is casting a wary eye on a war-ridden new millennium, but these aren't protest songs, they work on an emotional level and are appropriately balanced with lighter moments, like the lazy shuffle of &quot;All Day and All Night.&quot; All through his career, Jakob Dylan has never pushed too hard; he simply lays it out there, so he's uncommonly suited to Rubin's unadorned production. In Rubin's hands, Seeing Things plays like a songwriter playing his newest songs in your living room -- a seductive feeling that no Wallflowers record ever captured, which is an excellent reason for Dylan to step out on his own.\n\n\nTracks\n01  Evil Is Alive and Well         3:56\n02  Valley of the Low Sun         3:57\n03  All Day and All Night         3:28\n04  Everybody Pays as They Go         3:00\n05  Will It Grow         4:49\n06  I Told You I Couldn't Stop         4:14\n07  War Is Kind         3:08\n08  Something Good This Way Comes         3:39\n09  On Up the Mountain         3:45\n10  This End of the Telescope         3:59","torrent":{"xt":"urn:btih:361483262ede6f931f61951695a29564db7e10cc","amp;dn":"Jakob+Dylan+-+2008+-+Seeing+Things++%5BEAC+-+FLAC+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361483262ede6f931f61951695a29564db7e10cc","infoHashBuffer":{"type":"Buffer","data":[54,20,131,38,46,222,111,147,31,97,149,22,149,162,149,100,219,126,16,204]},"announce":[],"urlList":[]}}