{"title":"Resident Evil Revelations 2 Repack - 32play","uid":11767050,"size":4084106012,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:36778c569547af781efd4313674d6e3596c29874&amp;dn=Resident+Evil+Revelations+2+Repack+-+32play&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"globeplus","files":3,"time":1426880180,"description":"\nBig hello to all Resident Evil games series fans and this the Complete Season of Resident evil Revelations 2 with more than 14 gb packed in 3.8 ... i hope all of you like it ...\n\n\n\nRepack with all 4 episodes + 2 extras dlcs + bonus\n\nAudio : English Only\n\nSubtitles : Multi-12\n\nNothing ripped with an installation in portable style\n\n\nPlot\n\nResident Evil: Revelations 2 will be set between the events of Resident Evil 5 and Resident Evil 6. Claire Redfield will be the main protagonist and Barry Burton's daughter Moira will play a supporting role. In December of 2014, a new trailer revealed Barry as another playable protagonist, and he will be joined by Natalia Korda, who is a little girl with some special abilities. The official cinematic trailer was released in December of 2014.\n\nThe first episode sees Claire and Moira being taken to an island facility where the &quot;Afflicted&quot; are in wait. An unknown woman calling herself the &quot;Overseer&quot; watches via cameras and tells them the bracelets on their wrists record fear, as the pair try to find safety. Upon reaching a radio tower, they call for help. Unfortunately, Barry arrives very late as the distress call was actually made months ago. Once he reaches the island, he immediately meets Natalia, a strange little girl. Together, they head to the tower, encountering many dangerous situations along the way. Natalia claims Moira had died 6 months ago, while having a severe headache.\n\n\nenjoy","torrent":{"xt":"urn:btih:36778c569547af781efd4313674d6e3596c29874","amp;dn":"Resident+Evil+Revelations+2+Repack+-+32play","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36778c569547af781efd4313674d6e3596c29874","infoHashBuffer":{"type":"Buffer","data":[54,119,140,86,149,71,175,120,30,253,67,19,103,77,110,53,150,194,152,116]},"announce":[],"urlList":[]}}