{"title":"The Great British Sewing Bee - S03E01 - HD-WebDL -- STS","uid":11717365,"size":1072292751,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3686f925f8a393d6623d3638e8ebf7e649e93767&amp;dn=The+Great+British+Sewing+Bee+-+S03E01+-+HD-WebDL+--+STS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"uggauga","files":2,"time":1424645784,"description":"The Great British Sewing Bee - Series 3: Episode 1\n\nThe Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Ten of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.\n\nIn the first episode, ten nervous home sewers are asked to work with a core fabric found in every dressmaker's cupboard: cotton. With shaking fingers and sweaty palms, the sewers attempt to create their best work under the watchful gaze of the judges. The fabric-lovers take on 3D construction in a pair of women's trousers (complete with complicated invisible zip), have to totally transform a bog standard denim shirt in just 90 minutes and are asked to produce a stunning summer dress for their real-life models. Everything from uneven hemlines to spots matched with military precision is offered up to the judges, but who will crack under the pressure of the sewing room?","torrent":{"xt":"urn:btih:3686f925f8a393d6623d3638e8ebf7e649e93767","amp;dn":"The+Great+British+Sewing+Bee+-+S03E01+-+HD-WebDL+--+STS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3686f925f8a393d6623d3638e8ebf7e649e93767","infoHashBuffer":{"type":"Buffer","data":[54,134,249,37,248,163,147,214,98,61,54,56,232,235,247,230,73,233,55,103]},"announce":[],"urlList":[]}}