{"title":"Black Grape - Stupid Stupid Stupid [1997]","uid":9697795,"size":353799206,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:372b9cb55ab244b2f3fd7f1b05fa32657a03159c&amp;dn=Black+Grape+-+Stupid+Stupid+Stupid+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GenXRock","files":-1,"time":1393959821,"description":"Review by Stephen Thomas Erlewine  [-]\nArriving out of nowhere, Black Grape's debut, It's Great When You're Straight... Yeah, was a complete surprise, a post-acid house party record that delivered on all of the Happy Mondays' promise. It was a kinetic, exciting record that disregarded boundaries between rap, house, rock, soul, and pop -- it was the culmination of what Shaun Ryder began with Pills N Thrills N Bellyaches. It's Great was greeted warmly by critics and fans, which meant that the group's second album, Stupid, Stupid, Stupid, was eagerly anticipated. Perhaps nothing could live up to the expectations of hardcore fans, but Stupid, Stupid, Stupid fails to deliver in a variety of ways. Essentially, it plays like It's Great, part two, only without its predecessor's infectious beats, mammoth hooks, and surreal humor. There's a heavier soul influence this time around (&quot;Lonely&quot; is a straight cover of Frederick Knight's 1972 hit &quot;I've Been Lonely for So Long&quot;), but it doesn't sit well with Ryder's thuggish rasp, and that's one of the problems about the album -- the vocals and the music don't match. Apart from the dynamite opening trilogy of &quot;Get Higher,&quot; &quot;Squeaky,&quot; and &quot;Marbles,&quot; Ryder and Kermit don't sound integrated with the music; they sound as if they're rapping over pre-existing backing tracks, which aren't as funky or inventive as those from It's Great. Perhaps Stupid, Stupid, Stupid would sound intoxicating if you're intoxicated, but such stimulation shouldn't be necessary -- the music should be intoxicating enough on its own. (3/5)","torrent":{"xt":"urn:btih:372b9cb55ab244b2f3fd7f1b05fa32657a03159c","amp;dn":"Black+Grape+-+Stupid+Stupid+Stupid+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"372b9cb55ab244b2f3fd7f1b05fa32657a03159c","infoHashBuffer":{"type":"Buffer","data":[55,43,156,181,90,178,68,178,243,253,127,27,5,250,50,101,122,3,21,156]},"announce":[],"urlList":[]}}