{"title":"Cuckold Sessions - Allie James","uid":6926854,"size":422461587,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:375da5913437e2e08c66a1a1b72d77a4201fd8c2&amp;dn=Cuckold+Sessions+-+Allie+James&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mutiny0","files":1,"time":1325538129,"description":"\nAllie James has it all: The sexy looks, the sexual appetite of a true whore, and a boyfriend who's deep pockets know no bounds. Allie's man has found Shane Diesel via online posting and there's no expense he'll spare to give his woman a great time. Allie's boyfriend came up with the right number in order for a cuckold session to take place. Shane Diesel and Allie James spoke down to the cuckold before turning their sights on each other. Allie's cuckold wore his male chastity device as she worshipped Shane's massive meat. The only thing left was for Allie James to suck on that huge black cock while her cuckold looked on like a good little boy (emphasis on little). Allie's mouth wrapped around as much of Shane's black cock as she could dish out. The cuckold, as is his feminine way, must have wanted to suck on that black cock but Shane is all man. Allie's pussy was next on the order of business and Shane slammed into it like he was trying to prove a point. Allie's cuckold needed a closer view of the penetration. That cuckold got up close to his woman's clit as Shane pulverized her pelvis with his. The juices flowing off her clit was a clear indication that Allie was finally getting fucked in a manner she deserved. As she was bent over , you can see her give the &quot;stare of love&quot; at her boyfriend while Shane's big, black cock was parting her pussy lips. Allie's pussy nearly fell off her body as Shane was showing no mercy on that love hole. Allie's cuckold/boyfriend paid a hefty enough price which guaranteed the opportinity to eat Shane's jizz right off his girlfriend's snatch. He cleaned up very well, but his bank account is now back at 0....much like his personality.\n &lt;a href=&quot;\nhttp://www.cuckoldsessions.com/tour/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cuckoldsessions.com/tour/&lt;/a&gt;","torrent":{"xt":"urn:btih:375da5913437e2e08c66a1a1b72d77a4201fd8c2","amp;dn":"Cuckold+Sessions+-+Allie+James","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375da5913437e2e08c66a1a1b72d77a4201fd8c2","infoHashBuffer":{"type":"Buffer","data":[55,93,165,145,52,55,226,224,140,102,161,161,183,45,119,164,32,31,216,194]},"announce":[],"urlList":[]}}