{"title":"Chessimo 3.40 + Patch","uid":8739331,"size":13825085,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3761c59189d94cad0fb246fbc448d0b3ae2f8d1a&amp;dn=Chessimo+3.40+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1374746787,"description":"Chessimo is software specially designed for chess players who want to make progress, but have little time for studying.\n\nThe basic concept of this training is to develop your chess strategy and tactics through repetition and memorization of key concepts (patterns) and positions.\n\nWith Chessimo you will:\n\n* Improve your Combinatory Vision.\n* Improve your ability to identify Chess Tactics Resources.\n* Learn when and how to apply basic and advanced Chess Strategy concepts.\n* Improve and accelerate your ability to Calculate Variations in a quick and precise manner.\n* Play against the program and save your games.\n* Analyze moves and resolve your doubts in dialogue with the program.\n* Develop your intuition.\n\nThe training process of Chessimo is based on the resolution of diagrams presented by the software. If you do not solve an exercise during a relatively short period of time, the program will present you the solution and you will have to repeat the exercise.\n\nThe exercises are repeated in a regular space of time, and subsequently faster and faster, until they are permanently printed into your memory.\n\nIn a very short time, you will have an Instant Chess Memory\nThe training of the Chessimo is based on memorization of key concepts and positions. These key positions eventually become a sort of instant memory that, besides improving intuition, is essential to develop combinatory vision and improve variation calculations.","torrent":{"xt":"urn:btih:3761c59189d94cad0fb246fbc448d0b3ae2f8d1a","amp;dn":"Chessimo+3.40+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3761c59189d94cad0fb246fbc448d0b3ae2f8d1a","infoHashBuffer":{"type":"Buffer","data":[55,97,197,145,137,217,76,173,15,178,70,251,196,72,208,179,174,47,141,26]},"announce":[],"urlList":[]}}