{"title":"Flight Behavior - Barbara Kingsolver.epub","uid":8755453,"size":1086284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:376a010f412d4262e4282489f476e143733c03c1&amp;dn=Flight+Behavior+-+Barbara+Kingsolver.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1375144713,"description":"Flight Behavior transfixes from its opening scene, when a young woman's narrow experience of life is thrown wide with the force of a raging fire. In the lyrical language of her native Appalachia, Barbara Kingsolver bares the rich, tarnished humanity of her novel's inhabitants and unearths the modern complexities of rural existence. Characters and reader alike are quickly carried beyond familiar territory here, into the unsettled ground of science, faith, and everyday truces between reason and conviction.\n\nDellarobia Turnbow is a restless farm wife who gave up her own plans when she accidentally became pregnant at seventeen. Now, after a decade of domestic disharmony on a failing farm, she has settled for permanent disappointment but seeks momentary escape through an obsessive flirtation with a younger man. As she hikes up a mountain road behind her house to a secret tryst, she encounters a shocking sight: a silent, forested valley filled with what looks like a lake of fire. She can only understand it as a cautionary miracle, but it sparks a raft of other explanations from scientists, religious leaders, and the media. The bewildering emergency draws rural farmers into unexpected acquaintance with urbane journalists, opportunists, sightseers, and a striking biologist with his own stake in the outcome. As the community lines up to judge the woman and her miracle, Dellarobia confronts her family, her church, her town, and a larger world, in a flight toward truth that could undo all she has ever believed.\n\nFlight Behavior takes on one of the most contentious subjects of our time: climate change. With a deft and versatile empathy Kingsolver dissects the motives that drive denial and belief in a precarious world.","torrent":{"xt":"urn:btih:376a010f412d4262e4282489f476e143733c03c1","amp;dn":"Flight+Behavior+-+Barbara+Kingsolver.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"376a010f412d4262e4282489f476e143733c03c1","infoHashBuffer":{"type":"Buffer","data":[55,106,1,15,65,45,66,98,228,40,36,137,244,118,225,67,115,60,3,193]},"announce":[],"urlList":[]}}