{"title":"Illustrated History of Furniture","uid":4874997,"size":12454808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37998bc9e1d0d827c6608ce9dfc5881591bc4045&amp;dn=Illustrated+History+of+Furniture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"philmccrevice","files":1,"time":1241078244,"description":"Frederick Litchfield created an enduring classic study of functional art with his Illustrated History of Furniture. This reprinting is presented out of a deep appreciation for the excellent scholarship and many illuminating insights that he so generously shared. \n\nThe first chapter, which refers to Ancient Furniture and covers a period of several centuries, is introductory to those that follow, rather than a serious attempt to examine the history of the furniture during that space of time. The fourth chapter, which deals with a period of some hundred and fifty years, from the time of King James the First until that of Chippendale and his contemporaries, and the last three chapters, are more fully descriptive than some others, partly because trustworthy information to these times was more accessible, and partly because it is probable that English readers will feel greater interest in the furniture of which they are the subject. The French meubles de luxe, from the latter half of the seventeenth century until the Revolution, are also treated more fully than the furniture of other periods and countries, on account of the interest which has been manifested in this description of the cabinet maker's and metal mounter's work. \n\nEvidence of this appreciation may be found in the enormous prices realized at notable auction sales, when such furniture has been offered for competition to wealthy connoisseurs. Such furniture cannot be cheap certainly, but the real cost is sometimes borne by the artist who produces, rather than by the man who may happen to buy it. It is often forgotten that the price paid is that of the lives and sustenance of the workers and their families. \n\n","torrent":{"xt":"urn:btih:37998bc9e1d0d827c6608ce9dfc5881591bc4045","amp;dn":"Illustrated+History+of+Furniture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37998bc9e1d0d827c6608ce9dfc5881591bc4045","infoHashBuffer":{"type":"Buffer","data":[55,153,139,201,225,208,216,39,198,96,140,233,223,197,136,21,145,188,64,69]},"announce":[],"urlList":[]}}