{"title":"Teddy Thompson - 2008 - A Piece of What You Need","uid":5793796,"size":313808342,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37cb8f1482ba50bff096b91cd400ffb8aedbbef1&amp;dn=Teddy+Thompson+-+2008+-+A+Piece+of+What+You+Need&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bludStain","files":-1,"time":1282958951,"description":"Teddy Thompson - 2008 - A Piece of What You Need\n\nFile this under POP.\n\n\nReview\tby Mark Deming\n\n&quot;File under: Pop&quot; a polite message reads on the back cover of Teddy Thompson's fourth full-length album, A Piece of What You Need, and in this case no one can accuse the product of not living up to its billing. Thompson's first two albums were beautiful collections of moody folk-leaning indie pop that confirmed it was possible to sound dour and passionate at the same time, and his third set, Upfront &amp; Down Low, was a glorious celebration of heartache as portrayed in 11 classic country weepers, but A Piece of What You Need finds him sounding unexpectedly upbeat for a change, and the shift in attitude works remarkably well. &quot;What's this? What's this? Am I happy or something?&quot; Thompson asks on the disc's second tune, and while much of the time he still seems to be having trouble in the eternal search for the woman of his dreams, with producer Marius de Vries behind the controls (who has previously worked with David Gray, Melanie C, Josh Groban, and Thompson's pal Rufus Wainwright), most of these meditations on the joys and pitfalls of romance have a good beat and you can even dance to them. &quot;What's This?!!&quot; and &quot;In My Arms&quot; sound like potential hit singles, complete with snappy beats and slick harmonies, but de Vries has also made the most of Thompson's rich, strong voice, and the melodies are well served by the sweet but intelligent arrangements and production. And it's clear de Vries hasn't forced a more polished sound on Thompson against his will; &quot;Where to Go from Here&quot; and &quot;Slippery Slope&quot; would have sounded right at home on Thompson's sadly overlooked debut, &quot;Turning the Gun on Myself&quot; is just as lovely and severe as it needs to be, and &quot;Jonathan's Book&quot; could be &quot;Paperback Writer&quot; from the other side of the camera. Teddy Thompson has taken a more user-friendly approach on A Piece of What You Need, but he hasn't sold his soul or lost what makes him special along the way, and this is a clever, adventurous, and thoroughly engaging exercise in smart pop that's as thoughtful as it is pleasurable.\n\n\n01  -  The Things I Do   Thompson   3:44\n02  -  What's This?!!   Thompson   3:23\n03  -  In My Arms   Thompson   3:14\n04  -  Where to Go from Here   Thompson   3:12\n05  -  Don't Know What I Was Thinking   Thompson   3:53\n06  -  Can't Sing Straight   Thompson   3:42\n07  -  Slippery Slope (Easier)   Thompson   4:13\n08  -  Jonathan's Book   Thompson   4:40\n09  -  One of These Days   Thompson   2:49\n10  -  Turning the Gun on Myself   Thompson   4:21\n11  -  A Piece of What You Need   Thompson   18:35","torrent":{"xt":"urn:btih:37cb8f1482ba50bff096b91cd400ffb8aedbbef1","amp;dn":"Teddy+Thompson+-+2008+-+A+Piece+of+What+You+Need","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37cb8f1482ba50bff096b91cd400ffb8aedbbef1","infoHashBuffer":{"type":"Buffer","data":[55,203,143,20,130,186,80,191,240,150,185,28,212,0,255,184,174,219,190,241]},"announce":[],"urlList":[]}}