{"title":"LochMaster 3.0","uid":5564159,"size":40117647,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:389c54044ddb01ab5fc5192032a50815e70271a7&amp;dn=LochMaster+3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Coconut_Peat","files":-1,"time":1273881877,"description":"Language: German, English\n\n\nProduktbeschreibungen\n\nDas Entwicklungstool fÃƒÂ¼r Lochrasterprojekte. Mit LochMaster planen und entwerfen Sie Projekte auf Lochrasterplatinen. Optimieren und dokumetieren Sie Ihre Projekte sauber und effektiv am PC. LochMaster besitzt zahlreiche Funktionen die speziell fÃƒÂ¼r den praktischen Entwurf von Lochrasterschaltungen entwickelt wurden. Durch die fotorealistische Darstellung der Platine und die intuitive Bedienung der Software erreichen Sie in kÃƒÂ¼rzester Zeit ansehnliche Ergebnisse. Die Funktionen des Programms sind dem Arbeiten an realen Platinen nachempfunden. Blanke und isolierte DrÃƒÂ¤hte ziehen, biegen, ein- und auslÃƒÂ¶ten, Bauteile rotieren, Kupferbahnen auftrennen, Bohrungen setzen - alles wie im richtigen Leben! Auch komplexe Konstellationen wie z.B. ÃƒÂ¼bereinander liegende Bauteile und DrÃƒÂ¤hte, schrÃƒÂ¤g verlegte WiderstÃƒÂ¤nde o.ÃƒÂ¤. sind fÃƒÂ¼r die Software kein Problem. Sie kÃƒÂ¶nnen die Platine jederzeit drehen, und so problemlos beide Platinenseiten bearbeiten. Die &quot;RÃƒÂ¶ntgenblick&quot;-Funktion lÃƒÂ¤sst dabei DrÃƒÂ¤hte und Bauteile die sich auf der anderen Platinenseite befinden, auf Wunsch durchscheinen, als ob Sie die Platine von der RÃƒÂ¼ckseite mit einer starken Lichtquelle bestrahlen wÃƒÂ¼rden. So lassen sich in jeder Ansicht SignalverlÃƒÂ¤ufe und mechanischer Aufbau sehr gut erkennen. Mit der eingebauten PotentialprÃƒÂ¼fung verfolgen Sie auf einen Blick auch komplexe SignalverlÃƒÂ¤ufe. - Diverse Experimentierplatinen wÃƒÂ¤hlbar - Boardeditor zum Erstellen eigener Grundplatinen - Umfangreiche, fotorealistische Bauteilbibliotheken - PotentialprÃƒÂ¼fung zeigt alle Verbindungen an - &quot;RÃƒÂ¶ntgenblick&quot; lÃƒÂ¤sst RÃƒÂ¼ckseite durchscheinen - StÃƒÂ¼cklistenfunktionen, und vieles mehr...","torrent":{"xt":"urn:btih:389c54044ddb01ab5fc5192032a50815e70271a7","amp;dn":"LochMaster+3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"389c54044ddb01ab5fc5192032a50815e70271a7","infoHashBuffer":{"type":"Buffer","data":[56,156,84,4,77,219,1,171,95,197,25,32,50,165,8,21,231,2,113,167]},"announce":[],"urlList":[]}}