{"title":"The Beatles - With The Beatles (1963) WMA320","uid":6283784,"size":85974207,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:38d004453ab8d33b171af257f195a432dce93b57&amp;dn=The+Beatles+-+With+The+Beatles+%281963%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301540337,"description":"This is the album that launched Beatlemania in the U.S. Well, sort of. The cover is the same, but this is the U.K. version of the Beatles' second album, which was released only eight months after their debut in March of 1963. The U.S. version (entitled Meet the Beatles) included only nine of these songs and added &quot;I Want To Hold Your Hand&quot; and its b-side &quot;I Saw Her Standing There&quot; along with &quot;This Boy.&quot;\nBut even though this is not the version that millions of baby boomers (like myself) grew up with, it's still an essential album in the Beatles' catalog. Among the originals is their best song never released as a single, &quot;All My Loving.&quot; Also Ringo gets a vocal on the song originally given to the Rolling Stones, &quot;I Wanna Be Your Man.&quot; And George Harrison gets his first songwriting credit with &quot;Don't Bother Me.&quot;\n\nThe Beatles raid the Motown vaults for many of the covers. &quot;Please Mr. Postman,&quot; &quot;You've Really Got a Hold on Me&quot; and &quot;Money&quot; are highlights. The latter features one of Lennon's best vocals. [It wouldn't be until their next album when they released a collection of all original material.]\n\nAll told, this album catches the Beatles while they are still not too far removed from their Cavern Club and Hamburg days. As such, you hear an urgency and energy in their performance that sets their music apart from the rest of the British Invasion that followed. ESSENTIAL \n\nby Steve Vrana\n\nTRACKLIST:\n\n01 - It Won't Be Long.wma                                   \n02 - All I've Got To Do.wma                                 \n03 - All My Loving.wma                                      \n04 - Don't Bother Me.wma                                    \n05 - Little Me.wma                                          \n06 - Till There Was You.wma                                 \n07 - Please Mister Postman.wma                              \n08 - Roll Over Beethoven.wma                                \n09 - Hold Me Tight.wma                                      \n10 - You Really Got A Hold On Me.wma                        \n11 - I Wanna Be Your Man.wma                                \n12 - Devil In Her Heart.wma                                 \n13 - Not A Second Time.wma                                  \n14 - Money (That's What I Want).wma                         \n\nWMA 320Kbps 44100Hz STEREO\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:38d004453ab8d33b171af257f195a432dce93b57","amp;dn":"The+Beatles+-+With+The+Beatles+%281963%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d004453ab8d33b171af257f195a432dce93b57","infoHashBuffer":{"type":"Buffer","data":[56,208,4,69,58,184,211,59,23,26,242,87,241,149,164,50,220,233,59,87]},"announce":[],"urlList":[]}}