{"title":"Device Bondage--DB-29539 Mz Berlin and Penny Pax WMV","uid":8506366,"size":1471135214,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:399ec97f91cbf1de2f473c4bf5846eb6a10948dd&amp;dn=Device+Bondage--DB-29539+Mz+Berlin+and+Penny+Pax+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"merzedes","files":-1,"time":1369435961,"description":"Fragments VIII\n\nMay 24, 2013 - Performers: Mz Berlin  and  Penny Pax \n \n\nWMV only. MP4 + Pics later.\n\n\nFragments VIII\n\n n. fragment a part broken off or detached\nan isolated, unfinished, or incomplete part\nan odd piece, bit, or scrap. \n\n\nSCENE 1\nLatex slut is standing, ready, sweating onto herself with the moistness trapped in a film of rubber against her skin. She is made to slowly and sexily undress at the behest of Mz and insert a vaginal and anal inflatable plugs that are attached to latex panties into her holes. The panties are pulled up and inflated in the ass and cunt. Mz drags her over to the chair and she is bound stretched tight in clear straps. An inflatable gag is stuffed and filled in her mouth... she is now airtight. Mz works her over.... tormenting her, challenging her with nipple clamps, the tazapper, and vibrator.\n\n\nSCENE 2\nSlut is bent backwards standing into an intense arch spread. The fist of Mz slides easily into the cunt hole. Shackles are tightly bound to slut's tits - a cupcake of flesh spilling over and constricted. Flogging warms up and tenderizes the skin before clamps in a zipper fashion are applied along the torso. Slut melts into the hands of capable Mz. Draining her for cum, Mz Berlin's efforts are relentless.\n\n\nSCENE 3\nChocolate skinned bitch in romper gets schooled on the ways of Device by experienced handler Orlando. The drool runs down her face. With a closely trimmed head shave, this cunt has no where to hide. Everything is exposed. She is flogged till we can see the red come up from her skin. In order to be a proper slut, she has to be trained to fuck. Orlando orders her to ride the cock between her legs in an appealing fashion. Desperate, scared, the vibrator enters...\n\n\nSCENE 4\nShe is installed on her side in a strict strappado/forward bend predicament. Her feet are an easy target for the single tail and Orlando knows exactly how to torment someone that cannot see the sensations coming. Whimpering, desperate for the pain to end, Orlando rams a thick cock into her. Thrusting it in and out, coaxing newbie defiled cum out of her unpracticed holes. Cum drips down her leg, she is left to suffer alone.\n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=29539&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=29539&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:399ec97f91cbf1de2f473c4bf5846eb6a10948dd","amp;dn":"Device+Bondage--DB-29539+Mz+Berlin+and+Penny+Pax+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"399ec97f91cbf1de2f473c4bf5846eb6a10948dd","infoHashBuffer":{"type":"Buffer","data":[57,158,201,127,145,203,241,222,47,71,60,75,245,132,110,182,161,9,72,221]},"announce":[],"urlList":[]}}