{"title":"Ric Ocasek - Something To Grab For [promo].VOB","uid":6788856,"size":193912832,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3a0bba27080e248e344a94c0c69e37e768a760e2&amp;dn=Ric+Ocasek+-+Something+To+Grab+For+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1320193937,"description":"Ric Ocasek - Something To Grab For [promo].VOB\n\n\nHQ very rare promo music video. &quot;Something To Grab For&quot; is a single from Beatitude, the debut album released by Ric Ocasek, lead singer and principal songwriter of The Cars. It was released by Geffen Records in 1982, and featured an appearance by Greg Hawkes on keyboards, who is also from The Cars.\n\nRic Ocasek (born Richard T Otcasek on March 23, 1949 in Baltimore, Maryland) is an American musician and music producer. He is best known as lead vocalist (along with Ben Orr) and rhythm guitarist for the rock band, The Cars.\n\nOcasek's father, a computer analyst for NASA, was transferred to Cleveland, Ohio when he was 16. After graduating from high school in Cleveland, Ocasek then attended Bowling Green State University near Toledo, Ohio. He is married to model Paulina Porizkova.\n\nRic Ocasek's breakout success was as a founding member of the new wave band Cap'n Swing, later re-named The Cars, which had numerous hit songs from 1976 to 1988. He played rhythm guitar and sang lead vocals on many tracks, as well as playing keyboard instruments and bass. Ocasek was the principal songwriter of the band, and wrote nearly all of The Cars material, sharing credit on only a few songs with fellow bandmate Greg Hawkes as co-writer. During his time with The Cars, Ocasek developed a reputation as a successful producer, and took this role for many up-and-coming bands of differing genres including, but not limited to Weezer, Bad Brains, Bad Religion, Nada Surf, No Doubt, Guided by Voices, Bran Van 3000, and Suicide, as well as some of The Cars albums and singles. In 2010, Ocasek reunited with the surviving original members of The Cars to record their first album in 24 years, titled Move Like This, which came out on May 10, 2011.\n(video has a purple &quot;all request&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Beatitude_(Ric_Ocasek_album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Beatitude_(Ric_Ocasek_album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PaklMaadg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PaklMaadg&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 8241kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:44\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated July 22, 2011\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n","torrent":{"xt":"urn:btih:3a0bba27080e248e344a94c0c69e37e768a760e2","amp;dn":"Ric+Ocasek+-+Something+To+Grab+For+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a0bba27080e248e344a94c0c69e37e768a760e2","infoHashBuffer":{"type":"Buffer","data":[58,11,186,39,8,14,36,142,52,74,148,192,198,158,55,231,104,167,96,226]},"announce":[],"urlList":[]}}