{"title":"Allen Toussaint - The Complete Warner Bros. Recordings (MP3@256)","uid":10480148,"size":303986058,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a169139a1858204e3b1ced988bcbb43892c9cb8&amp;dn=Allen+Toussaint+-+The+Complete+Warner+Bros.+Recordings+%28MP3%40256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":44,"time":1404395219,"description":"His funky/groovy recordings for Warner Brothers 1972-78. \n\n\n&quot;Allen Toussaint is a legend who wrote and produced some of the greatest songs in New Orleans R&amp;B history, but his career as a recording artist is hardly legendary. He didn't record all that much and what he did wax is overshadowed by his compositions and productions -- which, admittedly, is understandable given the work he did with the Meters, Lee Dorsey, Aaron Neville, Ernie K-Doe, the Band, LaBelle, Irma Thomas, and many others. But not being legendary is hardly the same thing as not having merit, and Rhino Handmade's 2003 double-disc set The Complete Warner Recordings makes a convincing case that Toussaint's three albums for Warner and Reprise are among the best hidden treasures in soul music. These three albums -- which are augmented by a very different single version of &quot;Country John&quot; and a full live concert originally released in part on Rhino's 1989 various-artists collection New Orleans Jazz &amp; Heritage Festival, 1976 (although it apparently was recorded in Philadelphia in 1975), here presented in its entirety on the second disc -- represent the longest period of recording Toussaint had as a solo artist. He cut The Wild Sound of New Orleans by Tousan in 1958, at the peak of rock &amp; roll and R&amp;B's chart success (this material is collected on Bear Family's The Complete &quot;Tousan&quot; Sessions), but throughout the '60s he devoted himself to behind-the-scenes work before getting the chance to record his own albums in the early '70s, starting with Toussaint (later retitled From a Whisper to a Scream for a U.K. reissue), cut for Scepter Records in 1970. He then moved to Warner, where he recorded three albums -- 1972's Life, Love and Faith, 1975's Southern Nights, 1978's Motion -- that largely went unheard outside of New Orleans R&amp;B and soul circles. Apart from a few import and quasi-legal budget-line reissues, these albums remained out of print for years, only surfacing as selections on the excellent 1991 CD The Allen Toussaint Collection, which expertly summarizes these records. Such is the neglect bestowed upon these three records; even in his otherwise fine liner notes for The Complete Warner Recordings, Billy Vera glosses over these albums, spending about a page on them and never going into detail. All this means is that the music needs to speak for itself, which it certainly can do. Toussaint did something very interesting with his Warner recordings. He stayed grounded in the earthy New Orleans R&amp;B and funk that had been his bread and butter for many a year, but he spun it differently, bringing it in line with the smooth soul coming out of places like Philadelphia in the '70s, tempering it with a bit of a gloss borrowed from Los Angeles troubadours, yet retaining that distinctly Southern feel. Each album shares that sound, with each song clearly identifiable as the work of Allen Toussaint, but each has its own feel. Life, Love and Faith is the strongest and funkiest of the bunch, a Southern soul spin on West Coast singer/songwriter albums that is an excellent expansion of his signature sound. Southern Nights is Toussaint's album rock album, complete with a hazy theme and trippy instrumental interludes. Motion is his smooth commercial soul album, recorded with L.A. studio pros at Warner's insistence. The live album finds Toussaint returning to the basics of his music, which is at once earthy and sophisticated. While each of the albums apart from Life, Love and Faith might have a flaw -- Southern Nights is a bit unfocused, Motion a bit too slick, the live material can meander -- these are minor issues since there's such a wealth of wonderful music here. Toussaint has an easy, relaxed touch to his performances that enhances the sly elegance of his writing, whether it's on ballads like &quot;With You in Mind&quot; and the gorgeous &quot;What Do You Want the Girl to Do?&quot; or intricate funk like &quot;Victims of the Darkness&quot; and the dynamic, layered &quot;Last Train,&quot; or such idiosyncratic spins on classic New Orleans R&amp;B like &quot;Brickyard Blues&quot; and &quot;Shoo-Ra,&quot; the latter two taken from the live set. These are just a few of the many sublime moments on The Complete Warner Recordings -- moments so good, it's hard to believe that these albums have gone underappreciated for so long. Since this set is limited to 2,500 copies and only available through www.rhinohandmade.com, this doesn't necessarily rectify the situation -- after all, that's hardly a wide distrubition (then again, as Paul Gayten quoted in Vera's liner notes, &quot;New Orleans music is the greatest in the world, but it just doesn't sell to the mass public&quot;) -- but anybody who loves soul music and New Orleans R&amp;B needs to own this priceless set.&quot;\n\n/Allmusic","torrent":{"xt":"urn:btih:3a169139a1858204e3b1ced988bcbb43892c9cb8","amp;dn":"Allen+Toussaint+-+The+Complete+Warner+Bros.+Recordings+%28MP3%40256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a169139a1858204e3b1ced988bcbb43892c9cb8","infoHashBuffer":{"type":"Buffer","data":[58,22,145,57,161,133,130,4,227,177,206,217,136,188,187,67,137,44,156,184]},"announce":[],"urlList":[]}}