{"title":"The Go Masters","uid":3694066,"size":784914039,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a4f8a2619276bf71cb39e0dbb9a5cd7d845c844&amp;dn=The+Go+Masters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vash3g","files":2,"time":1179819439,"description":"Ten years before the outbreak of the Second World War in Asia, a Japanese Go master and his Chinese rival meet in China to play a game of Go (loosely described as an Asian version of chess). It soon becomes evident that the Chinese master&amp;#039;s son is the most talented player that the Japanese master has ever encountered, and he convinces the boy&amp;#039;s father to let him bring the child back to Japan to train him as a professional Go player. Years pass, and as the young Chinese master grows to maturity in Japan, the Japanese invasion of China forces him to choose between his triumphant career and his loyalty to his native country. His decision is complicated by his marriage to the daughter of the Japanese master, with whom he has produced a child. His choice will profoundly alter the lives of two families. Their saga serves as a reflection of the tragic relations between their two great countries, and the possibility of reconciliation and healing.\n(description taken from IMDB)\n\nJapanese title: Mikan no taikyoku\nMandarin title: Yu pan mei you xia wan de qi\n\nChinese with English subtitles.\n\nTaken from a decent VHS rip. This is a preliminary rip. The actual tape this was ripped from has mechanical defects. We are working on smoothing out the encode and the video track. The audio track has static sounds throughout but it does not overpower the rest of the track. Next release should fix both problems.\n\nThe video may seem jumpy, this is normal on slower machines as H.264 is a very processor intensive codec.\n","torrent":{"xt":"urn:btih:3a4f8a2619276bf71cb39e0dbb9a5cd7d845c844","amp;dn":"The+Go+Masters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a4f8a2619276bf71cb39e0dbb9a5cd7d845c844","infoHashBuffer":{"type":"Buffer","data":[58,79,138,38,25,39,107,247,28,179,158,13,187,154,92,215,216,69,200,68]},"announce":[],"urlList":[]}}