{"title":"MSI Everything But The Show","uid":12118262,"size":663393681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a583d35afcc2285844a2e4231df5c6791fa22ee&amp;dn=MSI+Everything+But+The+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Star_M","files":1,"time":1436775960,"description":"This is my first torrent upload ever, so hopefully I've done everything right (please be kind).\n\nI couldn't find this anywhere, and since I had to scan this for somebody anyway, I figured I'd put this up online for the BT community. So, for those of you who couldn't get it on Kickstarter or can't afford it or w/e, here it is, Mindless Self Indulgence's Kickstarter book, scanned the best I possibly could without dismantling my book. I haven't actually read it myself (something about waiting like 3 freakin' years for it made me less excited for it when it actually came) but anyway, here it is for all of you. Now you can read this limited edition book :)\n\nOnce unzipped, it comes in 3 flavors: ePub, PDF, and the loose JPEGs. And, yes, as a fan, that page saying &quot;buy their shit&quot; had to be there; sorry, but for free you could do a lot worse...\n\nI love MSI and support them and I do buy as much of their shit as I can, but I am also a BT addict and actually started buying their shit *after* torrenting their discography; but yeah, wanted to add here that if you're a fan you should give them some financial support, if you're able. They're cool people.\n\nI'll be seeding as much as I can but sometimes I do have to turn my computer off, anyway hopefully this'll catch on so I won't have to seed forever. If there's anything wrong at all with this torrent please let me know so I can correct it.\n\n~Star_M","torrent":{"xt":"urn:btih:3a583d35afcc2285844a2e4231df5c6791fa22ee","amp;dn":"MSI+Everything+But+The+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a583d35afcc2285844a2e4231df5c6791fa22ee","infoHashBuffer":{"type":"Buffer","data":[58,88,61,53,175,204,34,133,132,74,46,66,49,223,92,103,145,250,34,238]},"announce":[],"urlList":[]}}