{"title":"Muppets Celebration of 30 Years / Fantastic Miss Piggy Show","uid":9242391,"size":4560565301,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3a8f658aa44175210a62d91ed43c602518e9eb36&amp;dn=Muppets+Celebration+of+30+Years+%2F+Fantastic+Miss+Piggy+Show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":99,"time":1385301060,"description":"The Muppets: A Celebration of 30 Years and The Fantastic Miss Piggy Show\n\nHere are two rarely seen hourlong specials starring Jim Henson's Muppets, from 1986 and 1982. PAL (European) DVD format.\n\nThe Muppets: A Celebration of 30 Years has never been issued on DVD. This version has been painstakingly restored to DVD quality by the editor of The Thief and the Cobbler: Recobbled Cut. A German-dubbed PAL master was used for most of the video, with audio, original commercial breaks, some picture elements and some scenes restored from a commercially-sold PAL VHS (which was in fairly bad shape). Additional scenes and audio were restored from an NTSC VHS tape, recorded when the special aired. All video errors on the VHS material were painted out carefully.\n\nGreat care was taken to ensure that the special is uncut and of a high quality standard.\n\n\nThe Fantastic Miss Piggy Show is included from a rare Portuguese DVD.\n\n\n----\n\nThe Muppets: A Celebration of 30 Years aired on CBS on January 21, 1986.\n\nThis one-hour special celebrates the thirtieth anniversary of the Muppets, who hold a formal banquet to present a retrospective of their television and film appearances.\n\nHosted by Fozzie Bear and featuring guest of honor Kermit the Frog, the program provides an overview of the Muppets' history and musical highlights beginning with early appearances in the fifties.\n\n\nExecutive Producer: Diana Birkenfield\nProducer: Andrew Solt\nDirector: Peter Harris\nWriter: Jerry Juhl\nHistorians: Jane Henson and Bob Payne\nMuppet Performers: Jim Henson, Frank Oz, Jerry Nelson, Richard Hunt, Dave Goelz, Steve Whitmire, Caroll Spinney. Terry Angus, Kevin Clash, Michael Earl, Jonathan Paine\n\n\nThe Fantastic Miss Piggy Show is a one-hour television special starring the glamorous Miss Piggy, which aired on ABC on September 17, 1982. Miss Piggy hosts her own variety show, with special guests John Ritter, George Hamilton, and Andy Kaufman (as &quot;Tony Clifton&quot;). The special was filmed in Toronto between August 9 and 24 1982.\n\nUnder the direction of Kermit the Frog, the Muppets work in the studio control room and, amidst chaos, manage to keep the show on the air. Throughout the show, a romantic triangle develops among Miss Piggy, Ritter (who is smitten with the pig) and Hamilton (who is deeply uncomfortable with the star's romantic inclinations).\n\n\nGuest Stars: George Hamilton, John Ritter, Tony Clifton\n\nMuppet Performers: Frank Oz, Jim Henson, Dave Goelz, Richard Hunt, Kathryn Mullen, Karen Prell, Steve Whitmire, Terry Angus\n","torrent":{"xt":"urn:btih:3a8f658aa44175210a62d91ed43c602518e9eb36","amp;dn":"Muppets+Celebration+of+30+Years+%2F+Fantastic+Miss+Piggy+Show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a8f658aa44175210a62d91ed43c602518e9eb36","infoHashBuffer":{"type":"Buffer","data":[58,143,101,138,164,65,117,33,10,98,217,30,212,60,96,37,24,233,235,54]},"announce":[],"urlList":[]}}