{"title":"[Permaculture] Bill Mollinson - In Grave Danger of Falling Food","uid":3873038,"size":366628864,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3ab67b28d6890404a78336f43646af5d117c6d93&amp;dn=%5BPermaculture%5D+Bill+Mollinson+-+In+Grave+Danger+of+Falling+Food&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"diinero","files":1,"time":1194212094,"description":"[Permaculture] Bill Mollinson - In Grave Danger of Falling Food\n\nBill Mollinson, Australian designer and author, thinks the greatest threat to our planet is agriculture. He maintains that modern agricultural practices are destroying our soil and water and produce increasingly poisonous food. His alternative is the &amp;#039;permaculture&amp;#039; concept which turns even the smallest city garden into a fertile eco-system that can provide most of the food for an average family.\n\n---\n\nPermaculture is a design system which actualizes an environmental ethic, and which enriches the quality of human life by learning directly from nature. In this context, the term quality of life is a broadly inclusive concept which recognises that human well -being is inextricably linked to the health of the land.\n\n&quot;Permaculture is a philosophy and a practical approach to sustainable design in all aspects of life. It is a framework upon which to hang the ideas from many disciplines, an integrative method which enables us to design systems in which all elements work together in an integrated whole, including people, plants, buildings, animals and natural forces such as the sun and wind.&quot;.\n\nThis is not intended as an introduction to permaculture. The appendix contains a short summary of the basic principles of permaculture design.\n\nPermaculture ultimately transgresses a debate between an anthropocentric or biocentric view of nature, as it adopts a non-dualistic view of humans and nature, where there is no division between people and nature, such that nature does not become a space hypostatised as &amp;#039;other&amp;#039; and not &amp;#039;me&amp;#039;. Instead, &quot;to preserve the integrity, stability and beauty of the biotic community&quot; is seen as a integral to preserving a viable human community.","torrent":{"xt":"urn:btih:3ab67b28d6890404a78336f43646af5d117c6d93","amp;dn":"%5BPermaculture%5D+Bill+Mollinson+-+In+Grave+Danger+of+Falling+Food","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab67b28d6890404a78336f43646af5d117c6d93","infoHashBuffer":{"type":"Buffer","data":[58,182,123,40,214,137,4,4,167,131,54,244,54,70,175,93,17,124,109,147]},"announce":[],"urlList":[]}}