{"title":"Jasper Dent series by Barry Lyga (ePub Retail)","uid":8382740,"size":1038751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ad92ad10b07985d6b70647cc36a15ee7a19b9f9&amp;dn=Jasper+Dent+series+by+Barry+Lyga+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TxJag","files":6,"time":1366214574,"description":"Barry Lyga is the author of several acclaimed young adult novels, including The Astonishing Adventures of Fanboy and Goth Girl. He now knows way too much about how to dispose of a human body. Barry lives and writes in New York City. His website is www.barrylyga.com.\n\nJasper Dent series:\n\nI Hunt Killers (#1): What if the world's worst serial killer...was your dad?\n\nJasper (Jazz) Dent is a likable teenager. A charmer, one might say.\n\nBut he's also the son of the world's most infamous serial killer, and for Dear Old Dad, Take Your Son to Work Day was year-round. Jazz has witnessed crime scenes the way cops wish they could--from the criminal's point of view.\n\nAnd now bodies are piling up in Lobo's Nod.\n\nIn an effort to clear his name, Jazz joins the police in a hunt for a new serial killer. But Jazz has a secret--could he be more like his father than anyone knows?\n\nGame (#2): Billy grinned. &quot;Oh, New York,&quot; he whispered. &quot;We're gonna have so much fun.\n\nI Hunt Killers introduced the world to Jazz, the son of history's most infamous serial killer, Billy Dent.\n\nIn an effort to prove murder didn't run in the family, Jazz teamed with the police in the small town of Lobo's Nod to solve a deadly case. And now, when a determined New York City detective comes knocking on Jazz's door asking for help, he can't say no. The Hat-Dog Killer has the Big Apple--and its police force--running scared. So Jazz and his girlfriend, Connie, hop on a plane to the big city and get swept up in a killer's murderous game.\n\nBoth the stakes and the body count are higher in this suspenseful and unstoppable sequel from acclaimed author Barry Lyga.\n\nFull Retail ePub. Calibre ready. Metadata is complete.","torrent":{"xt":"urn:btih:3ad92ad10b07985d6b70647cc36a15ee7a19b9f9","amp;dn":"Jasper+Dent+series+by+Barry+Lyga+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ad92ad10b07985d6b70647cc36a15ee7a19b9f9","infoHashBuffer":{"type":"Buffer","data":[58,217,42,209,11,7,152,93,107,112,100,124,195,106,21,238,122,25,185,249]},"announce":[],"urlList":[]}}