{"title":"I Stand Corrected: How Teaching Western Manners in China epub","uid":11313943,"size":2215895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3af8b928ffb908d1ce75142f53ba3b74b4aee717&amp;dn=I+Stand+Corrected%3A+How+Teaching+Western+Manners+in+China+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1414531540,"description":"I Stand Corrected: How Teaching Western Manners in China Became Its Own Unforgettable Lesson\n\nDuring the course of a career that has, quite literarily, moved her around the world, no country has fascinated Eden Collinsworth more than China, where she has borne witness to its profound transformation. After numerous experiences there that might best be called &quot;unusual&quot; by Western standards, she concluded that despite China's growing status as a world economy, businessmen in mainland China were fundamentally uncomfortable in the company of their Western counterparts. This realization spawned an idea to work collaboratively with a major Chinese publisher on a Western etiquette guide, which went on to became a bestseller and prompted a branch of China's Ministry of Education to suggest that she create a curriculum for the school system. In I Stand Corrected, Collinsworth tells the entertaining and insightful story of the year she spent living among the Chinese while writing a book featuring advice on such topics as the non-negotiable issue of personal hygiene, the rules of the handshake, and making sense of foreigners. Scrutinizing the kind of etiquette that has guided her own business career, one which has unfolded in predominately male company, Collinsworth creates a counterpart that explains Chinese practices and reveals much about our own Western culture. At the same time, I Stand Corrected is a wry but self-effacing reflection on the peripatetic career she led while single-handedly raising her son, and here she details the often madcap attempts to strike a balance that was right for them both","torrent":{"xt":"urn:btih:3af8b928ffb908d1ce75142f53ba3b74b4aee717","amp;dn":"I+Stand+Corrected%3A+How+Teaching+Western+Manners+in+China+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af8b928ffb908d1ce75142f53ba3b74b4aee717","infoHashBuffer":{"type":"Buffer","data":[58,248,185,40,255,185,8,209,206,117,20,47,83,186,59,116,180,174,231,23]},"announce":[],"urlList":[]}}