{"title":"Thomas Ott - Cinema Panopticum","uid":7585792,"size":58589920,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3afceab2986f613915a5d62f0086c261dd3ccdb2&amp;dn=Thomas+Ott+-+Cinema+Panopticum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346404384,"description":"'Cinema Panopticum'\n\nFantagraphics Books, 2005, 90 pages\n\nBy Thomas Ott\n\nThomas Ott plunges into the darkness with five new graphic horror novelettes - 'The Prophet', 'The Wonder Pill', 'La Lucha', 'The Hotel', and the title story, each executed in his hallucinatory and hyper-detailed scratchboard style and running between 16 to 20 pages.\n\nThe first story in the book introduces the other four - A little girl visits an amusement park. She looks fascinated, but finds everything too expensive. Finally, behind the rollercoaster she eyeballs a small booth with 'CINEMA PANOPTICUM' written on it. Inside there are boxes with screens. Every box contains a movie; the title of each appears on each screen. Each costs only a dime, so the price is right for the little girl. She puts her money in the first box: &quot;The Prophet&quot; begins. In the film, a vagrant foresees the end of the world and tries to warn people, but nobody believes him. They will soon enough.\n\nIn the second film, 'The Wonderpill', a short-sighted man initially goes blind from some pills his doctor gave him, but soon the blindness wears off and he finds they accord quite a view. 'La Lucha', the third story, introduces a Mexican wrestler who fights against death himself. In a typical Ott twist, he wins and loses at the same time. The final story, 'The Hotel', depicts a traveler who goes to sleep in what seems to be an otherwise empty hotel. His awakening is the stuff of nightmares.\n\nOtt's O' Henry-esque plot twists will delight fans of classic horror like The Twilight Zone and Tales From the Crypt, his artwork will haunt you long after you've put the book down. ","torrent":{"xt":"urn:btih:3afceab2986f613915a5d62f0086c261dd3ccdb2","amp;dn":"Thomas+Ott+-+Cinema+Panopticum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3afceab2986f613915a5d62f0086c261dd3ccdb2","infoHashBuffer":{"type":"Buffer","data":[58,252,234,178,152,111,97,57,21,165,214,47,0,134,194,97,221,60,205,178]},"announce":[],"urlList":[]}}