{"title":"M3 Medium Tank vs Panzer III - Kasserine 1943 [Non-Fiction] PDF_","uid":8900351,"size":5578720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b3137d8fb027b282dc12a6ddd75ea0d26980a0e&amp;dn=M3+Medium+Tank+vs+Panzer+III+-+Kasserine+1943+%5BNon-Fiction%5D+PDF_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"K-Slender","files":3,"time":1378795240,"description":"ISBN13: 9781846032615\nISBN10: 184603261X\n\nSmarting from their defeat at El Alamein and with directives to save the North African campaign, Rommel's battle-hardened armored divisions confronted a fresh opponent in the form of the newly arrived Americans. This would be a duel between the stalwart of the Wehrmacht armored divisions - the Panzerkampfwagen III - and the American's as yet untested first armored division. In reality both would prove unequal to the task as they floundered amidst the rugged hills and ravines of the Tunisian landscape. This book charts the design and development of these two disparate rivals - their vastly different armament and armor as well as their tactical concepts. Mutually hampered by the climate, terrain, and lack of experience, this was a desperate struggle for supremacy. Moreover, it was a duel with far-reaching implications. For the Americans it was their first baptism of fire and the outcome would determine their future war strategy. For the Germans, this was the final throw of the dice to regain the overwhelming superiority they had enjoyed during the first years of the war. Analyzing the strengths and weaknesses of these two deadly opponents, this book explores the successes and failures of the Grant and Panzer III as they clashed at the critical battles of North Africa. Moreover it is an insight into the lives of the tank crews themselves as they struggled with the twin horrors of tank warfare and the fight for survival amidst some of the most inhospitable terrain on earth. ","torrent":{"xt":"urn:btih:3b3137d8fb027b282dc12a6ddd75ea0d26980a0e","amp;dn":"M3+Medium+Tank+vs+Panzer+III+-+Kasserine+1943+%5BNon-Fiction%5D+PDF_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b3137d8fb027b282dc12a6ddd75ea0d26980a0e","infoHashBuffer":{"type":"Buffer","data":[59,49,55,216,251,2,123,40,45,193,42,109,221,117,234,13,38,152,10,14]},"announce":[],"urlList":[]}}