{"title":"Clinical Anatomy - Applied Anatomy for Students and Junior Docto","uid":9500165,"size":31099810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c232fb1e609ae77392ea3dc91f2d07e64da1627&amp;dn=Clinical+Anatomy+-+Applied+Anatomy+for+Students+and+Junior+Docto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1390207441,"description":"Clinical Anatomy - Applied Anatomy for Students and Junior Doctors (13th Ed)\nby Harold Ellis and Vishy Mahadevan\nWiley-Blackwell | November 2013 | ISBN-10: 1118373774 | PDF | 500 pages | 29.6 mb\n\nTHE THIRTEENTH EDITION OF THE CLASSIC TEXTBOOK, FIRST PUBLISHED IN 1960\nWritten by one of the great teachers of anatomy, the thirteenth edition of Clinical Anatomy continues to provide thousands of medical students, postgraduate trainees and junior doctors across the world with essential anatomical information within a clinical setting. It is particularly appropriate for those preparing for the Intercollegiate Membership Examination of the Royal Colleges of Surgeons (I-MRCS).\nProfessor Harold Ellis is again joined by Professor Vishy Mahadevan to provide detailed, easy-to-follow structured text suitable for anatomy students and trainees of all levels.\nFully revised and updated with many new illustrations, this new edition features for the first time, several anatomical drawings overlaid on a living anatomy model to provide detailed topographical orientation and accurate surface representation.\nThe companion website at www.ellisclinicalanatomy.co.uk/13edition contains digital flashcards of all the illustrations and photographs contained in the book - ideal for revision and teaching purposes.\n\nAbout the Authors\nHarold Ellis - Clinical Anatomist, Guy's, King's and St Thomas' School of Biomedical Sciences\nEmeritus Professor of Surgery, Charing Cross and Westminster Medical School, London. Formerly Examiner in Anatomy, Primary FRCS (Eng)\nVishy Mahadevan - Barbers' Company Professor of Anatomy &amp; Professor of Surgical Anatomy, The Royal College of Surgeons of England, London. Member of the Court of Examiners, RCS England ","torrent":{"xt":"urn:btih:3c232fb1e609ae77392ea3dc91f2d07e64da1627","amp;dn":"Clinical+Anatomy+-+Applied+Anatomy+for+Students+and+Junior+Docto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c232fb1e609ae77392ea3dc91f2d07e64da1627","infoHashBuffer":{"type":"Buffer","data":[60,35,47,177,230,9,174,119,57,46,163,220,145,242,208,126,100,218,22,39]},"announce":[],"urlList":[]}}