{"title":"My Daughter's Fucking Blackzilla #3 - Anal Interracial Porn XXX","uid":10695671,"size":2416630151,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3c644363906aa60b62372b47396bf34ed5023488&amp;dn=My+Daughter%27s+Fucking+Blackzilla+%233+-+Anal+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"KidAtomic","files":-1,"time":1407166566,"description":"My Daughter's Fucking Blackzilla #3\n\nCOVERS AND SCREENS SEEN HERE:             &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=6&lt;/a&gt;\n\nSHARE! SHARE! SHARE! SHARE! SHARE! SHARE! SHARE! SHARE! SHARE! SHARE! SHARE!\n\nMore Meat Per Square Inch!!\n\nThe gigantic romantic! Cyclopean! Amalgamation of monstrous meat! Bigger than a Louisville Slugger! Goodness! Gracious! Black balls of desire! Thundering African-plundering white women! Brobdingnagian! As big and as hard as the Empire State Building!\n\n    Scene 1. Charlotte Stokely, Shane Diesel\n    Scene 2. Tobi Pacific, Shane Diesel\n    Scene 3. Leah Luv, Shane Diesel\n    Scene 4. Georgia Southe, Shane Diesel\n    Scene 5. Mia Bangg, Shane Diesel\n\nDirector\n    Zulu Royalle (as Zulu Royale)\n\nActresses:\n    Charlotte Stokely [Facial IR]\n    Georgia Southe [Facial IR]\n    Leah Luv [Facial IR]\n    Mia Bangg [Anal Facial IR]\n    Tobi Pacific [Facial IR]\n\nActors:\n    Shane Diesel [IR]\n\n*******************************************************************************\n \nBody of Review: Shane Diesel is the well equipped black man who took the last name of the popular Hollywood actor Vin Diesel as well as the first name of his most popular character. While that wouldn't cause much of a stir, the resemblance between the two (regardless of racial differences), is more than passing so I can see why Shane would promote it so often. In the case of his latest flick, My Daughter is Fucking Blackzilla 3, most of the early scenario footage is gone in order to focus solely on the sexual activity taking place on the infamous couch used in the series. I haven't seen the second volume in the series but if the third was anything like Blackzilla #1, I knew the ladies would be gasping for air as they tried to earn their dough with the man affectionately known as &quot;Blackzilla&quot;. The back cover went so far as to say: &quot;Prepare yourself for the gigantic romantic. Cyclopean!!!!! Amalgamation of monstrous meat!!! Bigger than a Louisville Slugger!! Goodness! Gracious! Black balls of desire! Thundering African-plundering white women!!! He's as big and as hard as the Empire State Building!&quot; That said, here's a quick look at the scenes by cast and action, noting that no condoms were used:\n\nScene One: Charlotte Stokely, an 18 year old girl next door type from Utah, was up first with Shane Diesel as he took her out for a coffee and snack before he promised to take her to his yacht. Claiming never to have done a black man before because her dad would kill her, she became interested in his dick as she checked out his bulge. The next thing you know, she's rubbing him through his pants and jerking him off; enlarging it even more with some oral. Of course she couldn't take more than a few inches on his baseball bat sized cock in her mouth as she continued to jerk him off but she still managed to get him increasingly hard as she worked him over to the best of her abilities. She then climbed aboard his penis for a vaginal ride although he did most of the work and she couldn't take his entire shaft inside her. His load was small compared to the size of his penis but the emphasis of the scene was oral over all else.\n\nScene Two: Tobi Pacific, an even cuter gal with pretty eyes and a skimpy bit of lingerie, claimed to want a black guy and she ended up with Shane Diesel. From Vancouver in Canada, she was skinnier than most and the scene skipped the usual pick up line crud in favor of starting off at the couch inside the apartment as Shane played with her to prepare her for the scene. She took one look at his dick and got nervous at how large it was but sucked away with abandon nonetheless. Her oral talents were better developed than Charlotte's were so fans of messy blowjobs will appreciate what she had to offer. This led to him screwing her pussy and I swear it looked like he was so big as to cause her stomach to bulge out a bit in response. It's rare that a gal so skinny can take a penis so large so while she wasn't the most energetic woman I've watched of late, she did do a solid job here. He choked her a little towards the end and rubbed out a load to her face but it was even smaller than the last load.\n\nScene Three: Leah Luv, a young gal with braces and a reputation for doing anything and everything sexually in her porn scenes, was up next with Shane Diesel after seeing his huge black dick. The scene came across as trying to get her involved by playing the race card but she then seemed to become self motivated as though participating in a sort of sexual Olympics. If you've seen her at work before, you'll know how small she is so even her time tested oral skills weren't up to the challenge of going all the way on him but she redeemed herself when impaling herself balls deep on his shaft vaginally. Admittedly, she wasn't as sexually aggressive taking him inside her as she usually is with a partner but given his size, that's part of the price you pay for seeing Shane at work. It was a pretty decent scene overall though.\n\nScene Four: Georgia Southe, a lean redhead with glasses, was another one to dispense with the opening scenario as she climbed onto the couch with Shane Diesel. While not a particularly attractive gal (to me at least), she seemed willing to give his shaft the old college try as she took about a third of him inside her mouth while she pumped his shaft according to the tenants of pleasure. The only real problem with the scene was that she was a lazy fuck when he pumped away at her, even less willing to move about then the other gals of the movie when they were taking care of his needs. It was kind of strange to hear Shane tell her to tighter up her pussy as he screwed her too (how loose could it have been with him inside of her?) but she fit the physical profile of the type of gal used in the series (small, lean, and tiny). It ended in the expected facial but at least she swallowed it down (and it wasn't as small a load as the other scenes).\n\nScene Five: Mia Bangg, an attractive blonde with more curves than the other gals used in the movie, was on the front DVD cover (both versions too) for a reason; primarily the way she took to Shane Diesel and his dick. They were both on the same old couch and he dropped his pants to give her a glimpse of his massive meat. She was hesitant but managed to give him some minor head just the same. Her strength was not in being able to deepthroat him so much as actively ride him vaginally. They did several positions and as she got used to him, they played with some anal (literally hurting her as he stuffed about two thirds of it in her rectum). In any case, the scene was more complete than the others so fans of anal will appreciate her attempts to handle him like the others could only dream of. It ended with a good sized facial that she seemed to enjoy, marking the end of the show.\n\nSummary: My Daughter is Fucking Blackzilla 3 was worth a rating of Recommended for anyone looking for a straightforward interracial title focusing on small gals taking on the infamous Blackzilla. The shock factor alone should be enough to keep fraternity houses in howls as they drink to excess and wish they were as genetically gifted as Shane but while I prefer situations where the gals look more engaged in the sex acts rather than how much they could handle. Also, one of the tenants of the series is to get the women to say how much they like &quot;N&quot; dick (over and over in fact) so if you're one of those who is politically correct, you might want to avoid listening to the show, even if Shane and director Zulu pretty much require the gals to say the word repeatedly. If you hate interracial or have penis envy at seeing large cocks in small gals, avoid this one but otherwise give it a look or three for what it is meant to be. ","torrent":{"xt":"urn:btih:3c644363906aa60b62372b47396bf34ed5023488","amp;dn":"My+Daughter%27s+Fucking+Blackzilla+%233+-+Anal+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c644363906aa60b62372b47396bf34ed5023488","infoHashBuffer":{"type":"Buffer","data":[60,100,67,99,144,106,166,11,98,55,43,71,57,107,243,78,213,2,52,136]},"announce":[],"urlList":[]}}