{"title":"Oxford Handbook Of Urology (1st Edition)","uid":7966959,"size":11369245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cd2d5e122894e3dde7c02ed4bd1416a0c6a1225&amp;dn=Oxford+Handbook+Of+Urology+%281st+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"shafi3803","files":-1,"time":1356707018,"description":"Oxford Handbook Of Urology\n\nGeneral Information\nPublication Date: April 15, 2009\n ISBN-10: 0199534942\n ISBN-13: 978-0199534944\n Edition: 2nd\n\nDescription\nApproximately 20% of all surgical operations and a similar percentage of surgical emergencies are urological in nature. However, doctors often have very limited experience with the many common and varied conditions encountered in this important surgical specialty. For the doctor or nurse expected to provide the initial assessment and management of a condition with which he or she has had very limited experience, this book provides an invaluable source of information and advice. This applies not only to SHOs and specialist registrars on urology and surgical rotations, but also to General Practitioners, Accident and Emergency staff, and the growing number of urological specialist nurses.\n\nThe Oxford Handbook of Urology, Second Edition covers a wide spectrum of diseases and their treatment in the field of urology and surgical aspects of kidney, bladder, prostate, and scrotal disorders. It aims to give a brief overview of many different urological subjects, including urology emergencies, cancers, infections, children's disorders and kidney stone disease. It is designed so that it can be quickly and efficiently accessed by a range of people involved in patient care, including medical students, nurses, surgical and urology doctors, and general practitioners.","torrent":{"xt":"urn:btih:3cd2d5e122894e3dde7c02ed4bd1416a0c6a1225","amp;dn":"Oxford+Handbook+Of+Urology+%281st+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cd2d5e122894e3dde7c02ed4bd1416a0c6a1225","infoHashBuffer":{"type":"Buffer","data":[60,210,213,225,34,137,78,61,222,124,2,237,75,209,65,106,12,106,18,37]},"announce":[],"urlList":[]}}