{"title":"Aleister Crowley's Diary of a Drug Fiend","uid":9212417,"size":1240519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d8a9d9d5cd324dcfc81ecdb63bd78449d780e73&amp;dn=Aleister+Crowley%27s+Diary+of+a+Drug+Fiend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"voxtelum","files":4,"time":1384813120,"description":"I couldn't find this anywhere and wanted to share the wealth!\n\n\nThis is the de-DRM'ed Amazon version in mobi and epub.\n\nIt's untouched except I replaced the cartoonish cover with the classic blue one attributed to Crowley.\n\n\nFrom Wikipedia:\n\nDiary of a Drug Fiend, published in 1922, was occult writer and mystic Aleister Crowley's first published novel, and is also reportedly the earliest known reference to the Abbey of Thelema in Sicily.\n\n\nPlot introduction\n\nThe story is widely thought to be based upon Crowley's own drug experiences, despite being written as a fiction. This seems almost conclusively confirmed by Crowley's statement in the novel's preface: &quot;This is a true story. It has been rewritten only so far as was necessary to conceal personalities.&quot; Crowley's own recreational drug use and also his personal struggle with drug addiction, particularly heroin, is well documented.\nCrowley made a study of drugs and their effects upon the body and mind, experimenting widely himself. Many of his conclusions are present within this novel. The story follows Peter Pendragon and Louise Laleham, a couple passionately in love, as they fall head-first into a drug binge across Europe. Diary of a Drug Fiend encapsulates much of Crowley's core philosophy concerning Thelema and his conception of True Will.\nPlot summary[edit]\n\nThe protagonists find themselves desperate after their drug supply diminishes. The particulars of their desperate addiction and cravings are documented in realistic detail. The pair, however, are saved from destruction by an adept Magician named King Lamus. This mysterious and charismatic figure frees Pendragon and Lou from their addictions through the use of Magickal techniques, aimed at mastering True Will and releasing the individual from sloth, self-destructive impulses and craving.","torrent":{"xt":"urn:btih:3d8a9d9d5cd324dcfc81ecdb63bd78449d780e73","amp;dn":"Aleister+Crowley%27s+Diary+of+a+Drug+Fiend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d8a9d9d5cd324dcfc81ecdb63bd78449d780e73","infoHashBuffer":{"type":"Buffer","data":[61,138,157,157,92,211,36,220,252,129,236,219,99,189,120,68,157,120,14,115]},"announce":[],"urlList":[]}}