{"title":"Neil Sedaka - All Time Greatest Hits: Vol. 2 (1991)","uid":8685049,"size":343763913,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3de2ba63aa4bcc5a8a3da10cccc7687d0849e499&amp;dn=Neil+Sedaka+-+All+Time+Greatest+Hits%3A+Vol.+2+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":29,"time":1373779096,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nNeil Sedaka - All Time Greatest Hits: Vol. 2 (1991)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51H08xIwFwL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51H08xIwFwL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by William Ruhlmann):\n\nSinger, songwriter, and pianist Neil Sedaka enjoyed two distinct periods of commercial success in two slightly different styles of pop music: first, as a teen pop star in the late '50s and early '60s, then as a singer of more mature pop/rock in the '70s. In both phases, Sedaka, a classically trained pianist, composed the music for his hits, which he sang in a boyish tenor. And throughout, even when his performing career was at a low ebb, he served as a songwriter for other artists, resulting in a string of hits year in and year out, whether recorded by him or someone else. For himself, he wrote eight U.S. Top Ten pop hits, including the chart-toppers &quot;Breaking Up Is Hard to Do,&quot; &quot;Laughter in the Rain,&quot; and &quot;Bad Blood.&quot; The most successful cover of one of his compositions was Captain &amp; Tennille's recording of &quot;Love Will Keep Us Together,&quot; another number one. And over the years his songs were recorded by a wide range of pop, rock, country, R&amp;B, and jazz performers including ABBA, Frankie Avalon, LaVern Baker, Shirley Bassey, Teresa Brewer, Carol Burnett, Glen Campbell, the Carpenters, Nick Carter, David Cassidy, Cher, Petula Clark, Richard Clayderman, Patsy Cline, Rosemary Clooney, Sheryl Crow, Vic Damone, Bobby Darin, John Davidson, Neil Diamond, Gloria Estefan, the 5th Dimension, the Four Seasons, Connie Francis, Crystal Gayle, Lesley Gore, the Happenings, Engelbert Humperdinck, Wanda Jackson, Jan &amp; Dean, Tom Jones, Carole King, Earl Klugh, Peggy Lee, Little Anthony &amp; the Imperials, Tony Martin, Johnny Mathis, Susannah McCorkle, Clyde McPhatter, Mandy Moore, Nana Mouskouri, Maria Muldaur, the Monkees, Jim Nabors, Wayne Newton, Jane Olivor, Donny Osmond, Patti Page, the Partridge Family, Bernadette Peters, Wilson Pickett, Elvis Presley, Cliff Richard, the Searchers, Sha Na Na, Kay Starr, John Travolta, Dinah Washington, Andy Williams, and Glenn Yarbrough, among many others.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/neil-sedaka-p3147/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/neil-sedaka-p3147/biography&lt;/a&gt;\n\nAll Music Album Review (by William Ruhlmann):\n\n&quot;A few years ago, RCA Records released the first volume of Neil's greatest hits and it has proven to be one of their best sellers,&quot; writes compilation co-producer Steve Kolanjian in his liner notes to this album, adding, &quot;Not all his hits were covered in that volume so here, at last, is another collection of songs that made Neil Sedaka the superstar that he is.&quot; Nearly everything Kolanjian says here is untrue, or at very least deceptive. In particular, while it may be technically accurate to say that not all of Sedaka's RCA hits were covered in the 1988 album All Time Greatest Hits, every one that made the Top 30 in Billboard's Hot 100 was. Sedaka's initial hitmaking period stretched across four years, from early 1959 to mid-1963, and All Time Greatest Hits covers that period. All that's left are six singles that got no higher than number 33, most of them made between the second half of 1963 and early 1966, as Sedaka struggled unsuccessfully to avoid being swept off the charts by the British Invasion. All of those singles are included on All Time Greatest Hits, Vol. 2, along with LP tracks and singles that didn't chart at all, plus the occasional stray B-side and alternate take. Most of these recordings have never been issued on an album before. A more appropriate title for this disc would be All Time Greatest Flops. That said, much of the material has merit. Sedaka toys with country sounds (&quot;The Same Old Fool&quot;), gets bluesy (&quot;Don't Lead Me On&quot;), and otherwise experiments in search of a new hit formula. Sedaka fans will welcome the rarities: the version of &quot;The Diary&quot; is an alternate take representing Sedaka's first work in an RCA studio; 15 of the tracks are heard in stereo for the first time; and track 21 finds Sedaka recording a promotion for an Australian radio station. All of that should make this disc a must for collectors. But casual fans will find themselves puzzled as they struggle to recognize most of these so-called hits. (Note to Steve Kolanjian: Peter Allen and Chris Allen, co-authors with Dick Everitt of the minor Sedaka chart entries &quot;The World Through a Tear&quot; and &quot;The Answer to My Prayer,&quot; were not brothers, even though they performed under the name the Allen Brothers.)\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/all-time-greatest-hits-vol-2-r17643/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/all-time-greatest-hits-vol-2-r17643/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000008KJC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000008KJC&lt;/a&gt;\n\nTrack List:\n\n01. The Diary\n02. I Go Ape\n03. Stupid Cupid\n04. The Same Old Fool\n05. Don't Lead Me On\n06. All The Words In The World\n07. Waiting For Never (La Terza Luna)\n08. Look Inside Your Heart\n09. The Dreamer\n10. Bad Girl\n11. Wait 'Till You See My Baby\n12. The Closest Thing to Heaven\n13. Sunny\n14. I Hope He Breaks Your Heart\n15. Let The People Talk\n16. In The Capel With You\n17. The World Through A Tear\n18. The Answer To My Prayer\n19. Blue Boy\n20. We Can Make It If We Try\n21. Station Announcements\n","torrent":{"xt":"urn:btih:3de2ba63aa4bcc5a8a3da10cccc7687d0849e499","amp;dn":"Neil+Sedaka+-+All+Time+Greatest+Hits%3A+Vol.+2+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de2ba63aa4bcc5a8a3da10cccc7687d0849e499","infoHashBuffer":{"type":"Buffer","data":[61,226,186,99,170,75,204,90,138,61,161,12,204,199,104,125,8,73,228,153]},"announce":[],"urlList":[]}}