{"title":"Nubiles-Casting - Adria Rae, Piper Perri (Piper Perri Cast Adria","uid":12533271,"size":583445188,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3e655a43ce42496cb44b21ff48c18f6222132fb1&amp;dn=Nubiles-Casting+-+Adria+Rae%2C+Piper+Perri+%28Piper+Perri+Cast+Adria&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1444298481,"description":"Spinner babe Piper Perri is ready to try her hand at casting for Nubiles. Her first interviewee is lusty spinner Adria Rae, a perky brunette with a tight little body that Piper instantly falls in love with. After encouraging Adria to peel off her clothes so that she can admire her small boobs and bald pussy, Piper brings out Johnny Castle so that Adria can demonstrate her sensuality.Johnny is a willing prop as Adria puts her blowjob skills on display. She does such a good job that Piper can't keep her clothes on! Soon the blonde is on her knees beside Adria, putting her tongue to work for a double blowjob. When their lusty licking turns into a full-blown threesome with Johnny going to town on Adria's juicy bald pussy, Piper is happy to do whatever it takes to make sure that her partners are getting the most pleasure possible.The last step to passing her Nubiles interview is for Adria to bring Johnny off. She plays her part eagerly, creating a double pussy stack with Piper's help so that Johnny can fuck until the last possible moment when he pulls out and cums all over Piper's ass and Adria's pussy in a hot sticky stamp of approval.\r\nTags: Medium Boobs, Shaved Pussy, Brunette, Blonde, Long hair, Hardcore, Lesbian, Girl-Girl-Boy, Blowjob, Casting, Licking\r\n \nhttp://imgdone.com/viewer.php?file=27573046656960560600.jpg\r\n \nhttp://imgdone.com/viewer.php?file=03795011522730629430.jpg","torrent":{"xt":"urn:btih:3e655a43ce42496cb44b21ff48c18f6222132fb1","amp;dn":"Nubiles-Casting+-+Adria+Rae%2C+Piper+Perri+%28Piper+Perri+Cast+Adria","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e655a43ce42496cb44b21ff48c18f6222132fb1","infoHashBuffer":{"type":"Buffer","data":[62,101,90,67,206,66,73,108,180,75,33,255,72,193,143,98,34,19,47,177]},"announce":[],"urlList":[]}}