{"title":"Handbook of Organizational Creativity","uid":7319036,"size":5384603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ec239792cb2b5512c9e7f67eb8f83efac6a1cd8&amp;dn=Handbook+of+Organizational+Creativity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"chami1988","files":-1,"time":1338571321,"description":"Handbook of Organizational Creativity\nISBN: 0123747147 | 2011 | PDF | 754 pages \n\n\n\nHandbook of Organizational Creativity is designed to explain creativity and innovation in organizations. This handbook contains 28 chapters dedicated to particularly complex phenomena, all written by leading experts in the field of organizational creativity. The format of the book follows the multi-level structure of creativity in organizations where creativity takes place at the individual level, the group level, and the organizational level. Beyond just theoretical frameworks, applications and interventions are also emphasized. This topic will be of particular interest to managers of creative personnel, and managers that see the potential benefit of creativity to their organizations.\n*Information is presented in a manner such that students, researchers, and managers alike should have much to gain from the present handbook *Variables such as idea generation, affect, personality, expertise, teams, leadership, and planning, among many others, are discussed *Specific practical interventions are discussed that involve training, development, rewards, and organizational development *Provides a summary of the field's history, the current state of the field, as well as viable directions for future research\n","torrent":{"xt":"urn:btih:3ec239792cb2b5512c9e7f67eb8f83efac6a1cd8","amp;dn":"Handbook+of+Organizational+Creativity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec239792cb2b5512c9e7f67eb8f83efac6a1cd8","infoHashBuffer":{"type":"Buffer","data":[62,194,57,121,44,178,181,81,44,158,127,103,235,143,131,239,172,106,28,216]},"announce":[],"urlList":[]}}