{"title":"Age of Wonders 2: Wizards Throne and Shadow Magic ( RUS/ ENG)","uid":4417539,"size":1524936770,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3efbca4cbd86e005e66918dd3ab9ef2185f0cc37&amp;dn=Age+of+Wonders+2%3A+Wizards+Throne+and+Shadow+Magic+%28+RUS%2F+ENG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Unruly_Peerat","files":3,"time":1222561730,"description":"Age of Wonders 2: The Wizard&amp;#039;s Throne is a turn-based, strategy PC-game in a fantasy setting. The first sequel to Age of Wonders, it was developed by Triumph Studios, a Dutch game developer.\n\nUnlike in Age of Wonders, where the player has the option of removing their leader from the map, players in Age of Wonders 2 take the role of an immortal spell-casting Wizard, who cannot be upgraded, but in certain circumstances can survive being killed.\n\n\n\nAge of Wonders: Shadow Magic or AOW:SM is a turn-based, strategy PC-game in a fantasy setting.Shadow Magic is the third incarnation of the Age of Wonders series, and is a direct sequel to Age of Wonders 2: The Wizard&amp;#039;s Throne. All three games were developed by Triumph Studios, a Dutch game developer.\n\nThe game features a world on three different levels, the Surface, the Underground and the Shadow World. Some scenarios only include the Surface world, because the Underground and the Shadow World are optional. The game can either be played in a simultaneous mode, wherein players move their units at the same time during a turn, and in a traditional turnbased mode. Note that both modes are still turnbased.\nThe game is played both in an overworld mode, on which parties are moved and raised, structures are built and heroes are contracted, as well as a battle mode.\n","torrent":{"xt":"urn:btih:3efbca4cbd86e005e66918dd3ab9ef2185f0cc37","amp;dn":"Age+of+Wonders+2%3A+Wizards+Throne+and+Shadow+Magic+%28+RUS%2F+ENG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3efbca4cbd86e005e66918dd3ab9ef2185f0cc37","infoHashBuffer":{"type":"Buffer","data":[62,251,202,76,189,134,224,5,230,105,24,221,58,185,239,33,133,240,204,55]},"announce":[],"urlList":[]}}