{"title":"Chaos-based Cryptography","uid":6577410,"size":6866740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f02ec1b7c3d5c22f8d0501cb87e38dde016f2cb&amp;dn=Chaos-based+Cryptography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1312268983,"description":"Ljupco Kocarev, &quot;Chaos-based Cryptography: Theory, Algorithms and Applications (Studies in Computational Intelligence)&quot;\n Publisher: S***ger | ISBN 10: 3642205410 | 2011 | PDF | 400 pages | 6.54 MB\n\n Chaos-based cryptography, attracting many researchers in the past decade, is a research field across two fields, i.e., chaos (nonlinear dynamic system) and cryptography (computer and data security). It Chaos' properties, such as randomness and ergodicity, have been proved to be suitable for designing the means for data protection.\n The book gives a thorough description of chaos-based cryptography, which consists of chaos basic theory, chaos properties suitable for cryptography, chaos-based cryptographic techniques, and various secure applications based on chaos. Additionally, it covers both the latest research results and some open issues or hot topics.\n The book creates a collection of high-quality chapters contributed by leading experts in the related fields. It embraces a wide variety of aspects of the related subject areas and provide a scientifically and scholarly sound treatment of state-of-the-art techniques to students, researchers, academics, personnel of law enforcement and IT practitioners who are interested or involved in the study, research, use, design and development of techniques related to chaos-based cryptography.","torrent":{"xt":"urn:btih:3f02ec1b7c3d5c22f8d0501cb87e38dde016f2cb","amp;dn":"Chaos-based+Cryptography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f02ec1b7c3d5c22f8d0501cb87e38dde016f2cb","infoHashBuffer":{"type":"Buffer","data":[63,2,236,27,124,61,92,34,248,208,80,28,184,126,56,221,224,22,242,203]},"announce":[],"urlList":[]}}