{"title":"Sexually Broken--Big bootied spinner throat blasted Jynx Maze Ma","uid":8822523,"size":1345568859,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3f53271d9feca0407ba2da800c31b22de629ec58&amp;dn=Sexually+Broken--Big+bootied+spinner+throat+blasted+Jynx+Maze+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"merzedes","files":-1,"time":1376737623,"description":"Big bootied spinner throat blasted, rag doll fucked and suspended upside down! | Jynx Maze | Matt Williams\n\nAugust 16, 2013 \n\n\nMP4 only. \n\n \nPocket-sized Latina stunner Jynx Maze has a booming bootie and a super sensitive pussy. Her all natural curves are the type that inspires men. In this case, it inspires us to tie her up and throat fuck her into next week.\n\nWe start off binding her strictly onto a bed, legs spread and that overly sensitive pussy exposed and helpless. Once the vibrations start she is immediately begging for mercy. Some girls hardly notice the hitachi. Some girls cunts are so sexually responsive that a hitachi is torture. Jynx is of the later persuasion. Let's have some fun with that, shall we? It is all too much for Jynx, she desperately tries to escape the stimulation, but the ropes keep her firmly bound in place. That wide-open mouth begging for relief inspires us and we turn her throat into a cock sheath. Jynx can't decide which one is harder to take, her pussy being vibrated mercilessly or a rock hard cock down the throat cutting off all air.\n\nOnce we have used her throat to our content, we switch to that sensitive pussy of hers and fuck her deep into the mattress. Jynx's eyes glaze over and the thick throat spit our dick brought up slides down her pretty little face. There is nothing she can do but endure. Pretty girls are so much fun to take down a peg or two, and the cock is the perfect tool to do it with.\n\nJynx might think we are almost done with her, but she is sadly mistaken. Her bondage is quickly shifted and she suddenly finds herself hanging upside down with the vibrator jammed back into that responsive little slit of hers. Today might be the day she truly grasps the meaning of the term &quot;Sexually Broken&quot;. Her wails just make us jam the dick down her throat again. She sputters and gasps as she fights for air. Seeing those puffy nipples of hers begging for attention we add some weights and then walk off leaving her dangling, weighted and vibrated. Today is a day she won't be forgetting any time soon... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_16jmaze3/SexuallyBroken-Jynx-Maze-Matt-Williams-Big-bootied-spinner-throat-blasted-rag-doll-fucked-and-suspended-upside-down.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_16jmaze3/SexuallyBroken-Jynx-Maze-Matt-Williams-Big-bootied-spinner-throat-blasted-rag-doll-fucked-and-suspended-upside-down.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:3f53271d9feca0407ba2da800c31b22de629ec58","amp;dn":"Sexually+Broken--Big+bootied+spinner+throat+blasted+Jynx+Maze+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f53271d9feca0407ba2da800c31b22de629ec58","infoHashBuffer":{"type":"Buffer","data":[63,83,39,29,159,236,160,64,123,162,218,128,12,49,178,45,230,41,236,88]},"announce":[],"urlList":[]}}