{"title":"Racing.Manager.2014-BACKLASH","uid":9318913,"size":111735307,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3f63fe12b0efa3644cf82a301a3d776af91e4ca7&amp;dn=Racing.Manager.2014-BACKLASH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":3,"time":1386511212,"description":"b a c k l a s h\np r o u d l y p r e s e n t s\n\ntitle\n\nRacing Manager 2014 (c) Kalypso Media\n\ninformation\n\nRelease Date: 06-DEC-2013 Release Size: 23 Disks\nGame Type: Simulation Protection: Condom\n\nrelease notes\n\nTest your managerial skills with Racing Manager 2014 - the most\nin-depth racing team management simulation to date!\n\nAssume control of one of the pre-defined teams or create your very\nown and prepare to storm the ranks of the racing world. Hire\ndrivers, mechanics, engineers and designers, put each of them in the\nperfect position and decide which training sessions are best for\nyour drivers\n\nDesign the ideal race car, buy spare parts, sign contracts with\nengine manufacturers, give your ride a paint job and plaster it with\ndecals from the best advertisement contracts you can find. Racing\nManager 2014 also features an extensive research system. Put your\ndesigner team to the test on a tech tree of over 100 projects or use\nthe espionage feature to snatch new technologies from your\ncompetitors\n\nWhen it's time to race, define and refine your race strategy, plan\npit stops, manage fuel and tire pressure and listen to your drivers'\nfeedback to gain the upper hand and move one step closer to your\nultimate goal: to win the World Championship!\n\nFeatures:\n\n* Create your very own drivers with skills, strengths and\nweaknesses and build a new racing team with unique\nstarting technologies and abilities\n* Research more than 100 new car technologies using\nan extensive technology tree\n* Hire and train engineers, mechanics, drivers and designers and\nutilize team dynamics to make the best use of your crew\n* Expand your team ground, build different structures including\na wind tunnel or a fitness center\n* Show your success by buying sports cars, buying\na yacht or a villa\n* Tailor a car setup for each track and driver, customizing\neverything from engine supplier to tire pressure\nto flipup angle\n\nRipped: Nothing\n\n/Team Backlash\n\ninstall notes\n\n\n1) Start Setup\n2) Play!\n\nHave fun!","torrent":{"xt":"urn:btih:3f63fe12b0efa3644cf82a301a3d776af91e4ca7","amp;dn":"Racing.Manager.2014-BACKLASH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f63fe12b0efa3644cf82a301a3d776af91e4ca7","infoHashBuffer":{"type":"Buffer","data":[63,99,254,18,176,239,163,100,76,248,42,48,26,61,119,106,249,30,76,167]},"announce":[],"urlList":[]}}