{"title":"THE ULTIMATE TEA DIET-EBOOK try it now-SHAREGO.rar","uid":4769304,"size":1842066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f705db2646d2caceb740ea3fe3cb0d178a5e3b7&amp;dn=THE+ULTIMATE+TEA+DIET-EBOOK+try+it+now-SHAREGO.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dodgerblue","files":1,"time":1236983969,"description":"The Ultimate Tea Diet: How Tea Can Boost Your Metabolism SHAREGO\n[IMG]http://i269.photobucket.com/albums/jj44/downarchive2/moderator/TeaDiet_001.jpg[/IMG]\nNow, it's time for tea to be recognized, not only for all of these wonderful health benefits, but also for its ability to help tea drinkers lose weight.\n\n\nThe Ultimate Tea Diet harnesses tea's incredible weight-loss potential in a straight-forward plan for losing weight in a safe and healthy way. Simply find a tea you love, drink it all day, follow an easy food plan, and see the pounds fall off.\n\nTea's ability to encourage weight loss comes from the synergy of its three main ingredients: caffeine to stimulate, L-theanine to neutralize the harmful side effects of caffeine and act as an appetite suppressant, and EGCG, which causes you to burn fat faster and more efficiently. In other words, tea reduces your appetite and stimulates your metabolism.\n\nDon't worry--you won't go hungry on the Ultimate Tea Diet. The food plan includes tasty tea-based meals for breakfast, lunch, and dinner as well as tempting choices for midday snacks and sweet treats. All are made deliciously with tea so not only is your food incredibly flavorful, but you're also getting the health and weight-loss benefits in every single bite you enjoy.\n\nDrinking tea--and maintaining a conscientious focus on good health--can easily become a way of life. Slim down to a leaner, more energetic, and healthier you with the Ultimate Tea Diet.\n\nTea has been widely recognized for its amazing health benefits. It can help:\n\n- Boost the immune system\n\n- Lower blood sugar and cholesterol\n\n- Prevent cavities and tooth decay\n\n- Slow the aging process\n\n- Decrease high blood pressure\n\n- Prevent arthritis\n\n- Sharpen mental focus and concentration\n\n- Reduce the risk of stroke, heart disease, cancer, and more...\n[img]http://1337x.org/torrentimg-14558.png[/img]","torrent":{"xt":"urn:btih:3f705db2646d2caceb740ea3fe3cb0d178a5e3b7","amp;dn":"THE+ULTIMATE+TEA+DIET-EBOOK+try+it+now-SHAREGO.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f705db2646d2caceb740ea3fe3cb0d178a5e3b7","infoHashBuffer":{"type":"Buffer","data":[63,112,93,178,100,109,44,172,235,116,14,163,254,60,176,209,120,165,227,183]},"announce":[],"urlList":[]}}