{"title":"THE FEW - Alex Kershaw. Read by Scott Brick {FerraBit}","uid":6046224,"size":410686754,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3ff340efb663a050d7982d375ba4f790ed896a49&amp;dn=THE+FEW+-+Alex+Kershaw.+Read+by+Scott+Brick+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FerraBit","files":-1,"time":1292561999,"description":"THE FEW by Alex Kershaw (2006)\n\nThe Few: The American &quot;Knights of the Air&quot; Who Risked \n\tEverything to Fight in the Battle of Britain\n\nRead by . . : Scott Brick\nPublisher . : Brilliance Audio (2006)\nISBN . . . .: 1423315979 | 9781423315971\nFormat . . .: MP3. 16 tracks, 389 MB\nBitrate . . : 96 kbps (from source CD, CBR, Mono, 44.1 kHz)\nSource . . .: 1 Mp3-CD (8.9 hrs)\nGenre . . . : Nonfiction, History, WWII\nUnabridged .: Unabridged\n\nAs Winston Churchill said, &quot;Never in the field of human conflict \nwas so much owed by so many to so few.&quot;\n\nTracks by chapter.\nNicely tagged and labeled, cover scan included.\n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nDec 2010\n\n\n Links: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Alex_Kershaw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Alex_Kershaw&lt;/a&gt; &lt;a href=&quot;\nhttp://www.thefewbook.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thefewbook.com&lt;/a&gt;\n\n Originally posted: &lt;a href=&quot;\nhttp://thepiratebay.se/user/FerraBit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FerraBit&lt;/a&gt; &lt;a href=&quot;\nhttp://www.kickasstorrents.com/user/FerraBit/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kickasstorrents.com/user/FerraBit/&lt;/a&gt;\n\nTaken the time to read this? Take some more, and leave me a nice \nnote of encouragement. Got your FPL card?\n_____________________________________________________\n\nFrom thefewbook.com:\n\nBy the summer of 1940 Hitler was triumphant and planning an invasion of \nEngland. But the United States was still a neutral country and, as Winston \nChurchill later observed, &quot;the British people held the fort alone.&quot;\n\nA few Americans, however, did not remain neutral. They joined Britain's \nRoyal Air Force to fight Hitler's air aces and help save Britain in its \ndarkest hour.\n\nThe Few is the never-before-told story of these thrill-seeking Americans \nwho defied their country's neutrality laws to fly side-by-side with \nEngland's finest pilots. They flew the lethal and elegant Spitfire, and \nbecame &quot;knights of the air.&quot;\n\nWith minimal training and plenty of guts they dueled the skilled pilots \nof Germany's Luftwaffe in the blue skies over England. They shot down \nseveral of Germany's fearsome aces, and were feted as national heroes in\nBritain.\n\nBy October 1940, they had helped England win the greatest air battle in \nthe history of aviation. At war's end, just one of the &quot;Few&quot; would be \nalive. The others died flying, wearing the RAF's dark blue uniform each \nwith a shoulder patch depicting an American eagle.\n\nAs Winston Churchill said, &quot;Never in the field of human conflict was so \nmuch owed by so many to so few.&quot;\n\n\nFrom Wiki:\n\nAlex Kershaw taught history at Whitgift school for two years before working \nas a journalist for several British newspapers, including The Guardian, The \nIndependent and The Sunday Times. His journalism has appeared in many leading \nnewspapers and magazines around the world. He has also worked as a writer and \nproducer in television, penning an award-winning documentary about Bobby Kennedy. \nSeveral of his books have been optioned by Hollywood, including The Few which \nwas selected as the Military Book Club's first ever book of the year in 2006. \n\nHe has been cited as a &quot;master storyteller&quot; by Booklist for his work on The Few.\n\n\nFrom Publishers Weekly:\n\nWith his customary narrative drive, Kershaw (The Bedford Boys: One American \nTown's Ultimate D-Day Sacrifice) spotlights the handful of American pilots \nwho joined the Royal Air Force and its fighter squadrons during the Battle \nof Britain. They have been overshadowed by or confused with the better-known \nEagle Squadrons, which formed in the autumn of 1940 with the tacit consent \nof the U.S. government. Kershaw's &quot;few&quot; were a vanguard, enlisting \nindividually to operate the British Spitfire planes as early as May 1940, \nwhen England stood alone and her odds of survival seemed long. Crusaders and \nadventurers, the pilots ignored U.S. neutrality acts to fight from a mixture \nof principled opposition to Nazism, vaguely defined Anglophilia and sheer love \nof air combat at a time when it still seemed glamorous. Scattered by ones and \ntwos among different squadrons, each had his own story, which Kershaw admirably \ncontextualizes within the climate of the Battle of Britain. Using personal \nvignettes to convey the extraordinary routines of life in the cockpits, in the \nsquadrons and in England, Kershaw evokes the heroism of these pilots, only one \nof whom survived the war whose tide they helped turn.\n","torrent":{"xt":"urn:btih:3ff340efb663a050d7982d375ba4f790ed896a49","amp;dn":"THE+FEW+-+Alex+Kershaw.+Read+by+Scott+Brick+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff340efb663a050d7982d375ba4f790ed896a49","infoHashBuffer":{"type":"Buffer","data":[63,243,64,239,182,99,160,80,215,152,45,55,91,164,247,144,237,137,106,73]},"announce":[],"urlList":[]}}