{"title":"Mass Effect - Retribution by Drew Karpyshyn (Smaller-ReUp)","uid":5877232,"size":264985337,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3ff9a8c1ed345a833e5d3d981d1528e1cdc7aace&amp;dn=Mass+Effect+-+Retribution+by+Drew+Karpyshyn+%28Smaller-ReUp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Awesomo42","files":-1,"time":1286683321,"description":"This is a reupload of a previous torrent who's torrent file was having issues, and it was in more than 180 files, this version is also much smaller due to lowering the bitrate to a more reasonable level for audiobooks with no loss in quality, (128 is just overkill for vocal content) and is in 19 parts. Enjoy this great book.\n\n\n\n\nNote: Initial downloading will be very slow, my upload is atrocious, but I'll be sharing as fast as I can.\n\nHopefully everyone will do their part to make this available and seed generously, thank you.\n\n\n\n\n\n\n\n\n=======================\n\nMass Effect: Retribution\nDrew Karpyshyn\n64Kbps mp3 - 19 Parts\nAudiobook\n\n========================\n\nHumanity has reached the stars, joining the vast galactic community of alien species. But beyond the fringes of explored space lurk the Reapers, a race of sentient starships bent on harvesting the galaxy's organic species for their own dark purpose.\n\nThe Illusive Man, leader of the pro-human black ops group Cerberus, is one of the few who know the truth about the Reapers. To ensure humanity's survival, he launches a desperate plan to uncover the enemy's strengths and weaknesses by studying someone implanted with modified Reaper technology. He knows the perfect subject for his horrific experiments: former Cerberus operative Paul Grayson, who wrested his daughter from the cabal's control with the help of Ascension project director Kahlee Sanders.\n\nBut when Kahlee learns that Grayson is missing, she turns to the only person she can trust: Alliance war hero Captain David Anderson. Together they set out to find the secret Cerberus facility where Grayson is being held. But they aren't the only ones after him. And time is running out.\n\nAs the experiments continue, the sinister Reaper technology twists Grayson's mind. The insidious whispers grow ever stronger in his head, threatening to take over his very identity and unleash the Reapers on an unsuspecting galaxy.\n\nThis novel is based on a Mature-rated video game.\n\n\n=========================\n","torrent":{"xt":"urn:btih:3ff9a8c1ed345a833e5d3d981d1528e1cdc7aace","amp;dn":"Mass+Effect+-+Retribution+by+Drew+Karpyshyn+%28Smaller-ReUp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff9a8c1ed345a833e5d3d981d1528e1cdc7aace","infoHashBuffer":{"type":"Buffer","data":[63,249,168,193,237,52,90,131,62,93,61,152,29,21,40,225,205,199,170,206]},"announce":[],"urlList":[]}}