{"title":"Morcheeba - Head Up High (2013) [FLAC]","uid":9018346,"size":320722250,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4018b542dc28e5b4be7e3c6a65d5325b62a7cfba&amp;dn=Morcheeba+-+Head+Up+High+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1381239059,"description":"\n  Morcheeba - Head Up High (2013) [FLAC]\n  \n  Genre: Electronic\n  Style: Trip-Hop\n  Source: CD (log + cue)\n  Cocdec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Gimme Your Love\n  02 Face of Danger\n  03 Call It Love\n  04 Under the Ice\n  05 I'll Fall Apart\n  06 Make Believer\n  07 Release Me Now\n  08 To Be\n  09 Hypnotized\n  10 To the Grave\n  11 Do You Good\n  12 Finally Found You \n\n  The most groove-oriented act in the mid-'90s female-fronted electronica crowd, Morcheeba rely on the sweet, fluid vocals of Skye Edwards and a laid-back mix of fusion, funk, and blues produced by brothers Paul and Ross Godfrey, on beats/scratches and guitar/keyboards, respectively. The trio was formed in 1995 when the Godfreys decided to go out on their own after co-producing six tracks for David Byrne's album Feelings. They submitted several tapes of their instrumental demos to labels around London, but received little interest in return. After hooking up with vocalist Edwards at a party, however, their music began to gel and Morcheeba signed to the China label. After the release of two EPs (Trigger Hippie and Music That We Hear), the trio issued its debut album, Who Can You Trust? It appeared on the American Discovery label in late 1996, and Morcheeba toured the U.S. with Live and Fiona Apple the following year. Big Calm followed in 1998 and Fragments of Freedom was released two years later. \n\n  Charango appeared in 2002 and featured guest appearances from Lambchop's Kurt Wagner and rapper Slick Rick. A year later, the greatest-hits collection Parts of the Process was released and Skye Edwards left the band. Former Noonday Underground vocalist Daisy Martey joined the group for 2005's The Antidote, a more acoustic album that mixed psychedelia with Burt Bacharach-styled pop. Dive Deep (2008) took a marked turn toward folk, with the Godfreys using a revolving door of vocalists who included Thomas Dybdahl, Judie Tzuke, and Bradley Burgess. Skye Edwards returned to the fold for 2010's Blood Like Lemonade.","torrent":{"xt":"urn:btih:4018b542dc28e5b4be7e3c6a65d5325b62a7cfba","amp;dn":"Morcheeba+-+Head+Up+High+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4018b542dc28e5b4be7e3c6a65d5325b62a7cfba","infoHashBuffer":{"type":"Buffer","data":[64,24,181,66,220,40,229,180,190,126,60,106,101,213,50,91,98,167,207,186]},"announce":[],"urlList":[]}}