{"title":"Gene Ammons and Sonny Stitt - 2001 - God Bless Jug and Sonny FLA","uid":8630261,"size":423043778,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:408b803071c8211ba3e0d5fddd77c4a1cd7fffb1&amp;dn=Gene+Ammons+and+Sonny+Stitt+-+2001+-+God+Bless+Jug+and+Sonny+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"eika256","files":-1,"time":1372616407,"description":"Gene Ammons and Sonny Stitt - 2001 - God Bless Jug and Sonny\n\nThough Gene Ammons and Sonny Stitt were the premier twin towers of jazz tenor sax bar none, they also had great mutual respect for their distinctly different styles. The soulful Ammons and the bop-oriented Stitt meshed well whether playing standards, jamming on familiar melodies, or in ballad form. This recording sees them a bit restrained, teamed with the brilliant organist Don Patterson, the totally obscure guitarist Paul Weeden, and the great drummer Billy James. There's a schism in terms of the stereo separation as each saxophonist gets his own channel, but on occasion they do play together, just not all that much. Some longer cuts allow Patterson to loosen up and take charge, but he is in the main an accompanist on this date from 1962. There's no real battling for turf here, while one-upmanship is redacted as the two take turns with nary a hint of egotism. Stitt switches to alto in contrast, and the two saxophonists play together on the good swinger &quot;Walkin',&quot; always a jam vehicle but shortened here, with the basic melody played only one time through, with Ammons adding a bit of harmony to the proceedings. They trade shorter phrases on &quot;Why Was I Born?,&quot; as Stitt goes off on a flurry of bebop notes. Where &quot;John Brown's Body&quot; is quintessential soul-jazz at its primal best, they stretch out on the ten-minute jam &quot;Bye Bye Blackbird,&quot; with Stitt first out of the batters' box and Ammons hitting for extra bases to drive his bandmate home. Where programming doesn't really matter on a CD (you can do that on your own), the leadoff track -- strangely enough -- is downtempo, hardly something to send anyone into orbit. &quot;Long Ago and Far Away&quot; is a ballad feature, first for Ammons and then Stitt, where the stereo effect is in full flight as the two go back and forth, with Patterson's sweet, swinging, and soulful B-3 languishing in the background. While not an out-and-out knock-down, drag-out event like their other recordings, this is still one of too few magical efforts with Ammons and Stitt together. Those who crave the live cutting sessions that made jazz very exciting in the early '60s might also consider this tamer studio effort. [The Deluxe Edition contains no additional tracks from the original issue, but there is a detailed booklet and double-fold cardboard container.] (AllMusic)\n\nTrack list:\n01 - Blue 'n' Boogie\n02 - Stringin' the Jug\n03 - God Bless the Child\n04 - Autumn in New York\n05 - Ugetsu\n06 - Bye Bye Blackbird\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:408b803071c8211ba3e0d5fddd77c4a1cd7fffb1","amp;dn":"Gene+Ammons+and+Sonny+Stitt+-+2001+-+God+Bless+Jug+and+Sonny+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"408b803071c8211ba3e0d5fddd77c4a1cd7fffb1","infoHashBuffer":{"type":"Buffer","data":[64,139,128,48,113,200,33,27,163,224,213,253,221,119,196,161,205,127,255,177]},"announce":[],"urlList":[]}}