{"title":"Judas Priest 24 Bit Vinyl Pack","uid":8688655,"size":11105925062,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:414fc568d6dec1b20c8a41fbfb093a77958ba42d&amp;dn=Judas+Priest+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1373847244,"description":"  Judas Priest 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: British Metal, Hard Rock, Heavy Metal, Album Rock\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 3,200 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  British Steel (WPL) PBTHAL\n  Defenders of the Faith\n  Painkiller\n  Point of Entry\n  Priest Live!\n  Sad Wings of Destiny\n  Screaming for Vengeance \n  Sin After Sin\n  Stained Class (UK 1st Pressing)\n  Turbo\n  Unleashed in the East (Dutch Pressing) PBTHAL\n  \n  Judas Priest was one of the most influential heavy metal bands of the '70s, spearheading the New Wave of British Heavy Metal late in the decade. Decked out in leather and chains, the band fused the gothic doom of Black Sabbath with the riffs and speed of Led Zeppelin, as well as adding a vicious two-lead guitar attack; in doing so, they set the pace for much popular heavy metal from 1975 until 1985, as well as laying the groundwork for the speed and death metal of the '80s.\n\n  Formed in Birmingham, England, in 1970, the group's core members were guitarist K.K. Downing and bassist Ian Hill. Joined by Alan Atkins and drummer John Ellis, the band played their first concert in 1971. Atkins' previous band was called Judas Priest, yet the members decided it was the best name for the new group. The band played numerous shows throughout 1971; during the year, Ellis was replaced by Alan Moore; by the end of the year, Chris Campbell replaced Moore. After a solid year of touring the U.K., Atkins and Campbell left the band in 1973 and were replaced by vocalist Rob Halford and drummer John Hinch. They continued touring, including a visit to Germany and the Netherlands in 1974. By the time the tour was completed, they had secured a record contract with Gull, an independent U.K. label. Before recording their debut album, Judas Priest added guitarist Glenn Tipton.\n\n  Rocka Rolla was released in September of 1974 to almost no attention. The following year, they gave a well-received performance at the Reading Festival and Hinch departed the band; he was replaced by Alan Moore. Later that year, the group released Sad Wings of Destiny, which earned some positive reviews. However, the lack of sales was putting the band in a dire financial situation, which was remedied by an international contract with CBS Records. Sin After Sin (1977) was the first album released under that contract; it was recorded with Simon Phillips, who replaced Moore. The record received positive reviews and the band departed for their first American tour, with Les Binks on drums.\n\n  When they returned to England, Judas Priest recorded 1978's Stained Class, the record that established them as an international force in metal. Along with 1979's Hell Bent for Leather (Killing Machine in the U.K.), Stained Class defined the nascent New Wave of British Heavy Metal movement. A significant number of bands adopted Priest's leather-clad image and hard, driving sound, making their music harder, faster, and louder. After releasing Hell Bent for Leather, the band recorded the live album Unleashed in the East (1979) in Japan; it became their first platinum album in America. Les Binks left the band in 1979; he was replaced by former Trapeze drummer Dave Holland. Their next album, 1980's British Steel, entered the British charts at number three, launched the hit singles &quot;Breaking the Law&quot; and &quot;Living After Midnight,&quot; and was their second American platinum record; Point of Entry, released the following year, was nearly as successful.","torrent":{"xt":"urn:btih:414fc568d6dec1b20c8a41fbfb093a77958ba42d","amp;dn":"Judas+Priest+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"414fc568d6dec1b20c8a41fbfb093a77958ba42d","infoHashBuffer":{"type":"Buffer","data":[65,79,197,104,214,222,193,178,12,138,65,251,251,9,58,119,149,139,164,45]},"announce":[],"urlList":[]}}