{"title":"Past the Shallows by Favel Parrett","uid":9723653,"size":581272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4246f18a9cdb54fc4e6ed99a00d7ec9957214fe6&amp;dn=Past+the+Shallows+by+Favel+Parrett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":2,"time":1394268635,"description":"\nHauntingly beautiful and told with an elegant simplicity, this is the story of two brothers growing up in a fractured family on the wild Tasmanian coast. The consequences of their parents' choices shape their lives and ultimately bring tragedy to them all.\n\nEveryone loves Harry. Everyone except his father.\n\nThree brothers, Joe, Miles and Harry, are growing up on the remote south coast of Tasmania. The brothers' lives are shaped by their father's moods - like the ocean he fishes, he is wild and unpredictable. He is a bitter man, warped by a devastating secret.\n\nMiles tries his best to watch out for Harry, the youngest, but he can't be there all the time. Often alone, Harry finds joy in the small treasures he discovers, in shark eggs and cuttlefish bones. In a kelpie pup, a big mug of Milo, and a secret friendship with a mysterious neighbour.\n\nBut sometimes small treasures, or a brother's love, are not enough.\n\nFavel Parrett won the 2012 Dobbie Award for a first book published by a woman writer, was shortlisted for the Miles Franklin Award and was named Newcomer of the Year at the 2012 Australian Book Industry Awards. Favel lives in Victoria and is currently working on her next novel.\n\n'...that rare thing, a finely crafted literary novel that is genuinely moving and full of heart.' THE AGE\n\n&quot;If you read only one book this year, make sure it's this.&quot; (The Sunday Times (UK))\n\n&quot;A finely crafted literary novel that is genuinely moving and full of heart.&quot; (The Age)\n\nGenre: General Fiction/Classics","torrent":{"xt":"urn:btih:4246f18a9cdb54fc4e6ed99a00d7ec9957214fe6","amp;dn":"Past+the+Shallows+by+Favel+Parrett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4246f18a9cdb54fc4e6ed99a00d7ec9957214fe6","infoHashBuffer":{"type":"Buffer","data":[66,70,241,138,156,219,84,252,78,110,217,154,0,215,236,153,87,33,79,230]},"announce":[],"urlList":[]}}