{"title":"Ninni Schulman - Flickan med sno i haret - 2011","uid":6865668,"size":309646718,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:435ad41b062ab78bfe3bcd4eec9081468f332447&amp;dn=Ninni+Schulman+-+Flickan+med+sno+i+haret+-+2011+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"relyssen1","files":-1,"time":1323094728,"description":"En kall och snoig nyarsafton forsvinner sextonariga Hedda Losjo fran sitt hem utanfor Hagfors i Varmland. Hennes foraldrar ar fortvivlade. Vad kan ha hant deras skotsamma dotter? Nar poliserna Petra Wilander och Christer Berglund far fallet pa sitt bord visar det sig snart att Hedda har levt ett dubbelliv.\n\nEn tid senare hittas en ung flicka mordad i en jordkallare i skogen nagra kilometer fran familjen Losjos hem. Flickan ar naken och har dodats med ett skott i bakhuvudet. Kan det vara den forsvunna Hedda? Den lilla polisstationen star nu infor en av sina storsta utmaningar.\n\nJournalisten Magdalena Hansson har lamnat Stockholm och flyttat hem till Hagfors med sin sexariga adoptivson Nils efter en uppslitande skilsmassa. Hon ar trott och deprimerad och hoppas att lugnet pa landsbygden och tryggheten i uppvaxtstaden ska ge henne livsgladjen tillbaka. Magdalena engagerar sig kanslomassigt i den forsvunna Heddas ode och borjar grava i fallet. Snart inser hon att den fridfulla bygden bar pa hemligheter som vissa gor vad som helst for att dolja.\n\n\nUpplasare: Angela KovÃƒÅ¸cs","torrent":{"xt":"urn:btih:435ad41b062ab78bfe3bcd4eec9081468f332447","amp;dn":"Ninni+Schulman+-+Flickan+med+sno+i+haret+-+2011+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"435ad41b062ab78bfe3bcd4eec9081468f332447","infoHashBuffer":{"type":"Buffer","data":[67,90,212,27,6,42,183,139,254,59,205,78,236,144,129,70,143,51,36,71]},"announce":[],"urlList":[]}}