{"title":"Data Architecture: From Zen to Reality{BBS}","uid":6813419,"size":5852627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43679c9e9d120dcb0b19bf4ad637d28cd2fcef43&amp;dn=Data+Architecture%3A+From+Zen+to+Reality%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321110368,"description":"Data is an expensive and expansive asset. Information capture has forced storage capacity from megabytes to terabytes, exabytes and, pretty soon, zetabytes of data. So the need for accessible storage space for this data is great. To make this huge amount of data usable and relevant, it needs to be organized effectively. Database Base Management Systems, such as Oracle, IBM's DB2, and Microsoft SqlServer are used often, but these are being enhanced continuously and auxiliary tools are being developed every week; there needs to be a fundamental starting point for it all. That stating point is Data Architecture, the blueprint for organizing and structuring of information for services, service providers, and the consumers of that data.\n\nData Architecture: From Zen to Reality explains the principles underlying data architecture, how data evolves with organizations, and the challenges organizations face in structuring and managing their data. It also discusses proven methods and technologies to solve the complex issues dealing with data. The book uses a holistic approach to the field of data architecture by covering the various applied areas of data, including data modelling and data model management, data quality , data governance, enterprise information management, database design, data warehousing, and warehouse design. This book is a core resource for anyone emplacing, customizing or aligning data management systems, taking the Zen-like idea of data architecture to an attainable reality.\n\n\n\n    * Presents fundamental concepts of enterprise architecture with definitions and real-world applications and scenarios\n\n    * Teaches data managers and planners about the challenges of building a data architecture roadmap, structuring the right team, and building a long term set of solutions \n\n\n\n# Paperback: 448 pages\n# Publisher: Morgan Kaufmann; 1 edition (April 6, 2011)\n# Language: English\n# ISBN-10: 0123851262\n# ISBN-13: 978-0123851260","torrent":{"xt":"urn:btih:43679c9e9d120dcb0b19bf4ad637d28cd2fcef43","amp;dn":"Data+Architecture%3A+From+Zen+to+Reality%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43679c9e9d120dcb0b19bf4ad637d28cd2fcef43","infoHashBuffer":{"type":"Buffer","data":[67,103,156,158,157,18,13,203,11,25,191,74,214,55,210,140,210,252,239,67]},"announce":[],"urlList":[]}}