{"title":"Librivox M4B Audiobook - Utilitarianism by John Stuart Mill","uid":5518086,"size":52214023,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:440445b765bfb8b9d2245a8fae36adac574f6bf3&amp;dn=Librivox+M4B+Audiobook+-+Utilitarianism+by+John+Stuart+Mill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VoxRatio","files":-1,"time":1272345162,"description":"John Stuart Mill's book Utilitarianism is one of the most influential and widely-read philosophical defenses of utilitarianism in ethics. The essay first appeared as a series of three articles published in Fraser's Magazine in 1861; the articles were collected and reprinted as a single book in 1863. It went through four editions during Mill's lifetime with minor additions and revisions.\n\nAlthough Mill includes discussions of utilitarian ethical principles in other works such as On Liberty and The Subjection of Women, Utilitarianism contains Mill's only major discussion of the fundamental grounds for utilitarian ethical theory. (Summary from Wikipedia)\n\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:440445b765bfb8b9d2245a8fae36adac574f6bf3","amp;dn":"Librivox+M4B+Audiobook+-+Utilitarianism+by+John+Stuart+Mill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440445b765bfb8b9d2245a8fae36adac574f6bf3","infoHashBuffer":{"type":"Buffer","data":[68,4,69,183,101,191,184,185,210,36,90,143,174,54,173,172,87,79,107,243]},"announce":[],"urlList":[]}}