{"title":"Bill Evans - 1972 - Portraiture FLAC","uid":8796168,"size":431928935,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:441d531bae82edb547a84af047185946cb420a20&amp;dn=Bill+Evans+-+1972+-+Portraiture+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1376084413,"description":"Bill Evans - 1972 - Portraiture\n\nWhile there has been a plethora of live recordings issued on CD from the Bill Evans Trio's (with Joe La Barbera and Marc Johnson) last tours in the final two years of Evans' life, far rarer are those with his previous trio with Marty Morell and bassist Eddie Gomez. Given the jazz fascists who insist that after Scott LaFaro died there was no Bill Evans Trio, this is not surprising. Most of the evidence on studio recordings proves them to be full of ____ (fill in your own blank). This date, recorded in Paris in 1969, is a case in point. For one, those who claimed Evans wasn't playing as well toward the end of the 1960s obviously never caught him live. His elegance and singular style are in full effect here, full of subtle shadings, gorgeously swinging and muted harmonic structures, and a firm command of the direction of improvisation -- check the opener, a gorgeous read of the Bacharach/David classic &quot;Alfie.&quot; As for the trio itself, the rapport Evans has with Gomez is nothing short of stunning, as the interplay of solos and counterpoint on &quot;Waltz for Debbie&quot; reveals. In a little over six minutes, Evans and Gomez move through an intervallic exchange that is dizzying in scope. The band follows with &quot;34 Skidoo,&quot; and Gomez goes right out after Evans, forcing the tempo; even Morell is caught off guard for a brief moment before turning the tables and Evans responds fluidly, warmly, and quickly, moving through blurring 16th notes that are uncharacteristic of his style. There are a few tunes from the Evans-Miles Davis collaboration too, such as one of the most lyrical and mysterious performances of &quot;Blue in Green&quot; ever recorded -- the space Evans employs in the intro and in the textural harmonic architecture is almost an inversion of the melodic line, but the changes keep it anchored in reality. &quot;Nardis&quot; is the other, with its staggered, partial chords, building upon one another percussively before giving way to the rhythm section that stretches them into whole sentences from phrases with Monk-like rhythmnatism. Likewise, Johnny Mandel's &quot;Emily&quot; is transformed from a soppy ballad into a work of glorious improvisation, where the original melody becomes a cipher and in its place are questions of time, space, and coloration under the guides of a melodic frame that suggests the original without actually playing it. Gomez's solo here is nothing short of stunning. This set looks a bit generic from its cover; don't let that fool you. What is contained within is more than enough to stun on contact. (AllMusic)\n\nTrack list:\n01 - Alfie\n02 - Waltz For Debbie\n03 - 34 Skidoo\n04 - Blue In Green\n05 - Detour Ahead\n06 - Emily\n07 - Nardis\n08 - Peri's Scope\n09 - Some Other Time\n10 - Who Can I Turn To\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:441d531bae82edb547a84af047185946cb420a20","amp;dn":"Bill+Evans+-+1972+-+Portraiture+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"441d531bae82edb547a84af047185946cb420a20","infoHashBuffer":{"type":"Buffer","data":[68,29,83,27,174,130,237,181,71,168,74,240,71,24,89,70,203,66,10,32]},"announce":[],"urlList":[]}}