{"title":"The Searchers - The Complete Collection  FLAC","uid":5522179,"size":355709227,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:446180de99cd6e45d151ba260d9ab3cd7f647dd7&amp;dn=The+Searchers+-+The+Complete+Collection++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"keeybee","files":33,"time":1272644995,"description":"Please seed!\n\nThe Searchers are an English rock band who emerged as part of the 1960s Merseybeat scene along with The Beatles, The Swinging Blue Jeans, and Gerry &amp; The Pacemakers.\nThe band's hits included a remake of the Drifters' 1961 hit, &quot;Sweets for My Sweet&quot;; remakes of Jackie DeShannon's &quot;Needles and Pins&quot; and &quot;When You Walk In The Room&quot;; an original song written for them, &quot;Sugar and Spice&quot;; The Orlons' &quot;Don't Throw Your Love Away&quot;; and a remake of The Clovers' &quot;Love Potion No. 9&quot;. They were the second group from Liverpool, after the Beatles, to have a hit in the United States when &quot;Needles and Pins&quot; charted during the first week of March 1964. (Wiki)\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Searchers_(band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Searchers_(band)&lt;/a&gt;\n\n\nThe Searchers - The Complete Collection\nThis compilation 1990\nWith covers\n\n01  The Searchers - The Complete Collection - Sweets For My Sweet  \n02  The Searchers - The Complete Collection - Listen To Me  \n03  The Searchers - The Complete Collection - When You Walk In The Room  \n04  The Searchers - The Complete Collection - Goodbye My Love  \n05  The Searchers - The Complete Collection - I Don't Want To Go On Without You  \n06  The Searchers - The Complete Collection - What Have They Done To The Rain  \n07  The Searchers - The Complete Collection - Don't Throw Your Love Away  \n08  The Searchers - The Complete Collection - Ain't Gonna Kiss Ya  \n09  The Searchers - The Complete Collection - Since You Broke My Heart  \n10  The Searchers - The Complete Collection - Goodnight Baby  \n11  The Searchers - The Complete Collection - Hungry For Love  \n12  The Searchers - The Complete Collection - When I Get Home  \n13  The Searchers - The Complete Collection - Needles And Pins  \n14  The Searchers - The Complete Collection - Ain't That Just Like Me  \n15  The Searchers - The Complete Collection - Take It Or Leave It  \n16  The Searchers - The Complete Collection - Bumble Bee  \n17  The Searchers - The Complete Collection - Someday We're Gonna Love Again  \n18  The Searchers - The Complete Collection - Farmer John  \n19  The Searchers - The Complete Collection - Sugar And Spice  \n20  The Searchers - The Complete Collection - Have You Ever Loved Somebody  \n21  The Searchers - The Complete Collection - Take Me For What I'm Worth  \n22  The Searchers - The Complete Collection - Western Union  \n23  The Searchers - The Complete Collection - He's Got No Love  \n24  The Searchers - The Complete Collection - Love Potion No. 9\n","torrent":{"xt":"urn:btih:446180de99cd6e45d151ba260d9ab3cd7f647dd7","amp;dn":"The+Searchers+-+The+Complete+Collection++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446180de99cd6e45d151ba260d9ab3cd7f647dd7","infoHashBuffer":{"type":"Buffer","data":[68,97,128,222,153,205,110,69,209,81,186,38,13,154,179,205,127,100,125,215]},"announce":[],"urlList":[]}}