{"title":"Steal This Computer Book 4.0 (gnv64)","uid":7244788,"size":54097539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4568e4dc8cbbe947299d67e7b04db75e6ddbac92&amp;dn=Steal+This+Computer+Book+4.0+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1336246016,"description":"\n[color=Purple][b]Steal This Computer Book 4.0: What They Won't Tell You about the Internet (4th edition)\nby Wallace Wang\nNo Starch Press | April 2006 | 384 Pages | ISBN: 1593271050 | ePUB/PDF | 13.4/38.1  mb[/b][/color]\n[url]http://www.amazon.com/Steal-This-Computer-Book-4-0/dp/1593271050\nPDF conversion is mine[/url]\n\n[color=Teal]National bestseller with over 175,000 copies sold!\nIf you thought hacking was just about mischief-makers hunched over computers in the basement, think again. As seasoned author Wallace Wang explains, hacking can also mean questioning the status quo, looking for your own truths, and never accepting at face value anything authorities say or do.\nThe completely revised fourth edition of this offbeat, non-technical book examines what hackers do, how they do it, and how you can protect yourself. Written in the same informative, irreverent, and entertaining style that made the first three editions hugely successful, Steal This Computer Book 4.0 will expand your mind and raise your eyebrows. New chapters discuss the hacker mentality, social engineering and lock picking, exploiting P2P file-sharing networks, and how people manipulate search engines and pop-up ads to obtain and use personal information. Wang also takes issue with the media for &quot;hacking&quot; the news and presenting the public with self-serving stories of questionable accuracy. Inside, you'll discover:\nHow to manage and fight spam and spyware How Trojan horse programs and rootkits work, and how to defend against them How hackers steal software and defeat copy-protection mechanisms How to tell if your machine is being attacked and what you can do to protect it Where the hackers are, how they probe a target and sneak into a computer, and what they do once they get inside How corporations use hacker techniques to infect your computer and invade your privacy How you can lock down your computer to protect your data and your personal information using free programs.[/color]","torrent":{"xt":"urn:btih:4568e4dc8cbbe947299d67e7b04db75e6ddbac92","amp;dn":"Steal+This+Computer+Book+4.0+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4568e4dc8cbbe947299d67e7b04db75e6ddbac92","infoHashBuffer":{"type":"Buffer","data":[69,104,228,220,140,187,233,71,41,157,103,231,176,77,183,94,109,219,172,146]},"announce":[],"urlList":[]}}