{"title":"The Bone Thief - V. M. Whitworth.epub","uid":9414671,"size":472764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:457d523306acfb206e1a5befe2588788c7dc83fa&amp;dn=The+Bone+Thief+-+V.+M.+Whitworth.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1388409054,"description":"900 A.D. A time of turmoil. A kingdom in dispute. An unlikely hero...Edward, son of Alfred the Great, has inherited the Kingdom of Wessex and achieved a precarious set of alliances through marriage and military conquest. But the alliance is uneasy and the kingdom of Mercia has more reason than most to fear the might of Wessex. Their Lord is elderly and perhaps mortally sick, and his wife fears that she does not have the power to withstand hostile takeover. She also knows too well what her neighbour is capable of - after all, King Edward is her brother. The chance to rescue St Oswald's bones, beloved patron saint, to consecrate her new church and unite the people behind her, is too good an opportunity to miss. But they are rumoured to be buried a long way north - outside Lincoln, deep in hostile territory. Her secretary, Wulfgar, groomed for the priesthood since he was a boy in the elegant cloisters of Winchester cathedral but a naive in the ways of the wider world - is surprised to be sent on this mission. It will prove an incredibly dangerous journey, requiring resources and courage Wulfgar did not know he had, and support from surprising allies along the way including a maverick priest and a Viking adventuress whose loyalties are far from clear...","torrent":{"xt":"urn:btih:457d523306acfb206e1a5befe2588788c7dc83fa","amp;dn":"The+Bone+Thief+-+V.+M.+Whitworth.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"457d523306acfb206e1a5befe2588788c7dc83fa","infoHashBuffer":{"type":"Buffer","data":[69,125,82,51,6,172,251,32,110,26,91,239,226,88,135,136,199,220,131,250]},"announce":[],"urlList":[]}}