{"title":"James Burke's The Day The Universe Changed (1985) (AVI)","uid":5378313,"size":7117766484,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:45a16d09eeecf3e6f4bc265bf3e45c0e5f6e1f8b&amp;dn=James+Burke%5C%27s+The+Day+The+Universe+Changed+%281985%29+%28AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"flybers","files":12,"time":1266651528,"description":"TV : Documentary : TV quality : English\nfrom usenet\n\nJames Burke's The Day The Universe Changed (1985) (AVI)\n\nThe Day the Universe Changed is James Burke's personal view on the great ebb\nand flow of ideas that have gone into the development of Western thought. Host\nJames Burke gives a stunning overview of this evolution of thought since the\ndays of the Greeks in this ten-part series co-produced by BBC-TV and RKO\nPictures.\n\nEpisode 1 - The Way We Are\nWritten and presented by James Burke, this 10-part series traces the\ndevelopment of Western thought through its major transformations since the days\nof ancient Greece. Program one is an overview of the series, showing how a\nculture's view of the world around it determines how it sees itself, and is\nreflected even in the smallest details of its customs and habits.\n\nEpisode 2 - In the Light of the Above\nRelates that in the course of overrunning Moorish Spain, Christian Europe\ndiscovered libraries, universities, optics, mechanics, and natural philosophy.\nThis rediscovery of classical knowledge led to the founding of universities and\nthe replacement of Augustinian philosophies by Aristotelian theories.\n\nEpisode 3 - Point of View\nShows that Western EuropeG??s rediscovery of perspective through the study of\nArab optics led to revolutions in art and architecture. The WestG??s new-found\nability to control things at a distance resulted in new methods of warfare and\nthe confidence to make long voyages of exploration.\n\nEpisode 4 - A Matter of Fact\nObserves that the invention of printing and the advent of cheap paper forever\ntransformed the nature of knowledge from the local and traditional to the\nsystematic and testable. Nationalism, public relations, and propaganda are\namong the results.\n\nEpisode 5 - Infinitely Reasonable\nNotes that investigators such as Copernicus, Kepler, Galileo, and Newton evolved\nbetter explanations of natural phenomena than those of Aristotle. Highlights the\ntheories that led to a new conception of how the universe works and of manG's\nplace in it.\n\nEpisode 6 - Credit Where It's Due\nLocates the origins of contemporary consumerism in the English industrial\nRevolution, powered by religious dissenters barred from all activities except\ntrade. The invention of the steam engine, new forms of credit, surplus wealth,\nand opening markets laid the foundation for industrial society.\n\nEpisode 7 - What the Doctor Ordered\nTraces modern societyG??s recognition of the value of statistics to medical\nadvances stemming from responses to the French Revolution and an English\ncholera epidemic. Identifies the origins of medicine as a science with the\ndiscovery of anesthesia, antiseptics, and bacteriology.\n\nEpisode 8 - Fit to Rule\nTracks the expectation of change, fundamental to contemporary society, through\nthe developing sciences of botany, geology, and biology to DarwinG??s theory\nof evolution. DarwinG's theory, in turn, has been used as a justification for\nNazism, communism, and cut-throat capitalism.\n\nEpisode 9 - Making Waves\nPoints out that studies of the properties of magnetism, electricity, and light\nhave led scientists to the realization that Newtonian physics is inadequate to\nexplain all that they observe. The public, meanwhile, has continued to concentrate\non the technological by-products of science.\n\nEpisode 10 - Worlds Without End\nObserves that over the centuries Western civilization has regularly shifted its\nconception of the nature of truth. Citing the example of Nepalese Buddhism, a\nsystem as complete and satisfactory of Nepal as science is for the West, the\nseries ends with a plea for tolerance.","torrent":{"xt":"urn:btih:45a16d09eeecf3e6f4bc265bf3e45c0e5f6e1f8b","amp;dn":"James+Burke%5C%27s+The+Day+The+Universe+Changed+%281985%29+%28AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45a16d09eeecf3e6f4bc265bf3e45c0e5f6e1f8b","infoHashBuffer":{"type":"Buffer","data":[69,161,109,9,238,236,243,230,244,188,38,91,243,228,92,14,95,110,31,139]},"announce":[],"urlList":[]}}