{"title":"Our Daughter's Wedding - Moving Windows [1982]","uid":4395007,"size":57613882,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:45d7b79a81b17d75bb99158e8a2f1a69f1d40e0c&amp;dn=Our+Daughter%5C%27s+Wedding+-+Moving+Windows+%5B1982%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"80zforever","files":-1,"time":1221387223,"description":"Our Daughters Wedding are:\nLayne Rico (synthesizers)\nKeith Silva (vocals/synthesizers)\nScott Simon (saxophone/synthesizers)\n\nReview by Stephen SPAZ Schnee \n\nAlthough some may not see it this way, Our Daughters Wedding were like early Men Without Hats, except a little snottier (and that is meant in the nicest way possible). Yes, there were plenty of synth pop outfits filling up the record bins during the first half of the '80s, but ODW's raw East Coast vibe set them apart from their British (and British wannabe) contemporaries. This New York synth pop trio gained plenty of attention on college radio and in the dance clubs with the ultra-cool &quot;Lawnchairs&quot; in 1980. Signing to EMI, the band re-recorded that song and a handful of other tracks for their Digital Cowboy EP, released in 1981. A year later, this album appeared and showed the band maturing into their craft, dishing up a delightful platter of catchy, intelligent synth pop. &quot;Elevate Her,&quot; the first single, contained all the right elements to take the band to a higher plateau of fame, yet unfortunately didn't (although it is still regarded as one of their finest moments). The band's imaginative, albeit simple, use of synthesizers helped to create a slightly unsettling atmosphere, embracing a commercial direction, yet remaining an arms length outside of the mainstream. While &quot;Auto Music,&quot; &quot;Elevate Her,&quot; &quot;She Was Someone&quot; and the likeably goofy &quot;Buildings&quot; are fun and infectious, ODW serve up their artier side with &quot;Daddy's Slave,&quot; &quot;Longitude 60&quot; and the almost touching &quot;Paris&quot; (Keith Silve's vocals on this track are not his most flattering). Relying exclusively on synths, Silve and bandmates Layne Rico and Scott Simon, create an intriguing aural landscape. There is not a synthetic beat out of place here, and it is a most enjoyable release. Too bad we didn't get to hear more of them. \n\nA1 Auto Music  \nA2 She Was Someone  \nA3 Elevate Her  \nA4 Track Me Down  \nA5 Daddy's Slave  \nA6 Longitude 60  \nB1 Love Machine  \nB2 Always Be True  \nB3 Moving Windows  \nB4 Paris  \nB5 Buildings \n","torrent":{"xt":"urn:btih:45d7b79a81b17d75bb99158e8a2f1a69f1d40e0c","amp;dn":"Our+Daughter%5C%27s+Wedding+-+Moving+Windows+%5B1982%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45d7b79a81b17d75bb99158e8a2f1a69f1d40e0c","infoHashBuffer":{"type":"Buffer","data":[69,215,183,154,129,177,125,117,187,153,21,142,138,47,26,105,241,212,14,12]},"announce":[],"urlList":[]}}