{"title":"60GHz Technology for Gbps WLAN and WPAN - From Theory to Practic","uid":5983986,"size":2834518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:466902ba4e40feb144abefd53d66f38010227cee&amp;dn=60GHz+Technology+for+Gbps+WLAN+and+WPAN+-+From+Theory+to+Practic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1290673848,"description":"Su-Khiong Yong, Pengfei Xia, Alberto Valdes Garcia, &quot;60GHz Technology for Gbps WLAN and WPAN: From Theory to Practice&quot;\nWiley | 2011 | ISBN: 0470747706 | 296 pages | PDF \n\nThis book addresses 60 GHz technology for Gbps WLAN and WPAN from theory to practice, covering key aspects for successful deployment.\n\nIn this book, the authors focus specifically on 60 GHz wireless technology which has emerged as the most promising candidate for multi-gigabit wireless indoor communication systems. 60 GHz technology offers various advantages over current or existing communications systems (e.g. huge unlicensed bandwidth worldwide, high transmit power, high frequency reuse and small form factor), which enables many disruptive applications that are otherwise difficult if not impossible to be realized at lower frequencies. The book addresses all aspects of the state-of-the-art in 60 GHz technology for high data rate wireless applications.\n\nKey Features:\n\n* Comprehensive coverage from theory to practice: provides readers with a thorough technical guide of 60 GHz technology development\n* Brings together the entire area of 60GHz technology for Gigabits per second (Gbps) WLAN and WPAN applications.\n* Discusses practical system designs covering wide aspects such as antenna propagation, beamforming, circuit design, digital communication, signal processing, system architectures, etc.\n* Provides up-to-date standardization activities, regulatory issues, technology development as well as future trends\n* Includes examples and case studies for practical scenarios\n* Contains theoretical, simulation and experimental results to demonstrate and compare the performance of various schemes (or systems)\n\nThis book serves as an excellent reference for system engineers, system architects, IC designers, standard engineers, researchers, and vendor and manufacturer consumers. Technical consultants, software and application developers will also find this book of interest. ","torrent":{"xt":"urn:btih:466902ba4e40feb144abefd53d66f38010227cee","amp;dn":"60GHz+Technology+for+Gbps+WLAN+and+WPAN+-+From+Theory+to+Practic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"466902ba4e40feb144abefd53d66f38010227cee","infoHashBuffer":{"type":"Buffer","data":[70,105,2,186,78,64,254,177,68,171,239,213,61,102,243,128,16,34,124,238]},"announce":[],"urlList":[]}}