{"title":"Texe Marrs - Holy Serpent of the Jews","uid":15574518,"size":2731783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:472837f956363816ae975e93758b926fd44dcce6&amp;dn=Texe+Marrs+-+Holy+Serpent+of+the+Jews&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"holocen","files":1,"time":1471307343,"description":"Today, we are on the threshold of a horrifying new epoch of Jewish history. Now, comes the Holy Serpent, slithering from his fiery abode in hell to wreak havoc upon humanity. Jesus once declared, Ye serpents, ye generation of vipers. How can ye escape the damnation of hell? Amazingly, the Jews have proven to be exactly what Jesus prophesied. They are the People of the Serpent, unregenerated hypocrites whose religion is unparalleled in its treachery, its wickedness, and its unbounded filth. The Kabbalah and the Talmud, authored by the rabbis, are the very code of hell, the doctrines of devils. On the surface, the Jews appear to be pious, humanitarian, charitable, and good. The very picture of saintly human beings, they are said to be exalted and true, God s Chosen. But appearances are deceiving. The evil spirits of those who once worshiped Moloch, who fashioned a golden calf in the desert, and who tortured and tormented Jesus Christ are back, and the whole world is in jeopardy. Making its way on stage is the most colossal devil religion ever. The People of the Serpent have awakened Abaddon and the Beast is rising. The Holy Serpent of the Jews is on the move and ready to strike","torrent":{"xt":"urn:btih:472837f956363816ae975e93758b926fd44dcce6","amp;dn":"Texe+Marrs+-+Holy+Serpent+of+the+Jews","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"472837f956363816ae975e93758b926fd44dcce6","infoHashBuffer":{"type":"Buffer","data":[71,40,55,249,86,54,56,22,174,151,94,147,117,139,146,111,212,77,204,230]},"announce":[],"urlList":[]}}