{"title":"The Anthony Cumia Show 2015-05-11 Fusilli Anthony MP4 MP3","uid":11909635,"size":284185464,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4771c4fda1908f6d3e060f2046cbf5fe51428450&amp;dn=The+Anthony+Cumia+Show+2015-05-11+Fusilli+Anthony+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mothergoose58","files":2,"time":1431450257,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 160 - TACS begins another week with the latest on George Zimmerman, Ant's weekend shenanigans, we hear about the two officers shot in Mississippi, a Subway employee fired for her comments on social media, and KtC talks about attending Brian Moore's funeral. We then find out that Morgan Freeman is a stoner, discuss medical marijuana, flying cars, air disaster TV shows, briefly talk about what Governor Christie spends money on, the correlation between grits and homosexuality, see a clip of new SNL thievery, a video of a valedictorian speech gone wrong, and a caller looks for advice on classic cars. After Anthony goes through Monday's mail, he plays a who gives a shit &quot;brunch&quot; video, talks about Tom Brady's suspension, recaps his appearance on Legion of Skanks, we watch a &quot;Brady response&quot; video, one of an Autistic kid kicked off of a plane, see a brutal child beating in China, and lighten the mood by ending with an adorable kitten video.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:4771c4fda1908f6d3e060f2046cbf5fe51428450","amp;dn":"The+Anthony+Cumia+Show+2015-05-11+Fusilli+Anthony+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4771c4fda1908f6d3e060f2046cbf5fe51428450","infoHashBuffer":{"type":"Buffer","data":[71,113,196,253,161,144,143,109,62,6,15,32,70,203,245,254,81,66,132,80]},"announce":[],"urlList":[]}}