{"title":"Big.Brother.Australia.AU.Series6.Disc1.Days.000a-023a","uid":9249024,"size":8367540584,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:477433ddb7f6c083bd39d7b09434d5957bd1197c&amp;dn=Big.Brother.Australia.AU.Series6.Disc1.Days.000a-023a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xgimpyx","files":39,"time":1385432823,"description":"\nSome things to know about this series:\n\nI noted the time marks on the launch night episode of series 5 to avoid the look back at previous winners. I scanned through the launch night episode to do the same for this series but I didn't see the look back on this series. I thought sure I remembered there was one but either I was wrong or I just missed it. If you do run across a spoiler I apologize for that.\n\nThis series is 5 discs and contains some pre series interviews and post series specials. Disc 4 also includes a copy of Media Player Classic in case you need it to play the .asx file from the live feed. Some versions of Media Player can't play the file and some versions of VLC won't play the sound. If you use the Media Player Classic there is nothing to install. \n\nYou will see that this series has a few controversial things about it but I will leave those for you as you watch. \n\nAfter I'm done uploading this series I will take a break for at least a couple of weeks but I promise to be back. So take your time watching series 5 and 6 and if you do somehow finish them both before I come back with 7 then all I can say is you're watching too much Big Brother Australia.  :)\n\n\n  ","torrent":{"xt":"urn:btih:477433ddb7f6c083bd39d7b09434d5957bd1197c","amp;dn":"Big.Brother.Australia.AU.Series6.Disc1.Days.000a-023a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"477433ddb7f6c083bd39d7b09434d5957bd1197c","infoHashBuffer":{"type":"Buffer","data":[71,116,51,221,183,246,192,131,189,57,215,176,148,52,213,149,123,209,25,124]},"announce":[],"urlList":[]}}