{"title":"Joni Mitchell - Germany 1968 - Live SBD","uid":11170810,"size":206082811,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47826f9ebb1f868909a8f3c8a719308476e4fba8&amp;dn=Joni+Mitchell+-+Germany+1968+-+Live+SBD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thewaymouth","files":-1,"time":1412700300,"description":"Joni Mitchell - 1968-xx-xx, Germany - SBD\n\n\n.Joni Loves Germany.\n\n\nThis short but sweet suite of seagirl guitar songs is as exquisite as it sounds which is nothing short of top notch.\n \n______________________\n\nOriginal Text\n______________________\n\n\nJoni Live Germany FLAC\n\nJoni Mitchell\n\nLive - Germany probably 1968 but possibly 1969\n\n\n\n01 Marcie\n\n02 Nathan La Franeer\n\n03 Dr. Junk (intro)\n\n04 Dr. Junk\n\n05 Roses Blue\n\n06 The Circle Game &gt; Little Green\n\n07 I Don't Know Where I Stand\n\n08 Go Tell The Drummer Man\n\n09 Michael From Mountains\n\n____________________________________________\n\n\nUpload to guitars101, 2008-07-21 by puckoon. \n\nNo lineage given -- in fact he was asking for it.\n\n\n&quot;I got this as a CDR in a trade a few years back. It is supposed to have been recorded in Germany in 1968 or 1969 but I've never been able to confirm the details. If anyone could positively identify it I would be grateful.&quot;\n\n______________________________________________________________________________\n\n\n\nNow the first uploader of this show listed in Dimebot (from 2006), docruper writes: \n\n\n&quot;This is a mysterious but very high-quality recording of Joni in 1967, 1968, or 1969. Early Joni, featuring her beautiful 1960s voice and a recording that is astoundingly good--crisp, clear, no static, very little hiss.&quot;\n\n____________________________________________________________________\n\n\n\nHowever, the size of docruper torrent file does not match puckoon's. \n\n\nPuckoon's folder size matches up exactly with that of a file of a remaster by briggY added to DIME in late 2006 -- and judging by the description, it sounds like it -- but some of the briggY track times listed differ slightly (a further remaster?).\n\n\nBut just for the halibut, let's get briggY with it...\n\n______________________________________________________\n\n\nDec 24, 2006\nA new torrent has been uploaded to DIME.\nTorrent: 127105\nTitle: Joni Mitchell - ''Germany 1968'' - WONDERFUL SBD (remaster)\nSize: 195.94 MB\nCategory: Singer/Songwriter\nUploaded by: briggY\nDescription\n\n-------------------------------------------------------------------------------\n\nJoni Mitchell \nUnknown Venue, supposedly (West) Germany (?) 1968 (?) \n\n\nI noticed that this amazingly high-quality recording of an absolutely stunning solo performance had dropped off the tracker, so I decided to put it back -- this is DEFINITELY one that everyone should have. Its origins are completely mysterious, though -- it circulates as &quot;Germany 1968&quot;, but Joni didn't play in Germany in 1968. During the intro to &quot;Dr. Junk&quot; she talks about her visit to Fort Bragg, Fayetteville, and since she first played Fayetteville on January 3rd, 1967 and again in May of that year, her remark that the visit was &quot;about 2 years ago&quot; suggests that this performance took place in 1969. I think the presence of &quot;Dr Junk&quot; in the setlist would argue against the show being far into that year, since it's a throwaway song that didn't stay in her repertoire for very long. The best guess, then, would be very early 1969, but where is more of problem -- although perhaps it COULD be Germany (did she play there in 1969? the jonimitchell.com chronology has no record of any European dates between London Sep 1968 &amp; London Jan 1970 -- which can't be right, surely?) -- her phrase &quot;my country's capitol&quot; in the &quot;Roses Blue&quot; preamble seems to refer to Washington DC rather than Ottawa, which places the performance outside of North America (and that song itself, though not an easy one to decipher, was probably written after the darker events of 1968 -- the King &amp; RFK assassinations, Chicago and the election of Nixon). \n\n\nI was going to seed the show exactly as received via the JMDL hub -- the same version upped here previously -- but when I took a close look at the wav files I found SBEs -- tiny ones, but they were there (as the lineage claims alignment was done, I imagine they're historical). I went through and got rid of these manually, then decided to up the levels and shift the tracking just a little whilst I was in there. I also fixed a nasty little glitch right at the beginning and faked a less abrupt fade at the very end. There was no temptation to use any nr or eq as the sound quality is great. It's an exercise in gilding the lily, but this particular lily was worth it. \n\n\nlineage: SBD &gt; ? &gt; acousticharmonies Vine CDR &gt; Wav (EAC secure mode) &gt; Flac frontend (level 8, aligned &amp; verified) \nremaster: &gt; WAV (SBEs manually fixed, tracking &amp; levels adjusted, flaws at start &amp; end fixed with ACL10) &gt; WAV (fixed SBEs with TLH) &gt; FLAC level 8\n\n\ntotal time 38:58\n\n\n[Removed: Nov 12, 2010]\nDays on tracker: 1,419\nLast status: 905 times snatched \n\n_____________________________________________________________________\n\n_____________________________________________________________________\n\n\n...I'm back again...\n\n\n2014-10-07 mikedreams on DIME aka around thewaymouth at ThePirateBay\n\n\n&quot;Someday I will know you very well.&quot;\n\n\nI have a theory - a theory that is mine. This is my theory... That this show took place before her first album, my favorite &quot;Song To A Seagull,&quot; was released in March of 1968. \n\nFor one, Joni never mentions that she has an album out at all. And the audience does not seem to get extra excited about the songs she plays off it. \n\nPlus one, the only song she introduces that comes from that album, &quot;Michael From Mountains...&quot; Joni pauses a moment before starting up, but no one in the audience makes a single sound that resembles recognition.\n\nMaybe the folkies there were just being cool. Maybe they were just jealous she had an album out and they didn't. But then that is not cool.\n\n\nI know for one if I knew, this here Mike, his heart would have at least just jumped for crying out loud for joy for just one mountainous moment. \n\n\nJoni Mitchell spells magic music\n\n________________________________\n\n\nMore Joni From Me \n\nMore Dear Bliss To Be Ear Kissed\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10732448/Joni_Mitchell_-_Club_47__Cambridge_MA__1968_-_FM_(upgrade)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10732448/Joni_Mitchell_-_Club_47__Cambridge_MA__1968_-_FM_(upgrade)&lt;/a&gt;","torrent":{"xt":"urn:btih:47826f9ebb1f868909a8f3c8a719308476e4fba8","amp;dn":"Joni+Mitchell+-+Germany+1968+-+Live+SBD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47826f9ebb1f868909a8f3c8a719308476e4fba8","infoHashBuffer":{"type":"Buffer","data":[71,130,111,158,187,31,134,137,9,168,243,200,167,25,48,132,118,228,251,168]},"announce":[],"urlList":[]}}