{"title":"EXPLOITED COLLEGE GIRLS - Lexi - Big Fat Boobies 720p *NEW*","uid":11398409,"size":1980815214,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4790430dd1b2298c97bb2eb9e05f0304fe26d62a&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Lexi+-+Big+Fat+Boobies+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"beta2008x","files":1,"time":1415393829,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=7mvpg_lix.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=7mvpg_lix.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=noat9_ecg_14_11_06_lexi_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=noat9_ecg_14_11_06_lexi_s.jpg&lt;/a&gt;\n\n\n\nLexi is unlike many of the girls on ECG with her Elvira Mistress of the Dark looks, her fetish model attitude and her huge fake funbags. She is JUST like many of our girls, however, when she completely succumbs to Jay's cock and has a real, genuine orgasm on camera for you.\n\nSurprisingly, in this week's interview you can tell that Jay is interested in Lexi's rather odd career choice which gives this update a really raw feel. Jay listens quite a bit to Lexi and even changes things up during filming to suit her tastes. But, this ain't Oprah and eventually things have to get naked. For Lexi this means proudly showing off her huge, enhanced jugs and tiny, fun sized little frame. This girl is obviously a bit of a show off, stripping and spreading for Jay gets her wet and excited and by the time he reaches for the dildo and vibrator she's halfway up the road to Orgasmtown already.\n\nBefore Lexi is allowed to cum, though, there are rules. At the top of the list is Jay getting his dick sucked. (More people should institute this rule, would keep the ladies on their toes.) Lexi gives it a shot and even lets Jay try a little face fucking. She does a decent job or relaxing her throat and Jay rewards her by fucking her in her favorite position - the sit down. This turns out to be surprisingly hot as Jay gets her from the front and the back - you get a great view of her little ass bouncing and then one of Jay drilling her wet pussy. This position will definitely be added to the regular rotation.\n\nAfter bouncing her on his cock like a sex toy for a bit, Jay gets her onto the bed and eventually fucks her to a powerful orgasm in the classic ECG pin down position. As a thank you Lexi drops to her knees to suck Jay off some more and then take a huge facial that covers her big, round titties as much as her actual face","torrent":{"xt":"urn:btih:4790430dd1b2298c97bb2eb9e05f0304fe26d62a","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Lexi+-+Big+Fat+Boobies+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4790430dd1b2298c97bb2eb9e05f0304fe26d62a","infoHashBuffer":{"type":"Buffer","data":[71,144,67,13,209,178,41,140,151,187,46,185,224,95,3,4,254,38,214,42]},"announce":[],"urlList":[]}}