{"title":"Beck - Record Club 3 - Oar by Skip Spence (MP4, MP3, FLAC)","uid":5393906,"size":729071545,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:48221e22f37a7efa045aebe47804dd536698b14e&amp;dn=Beck+-+Record+Club+3+-+Oar+by+Skip+Spence+%28MP4%2C+MP3%2C+FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"JimmyJon3","files":-1,"time":1267158784,"description":"This torrent includes the original .mp4 video files, 160kbps mp3 files, and flac files. The mp3s and flacs were made from the wav's that were ripped from the original .mp4 video files. Download all, or just the ones you want...\n\n====================\n\nBeck &amp; Friends\nNovember 2009\nRecord Club #3: Oar by Skip Spence\n\n1. Little Hands\n2. Cripple Creek\n3. Diana\n4. Margaret/Tiger Rug\n5. Weighted Down (The Prison Song)\n6. War in Peace\n7. Broken Heart\n8. All Come to Meet Her\n9. Books of Moses\n10. Dixie Peach Promenade (Yin for Yang)\n11. Lawrence of Euphoria\n12. Grey/Afro\n\nWe're 5 months into the Record Club project now, and it's time for our third installment. \n\nThis one took place last June when Wilco was in town for the release of their new eponymous album. \n\nThey came by after a long day filming a TV appearance and still managed to put down 8 songs with us. \n\nJamie Lidell was in the studio with me working on his new record. Leslie Feist happened to be in town \n\nediting her documentary and heard we were all getting together. Recording took place at Sunset Sound \n\nStudios in the room where the Stones did a lot of Exile On Main Street (and looking at the records on the \n\nwalls it appeared that the Doobie Brothers recorded most of their output there too). Sitting in on drums, \n\nwe had James Gadson, who's played on most of the Bill Withers records and on songs like 'Express \n\nYourself' and 'I Will Survive.' Jeff Tweedy's son Spencer played played additional drums. Also, Brian \n\nLebarton, from the last two Record Club sessions is back. \n\nThe record chosen this time was Skip Spence's 'Oar.' Running sequentially, the first song up is &quot;Little \n\nHands&quot;. Our friend Danny Kalb engineered. \n\nCripple Creek: Jamie takes the lead and Gadson gets behind the kit, while Beck and Brian back them up \n\non this bare bones take on Skip Spence's Cripple Creek.\n\nWeighted Down: Feist takes the lead this week with Nels Cline arpeggiating some ridiculous 64th notes \n\non a toy guitar.\n\nBook of Moses: Gadson lays down the heaviest RC beat ever, while Jamie loops his voice into a voice \n\narmy and Brian plays some kind of octagon shaped synth.\n\nDixie Peach Promenade: This week Jeff takes the lead with his son Spencer stepping behind the kit.\n\nRecord Club is an informal meeting of various musicians to record an album in a day. The album chosen \n\nto be reinterpreted is used as a framework. Nothing is rehearsed or arranged ahead of time. A track is \n\nput up here once a week. As you will hear, some of the songs are rough renditions, often first takes that \n\ndocument what happened over the course of a day as opposed to a polished rendering. There is no \n\nintention to 'add to' the original work or attempt to recreate the power of the original recording. Only to \n\nplay music and document what happens. And those who aren't familiar with the albums in question will \n\nhopefully look for the songs in their definitive versions.\n\n====================\n\nThis torrent includes the original .mp4 video files posted on Beck's vimeo.com site \n\n(http://www.vimeo.com/videotheque). They were ripped with clipnabber.com and are the original files \n\nuploaded by Beck, not the vimeo stream, not the vimeo re-encode.\n\nThe flac and mp3's, therefore, are clean rips from the best possible available source (the original mp4 \n\nvideos) and are not sourced from the vimeo stream or the re-encoded / compressed vimeo files.\n\nEnjoy this in the highest quality available until Beck officially releases it, if he does.\n\n- RandyB","torrent":{"xt":"urn:btih:48221e22f37a7efa045aebe47804dd536698b14e","amp;dn":"Beck+-+Record+Club+3+-+Oar+by+Skip+Spence+%28MP4%2C+MP3%2C+FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48221e22f37a7efa045aebe47804dd536698b14e","infoHashBuffer":{"type":"Buffer","data":[72,34,30,34,243,122,126,250,4,90,235,228,120,4,221,83,102,152,177,78]},"announce":[],"urlList":[]}}