{"title":"The Anthony Cumia Show 2015-05-12 John Melendez MP4 MP3","uid":11915796,"size":446764981,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:488909d9817ba9088a8b863c56b3c02d4dca10f5&amp;dn=The+Anthony+Cumia+Show+2015-05-12+John+Melendez+MP4+MP3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mothergoose58","files":2,"time":1431535367,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): John Melendez\n\nEpisode 160 - Before Anthony meets Stuttering John Melendez poolside, he talks about last nights Letterman with Howard Stern and Don Rickles, the &quot;breaking news&quot; that the Stangel brothers will now be producing Opie and Jimmy, KtC gives everyone an app and studio update, and Ant clears up concerns regarding his elbows. He then gets into some NY news with a hammer attack story, muggings in Central Park, and subway vandals, we find out we only have 48 hours to live thanks to an asteroid, hear about an IRS seizure of a business owners cash, some callers chime in, and Ant relocates outside to meet John. The guys talk about their divorces, the possibility of getting married again, the Opie saga, the Stern saga, Howie's hair on Letterman, John tells us the advice Don Rickles gave him, we hear about his staph infection, and the issues between Leno and Stern. They also discuss Jackie Martling, Artie Lange, Howard banning people from the show, being politically correct, the media exaggerating, their obsession with the TV show Columbo, cameos on Columbo, they talk about their preference in bushes, manscaping, jerking off, we find out where John will be performing next, and they end with &quot;foot in mouth&quot; stories and old interviews.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:488909d9817ba9088a8b863c56b3c02d4dca10f5","amp;dn":"The+Anthony+Cumia+Show+2015-05-12+John+Melendez+MP4+MP3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"488909d9817ba9088a8b863c56b3c02d4dca10f5","infoHashBuffer":{"type":"Buffer","data":[72,137,9,217,129,123,169,8,138,139,134,60,86,179,192,45,77,202,16,245]},"announce":[],"urlList":[]}}