{"title":"Hans Kung - On Being a Christian (pdf)","uid":8161300,"size":10055728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48cf8ed2cc25c52adbc1694fa139e6ebc8ae42a7&amp;dn=Hans+Kung+-+On+Being+a+Christian+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361254773,"description":"Hans Kung - On Being a Christian (Doubleday, 1976). 720 pages.\n\nNew scan. Searchable pdf (clearscan) with contents linked in bookmarks, accurate pagination, metadata, etc.\n\nThis is one of the books that got German theologian Hans Kung in trouble with the Vatican. It's a fat exploration of the fundamentals of being a Christian in the modern world. It adopts a position that might be called moderately liberal.\n\nfrom the book flap:\n\nCan Christian faith continue to meet the challenges of today's world? Is the Christian message an adequate one for twentieth century men and women?\n\nIn this brilliant study the controversial Catholic theologian Hans Kung answers with a resounding &quot;yes.&quot; Assessing the impact of other world religions, humanism, science, technology, and political revolution; and sifting through the theological controversies within the Christian community itself, Kung affirms the vitality and uniqueness of Christianity by tracing it back to its roots - the reality of the historical Christ. For Kung's exhaustive scholarship is combined with a passionate belief in Jesus Christ as the center of existence.\n\nBeyond its historical and theological dimensions, however, ON BEING A CHRISTIAN is a thorough re-examination of what it means to be a Christian today: the role of Christian ethics in a social and political context, the relationship between Christians and Jews, the organization of a community of believers, and practical suggestions for dealing with personal crises of faith. \n\nWritten for both the scholar and the educated laity, this monumental work is destined to become a landmark of modern Christian thought.\n\nback cover:\n\nThis book is written for all those who, for any reason at all, honestly\nand sincerely want to know what Christianity, what being a Christian,\nreally means.\n\nIt is written also for those\nwho do not believe, but nevertheless seriously inquire;\nwho did believe, but are not satisfied with their unbelief;\nwho do believe, but feel insecure in their faith;\nwho are at a loss, between belief and unbelief;\nwho are skeptical, both about their convictions and about their doubts.\nIt is written then for Christians and atheists, Gnostics and agnostics,\npietists and positivists, lukewarm and zealous Catholics, Protestants\nand Orthodox.\n\nIt is an attempt, in the midst of an epoch-making upheaval of the Church's doctrine, morality and discipline, to discover what is permanent: what is different from other world religions and modern humanisms; and at the same time what is common to the separate Christian Churches. The reader will rightly expect us to work out for him in his practice of Christianity, in a way that is both historically exact and yet up to date, in the light of the most recent scholarship and yet intelligibly, what is decisive and distinctive about the Christian program: what this program originally meant, before it was covered with the dust and debris of two thousand years, and what this program, brought to light again, can offer today by way of a meaningful, fulfilled life to each and every one.\n\nThis is not another gospel, but the same ancient gospel rediscovered for today.\n\n","torrent":{"xt":"urn:btih:48cf8ed2cc25c52adbc1694fa139e6ebc8ae42a7","amp;dn":"Hans+Kung+-+On+Being+a+Christian+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48cf8ed2cc25c52adbc1694fa139e6ebc8ae42a7","infoHashBuffer":{"type":"Buffer","data":[72,207,142,210,204,37,197,42,219,193,105,79,161,57,230,235,200,174,66,167]},"announce":[],"urlList":[]}}