{"title":"Roy Brown","uid":4443414,"size":65429604,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:49c7fabfecb283c2e31aade19a2d93cc59721528&amp;dn=Roy+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"snackie829","files":25,"time":1223927475,"description":"Born Roy James Brown in New Orleans, Louisiana[1], Brown started as a gospel singer. His mother was an accomplished singer and organist in church.[2] After a move to Los Angeles, California some time in the 1940s, and a brief period spent as a professional boxer in the welterweight category, he won a singing contest in 1945 at the Million Dollar Theater covering &quot;There&amp;#039;s No You&quot; by Bing Crosby. In 1946 Brown moved to Galveston, Texas, where he sang in a club. His numbers included &quot;Good Rocking Tonight&quot;. He returned to New Orleans in 1947.\n\nBrown failed to interest Wynonie Harris in &quot;Good Rocking Tonight&quot;, but got an introduction to the president of Deluxe Records, who signed him. The song was released in 1947 and reached #13 on Billboards R&amp;B charts (but was eclipsed by Harris&amp;#039; cover of it). Brown&amp;#039;s version was a jump blues with a swing beat, but Harris&amp;#039;s cover version can be considered closer to rock and roll. Elvis Presley also covered the song for Sun Records in 1954; later re-released on RCA Victor when his recording contract was sold to that record label in 1956.\n\nBrown and his band &quot;The Mighty Men&quot; were spectacular performers, with the kind of crowd pleasing stage histrionics for which Little Richard would soon be famous. Unfortunately, tastes changed and Brown could not keep up.\n\nThe decline of his fortunes coincided with his successfully winning a lawsuit against King Records for unpaid royalties in 1952, one of the few African American musicians to do so in the 1950s. This has led some, such as author Nick Tosches (in his book Unsung Heroes of Rock &amp;#039;n&amp;#039; Roll, which contains a chapter on Brown) to believe that Brown may have been blacklisted. When his popularity ebbed in the rock and roll era, he tried teen-slanted songs like &quot;School Bell Rock&quot;, but had little success and more or less retired.[3]\n\nHis popularity was at its lowest at the end of the 1950s, but he sporadically managed to find work through the 1960s. To supplement his income, he worked as an encyclopedia salesman.[4]\n\nIn 1970 Brown closed The Johnny Otis Show at the Monterey Jazz Festival. As a result of the crowd reaction he recorded &quot;Love For Sale&quot;, which became a hit for Mercury Records.[2]\n\nIn the late 1970s a compilation album of his old work brought about a minor revival of interest. In 1978 he had a successful tour in Scandinavia following the release of Laughing But Crying and before the release of Good Rocking Tonight. Shortly before his death he performed at the Whisky A Go-Go in West Hollywood, California and headlined the New Orleans Jazz and Heritage Festival during the spring of 1981.\n\nHe died of a heart attack, in San Fernando, California at the age of 55, in May 1981.[1][5] He was posthumously inducted into the Blues Hall of Fame the same year.","torrent":{"xt":"urn:btih:49c7fabfecb283c2e31aade19a2d93cc59721528","amp;dn":"Roy+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c7fabfecb283c2e31aade19a2d93cc59721528","infoHashBuffer":{"type":"Buffer","data":[73,199,250,191,236,178,131,194,227,26,173,225,154,45,147,204,89,114,21,40]},"announce":[],"urlList":[]}}