{"title":"Kabbalah Lectures with Rav Michael Laitman (Video Bundle 5)","uid":4706049,"size":941714178,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4a47680c81bb948343f359068e7896480f0522e4&amp;dn=Kabbalah+Lectures+with+Rav+Michael+Laitman+%28Video+Bundle+5%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"hozer01","files":18,"time":1233862581,"description":"Bnei Baruch - Kabbalah Lectures with Rav Michael Laitman (Video Bundle 5)\n\nTopic:\n\nIn the southern part of Switzerland lies a small town called Arosa. Until a month ago, the world knew it as a popular ski resort. Arosa is every skier's dream. Furnished with all the modern necessities, it attracts thousands of people from all over the world who come for skiing and relaxation. In 2004, Arosa became attractive for another reason; it became the center for the World Spirit Forum's meetings.\n\nNow Arosa hosts prominent scientists, thinkers and spiritual leaders from all over the world coming together to discuss plans to deal with a world filled with crises. In January 22-25, 2006, the Arosa meeting ran alongside a corporate world leaders' conference that took place on the other side of the mountain, in Davos. These two simultaneously-running, global scale think tanks sent shivers through the air, so to speak, that the fate of the whole world was at stake.\n\nThe Arosa meeting was a direct continuation of the forum that met in Tokyo. Tokyo's meeting laid out the basic ideological conception, and in Arosa, the process continued with discussions of concrete plans and how to realize them. Delegates met in various forums to discuss many proposals presented. Everyone united due to the sheer importance of the topic-global crisis-and their mutual responsibility to address it.\n\nThe video lectures are about Q&amp;A that took place after Rav Michael Laitman came back from Arosa. One of the best video bundle lectures for everyone to see...\n\n17 video lectures (.wmv)\n\nPlease seed","torrent":{"xt":"urn:btih:4a47680c81bb948343f359068e7896480f0522e4","amp;dn":"Kabbalah+Lectures+with+Rav+Michael+Laitman+%28Video+Bundle+5%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a47680c81bb948343f359068e7896480f0522e4","infoHashBuffer":{"type":"Buffer","data":[74,71,104,12,129,187,148,131,67,243,89,6,142,120,150,72,15,5,34,228]},"announce":[],"urlList":[]}}