{"title":"Instant GIMP Starter","uid":8202515,"size":22921105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4aa3e5ac0bdd6c9ea36a4972efcc0c5ccc69151a&amp;dn=Instant+GIMP+Starter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1362051725,"description":"Instant GIMP Starter\n\nBOOK DETAILS\n\nPublisher: Packt Publishing (January 2013) Language: English ISBN-10: 1782160345 ISBN-13: 978-1782160342 Format: PDF, EPUB\n\nBOOK DESCRIPTION:\n\nImage manipulation is being used by professionals all over the world. Beautiful pictures can be achieved by combining technology with art. GIMP.  the GNU Image Manipulation Program, makes them accessible to everyone. GIMP is. With it, anyone can express their emotional and intellectual capability in a new dimension. Instant GIMP Starter is a book that provides a new generation of artists with new techniques and tools in a comprehensive format. A range of task from drawing simple images to composing multiple pictures in an image are covered in this book. This book walks you through the journey of learning various tools and gets the reader to create exciting artworks, one after another. Although the book focuses on each step of producing wonderful effects with GIMP to anyone with basic computer skills, it also delivers information that can be used for school projects or corporate presentations. You will have a set of great photos when you learn how to apply special effects. You will have amazing tools to work with to satisfy your creativity and an endless chain of beautiful images you never knew you could come up with. \n\nWhat you will learn from this book:\n\nDraw an image from scratch\nColor images on canvas\nManage your images with layers\nDraw a graph precisely\nShade your images with gradient effects\nScale, transform, and rotate images\nUse filters to beautify the image\nMake a dinosaur appear in your picture\n\nApproach Get to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. \n\nA Starter guide which helps you practically start with GIMP through plenty of examples and screenshots. \n\nWho this book is for:\n\nThis is an excellent handbook for anyone who would like to start drawing using their computers. The approach used within this book is objective so that readers from any age will be able to learn the process. The setup is so basic that you will need only a computer and a very minimal amount of computer literacy to start using this book. \n","torrent":{"xt":"urn:btih:4aa3e5ac0bdd6c9ea36a4972efcc0c5ccc69151a","amp;dn":"Instant+GIMP+Starter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa3e5ac0bdd6c9ea36a4972efcc0c5ccc69151a","infoHashBuffer":{"type":"Buffer","data":[74,163,229,172,11,221,108,158,163,106,73,114,239,204,12,92,204,105,21,26]},"announce":[],"urlList":[]}}