{"title":"On Sparrow Hill - Maureen Lang.epub","uid":8950550,"size":452079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ac4e547f50e80e675ea842f38a842f245e8b001&amp;dn=On+Sparrow+Hill+-+Maureen+Lang.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1379873967,"description":"Two time periods--Victorian Ireland and contemporary England--are again woven together in this sequel to &quot;The Oak Leaves.&quot; Rebecca Seabrooke is a commercial manager for Quentin Hollinworth's family manor and is focused on two things: running the best historical home in the country and forgetting about the childhood crush she's had on Quentin ever since her father worked as the valet for his family. They don't, after all, run in the same social circles. When Quentin's distant cousin Dana Martin Walker comes to visit the Hollinworth estate, Rebecca realizes she must confront some of her preconceived ideas about herself . . . and about Quentin. Dana wants to learn more about her ancestors--especially about Berrie Hamilton, who in 1852 decided to fulfill her sister-in-law's dream of opening a school for the mentally challenged. Dana also discovers that, despite their precautions, she and her husband are expecting, and their unborn child may turn out to be like many of Berrie's students. It will take reading Berrie's letters--written a century ago--for Dana and Rebecca to learn the importance of serving others and to realize that ultimately, even our best-laid plans are not always God's plans.","torrent":{"xt":"urn:btih:4ac4e547f50e80e675ea842f38a842f245e8b001","amp;dn":"On+Sparrow+Hill+-+Maureen+Lang.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ac4e547f50e80e675ea842f38a842f245e8b001","infoHashBuffer":{"type":"Buffer","data":[74,196,229,71,245,14,128,230,117,234,132,47,56,168,66,242,69,232,176,1]},"announce":[],"urlList":[]}}