{"title":"Hard Anal Love 2 XXX DVDRip x264-RedSecTioN","uid":10003478,"size":2941313808,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4af3ec2558fd90359018f17e6a30b50787e50154&amp;dn=Hard+Anal+Love+2+XXX+DVDRip+x264-RedSecTioN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":13,"uploader":"xxxlavalxxx","files":6,"time":1398018809,"description":"&quot;Butt-obsessed director Mike Adriano believes in tough love when it comes to training the sweet assholes of beautiful girls. His explicit movies are dedicated to exploring female ass with perverse creativity and passion, and the filmmaker/ performer s tireless cock won t take no for an answer! In Mike indulges all his signature rectal fixations in four one-on-one scenes. Busty, pigtailed blonde bimbo Christie Stevens squeals as she shows Mike how much her anal gaping skills have improved. The nasty girl gives him a wet, drooling, gagging blow job, and after a shower enema, he stretches Christie s sphincter widely. She celebrates by milking the director s hot sperm into her mouth. Sultry Skin Diamond gags on Mike s meaty boner; he slathers the gorgeous African-American slut s pretty ass with greasy lube and reams her tight rear with his throbbing shaft and a hole-expanding speculum. Fit, toned and heavily tattooed, sexy blonde stripper Britney Shannon gets face-fucked and her rump gets completely wrecked. In a cute bob haircut and sheer lingerie, half-Persian Webcam model Lallasa makes her porn debut. This exotic newcummer shows off her thick, round, righteous booty and wraps her lips around Mike s meat for an intimate, ball-licking blow job that escalates to submissive rimming of the director s bunghole. Her big butt well sodomized, Lallasa slurps Mike s shaft ass-to-mouth and opens wide for a mouthful of creamy jism. There s nothing soft about but at least the girls are easy.&quot;\n\nChristie Stevens, Skin Diamond, Britney Shannon, Lallasa, Mike Adriano\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=38090971725647201712.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=38090971725647201712.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=64050410988009437485.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=64050410988009437485.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:4af3ec2558fd90359018f17e6a30b50787e50154","amp;dn":"Hard+Anal+Love+2+XXX+DVDRip+x264-RedSecTioN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af3ec2558fd90359018f17e6a30b50787e50154","infoHashBuffer":{"type":"Buffer","data":[74,243,236,37,88,253,144,53,144,24,241,126,106,48,181,7,135,229,1,84]},"announce":[],"urlList":[]}}