{"title":"Blackwell Companion to Law and Society (2004)","uid":8392438,"size":2733005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4af9bad213e28cfc7dd0b799f080223653e8b921&amp;dn=Blackwell+Companion+to+Law+and+Society+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":-1,"time":1366475615,"description":"Austin Sarat, editor - The Blackwell Companion to Law and Society (Wiley-Blackwell, 2004).\n\nISBN: 9780631228967 | 692 pages | PDF\n\nThe Blackwell Companion to Law and Society is an authoritative study of the relationship between law and social interaction. Thirty-three original essays by an international group of expert scholars examine a wide range of critical questions, covering topics such as the various legal systems favored by different societies and cultures, the effect that law has on scientific and technical advancement, and how legal institutions have embraced and constructed, as well as silenced and stigmatized, various national, social, cultural, and personal identities.\n\nClassical areas and new themes in law and society research are addressed, including: the gap between law on the books and law in action; the complexity of institutional processes; the significance of new media; and the intersections of law and identity. Authors represent various theoretical, methodological, and political commitments from positivism to interpretivism, from rational choice to critical scholarship, from radical to policy-oriented research, and from the new institutionalism to cultural studies. Each chapter reviews the state of knowledge in its area, emphasizing key research findings, theoretical developments, methodological controversies, and points the way for new inquiry. The result is a collection that is useful, engaging, and responsible, but also provocative.\n\nContributors are drawn from many different countries and cultures, reflecting the world-wide significance of North American law and society scholarship, and engaging the exciting work now being done in England, Europe, Australia, and New Zealand, South Africa, and Israel. The Blackwell Companion to Law and Society provides a definitive resource, offering the first truly global overview of the field.\n\nReviews\n\n&quot;This collection of law and society scholarship fills a gap that many of us in the field have lamented for years. Encyclopedic in scope, it manages to represent the rich diversity of the field while still making a strong case for a law and society 'canon'. It is bound to become a classic.&quot; -- Kitty Calavita, University of California, Irvine\n\n&quot;Sarat and his contributors have compiles a valuable and authoritative introduction to a substantial body of scholarship and reflection on the relationship between law and society. This will be an essential resource for both novice and experienced workers in this field.&quot; -- Robert Dingwall, University of Nottingham\n\n********************\n\nSee also http://thepiratebay.se/torrent/8390678\n","torrent":{"xt":"urn:btih:4af9bad213e28cfc7dd0b799f080223653e8b921","amp;dn":"Blackwell+Companion+to+Law+and+Society+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af9bad213e28cfc7dd0b799f080223653e8b921","infoHashBuffer":{"type":"Buffer","data":[74,249,186,210,19,226,140,252,125,208,183,153,240,128,34,54,83,232,185,33]},"announce":[],"urlList":[]}}