{"title":"Fellini Satyricon 1969 GER FRA ITA SPA DVD9 TRL [Ultima Frontier","uid":5153029,"size":8088610816,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4b1f74257dac2525f3c5c1cbac3441ea3ae55789&amp;dn=Fellini+Satyricon+1969+GER+FRA+ITA+SPA+DVD9+TRL+%5BUltima+Frontier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"qu3ll0","files":-1,"time":1257640124,"description":"Titolo originale: Fellini - Satyricon\nNazione: Francia, Italia\nAnno: 1969\nGenere: Drammatico\nDurata: 138\nRegia: Federico Fellini\nProduzione: Alberto Grimaldi Per La Pea/Produzioni Europee Associate\n\n\nJoseph Wheeler, Max Born, Lucia BosÃƒÂ©, Alain Cuny, Hiram Keller, Danika La Loggia, Elisa Mainardi, George Eastman, Gordon Mitchell, Magali NoÃƒÂ«l, Martin Potter, Salvo Randone, Capucine, Mario Romagnoli, Giuseppe Sanvitale, Hylette Adolphe, Fanfulla, Federico Fellini, Rodolfo Sonego, Bernardino Zapponi, Giuseppe Rotunno, Tod Dockstader, Andrew Rudin, Nino Rota, Ilhan Mimaroglu, Ruggero Mastroianni, Danilo Donati, Luigi Scaccianoce, Danilo Donati\n\n\nISPIRATO AL ROMANZO DI GAIO PETRONIO ARBITRO\nIl giovane Encolpio ÃƒÂ¨ follemente innamorato dell'efebo Gitone. Il suo amico Ascilto glielo ha sottratto e l'ha venduto al teatrante Vernacchio. Encolpio riesce a riaverlo ma, dopo una notte d'amore, Gitone preferisce Ascilto e abbandona Encolpio. Siamo nell'ambiente notturno della malfamata Suburra, delle terme, dell'Insuleta Felicles, luogo di tutti i vizi e ritrovo babelico di tutti i relitti umani. Un terremoto fa crollare l'Insula. Encolpio riesce a salvarsi e incontra il poeta Eumolpo, che lo conduce alla fastosa cena di Trimalcione. Le portate si succedono alle portate, non manca la musica, la poesia e la grottesca farsa del funerale di Trimalcione col pianto degli schiavi: tutto a livello bestiale, col predominio incontrastato dei porci. Eumolpo, avendo offeso Trimalcione, ÃƒÂ¨ bastonato e gettato fuori dal banchetto. Encolpio lo incontra dolorante in aperta campagna, lo aiuta e insieme si addormentano. Finiscono cosÃƒÂ¬, senza accorgersi, schiavi sulla nave del tiranno di Taranto, Lica. Nella stiva Encolpio ritrova Ascilto, Gitone e attira, per la sua bellezza, il sadico e corrotto Lica. Avviene cosÃƒÂ¬ una grottesca cerimonia nuziale fra Encolpio e Lica; ma subito dopo, in una sollevazione di soldati, il tiranno viene ucciso. Encolpio e Ascilto, liberi, giungono in una villa di patrizi romani, che si sono suicidati, dopo aver liberato gli schiavi. Trovano modo di divertirsi con una giovinetta negra, sola nella grande villa. La vicenda dei due amici continua. Alleatisi con un ladrone, Encolpio e Ascilto rapiscono, a scopo di lucro, un dio bambino ermafrodito; ma in una piana polverosa e desertica, sotto un sole accecante, il dio ermafrodito avvizzisce e muore. Encolpio e Ascilto, dopo una lotta furibonda col ladrone, continuano il loro viaggio. Giungono in una cittÃƒÂ  ove si celebrano le feste del dio Riso ed Encolpio ÃƒÂ¨ costretto ad affrontare il Minotauro, che, in realtÃƒÂ , ÃƒÂ¨ solo un erculeo giovane mascherato, dal quale viene sconfitto e col quale si abbraccia. Il premio per Encolpio, nonostante la sconfitta, ÃƒÂ¨ la prosperosa Arianna. Ma qui fa la dolorosa scoperta della sua impotenza. Frattanto Encolpio incontra nuovamente il poeta Eumolpo, che tradendo la povertÃƒÂ  tipica dell'arte, ÃƒÂ¨ diventato ricco e introduce il giovane nel Giardino delle Delizie ove l'allegria e le cure di festose ragazze dovrebbero guarirlo dalla sua impotenza; invece ÃƒÂ¨ un tormento inutile e uno spasso solo per l'amico Ascilto. Per riacquistare la sua virilitÃƒÂ  Encolpio si fa condurre con l'inseparabile Ascilto nell'antro della maga Enotea. Viene guarito, ma perde Ascilto, il quale ferito a un fianco nella lotta con il battelliere, che li ha condotto dalla maga, muore. Encolpio si ritrova in riva al mare davanti al cadavere del poeta Eumolpo che, per testamento, ha lasciato le sue ricchezze a chi si ciberÃƒÂ  del suo cadavere. Un branco di vecchi abbruttiti e avidi si abbandona al macrabo pasto, mentre Encolpio, con alcuni giovani amici, si imbarca contento su una nave che veleggia verso l'Oriente.\n\n\n&quot;Se si passa dalle premesse culturali ai concreti risultati espressivi, le riserve non mancano: programmatica fin che si vuole, la frammentarietÃƒÂ  non riesce a diventare una cifra stilistica: si ha l'impressione che il film potrebbe durare mezz'ora in meno o due ore in piÃƒÂ¹ senza che il risultato cambi. Soprattutto se paragonata con quelle delle sue opere precedenti, la galleria dei mostri finisce con l'essere un esercizio di alta acrobazia barocca fine a se stessa. (Morando Morandini, &quot;Il Tempo&quot;, 11 ottobre 1969)&quot;\n\n\nVideo\nFormat : MPEG Video\nFormat profile : Version 2\nBit rate mode : Variable\nWidth : 720 pixels\nHeight : 576 pixels\nDisplay aspect ratio : 16/9\nFrame rate : 25.000 fps\nStandard : PAL\n\nAudio #1\nFormat : AC-3\nFormat/Info : Audio Coding 3\nChannel(s) : 2 channels\nSampling rate : 48.0 KHz\nLanguage : German\n\nAudio #2\nFormat : AC-3\nFormat/Info : Audio Coding 3\nChannel(s) : 2 channels\nSampling rate : 48.0 KHz\nLanguage : French\n\nAudio #3\nFormat : AC-3\nFormat/Info : Audio Coding 3\nChannel(s) : 2 channels\nSampling rate : 48.0 KHz\nLanguage : Italian\n\nAudio #4\nFormat : AC-3\nFormat/Info : Audio Coding 3\nChannel(s) : 2 channels\nSampling rate : 48.0 KHz\nLanguage : Spanish\n\nText #1\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : English\n\nText #2\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : German\n\nText #3\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : French\n\nText #4\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Spanish\n\nText #5\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Finnish\n\nText #6\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Swedish\n\nText #7\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Norwegian Nynorsk\n\nText #8\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Danish\n\nText #9\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Portuguese\n\nText #10\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Hungarian\n\nText #11\nFormat : RLE\nFormat/Info : Run-length encoding\nResolution : 2 bits\nLanguage : Greek","torrent":{"xt":"urn:btih:4b1f74257dac2525f3c5c1cbac3441ea3ae55789","amp;dn":"Fellini+Satyricon+1969+GER+FRA+ITA+SPA+DVD9+TRL+%5BUltima+Frontier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b1f74257dac2525f3c5c1cbac3441ea3ae55789","infoHashBuffer":{"type":"Buffer","data":[75,31,116,37,125,172,37,37,243,197,193,203,172,52,65,234,58,229,87,137]},"announce":[],"urlList":[]}}