{"title":"Phil Collins - Hello I Must Be Going [1982, 320 kbps]","uid":5050616,"size":136493502,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b99f02e9dcaeaa5ae243e2f827b2f5b30eb6600&amp;dn=Phil+Collins+-+Hello+I+Must+Be+Going+%5B1982%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"musicalibera","files":30,"time":1250170705,"description":"PHIL COLLINS - Hello, I Must Be Going! (1982)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD\nNumber of tracks 12.\n\nAllmusic review:\n\n&quot;As his hit cover of &quot;You Can't Hurry Love&quot; demonstrates, Phil Collins began to inject his highly melodic pop songwriting with more soul and R&amp;B influences on his second solo album, Hello, I Must Be Going! While some of the material was successful, much of it showed that he was still coming to grips with how to incorporate R&amp;B techniques into his style; in retrospect, Hello, I Must Be Going! laid the groundwork for his breakthrough album, No Jacket Required..&quot;\n\nRolling Stone review:\n\n&quot;On his first solo album, 1981's Face Value, Genesis drummer-singer Phil Collins showed that he wasn't about to be left behind in the mire of classical-rock sludge. That LP boasted shorter songs and demonstrated that Collins had a true pop sensibility. Hello, I Must Be Going! continues that trend, with some familiar patterns emerging. First, there are the dramatic rock dirges that use drums as a lead instrument; &quot;I Don't Care Anymore,&quot; with Collins' one-man band playing alongside Daryl Stuermer's atmospheric guitars, wins in this category. Then there are the buttery ballads, of which &quot;Don't Let Him Steal Your Heart Away&quot; is the best by virtue of a Beatles-like melody that buoys Collins' anonymously sweet voice. Both of these styles were already Genesis staples; it was Collins' uptempo soul tunes on Face Value and Genesis' Abacab that surprised old fans and found new ones. &quot;I Cannot Believe It's True,&quot; with Earth, Wind and Fire's Phoenix Horns casting out clean lines, clobbers the other soul contenders on Hello, I Must Be Going!, especially his remake of the Supremes' &quot;You Can't Hurry Love.&quot; Collins took the golden-oldie route on that song and the result isn't soulful, it's superfluous. Despite its trend-bucking boast of an eight-track recording, the album's rich luster is of the old classical-rock school. In fact, the LP sounds like stripped-down Genesis, ornamental but not too ostentatious.&quot;\n\nWikipedia bio:\n\n&quot;Hello, I Must Be Going! is the second studio album by British singer-songwriter Phil Collins. It was originally released November 1, 1982 and a CD version released in 1988. This album's name comes from the Marx Brothers' song with the same name, featured in the movie Animal Crackers. The album was promoted with a tour of the same name.\nOne of the highlights of the album is the cover version of the Supremes hit &quot;You Can't Hurry Love&quot;, which is one of Collins' best-known singles, although none of the other single releases from the album made any significant impact on the charts. Other notable tracks include the modern-jazz instrumental &quot;The West Side&quot;, and &quot;Thru These Walls&quot;, a dark voyeuristic song about a man listening through the wall to his neighbors partaking in unseemly nighttime activities - or at least that's what he's imagining at the time.\nThe more upbeat tracks serve as a preamble to the more commercial sound of the next album No Jacket Required. The album takes much of its inspiration from the problems in Collins' personal life, most notably the painful divorce he was going through at the time. This accounts for the dark and embittered tone on several of the tracks, including the single &quot;I Don't Care Anymore&quot;. Co-produced with Hugh Padgham, the gated reverb sound of the drum kit is employed in full yet again, with a mixture of very dry drum sounds on tracks like &quot;I Cannot Believe It's True&quot; in contrast to the huge acoustics used on &quot;Do You Know, Do You Care?&quot;.\nThe album spawned no less than seven singles released in the UK/Continental Europe and/or the US in 1982 and 1983; &quot;Thru These Walls&quot; (UK #56, US Billboard Hot Mainstream Rock Tracks #34), &quot;You Can't Hurry Love&quot; (UK #1, US #10), &quot;I Don't Care Anymore&quot; (US Billboard Hot 100 #39, US Hot Mainstream Rock Tracks #3), &quot;Don't Let Him Steal Your Heart Anyway&quot; (UK #45), &quot;Why Can't It Wait 'Til The Morning?&quot; (UK #89), &quot;I Cannot Believe It's True&quot; (US Billboard Hot 100 #79) and &quot;Like China&quot; (US Hot Mainstream Rock Tracks #17).\nFollowing this series of moderately successful releases two singles issued in 1984 - neither of which were featured on Collins' own studio albums - both became smash hits; &quot;Against All Odds (Take A Look At Me Now)&quot;, the main theme for the film of the same name (UK #1, US Billboard Hot 100 #1, US Hot Adult Contemporary Tracks #3, US Hot Mainstream Rock Tracks #1) and &quot;Easy Lover&quot;, a duet with Earth Wind &amp; Fire's lead singer Philip Bailey (UK #1, US Billboard Hot 100 #1, US Hot Adult Contemporary Tracks #15, US Mainstream Rock Tracks #5, US Hot R&amp;B/Hip Hop Songs #3). The latter appeared on Bailey's solo album Chinese Wall, produced by Collins. &quot;Easy Lover&quot; was very successful commercially, selling over a million copies in the US alone. The song also won an MTV Video Music Award for Best Overall Performance in 1985 and was Grammy nominated for Best Pop Vocal Performance By A Duo or Group.&quot;\n\nTRACK LIST\n\nHello, I Must Be Going! (1982)\n==============================\n\n01. I Don't Care Anymore\n02. I Cannot Believe It's True\n03. Like China\n04. Do You Know, Do You Care?\n05. You Can't Hurry Love \n06. It Don't Matter To Me\n07. Thru These Walls\n08. Don't Let Him Steal Your Heart Away\n09. The West Side\n10. Why Can't It Wait 'Til The Morning?\n+\n11. Against All Odds (Take A Look At Me Now)\n12. Easy Lover (Duet with Philip Bailey)\n\n\nEnjoy and share with you fellow man.\n","torrent":{"xt":"urn:btih:4b99f02e9dcaeaa5ae243e2f827b2f5b30eb6600","amp;dn":"Phil+Collins+-+Hello+I+Must+Be+Going+%5B1982%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b99f02e9dcaeaa5ae243e2f827b2f5b30eb6600","infoHashBuffer":{"type":"Buffer","data":[75,153,240,46,157,202,234,165,174,36,62,47,130,123,47,91,48,235,102,0]},"announce":[],"urlList":[]}}