{"title":"Shine a Light - Subtitled Spanish Subtitulos Espanol","uid":4300818,"size":951802046,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4bb4b92f29f9fd13bbe955be59ca5137e75815b4&amp;dn=Shine+a+Light+-+Subtitled+Spanish+Subtitulos+Espanol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheLabMan","files":1,"time":1216308503,"description":"Martin Scorsese and the Rolling Stones unite in Shine a Light\n\nScorcese filmed the Stones over a two-day period at the intimate Beacon Theater in New York City in fall 2006. Cinematographers capture the raw energy of the legendary band.  \n\nWritten by alfiehitchie \n\n\nShine a Light is a 2008 documentary film directed by Martin Scorsese documenting two 2006 performances that took place during English rock band The Rolling Stones' A Bigger Bang Tour.[1] It also includes archive footage from the band's career. The film takes its title from the song of the same name, featured on the band's 1972 album Exile on Main St. A soundtrack album was released in April 2008 on the Universal label.\n\nScorsese filmed the Rolling Stones at New York City's Beacon Theater on October 29 and November 1, 2006. The concert footage is preceded by a brief semi-fictionalised introduction about the preparations for the shows, and is intercut with historical news clips and archival interviews with band members. The shows, which were added to the tour schedule for the purposes of the film shoot, featured a different set list than was typical of other shows on the tour (see below), and were noted for their star-studded crowds, including former President Bill Clinton and former President of Poland Aleksander Kwasniewski.[2][3] The film also shows Jack White, Buddy Guy and Christina Aguilera performing with the band.\n\nBackstage at the October 29th performance, music executive Ahmet ErtegÃƒÂ¼n slipped and suffered the head injury that ultimately led to his death. The film is dedicated to ErtegÃƒÂ¼n.\n\nShine a Light was initially scheduled for release on September 21, 2007, but Paramount Classics postponed it until April 2008.[4] The world premiere was at the 58th Berlin International Film Festival on February 7, 2008.[5] The film is also being screened in some IMAX cinemas.[6]\n\nThe MPAA gave the film a PG-13 rating (the film was edited from an R) for brief strong language, drug references, and smoking.","torrent":{"xt":"urn:btih:4bb4b92f29f9fd13bbe955be59ca5137e75815b4","amp;dn":"Shine+a+Light+-+Subtitled+Spanish+Subtitulos+Espanol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bb4b92f29f9fd13bbe955be59ca5137e75815b4","infoHashBuffer":{"type":"Buffer","data":[75,180,185,47,41,249,253,19,187,233,85,190,89,202,81,55,231,88,21,180]},"announce":[],"urlList":[]}}