{"title":"[Voluptuous] Veronika (Stress Buster / 28915 / 03.07.2013)","uid":8488970,"size":468238065,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4c22ab435fb7c24b2161e8a6ca7201f4759b7bcc&amp;dn=%5BVoluptuous%5D+Veronika+%28Stress+Buster+%2F+28915+%2F+03.07.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":2,"time":1368959105,"description":"[Voluptuous] Veronika (Stress Buster / 28915 / 03.07.2013)\n\nSCORE returns to the big titty city that emerged as a world power in the late '90s and has never lost its standing in the international boobs race. A place where boobs and the babes are hot and the beer is cold. We're talking Prague in the Czech Republic.\n\nRejoining this big top of big boobs is the ever-flexible brickhouse Veronika. The voluptuous vixen with a fuck-me face and cock sucker lips took a break from adult sex action a few years ago but she can't just stay away from wanting to spread her pussy and get her brains fucked out. So she put her feelers out to SCORE. &quot;I am bored being away so long,&quot; Veronika said when she showed up. &quot;I need good sex and good men giving me what I need.&quot; We aim to deliver.\n\nOne of the top studs of Prague was called to handle the peppery redhead who's changed her hair color back to blonde again. Neeo has masterfully drilled some of the hottest big-boobed names in his country like Sharon Pink and Westy. He is the right man for the task of cock-dominating busty bitches who crave a ramrod pounding.\n\nThey waste no time in feasting on Veronika's heavy sucklers. While Neeo sucks her pink nipples hard, Veronika bends over to suck his prick like a vacuum cleaner. He gives her a tit-fucking and then spreads her legs open to lick her pink cunt because real men eat pussy. Once Veronika's pussy-hole is nice and wet, he mails her a special delivery love-letter in the form of a rigid cock and pounds the shit out of her. Veronika's cries and moans provide the background music to the fast and rough drilling her snatch is getting while her bodacious hooters swing and bounce with every thrust.\n\nTo celebrate Veronika's comeback, Neeo never lets up the pace, ramming her in missionary and pile-driver while showing her neat tricks she can do with her tits while he's fucking her. With Veronika kneeling before him, he fucks her jugs again then loads her mouth with enough man-sauce to keep her satisfied until we can get Veronika over to visit SCOREVideos.com for more action. She holds up her melons and licks off as much cum as she can, smacking her lips and looking into the camera.\n\nBut wait! There's more! As a Boner Bonus, Veronika dances and strips, then oils 'em up, playing, squeezing and rubbing her tits as they glisten and shine. Welcome back, Veronika, bouncing Czech!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7z90p87t9g4ki9v0mxh3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7z90p87t9g4ki9v0mxh3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1pb2510m5blh5yorl8gz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1pb2510m5blh5yorl8gz.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:4c22ab435fb7c24b2161e8a6ca7201f4759b7bcc","amp;dn":"%5BVoluptuous%5D+Veronika+%28Stress+Buster+%2F+28915+%2F+03.07.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c22ab435fb7c24b2161e8a6ca7201f4759b7bcc","infoHashBuffer":{"type":"Buffer","data":[76,34,171,67,95,183,194,75,33,97,232,166,202,114,1,244,117,155,123,204]},"announce":[],"urlList":[]}}