{"title":"Joshua Redman Elastic Band - Momentum (2005)","uid":5780494,"size":375919230,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ca29d8248daf6e7ff0c32f58c4ee5e980af94e3&amp;dn=Joshua+Redman+Elastic+Band+-+Momentum+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mariorg","files":-1,"time":1282351247,"description":"Audio CD (May 24, 2005)\nLabel: Nonesuch\n\nTrack Listing\n~~~~~~~~~~~~\n01 - Soundcheck\n02 - Sweet Nasty\n03 - Just A Moment\n04 - Shut Your Mouth\n05 - Crunge\n06 - Riverwide\n07 - Greasy G\n08 - Lonely Woman\n09 - Swunk\n10 - Blowing Changes\n11 - Double Jeopardy\n12 - Put It In Your Pocket\n13 - Showtime\n\n\nPersonnel\n~~~~~~~~\n* Joshua Redman: Organ, Arranger, Sax (Soprano), Synthesizer Bass, Editing,\nEngineer, Producer, Clavinet, Sax (Tenor)\n* Sam Yahel: Organ, Synthesizer, Arranger, Atmosphere, Synthesizer Bass,\nEditing, Fender Rhodes, Engineer, Producer, Clavinet\n* Me'Shell NdegÃƒÂ©ocello: Bass\n* Brian Blade: Drums\n* Jeff Parker: Guitar\n* Nicholas Payton: Trumpet\n* Kurt Rosenwinkel: Guitar\n* ?uestlove: Drums\n* Jeff Ballard: Drums, Synthesizer Drums\n* Stefon Harris: Vibraphone\n* Eric Krasno: Guitar\n* Peter Bernstein: Guitar\n* Flea: Bass\n\n\nJoshua Redman Momentum CD\n\nOnce again featuring the expansive keyboard talents of Sam Yahel, saxophonist Joshua Redman's Momentum features more of the '70s-influenced jazz the former &quot;young lion&quot; experimented with on 2002's Elastic. Bringing to mind works by such iconic artists as Miles Davis, Herbie Hancock, and especially Eddie Harris, Redman digs into sundry groove-oriented tracks such as the driving and punchy &quot;Sweet Nasty,&quot; which finds Yahel and Redman soloing hard over drummer Jeff Ballard's James Brown-ready dance beat. Interestingly, Redman conscribes some heavy sidemen to help stir the funk this time around with bassists Flea of the Red Hot Chili Peppers and jazz-pop iconoclast Me'Shell NdegÃƒÂ©Ocello adding their signature styles to their respective tracks. Similarly, Roots drummer ?uestlove, drummer Brian Blade, vibraphonist Stefon Harris, and guitarist Kurt Rosenwinkle contribute much with appearances here. However, it is organist Yahel who sets the musical tone for the whole album, adding in bubbly ambient synth sounds, clavinet, and Rhodes piano throughout. With all these talents at Redman's disposal it is disappointing that Momentum isn't more adventurous. When set next to such classics of '70s funk as Davis' On the Corner or Hancock's Head Hunters, Redman's album is just too polite and controlled to really live up to such comparisons. Also, the album relies a bit too heavily on in-studio gimmickry such as when trumpeter Nicholas Payton -- who also released his own paean to '70s fusion with Sonic Trance -- solos with himself overdubbed like a trumpet section on &quot;Put It in Your Pocket.&quot; The result ultimately comes off as cheesy and gives the impression of a premeditated improvisation rather than a free flow of ideas. It is also unfortunate that some of the best cuts on the disc like the frenetic and angular &quot;Showtime&quot; are merely short interludes that are never fully developed. Momentum may loose some steam as it goes along, but with such talents on board it is still a fun and funky ride.\n~ Matt Collar","torrent":{"xt":"urn:btih:4ca29d8248daf6e7ff0c32f58c4ee5e980af94e3","amp;dn":"Joshua+Redman+Elastic+Band+-+Momentum+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ca29d8248daf6e7ff0c32f58c4ee5e980af94e3","infoHashBuffer":{"type":"Buffer","data":[76,162,157,130,72,218,246,231,255,12,50,245,140,78,229,233,128,175,148,227]},"announce":[],"urlList":[]}}