{"title":"Fractal Geometry: Mathematical Foundations and Applications","uid":4714221,"size":3386894,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cd6471d449212b2f51d24254a092dba9154824c&amp;dn=Fractal+Geometry%3A+Mathematical+Foundations+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234201114,"description":"Since its original publication in 1990, Kenneth Falconer's Fractal Geometry: Mathematical Foundations and Applications has become a seminal text on the mathematics of fractals. It introduces the general mathematical theory and applications of fractals in a way that is accessible to students from a wide range of disciplines. This new edition has been extensively revised and updated. It features much new material, many additional exercises, notes and references, and an extended bibliography that reflects the development of the subject since the first edition.\n* Provides a comprehensive and accessible introduction to the mathematical theory and applications of fractals.\n* Each topic is carefully explained and illustrated by examples and figures.\n* Includes all necessary mathematical background material.\n* Includes notes and references to enable the reader to pursue individual topics.\n* Features a wide selection of exercises, enabling the reader to develop their understanding of the theory.\n* Supported by a Web site featuring solutions to exercises, and additional material for students and lecturers.\nFractal Geometry: Mathematical Foundations and Applications is aimed at undergraduate and graduate students studying courses in fractal geometry. The book also provides an excellent source of reference for researchers who encounter fractals in mathematics, physics, engineering, and the applied sciences.","torrent":{"xt":"urn:btih:4cd6471d449212b2f51d24254a092dba9154824c","amp;dn":"Fractal+Geometry%3A+Mathematical+Foundations+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cd6471d449212b2f51d24254a092dba9154824c","infoHashBuffer":{"type":"Buffer","data":[76,214,71,29,68,146,18,178,245,29,36,37,74,9,45,186,145,84,130,76]},"announce":[],"urlList":[]}}