{"title":"Breakthrough (An Inspiring Raw Food Documentary)","uid":3635972,"size":681041920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4d3ee9abf6750f7ef5de58ff614645ed7396b0b7&amp;dn=Breakthrough+%28An+Inspiring+Raw+Food+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ReVIsed","files":1,"time":1173518927,"description":"Storm has been eating a raw vegan diet of fruits, nuts, seeds, and vegetables in their unheated state for over 30 years, and has become known among raw vegans for his body builder&amp;#039;s physique. At 57 he is still youthful. Jinjee first started eating a raw vegan diet when she met Storm 12 years ago. Her before and after pictures show her transformation. The whole family is 100% raw vegan with no supplements or dehydrated foods.\n\nThis documentary was assembled from footage that Storm and Jinjee collected over the years. They have four raw vegan children. In the film they share the challenges that they&amp;#039;ve faced, both personally and with friends and families, and the differences that cooked vegan and raw vegan have made in their lives. They share nutrition information and information about the growth and development of their children, with taped visits to the doctor, and comparisons to CDC height and weight charts. There is a good section on raw vegans and exercise requirements.\n\nThere is impressive footage of Jinjee during a raw vegan pregnancy, exercising, and walking 5 miles a day, even as she came to term. There is footage of her taken ten days after her child was born, with Jinjee healthy, radiant, active and thin. There is an interview with Jinjee discussing her four pregnancies, both cooked vegan and raw vegan, and how the raw vegan deliveries went much smoother and faster.\n\nFor anybody raising raw vegan children, or considering doing so, I heartily recommend this film. There are enough beautiful women and hunky men in the movie to keep even the most non-raw spouse interested in the film. (Yep, weightlifters and Swedish blondes.)\n &lt;a href=&quot;\nhttp://www.breakthroughthedocumentary.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.breakthroughthedocumentary.com/&lt;/a&gt;\n\nNumber of files: 1\nSize: 649 MB\nRun time: 1 hour, 51 minutes\nVideo codec: xvid, 746 kbps, 352x256, 30 fps\nAudio codec: mp3, 64 kbps, 48 kHz, mono, cbr\nSource: DVD (4:3, NTSC)\n\nOr you can watch it on Google video here: http://video.google.com/videoplay?docid=8183852041721248182","torrent":{"xt":"urn:btih:4d3ee9abf6750f7ef5de58ff614645ed7396b0b7","amp;dn":"Breakthrough+%28An+Inspiring+Raw+Food+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d3ee9abf6750f7ef5de58ff614645ed7396b0b7","infoHashBuffer":{"type":"Buffer","data":[77,62,233,171,246,117,15,126,245,222,88,255,97,70,69,237,115,150,176,183]},"announce":[],"urlList":[]}}