{"title":"La Elegancia del Erizo - Muriel Barbery [Epub][Spanish]","uid":6933528,"size":343014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4dd6e7fd3a4e0dbdd886a89340e0695450c67a85&amp;dn=La+Elegancia+del+Erizo+-+Muriel+Barbery+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"virana","files":-1,"time":1325748043,"description":"La Elegancia del Erizo - Muriel Barbey [Epub]\n\nMuriel Barbey con &quot;La elegancia del erizo&quot; ... nos han regalado alguna de las novelas mÃƒÂ¡s frescas, optimistas y positivas de los ÃƒÂºltimos aÃƒÂ±os.\n\nMerece la pena acercarse a estas novelas que tratan sobre la amistad, sobre personajes que se salvan unos a otros, que les une el amor a la literatura desde un oscuro cuartucho de portera y de los que reconstruyen su propia vida creando un mundo de fantasÃƒÂ­a e ilusiÃƒÂ³n para poder huir de su propia realidad.\n\nEs ÃƒÂ©ste un libro interesante y atractivo en el que varias vidas, a cual mÃƒÂ¡s dispar y distantes en edad, posiciÃƒÂ³n social, necesidades e intereses, se entrecruzan por azar en un elegante edificio del ParÃƒÂ­s mÃƒÂ¡s burguÃƒÂ©s.\n\n    El tema, en principio, nada presenta de motivador o particular. Su trama no radica en la historia en sÃƒÂ­ sino en las caracterÃƒÂ­sticas personales de los protagonistas, que el lector descubre poco a poco, y en las relaciones que casualmente  surgen entre ellos: una niÃƒÂ±a superdotada y maniÃƒÂ¡tica, una portera de apariencia vulgar pero refinada inteligencia,  y un rico y misterioso empresario japonÃƒÂ©s, cuyas existencias se limitan a sus propias vidas permaneciendo ajenos al mundo que les rodea, encerrados en sÃƒÂ­ mismos y escondidos tras la espinosa piel de un erizo.\n\nTodos pasan desapercibidos para el resto, personajes secundarios, reaccionando ÃƒÂºnicamente al sentirse amenazados.\n\nSon individuos que no necesitan de los demÃƒÂ¡s. Se encuentran aislados y disfrutan de esa situaciÃƒÂ³n sin permitir, en ningÃƒÂºn caso, que se vulnere su soledad; no buscan la comprensiÃƒÂ³n ni el afecto pues cada uno a su manera ha aprendido a protegerse del mundo y no desean ser acariciados salvo por seres de su misma especie. El punzante caparazÃƒÂ³n que todos ellos poseen los protege y defiende de aquellos que los rodean, e incluso en ocasiones de sÃƒÂ­ mismos.\n\nLa especie a la que estos seres pertenecen no estÃƒÂ¡ relacionada en modo alguno con el gÃƒÂ©nero biolÃƒÂ³gico sino mÃƒÂ¡s bien con valores espirituales, adquiridos tal vez. En ella se integra un reducido grupo de criaturas sensibles, de individuos capaces de apreciar lo que hay detrÃƒÂ¡s de un repugnante caparazÃƒÂ³n de afiladas espinas, detrÃƒÂ¡s de una vulgar portera de edificio, de una excÃƒÂ©ntrica niÃƒÂ±a rica o de un imponente y sibarita empresario oriental. Todos ellos tienen en comÃƒÂºn y comparten la delicada virtud de poder ver a los demÃƒÂ¡s mÃƒÂ¡s allÃƒÂ¡ de las barreras que impone la relaciÃƒÂ³n social, o mejor dicho, la convenciÃƒÂ³n social.","torrent":{"xt":"urn:btih:4dd6e7fd3a4e0dbdd886a89340e0695450c67a85","amp;dn":"La+Elegancia+del+Erizo+-+Muriel+Barbery+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd6e7fd3a4e0dbdd886a89340e0695450c67a85","infoHashBuffer":{"type":"Buffer","data":[77,214,231,253,58,78,13,189,216,134,168,147,64,224,105,84,80,198,122,133]},"announce":[],"urlList":[]}}