{"title":"Jaron Lanier - You Are Not a Gadget. A Manifesto (EPUB, MOBI)","uid":6442473,"size":2318574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e10e17c659c4c5ccd8e3ad3ac2ae01f8695918a&amp;dn=Jaron+Lanier+-+You+Are+Not+a+Gadget.+A+Manifesto+%28EPUB%2C+MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"acosmic","files":2,"time":1307015254,"description":"For the most part, Web 2.0--Internet technologies that encourage interactivity, customization, and participation--is hailed as an emerging Golden Age of information sharing and collaborative achievement, the strength of democratized wisdom. Jaron Lanier isn't buying it. In You Are Not a Gadget, the longtime tech guru/visionary/dreadlocked genius (and progenitor of virtual reality) argues the opposite: that unfettered--and anonymous--ability to comment results in cynical mob behavior, the shouting-down of reasoned argument, and the devaluation of individual accomplishment. Lanier traces the roots of today's Web 2.0 philosophies and architectures (e.g. he posits that Web anonymity is the result of '60s paranoia), persuasively documents their shortcomings, and provides alternate paths to &quot;locked-in&quot; paradigms. Though its strongly-stated opinions run against the bias of popular assumptions, You Are Not a Gadget is a manifesto, not a screed; Lanier seeks a useful, respectful dialogue about how we can shape technology to fit culture's needs, rather than the way technology currently shapes us.","torrent":{"xt":"urn:btih:4e10e17c659c4c5ccd8e3ad3ac2ae01f8695918a","amp;dn":"Jaron+Lanier+-+You+Are+Not+a+Gadget.+A+Manifesto+%28EPUB%2C+MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e10e17c659c4c5ccd8e3ad3ac2ae01f8695918a","infoHashBuffer":{"type":"Buffer","data":[78,16,225,124,101,156,76,92,205,142,58,211,172,42,224,31,134,149,145,138]},"announce":[],"urlList":[]}}