{"title":"Phantogram - Voices (2014) [FLAC]","uid":9618940,"size":310373646,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e4d89202cb17c1ec67649bc3aeec88930757e49&amp;dn=Phantogram+-+Voices+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"politux","files":-1,"time":1392471350,"description":"\n  Phantogram - Voices (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Indie Electronic\n  Source: CD \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44.1 KHz\n\n  01 Nothing But Trouble \n  02 Black Out Days\n  03 Fall In Love \n  04 Never Going Home \n  05 The Day You Died \n  06 Howling At The Moon \n  07 Bad Dreams \n  08 Bill Murray \n  09 I Don't Blame You \n  10 Celebrating Nothing \n  11 My Only Friend \n\n  Phantogram are an electronic rock duo from upstate New York whose music incorporates psychedelic pop vocals, J Dilla-style hip-hop beats, and shoegazing sensibility. Founded in 2007 and based in Saratoga Springs, New York, the duo is comprised of longtime friends Josh Carter (guitar, vocals) and Sarah Barthel (keyboards, vocals), who originally hail from the nearby small town of Greenwich, New York. Originally known as Charlie Everywhere and associated with the local independent label Sub-Bombin Records, the duo released the eponymous Phantogram EP in March 2009 and sparked widespread interest with two songs in particular, &quot;Mouthful of Diamonds&quot; and &quot;When I'm Small.&quot;\n\n  Phantogram subsequently released the Running from the Cops EP in May 2009 on the international label BBE Records. The duo finally made its full-length album debut with Eyelid Movies (2010), an 11-track album featuring the four previously released EP songs &quot;Mouthful of Diamonds,&quot; &quot;When I'm Small,&quot; &quot;Running from the Cops,&quot; and &quot;Bloody Palms.&quot; The album was released internationally by BBE Records, domestically by Barsuk Records, and on vinyl by Ghostly International. The duo returned in late 2011 with the Nightlife EP, which sold enough to hit the lower reaches of the U.S. charts.\n\n  They continued to tour heavily but found the time to collaborate with OutKast's Big Boi on his second album Vicious Lies and Dangerous Rumours (2012) and also featured on the Flaming Lips track &quot;Young Lust&quot; in 2013. Their success continued in 2013 when fan favorite &quot;When I'm Small&quot; appeared on the MTV adaptation of the hit U.K. show Skins and they released a four-song, self-titled EP. Toward the end of the year they returned to Upstate New York and began to write and record their second full-length album, which was due in early 2014. The pair traveled to L.A. to put the finishing touches on the record, titled Voices, with producer John Hill (Santigold, M.I.A.).","torrent":{"xt":"urn:btih:4e4d89202cb17c1ec67649bc3aeec88930757e49","amp;dn":"Phantogram+-+Voices+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e4d89202cb17c1ec67649bc3aeec88930757e49","infoHashBuffer":{"type":"Buffer","data":[78,77,137,32,44,177,124,30,198,118,73,188,58,238,200,137,48,117,126,73]},"announce":[],"urlList":[]}}