{"title":"James Patterson - The Jester (Retail)","uid":10314507,"size":439760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e6207766dadd6a7d94236760c5c3d6c26496cb9&amp;dn=James+Patterson+-+The+Jester+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheRose88","files":1,"time":1402188183,"description":"James Patterson - The Jester - Retail (epub)\n\n\nHugh De Luc returns from the Crusades to discover that his terrifying nightmare has just begun. Merciless killers have slain his young son, kidnapped his wife, Sophie, and destroyed his town in their search for a priceless relic from the Crucifixion. Hugh's quest to find Sophie is one of the most pulse-pounding adventures, mysteries, and unforgettable love stories in all of fiction.\n\nThe title character is, when introduced in 1096, an unassuming innkeeper in a French village oppressed by the local nobleman. To earn his freedom, Hugh de Luc joins the Crusades for a torturous, bloody march toward Jerusalem that occupies the book's first third and ends with him escaping the madness around him by deserting back to France, in possession of some minor treasures-or so he thinks. Back home, he finds that his beloved wife has been taken captive by the odious nobleman, and his infant son slain. Seeking his wife and revenge, Hugh adopts the guise of a jester in order to enter to the nobleman's castle, where he begins to fall in love with a young noblewoman, and she with him. In time, Hugh finds his wife, only to experience tragedy, and learns that the nobleman is searching for him, as he is believed to have carried back from the Crusades the greatest holy relic of all. Returning to his village, which has been destroyed during the nobleman's hunt for him, Hugh persuades his townspeople, then surrounding towns, to rise up in revolt against the corrupt nobleman and his henchmen. ","torrent":{"xt":"urn:btih:4e6207766dadd6a7d94236760c5c3d6c26496cb9","amp;dn":"James+Patterson+-+The+Jester+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e6207766dadd6a7d94236760c5c3d6c26496cb9","infoHashBuffer":{"type":"Buffer","data":[78,98,7,118,109,173,214,167,217,66,54,118,12,92,61,108,38,73,108,185]},"announce":[],"urlList":[]}}