{"title":"Karin Slaughter-Criminal","uid":14157822,"size":417436984,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4e6d3a4499f2d2083a96303386e323f061993f81&amp;dn=Karin+Slaughter-Criminal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"twocows","files":15,"time":1459683175,"description":"\nCriminal\r\n\r\nby Karin Slaughter\r\n\r\n\r\nKarin Slaughter's new thriller is an epic tale of love, loyalty, and murder that encompasses forty years, two chillingly similar murder cases, and a good man's deepest secrets.\r\n\r\nWill Trent is a brilliant agent with the Georgia Bureau of Investigation. Newly in love, he is beginning to put a difficult past behind him. Then a local college student goes missing, and Will is inexplicably kept off the case by his supervisor and mentor, deputy director Amanda Wagner. Will cannot fathom Amanda's motivation, until the two of them literally collide in an abandoned orphanage they have both been drawn to for different reasons. Decades before­when Will's father was imprisoned for murderthis was his home...\r\n\r\nFlash back nearly forty years: In the summer Will Trent was born, Amanda Wagner is taking her first steps in the boy's club that is the Atlanta police department. One of her first cases is to investigate a brutal crime in one of the city's worst neighborhoods. Amanda and her partner Evelyn are the only ones who seem to care if an arrest is ever made. Now the case that launched Amanda's career has suddenly come back to life, and it is intertwined with the long-held mystery of Will's birth and parentage.\r\n\r\nEach will need to face down demons from the past if they are to prevent an even greater terror from being unleashed on Atlanta today","torrent":{"xt":"urn:btih:4e6d3a4499f2d2083a96303386e323f061993f81","amp;dn":"Karin+Slaughter-Criminal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e6d3a4499f2d2083a96303386e323f061993f81","infoHashBuffer":{"type":"Buffer","data":[78,109,58,68,153,242,210,8,58,150,48,51,134,227,35,240,97,153,63,129]},"announce":[],"urlList":[]}}