{"title":"The Post-Impressionists by Richard Shone (Art Ebook) .pdf","uid":11462641,"size":33938204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e73b9dd3ab2fbd854be6319f4e8ae22cc1c1029&amp;dn=The+Post-Impressionists+by+Richard+Shone+%28Art+Ebook%29+.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1416007050,"description":"Pdf / English / 1984 / 176 pages / 32.3 MB\n\nThe term Post-Impressionist was first used by the English writer Roger Fry in 1910 when he organized an exhibition in London called 'Manet and the Post-Impressionists'. For the first time, it introduced a wide range of modern French painting to a bewildered British public. The painters most fully represented were Cezanne, Gauguin and van Gogh, all of whom were dead but still comparatively unknown. Among younger painters shown were Matisse, Rouault, Picasso, Derain and Vlaminck. The exhibition shook the quiet English art world. Roger Fry, a respected connoisseur and writer on Italian painting, found himself at the centre of an unprecedented row. The public came to laugh, the newspapers published caricatures and lampoons and the battle over Post-Impressionism began. The work of Cezanne and van Gogh outraged all notions of what good painting should be; it attacked vested interests, trampled on conventional ideas of beauty and upset accepted methods of representation. The words 'anarchist', 'degenerate' and 'madmen' peppered the columns of serious newspapers. 'Nothing I  could say.&quot; Fry later wrote, 'would induce people to look carefully enough at these pictures to see how closely they followed tradition....'\n(R. Fry, Vision and Design, 1920)","torrent":{"xt":"urn:btih:4e73b9dd3ab2fbd854be6319f4e8ae22cc1c1029","amp;dn":"The+Post-Impressionists+by+Richard+Shone+%28Art+Ebook%29+.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e73b9dd3ab2fbd854be6319f4e8ae22cc1c1029","infoHashBuffer":{"type":"Buffer","data":[78,115,185,221,58,178,251,216,84,190,99,25,244,232,174,34,204,28,16,41]},"announce":[],"urlList":[]}}