{"title":"Greg the Bunny - 2005 IFC Episodes","uid":3512081,"size":4613133924,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4e9344fdb41984639fce4de51f2ed7b06e26cb9d&amp;dn=Greg+the+Bunny+-+2005+IFC+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"donnieo","files":50,"time":1155477463,"description":"All Greg the bunny episodes which aired on IFC in 2005. These were shrunk to fit on one disc for you, but the larger originals from the state-of-the-art digital cable system were full or artifacts anyway. Burn with Nero or similar. Note that this is not the DVD that is due out in the fall.\n\nPlease help seed.\n\n***************************************************************\n\nFUR ON THE ASPHALT: The Greg the Bunny Reunion Special\nWe are proud to announce that we have just completed shooting on a new, half-hour special for the Independent Film Channel, the same channel where Greg first got his start (before selling out to be a sitcom star). Written, Directed and Produced by the original creators (Sean Baker, Spencer Chinoy and Dan Milano) this new special finds Greg and Warren both desperate for work after having lost the Fox show to poor ratings.\n\nEncouraged by puppet agent Pal Friendlies to star in a new IFC special, Greg and Warren must unite and go to Vegas in order to recruit fellow fallen star, Count Blah. What ensues is thirty minutes of debauchery and irreverence, completely unsuitable for family viewing. Human guest stars include Fox alum Seth Green, Sarah Silverman and Bob Gunton, as well as cameos from Jon Favreau, Adam Goldberg, Clint Howard, Martha Plimpton and Lou Ferigno. \n\nFriday, August 19: Bunnie Hall\nA soul-searching response to Woody Allen\\&amp;#039;s Annie Hall. Greg falls for a beautiful (live) lobster, will he be able to find love amid neurosis? Also featuring Warren the Ape in the obligatory Tony Roberts role.\n\nFriday, August 26: The 13th Step\nIn this ode to Barton Fink, Warren tells the show\\&amp;#039;s creators that he is going to Martha\\&amp;#039;s Vineyard with his wife Maggie. But he actually goesto a lonely room at the sleazy Carter Hotel. There, Warren obsesses over calling his wife, with whom he is in a trial separation. After a good dose of booze, the Ape comes face to face with his inner demons and attempts suicide.\n\nFriday, September 2: Sleazy Rider (Brand New! Never-Before-Seen!)\nWarren and Greg quit the IFC show and hit the road in an attempt to \\&quot;discover America.\\&quot; It\\&amp;#039;s a full-on parody of \\&quot;Easy Rider,\\&quot; with newcomer \\&quot;The Wumpus\\&quot; co-starring in the Jack Nicholson role. Get some gas, grass and ass by checking this one out!\n\nFriday, September 9: Dead Puppet Storage (Brand New! Never-Before-Seen!)\nA behind-the-scenes look as crew struggle to shoot Warren and Greg in a parody of Pulp Fiction.\n\nFriday, September 16: Blah!\nGreg meets his idol Frederick \\&quot;Count\\&quot; Blah for the first time.\n\nFriday, September 23: You Know, For Kids (Brand New! Never-Before-Seen!)\nHomage to all Coen Brothers films as Greg and Warrenattempt to defraud IFC by staging an inept kidnapping plot. Pursued by a nimble sheriff (The Wumpus) their adventure takes them through several parodies of the Cohen brothers\\&amp;#039; best known films.\n\nFriday, September 30: The Addiction\nAfter watching the vampire movie, The Addiction, Greg becomes convinced he\\&amp;#039;s been bitten by a vampire. He fears sunlight, drinks the blood of a live cat and tries to force Spencer (his roommate and the show\\&amp;#039;s director) to eat bugs. Eventually his fetish is demystified when Spence makes him watch the sunset and his fur fails to catch on fire. \n\nFriday, October 7: The Blues She is My Friend\nThis black-and-white prison movie, inspired by the Jim Jarmusch film, Down by Law, features Greg and Warren as prison inmates who learn that show biz is the worst prison of all. Features harmonica riff by Warren the Ape and sodomy humor for the kiddies.\n\nFriday, October 14: 2001-1: Space &amp; Stuff\nThis ambitious homage to Stanley Kubrick features Greg and Warren as astronauts on a mission to Jupiter. When HAL the computer starts getting snitty, Warren convinces Greg the Bunny to shut the psychotic CPU down. But HAL puts that chess-champ brain to good use, and has GTB ejected into deep space. Then, it\\&amp;#039;s up to Warren to enter Hal\\&amp;#039;s brain and pull the plug.\n\nFriday, October 21: Sex, Button Eyes and a Video Ape (Brand New! Never-Before-Seen!)\nA parody of the Bob Crane biopic, \\&quot;Auto Focus.\\&quot; While Greg the Bunny and Seth Green are shooting a public service announcement, a creepy technician (Warren the Ape) tries to get the two actors involved in amateur pornography. Features our first puppet/human nude scene! Also featuring an equally stimulating cameo by Gilbert Gottfried.\n\nFriday, October 28: Martian Serum 7 From Mars (Brand New! Never-Before-Seen!)\nInspired by the Tim Burton film \\&quot;Ed Wood,\\&quot; this episode features a documentary about Count Blah, highlighting his career in the film business. Features a rare look at the lost trailer for Blah\\&amp;#039;s classic film, \\&quot;Martian Serum 7 From Mars!\\&quot;.\n\nFriday, November 4: Naturally Sewn Killers (Brand New! Never-Before-Seen!)\nIn this parody of Oliver Stone\\&amp;#039;s pulp masterpiece, Warren the Ape is overcome by a murderous rage, with Greg the Bunny as his accomplice. After killing the show\\&amp;#039;s creators and the entire IFC staff, they take to the road in a cross-country spree. Features newscasting puppet Wayne Gayle and our own Count Blah as \\&quot;The Indian Chief.\\&quot;\n\nFriday, November 11: Daddyhood\nThis loving tribute to David Lynch\\&amp;#039;s Eraserhead, features Greg the Bunny as a lonely father to a baby potato. Featuring the creepiest mutant baby you ever saw on a puppet show, as well as a fantasy girl trapped inside a vacuum cleaner.\n\nFriday, November 18: The Godpappy\nViolent and gripping, this homage to The Godfather, featuring Count Blah as the Don, Warren the Ape as Tom Hagen, Gary the Bunny as Sonny, Marc Grass as Solazzo and Greg the Bunny as Michael.","torrent":{"xt":"urn:btih:4e9344fdb41984639fce4de51f2ed7b06e26cb9d","amp;dn":"Greg+the+Bunny+-+2005+IFC+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e9344fdb41984639fce4de51f2ed7b06e26cb9d","infoHashBuffer":{"type":"Buffer","data":[78,147,68,253,180,25,132,99,159,206,77,229,31,46,215,176,110,38,203,157]},"announce":[],"urlList":[]}}