{"title":"[ DivX ITA AC3 5.1 HDMI ] LE VITE DEGLI ALTRI","uid":4420872,"size":2033655000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f4ea59e1642326f98e31e33b98e2ff48df3b6d3&amp;dn=%5B+DivX+ITA+AC3+5.1+HDMI+%5D+LE+VITE+DEGLI+ALTRI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Huops","files":1,"time":1222772639,"description":"Un film di Florian Henckel von Donnersmarck. Con Martina Gedeck, Ulrich MÃƒÂ¼he, Sebastian Koch, Ulrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Volkmar Kleinert, Matthias Brenner. Genere Drammatico, colore 137 minuti. - Produzione Germania 2006. - Distribuzione 01 Distribution - [Uscita nelle sale venerdÃƒÂ¬ 6 aprile 2007]\n\n\nTRAMA : Berlino Est, 1984. Il capitano Gerd Wiesler ÃƒÂ¨ un abile e inflessibile agente della Stasi, la polizia di stato che spia e controlla la vita dei cittadini della DDR. Un idealista votato alla causa comunista, servita con diligente scrupolo. Dopo aver assistito alla piÃƒÂ¨ce teatrale di Georg Dreyman, un noto drammaturgo dell&amp;#039;Est che si attiene alle linee del partito, gli viene ordinato di sorvegliarlo. Il ministro della cultura Bruno Hempf si ÃƒÂ¨ invaghito della compagna di Dreyman, l&amp;#039;attrice Christa-Maria Sieland, e vorrebbe trovare prove a carico dell&amp;#039;artista per avere campo libero. Ma l&amp;#039;intercettazione sortirÃƒÂ  l&amp;#039;esito opposto, Wiesler entrerÃƒÂ  nelle loro vite non per denunciarle ma per diventarne complice discreto. La trasformazione e la sensibilitÃƒÂ  dello scrittore lo toccheranno profondamente fino ad abiurare una fede incompatibile con l&amp;#039;amore, l&amp;#039;umanitÃƒÂ  e la compassione. \nAll&amp;#039;epoca dei fatti, quando le Germanie erano due e un muro lungo 46 km attraversava le strade e il cuore dei tedeschi, il regista Florian Henckel von Donnersmarck era poco piÃƒÂ¹ che un bambino. Per questa ragione ha riempito il suo film dei dettagli che colpirono il fanciullo che era allora. L&amp;#039;incoscienza e la paura diffuse nella sua preziosa opera prima sono quelle di un&amp;#039;infanzia dotata di un eccellente spirito di osservazione. La riflessione e l&amp;#039;interesse per il comportamento della popolazione, degli artisti e degli intellettuali nei confronti del regime comunista appartengono invece a uno sguardo adulto e documentato sulla materia. Ricordi personali e documenti raccolti rievocano sullo schermo gli ultimi anni di un sistema che finirÃƒÂ  per implodere e abbattere il Muro. \nLa stretta sorveglianza, le perquisizioni, gli interrogatori, la prigionia, la limitazione di ogni forma di espressione e l&amp;#039;impossibilitÃƒÂ  di essere o pensarsi felici sono problemi troppo grandi per un bambino. Le vite degli altri ha cosÃƒÂ¬ il filo conduttore ideale nel personaggio dell&amp;#039;agente della Stasi, nascosto in uno scantinato a pochi isolati dall&amp;#039;appartamento della coppia protagonista. ÃƒË† lui, la spia, il singolare deus ex machina che non interviene dall&amp;#039;alto, come nella tragedia greca, ma opera dal basso, chiuso tra le pareti dell&amp;#039;ideologia abbattuta dalla bellezza dell&amp;#039;uomo e dalla sua arte. Personaggio dolente e civilissimo, ideologo del regime che in un momento imprecisato del suo incarico si trasforma in oppositore. Il &quot;metodo&quot; della sorveglianza diventa per lui fonte di disinganno e di sofferenza, perchÃƒÂ¨ lo costringe a entrare nella vita degli altri, che si ingegnano per conservarsi vivi o per andare fino in fondo con le loro idee. Gerd Wiesler contribuisce alla riuscita dello &quot;spettacolo&quot; con suggerimenti, correzioni (alle azioni della polizia), aggiustamenti (dei resoconti di polizia) e note di regia che se non avranno il plauso dei superiori avranno quello dei sorvegliati. &quot;Attori&quot; che recitano la vita ai microfoni della Stasi e nella cuffia stereo dei suoi funzionari. La vita quotidiana fatta di paure ed espedienti ÃƒÂ¨ restituita da una fotografia cupa e bruna, tinte monocromatiche che avvolgono i personaggi decisi a sopravvivere, a compromettersi e a resistere. La Stasi aveva un esercito di infiltrati, duecentomila collaboratori, Donnersmarck ne ha scelto uno e lo ha drammatizzato con la prova matura e sorprendente di Ulrich MÃƒÂ¼he. Il drammaturgo &quot;spiato&quot; ÃƒÂ¨ invece Sebastian Koch, l&amp;#039;ufficiale riabilitato di Black Book, intellettuale &quot;resistente&quot; per salvare l&amp;#039;anima del teatro e della Germania.","torrent":{"xt":"urn:btih:4f4ea59e1642326f98e31e33b98e2ff48df3b6d3","amp;dn":"%5B+DivX+ITA+AC3+5.1+HDMI+%5D+LE+VITE+DEGLI+ALTRI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4ea59e1642326f98e31e33b98e2ff48df3b6d3","infoHashBuffer":{"type":"Buffer","data":[79,78,165,158,22,66,50,111,152,227,30,51,185,142,47,244,141,243,182,211]},"announce":[],"urlList":[]}}