{"title":"Growing Up White: A Veteran Teacher Reflects on Racism [blackatk","uid":8788242,"size":804504,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f89d648feac63fde6336223d311e3ce5f311cc2&amp;dn=Growing+Up+White%3A+A+Veteran+Teacher+Reflects+on+Racism+%5Bblackatk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1375835266,"description":"| With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\n\nGrowing Up White is for everyone who wants to know more about our schools, our community, our country, and ourselves. Julie Landsman takes the reader on an inventory of her life, pulling from events and scenes, a set of lessons learned. She discloses honestly and unflinchingly the privileges she has experienced as a white person and connects those to her presence in city classrooms where she taught for over 25 years.\n\nAs a teacher Julie made mistakes, learned from them, made more and concludes that understanding race in America is an ongoing process. Her book is rich with suggestions for working in our schools today, where we find a primarily white teaching force and an expanding population of students of color. She believes that these students make our schools rich and exciting places in which to work. Landsman also believes that white teachers can reach their students in deep and positive ways. Because she invites you to go along with her in revealing the basis of her upbringing and her choices, the story itself is engaging. Readers arrive at the final chapters with an appreciation not only for the complexity of our history as individuals around race, gender and class but with real hope in education as a way to create a place where all children get a fair chance at success.\n\nJulie can be reached at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e9838588878d9a848887a98e86858d8c878e889d8cc7878c9dc7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n\n\n[b] Review [/b]\nI applaud Julie Landsman for her courage and candor in vividly illustrating how she and countless others have benefited from white privilege. The reflective exercises and practical strategies that she recommends can enable educators to deal with their own racial baggage, and increase their efficacy with students of color. Because this rich narrative can empower both educators and students, Landsman has made another excellent contribution to the growing body of literature on white privilege, diversity, and &quot;must have conversations.&quot; (Gail L. Thompson, PhD, Author, Up Where We Belong: Helping African American and Latino Students Rise in School and in Life and What African-American Pa)\n\nRacism, personal and institutional, is one of the most fundamental ills of our society, a fact we blink at our peril. How can we approach this painful truth in a way that opens us to an honest examination of our own shadows while still evoking &quot;the better angels of our nature&quot;? For years, Julie Landsman has done courageous and distinguished work helping educators respond to that question. Her new book, &quot;Growing Up White,&quot; contains the best answers I've seen. Here is a book that helps us understand &quot;the other&quot; by helping us understand ourselves, marking the most reliable path I know toward personal and social healing. (Parker J. Palmer, Author of The Courage to Teach, A Hidden Wholeness, and Let Your Life Speak)\n\nThis book is destined to be a 'classic.' Julie Landsman's sequence of unique insights into what it means to grow up White is a significant contribution to the field of education. The suggestions offered at the end of each short lesson will become nuggets of wisdom for all teachers who seek to make a difference in the lives of students in the 21st century. I highly recommend this book! (Chance W. Lewis, Associate Professor of Urban Education, Texas A&amp;M University, Co-Editor - White Teachers/Diverse Classrooms)\n\nJulie Landsman provides a critical analysis of privilege. This book should be mandatory reading for everyone interested in racial identity development. Landsman is a voice we should listen to as we move forward as a nation. (Robert W. Simmons III, Eastern Michigan University, Teacher Education)\n\nJulie Landsman continues to produce work for change agents. Her research and personal experiences are informative, challenging and practical for all educators. I strongly suggest you pick this up and be prepared to take action! (Eddie Moore, Jr., PhD, America &amp; MOORE, LLC, Founder/Creator, WPC)\n\nLandsman communicates her entire life and everyday experiences as a privileged white teacher for over thirty years with a keen humanity, willing to stay out of her comfort zone on behalf of her students. In writing this book, she seizes the power behind the pain of racism to professional benefit and personal triumph that few dare to live. (Benjamin Mchie, Founder, the African American Registry)\n\nBeginning with infant lullabies and progressing through music, songs, poetry, stories and the spoken word as she moved through childhood and adolescence, Julie Landsman skillfully demonstrates how she and other middle class White children of her generation unconsciously, subconsciously, and consciously were indoctrinated with racism and the advantages of White privilege. She goes on to offer valuable insights for countering racism and White privilege through a series of lessons and reflections which teachers, parents, and mentors can utilize to present a continuum of multicultural sounds, music, voices, and stories that will open the doors of all children to appreciating cultural differences and learning to move toward mutual understanding, mutual enrichment, finding common ground, and reconciliation across ethnic and cultural groups. (Joseph L. White, PhD, Co-author of Black Man Emerging, Professor Emeritus of Psychology and Psychiatry, University of California, Irvine)\n\n[b] About the Author [/b]\nJulie Landsman is a retired public school teacher and current consultant to schools and universities on multicultural education and building inclusive classrooms. \n\n\nHardcover: 200 pages\nPublisher: R&amp;L Education (September 5, 2008)\nLanguage: English\nISBN-10: 1578868378\nISBN-13: 978-1578868377\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Growing-Up-White-Veteran-Reflects/dp/1578868378/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Growing-Up-White-Veteran-Reflects/dp/1578868378/&lt;/a&gt;\n\n\nTags: school, teacher, pedagogy, discrimination, miseducation, inner, city, \nblacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery,education, school, at - risk, inner, city, public, schools, disparity, economy, leader, leadership, pedagogy, educators, NCLB, schooling, kids, primary, second, higher education, college, community, PTA, homeschool, minority, black, african, american, usa, latin, latino, hispanic, asian, native american, teacher, teach, test, standard, standardized testing, ","torrent":{"xt":"urn:btih:4f89d648feac63fde6336223d311e3ce5f311cc2","amp;dn":"Growing+Up+White%3A+A+Veteran+Teacher+Reflects+on+Racism+%5Bblackatk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f89d648feac63fde6336223d311e3ce5f311cc2","infoHashBuffer":{"type":"Buffer","data":[79,137,214,72,254,172,99,253,230,51,98,35,211,17,227,206,95,49,28,194]},"announce":[],"urlList":[]}}