{"title":"Model-Based Software Performance Analysis","uid":6528536,"size":5376194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f9024cc9132ea17f36bf19f1bf64b572bc80c81&amp;dn=Model-Based+Software+Performance+Analysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"theLEAK","files":-1,"time":1310239723,"description":"Poor performance is one of the main quality-related shortcomings that cause software projects to fail. Thus, the need to address performance concerns early during the software development process is fully acknowledged, and there is a growing interest in the research and software industry communities towards techniques, methods and tools that permit to manage system performance concerns as an integral part of software engineering.\n\nModel-based software performance analysis introduces performance concerns in the scope of software modeling, thus allowing the developer to carry on performance analysis throughout the software lifecycle.\nWith this book, Cortellessa, Di Marco and Inverardi provide the cross-knowledge that allows developers to tackle software performance issues from the very early phases of software development.\n\nThey explain the basic concepts of performance analysis and describe the most representative methodologies used to annotate and transform software models into performance models. To this end, they go all the way from performance primers through software and performance modeling notations to the latest transformation-based methodologies.\n\nAs a result, their book is a self-contained reference text on software performance engineering, from which different target groups will benefit: professional software engineers and graduate students in software engineering will learn both basic concepts of performance modeling and new methodologies; while performance specialists will find out how to investigate software performance model building.","torrent":{"xt":"urn:btih:4f9024cc9132ea17f36bf19f1bf64b572bc80c81","amp;dn":"Model-Based+Software+Performance+Analysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f9024cc9132ea17f36bf19f1bf64b572bc80c81","infoHashBuffer":{"type":"Buffer","data":[79,144,36,204,145,50,234,23,243,107,241,159,27,246,75,87,43,200,12,129]},"announce":[],"urlList":[]}}