{"title":"Total War ROME II Caesar in Gaul-RELOADED","uid":9369078,"size":11350092780,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4fe7a23e0865a6201810081631b3abcdfa6f754f&amp;dn=Total+War+ROME+II+Caesar+in+Gaul-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"extremezone","files":-1,"time":1387487634,"description":" &lt;a href=&quot;http://img560.imageshack.us/img560/5311/4wde.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img560.imageshack.us/img560/5311/4wde.jpg&lt;/a&gt;\n\nScreens:\n &lt;a href=&quot;\nhttp://img546.imageshack.us/img546/9229/8wcw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img546.imageshack.us/img546/9229/8wcw.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img855.imageshack.us/img855/898/6o39.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/img855/898/6o39.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img843.imageshack.us/img843/143/3w0a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img843.imageshack.us/img843/143/3w0a.jpg&lt;/a&gt;\n\nTotal War ROME II Caesar in Gaul-RELOADED\nTotal War: Rome II Caesar in Gaul (c) Sega\n\n12/2013 :..... RELEASE.DATE .. PROTECTION .......: SteamCEG\n1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nNOTE\n\nThis release includes full game with update 8 and Caesar in Gaul official\ncampaign addon. We thought it was inapropriate to release a 9 GB dox so we\ndecided to make it standalone\n\nThis release also includes the following DLC\n- Greek States Culture Pack\n- Nomadic Tribes Culture Pack\n- Blood &amp; Gore\n\nChangelist included in the pack as always. Enjoy\n\nDescription\n\nCaesar in Gaul is a standalone campaign pack for Total War: ROME II covering\nJulius Caesar's war of expansion against the Gaulish tribes. Players can\nchoose from four playable factions in this conflict: the Gallic Arverni, the\nGermanic Suebi, the Belgic Nervii and Rome, in a campaign inspired by Caesar's\nCommentarii de bello Gallico (Commentaries on the Gallic war\n\nOffering a tighter scope in terms of time and geography than Rome II (58-51BC),\nthe Caesar in Gaul Campaign Map is an expanded, more detailed vision of Gaul\nand the south coast of Britannia\n\nCompared with ROME II's map of Gaul, Caesar in Gaul contains more regions and\nprovinces, more factions (both playable and non-playable), and a series of\nfamous generals and statesmen from history which the player will employ or\nfight against depending on their chosen faction\n\nA war of great profit and glory for Caesar, this conflict made him extremely\npopular with the people of Rome though less so with the senators, who saw him\ngathering power to himself in a series of events that ultimately lead to his\nascension to Dictator\n\nCaesar in Gaul differs from the core ROME II experience in a number of\nimportant ways\n\nNew Campaign Map\n\nThe Caesar in Gaul campaign map is an enhanced, more detailed representation\nof Gaul, with players able to expand across 18 provinces dotted with resources,\nnew settlements and new provincial capitals\n\nGreater focus on characters\n\nMany factions employ great generals and statesmen from history (for example,\nRome fields Gaius Julius Caesar himself, Mark Anthony and others). Each of the\nfour playable factions also has a faction leader who acts as the player's\navatar during the campaign\n\n24 turns per year\n\nAs Caesar in Gaul deals with a considerably shorter time-span (58-51BC) than\nthe grand sweep of the ROME II campaign, each turn represents two weeks rather\nthan a year. This means seasons make a return. The gameplay effects of these\naren't always predictable however, and may vary from province to province. A\nlate autumn may bring a good harvest for example, but a long, dry summer may\ndamage your food production\n\nCompact, focussed multiplayer campaign\n\nFor those generals looking for a more rapid MP campaign game, Caesar in Gaul\npresents a series of interesting options. Due to the geographic scope and the\nopposing 48 factions, co-op or competitive 2-player campaigns are tighter,\nmore focussed, and less time-consuming than a full Campaign\n\nNew mid-game challenge mechanics\n\nFor those players making it through to the mid-game, there will be new\nchallenges to face as a more suitable replacement for the Civil Wars of ROME\nII. As a Gallic tribe, youll feel the mailed fist of Rome respond with heavy\nintervention forces, and as Rome, youll see the Gallic tribes rebelling and\nforming alliances against you\n\nNew historical battle\n\nCaesar in Gaul adds the Battle of Alesia as a playable historical battle\nAlesia marked the turning point of Caesars Gallic War, and resulted in the\ncapture of Vercingetorix, who was later taken to Rome and executed at Caesar's\nTriumph\n\nSet from Caesar's perspective, Alesia tasks the player with maintaining the\nsiege of Vercingetorix's Gallic stronghold. The battle begins with the Roman\nforces deployed within their own investment fortifications outside the hill-fort\nThe player must guide the Romans as they weather attacks from both a huge\nrelief army and within the fort itself\n\nNew Total War: ROME II full campaign playable factions\n\nAlongside the factions playable within the new Campaign, Caesar in Gaul also\nadds three new playable factions to the main game they are\n\n- Nervii (barbarian, Belgic\nThe most fierce and powerful of the Belgic tribes, the Nervii are a melting\npot of Celtic and Germanic heritage. Their unit roster reflects this mix of\ncultures, opening up the possibility of creating new, unique army compositions\n\n- Boii (barbarian, Gallic\nOne of the largest of the Gallic tribes, the Boii occupied Cisalpine-Gaul,\nPannonia, Bohemia and Transalpine Gaul. Their numbers make them a force to be\nreckoned with but they are somewhat disconnected from other the Gallic tribes\ngeographically and are directly exposed to the ferocious Germanic clans and\nthe Dacians\n\n- Galatians (barbarian, Anatolia\nThe Gauls of the East, the Galatians migrated to Asia Minor following the\nCeltic invasion of the Balkans. They arrived through Thracia at around 270 BC,\nled by generals Lotarios &amp; Leonnorios. As Celts deep within Hellenic territory\nand factions hostile towards them, the Galatians offer interesting and\nchallenging new gameplay\n\nNew units\n\nAlongside their usual unit rosters, the playable factions of Caesar in Gaul\n(and playable factions in the main ROME II campaign provided by Caesar in Gaul\nownership) also gain the following new units\n\nBoii (ROME II\n\n- Sword Followers (sword infantry\nWhere a lord commands, the sword is thrust\n\n- Veteran Spears (spear infantry\nBattle hardens the sinews and the heart, and deafens the ear to the cries of\ncowards\n\nGalatians (ROME II\n\n- Galatian Legionaries (sword infantry\nThe Celts have taught the Romans more than they're prepared to admit, but this\nis a two-way street\n- Galatian Raiders (javelin and sword cavalry\nBroken enemies know it is better to flee than face riders who will not spare\ntheir lives\n\nGallic tribes (ROME II and Caesar in Gaul\n\n- Chosen Swordsmen (sword infantry\nThese men fight with proven bravery and well-honed skill-at-arms\n- Chosen Spearmen (spear infantry\nChainmail does not chill a warrior's heart, or still his lust for battle\n- Gallic Hunters (stealth bow infantry\nThe skills of the hunt, hiding and a sudden strike, are the skills of a\nwarrior\n\nNervii (ROME II and Caesar in Gaul\n\n- Fierce Swords (sword infantry\nOnce he has earned it, a Celt will only be parted from his longsword by death\nitself\n- Guerilla Swordsmen (stealth sword infantry\n- These swordsmen strike wherever and whenever their enemies least expect\n- Mighty Horse (spear cavalry\n- strong mount and a savage swing make these warriors a fearsome prospect\n- Naked Spears (spear infantry\nWho needs clothes when you have more than your share of courage\n- Gallic Hunters (stealth bow infantry\nThe skills of the hunt, hiding and a sudden strike, are the skills of a\nwarrior\n\nAuxiliaries\n\n- Auxiliary Gallic Hunters (stealth bow infantry\nThe skills of a hunter should be used in the service of Rome\n- Auxiliary Noble Horse(spear cavalry\nA mounted, armoured fist is always useful in a Roman army\n- Auxiliary Naked Swords (sword infantry\nThe savage gods of war should be used to Rome's advantage\n- Auxiliary Short Swords (sword infantry\nBravery in battle, rather than skill, sometimes gives worth to a man\n\nMercenaries\n\n- Mercenary Gallic Hunters (stealth bow infantry\nThe hunting of other men often has the greatest of rewards\n- Mercenary Noble Horse (spear cavalry\nEven a nobleman has his price, and will fight for gold\n- Mercenary Naked Swords (sword infantry\nThe gods of war will bless mercenaries as long as they fight bravely\n- Mercenary Short Swords (sword infantry\nIt is often enough to sell bravery and a taste for glory\n\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. If you like this game, BUY IT\n\nNote: We need anything you can offer as early releases,seedboxes,links,accounts,\ncontact us ontorentz 3xforum ro or &lt;a href=&quot; http://torentz.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torentz.tk&lt;/a&gt;\nSeed Stats: 20-400 GiB at aprox 10 MiB/sec/20 slots per torrent\n\nTotal War ROME II Caesar in Gaul-RELOADED Torrent Free Download\n\nHow To Get Your MAXSPEED (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nIF the game does not work for you then update drivers, directX, components\nas netframework/redist files/etc, run as administrator, change compatibility\nmode, block/disable access to internet, copy crack/overwrite, other tweaks,upgrade pc,etc\nSearch on scene release websites for any future updates/working status/etc and \nother quality filesharing sites or just use this - other torrent search functions\nStop using stupid av's as AVG reporting false positive viruses-disable or use ESET","torrent":{"xt":"urn:btih:4fe7a23e0865a6201810081631b3abcdfa6f754f","amp;dn":"Total+War+ROME+II+Caesar+in+Gaul-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe7a23e0865a6201810081631b3abcdfa6f754f","infoHashBuffer":{"type":"Buffer","data":[79,231,162,62,8,101,166,32,24,16,8,22,49,179,171,205,250,111,117,79]},"announce":[],"urlList":[]}}