{"title":"DAMAGE CONTROL (Marvel) volume 1 to 4 (1989-2008) COMPLETE Req.","uid":8944362,"size":255964293,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:50c2af16dc48280fd0ca717278732191b9471be5&amp;dn=DAMAGE+CONTROL+%28Marvel%29+volume+1+to+4+%281989-2008%29+COMPLETE+Req.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1379737047,"description":"From the character wiki on Marvel's official site:\n\n&quot;A Sitcom Within the Marvel Universe&quot;  --Dwayne McDuffie\n\nWhen the superhuman community throws down in a neighborhood, the damages can be astronomical. However, the Manhattan based engineering and construction company, Damage Control, are here to clean up the mess and rebuild the property to the way it was. Considering the amount of superhuman battles there are, and with virtually no competition, Damage Control is a definite money maker.\n\n------\n\nDamage Control was an early concept of writer Dwayne McDuffie, then in his 20s and a new freelancer at Marvel.\n\nIt was drawn by veteran artist Ernie Colon, whose quirky style was perfect for this (and many other titles published across 6 different decades).\n\nIt was after editor Bobbie Chase refused to change a scene in McDuffie's prestige format miniseries &quot;She-Hulk: Ceremony&quot; that John Byrne quit as the writer-artist of &quot;Sensational She-Hulk&quot;. It's probably not a coincidence that She-Hulk's guest appearance in the 2nd Damage Control miniseries came just a couple of months after Byrne quit the character!\n\nMcDuffie went on to some success as one of the writers and Editor-in-Chief of Milestone Media (a line of superhero comics focused on diverse characters) and then to GREAT SUCCESS in animation, writing for Static Shock, Justice League, and Ben 10.\n\nWhen McDuffie returned to comics several years ago, Colon was replaced by Salva Espin for the 2008 Damage Control miniseries, which was set in the weeks after the events of World War Hulk.\n\nMcDuffie also had a year-long run on Fantastic Four and a 21-issue run on Justice League of America. McDuffie died suddenly on the day after his 49th birthday in 2011.\n\nPlease seed and share.  --STF","torrent":{"xt":"urn:btih:50c2af16dc48280fd0ca717278732191b9471be5","amp;dn":"DAMAGE+CONTROL+%28Marvel%29+volume+1+to+4+%281989-2008%29+COMPLETE+Req.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50c2af16dc48280fd0ca717278732191b9471be5","infoHashBuffer":{"type":"Buffer","data":[80,194,175,22,220,72,40,15,208,202,113,114,120,115,33,145,185,71,27,229]},"announce":[],"urlList":[]}}