{"title":"Fallout 3 (Complete Edition) -illiria","uid":6722035,"size":7747993600,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5118614c264319396e06ff54303981b213600579&amp;dn=Fallout+3+%28Complete+Edition%29+-illiria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"illiria","files":-1,"time":1317820676,"description":"Okay, this is a complete edition of Fallout 3. It is much like my repack of &quot;Fallout: New Vegas&quot;, except I did not repack the game itself here, only the DLCs. I prefer to keep the content original where possible - unless it is buggy and *requires* a proper repack.\n\nWhat you are getting here:\n\n1) All the Downloadable Content (DLCs) ever released, packed into one installer. Game directory will be automatically located by the installer.\n2) Latest official patch (1.7)\n3) Latest *un*official patch - I have edited its installer to make it fully automatic and reduce the number of plugins it installs, to avoid garbaging game data.\n4) Proper installer of Games for Windows - LIVE. Game requires it, BUT the one that was shipped along with the game DOES NOT work well. In some cases game may STILL keep asking for G4WL even if you have the original installed. That is why I have included a newer, proper version. You will find it in a disc root directory. Folder named &quot;Games for Windows - LIVE&quot;. I did not delete the original, because for all I know, game installation may require it.\n5) Latest version of Garden of Eden Creation Kit (G.E.C.K.), and latest update for it.\n\n- This edition of the game does not require any cracks! Not the original, not the patched version of it.\n\n\nScreenshots:\n------------\n &lt;a href=&quot;\nhttp://bayimg.com/IAkjNAaDf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAkjNAaDf&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/iAKjoAADf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iAKjoAADf&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/iAKjPaaDf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iAKjPaaDf&lt;/a&gt;\n\n\n\n***\nUnofficial patch will install two plugins: one containing fixes for original game, and one containing fixes for DLCs. Of course you need to have DLCs (Game Add-On Pack) installed if you enable DLC patch plugin. If you enable DLC plugin without having DLCs installed, game will crash on start, failing to locate the DLC content.\nIt should be obvious, but I'm mentioning just in case.\n\n\nSmall note: In my New Vegas repack, game plugins self-register in &quot;Data Files&quot;, but here you will still need to check the checkboxes. Standard procedure, just informing you in case some of you don't know it.\n\n\nIn other words, yes, this is the complete edition that includes all the officvial content ever released for this game. And unofficial patch, of course.\n\n\n--------------\nP.S. Yes, this repack is more basic than my repack of New Vegas, and you will have to do more clicking here, I realize that. But bear with me, the concept of this repack (or maybe it's better to call it a compilation instead) has been done years ago. At least you get all in one place. :P\n\nThe point is still the same. Install the game, patch and add-on pack. Unofficial patch and Games for Windows - LIVE are optional (install Games for Windows - LIVE if Fallout gives you XLive.dll error).\n\n\n\n\n-illiria","torrent":{"xt":"urn:btih:5118614c264319396e06ff54303981b213600579","amp;dn":"Fallout+3+%28Complete+Edition%29+-illiria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5118614c264319396e06ff54303981b213600579","infoHashBuffer":{"type":"Buffer","data":[81,24,97,76,38,67,25,57,110,6,255,84,48,57,129,178,19,96,5,121]},"announce":[],"urlList":[]}}