{"title":"Jason Mraz - Discography [FLAC]","uid":12527122,"size":8281210917,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:514359ccc62530428a37fbf0eb4ffb64b4a11d99&amp;dn=Jason+Mraz+-+Discography+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":279,"time":1444148586,"description":"\n  Jason Mraz - Discography [FLAC]\r\n\r\n  Genres: Rock, Pop\r\n  Styles: Alternative, Singer/Songwriter\r\n  Sources: CD, WEB, vinyl\r\n  Codec: FLAC\r\n  Bit rates: ~1,000 - 3,000 kbps\r\n  Bit depth: 16, 24\r\n  Sample rates: 44.1 - 96 kHz\r\n\r\n  Artist Bio by Christina Saraceno\r\n\r\nCalifornia-based singer/songwriter Jason Mraz makes laid-back, melodic pop with stylistic nods toward folk, jam band music, hip-hop, and soft rock. Since coming to the public's attention with his 2002 hit single &quot;The Remedy (Don't Worry)&quot;, Mraz has proven himself to be a reliable pop craftsman whose crowd-pleasing melodies can encompass both cheeky humor and earnest sincerity.\r\n\r\nBorn in Mechanicsville, Virginia, in 1977, Mraz grew up amidst the sounds of the Dave Matthews Band and local roots musicians the Agents of Good Roots. However, it was Mraz's interest and participation in musical theater that served as his first introduction to music. Following high school, he moved to New York to attend the American Musical and Dramatic Academy, but dropped out a year later when he took up the guitar and began to focus on songwriting. Nonetheless, Mraz's training as a vocalist would later show itself on his debut album, which was marked by the pure clarity of his tenor range.\r\n\r\nAfter busking around New York, Mraz eventually returned to Virginia; in 1999, however, he made his way out West and settled in San Diego, California, having been drawn to the city's coffee house scene and its historical support of singer/songwriters, most notably Jewel. Mraz began playing shows and soon landed a weekly residency at the local hot spot Java Joe's, which had previously played host to Jewel during the early stages of her career. He also formed a duo with drummer Noel &quot;Toca&quot; Rivera, who accompanied Mraz's acoustic material by banging the djembe. Together, the musicians honed a live show that featured as much comedic banter as actual music.\r\n\r\nOver the next two years, Mraz's following expanded outside of the San Diego limits and began to encompass Los Angeles, garnering the attention of record labels. Mraz signed to Elektra Records in early 2002 and returned to Virginia to write and record his debut album, a project that saw him working with producer John Alagía (the Dave Matthews Band, John Mayer) and his high school heroes, the Agents of Good Roots, who became his backing band. The resulting effort, Waiting for My Rocket to Come, was released that same November, blending Mraz's early influences with elements of country, roots rock, and coffee house folk. The buoyant first single &quot;Remedy (I Won't Worry),&quot; which Mraz had co-written with pop hitmakers the Matrix, proved to be a big hit, and Mraz headed out on the road to support it. One of those shows, an October 2003 date at the Eagles Ballroom in Milwaukee, was later documented on Mraz's summer 2004 live release Tonight, Not Again.\r\n\r\nThe album tided his fans over until July 2005, when the songwriter returned with the sophomore studio effort Mr. A-Z. Mraz's popularity reached a new high in 2008 with the release of We Sing, We Dance, We Steal Things, which peaked at number three and spawned his first chart-topping single, &quot;I'm Yours.&quot; The concert album, Jason Mraz's Beautiful Mess: Live on Earth, arrived in 2009, followed by his fourth studio album, Love Is a Four Letter Word, in 2012. In the summer of 2014, Mraz returned with Yes!, which featured backing from the all-female L.A. folk-rock outfit Raining Jane; it was preceded by the single &quot;Love Someone.&quot;","torrent":{"xt":"urn:btih:514359ccc62530428a37fbf0eb4ffb64b4a11d99","amp;dn":"Jason+Mraz+-+Discography+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514359ccc62530428a37fbf0eb4ffb64b4a11d99","infoHashBuffer":{"type":"Buffer","data":[81,67,89,204,198,37,48,66,138,55,251,240,235,79,251,100,180,161,29,153]},"announce":[],"urlList":[]}}