{"title":"Marshall G. S. Hodgson - The Venture of Islam (3 vols.)","uid":11137801,"size":8697233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51ed81df669e5bb88a1ee6bd6f7000e71907dd3d&amp;dn=Marshall+G.+S.+Hodgson+-+The+Venture+of+Islam+%283+vols.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1412127051,"description":"\n* Marshall G. S. Hodgson - THE VENTURE OF ISLAM (University of Chicago Press, 1974).  3 volumes. -- ePUB\n\n    Volume 1: The Classical Age of Islam\n    Volume 2: The Expansion of Islam in the Middle Periods\n    Volume 3: The Gunpowder Empires and Modern Times\n\n\nTHE VENTURE OF ISLAM has been honored as a magisterial work of the mind since its publication in 1974.  In this three-volume study, illustrated with charts and maps, Marshall G. S. Hodgson traces and interprets the historical development of Islamic civilization from before the birth of Muhammad to the middle of the twentieth century.  The work is universally recognized as a masterpiece that radically reconfigured the academic study of Islam.\n\nVolume 1 analyzes the world before Islam, Muhammad's challenge, and the early Muslim state between 625 and 692.  Hodgson then discusses the classical civilization of the High Caliphate.  The volume also contains a general introduction to the complete work and a foreword by Reuben Smith, who, as Hodgson's colleague and friend, finished the Venture of Islam after the author's death and saw it through to publication.\n\nVolume 2 investigates the establishment of an international Islamic civilization through about 1500.  This includes a theoretical discussion of cultural patterning in the Islamic world and the Occident.\n\nVolume 3 describes the second flowering of Islam: the Safavi, Timuri, and Ottoman empires.  The final part of the volume analyzes the widespread Islamic heritage in today's world.\n\n\nReview\n\n&quot;This is a nonpareil work, not only because of its command of its subject but also because it demonstrates how, ideally, history should be written.&quot; -- The New Yorker\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                          &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:51ed81df669e5bb88a1ee6bd6f7000e71907dd3d","amp;dn":"Marshall+G.+S.+Hodgson+-+The+Venture+of+Islam+%283+vols.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ed81df669e5bb88a1ee6bd6f7000e71907dd3d","infoHashBuffer":{"type":"Buffer","data":[81,237,129,223,102,158,91,184,138,30,230,189,111,112,0,231,25,7,221,61]},"announce":[],"urlList":[]}}