{"title":"Drugs and Pregnancy: A Handbook{BBS}","uid":6723312,"size":5044395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:523e1f3d53556cc2002224bcc03c0c62a6763191&amp;dn=Drugs+and+Pregnancy%3A+A+Handbook%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317863461,"description":"This practical handbook will assist the physician and nurse prescriber in understanding the effects of drug exposure during pregnancy. Numerous tables and boxes provide information on drug classifications and regimens, as well as highlighting adverse effects and TERIS and FDA risk ratings. Sources of further information are provided where appropriate, and full references are available on the book's website www.drugs-and-pregnancy.com. The book provides detailed guidelines on prescribing drugs in all classes, and for a wide variety of diseases and disorders, during pregnancy. Opening with a helpful analysis of potential risks and benefits of prescribing in pregnancy, the book moves on to consider the implications of both medications for pre-existing conditions and those that develop during pregnancy, including antimicrobials, drugs for cardiovascular disease, asthma and endocrine disorders, antineoplastic agents, skin preparations, epilepsy treatments and psychiatric drugs. Invaluable guidance on anesthetic administration and the use of pain relieving medication during pregnancy and labor, and helpful advice on the possible side-effects associated with over-the-counter preparations such as cold and 'flu remedies, antihistamines and nutritional supplements is also provided.\nAbout the Author\nBertis B. Little is Associate Vice-President for Academic Research and Professor, Tarleton State University, Texas, USA\nProduct Details\n\n    * Paperback: 368 pages\n    * Publisher: Oxford University Press, USA; 1 edition (November 1, 2006)\n    * Language: English\n    * ISBN-10: 0340809175\n    * ISBN-13: 978-0340809174","torrent":{"xt":"urn:btih:523e1f3d53556cc2002224bcc03c0c62a6763191","amp;dn":"Drugs+and+Pregnancy%3A+A+Handbook%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"523e1f3d53556cc2002224bcc03c0c62a6763191","infoHashBuffer":{"type":"Buffer","data":[82,62,31,61,83,85,108,194,0,34,36,188,192,60,12,98,166,118,49,145]},"announce":[],"urlList":[]}}