{"title":"Power Rangers Mystic Force (Legacy Collection and Beyond)","uid":11757047,"size":13007447559,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:526116f303c7b11898047c69e7494410535042d1&amp;dn=Power+Rangers+Mystic+Force+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"CeraKesh","files":33,"time":1426435342,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette3.wikia.nocookie.net/powerrangers/images/f/fe/Poster-prmf.jpg/revision/latest?cb=20120120090002[/img]\nPower Rangers Mystic Force (often abbreviated as &quot;PRMF&quot;) is the fourteenth incarnation of the Power Rangers television series that started early February 2006 based on the Super Sentai series, Mahou Sentai Magiranger (Magical Squadron Magiranger).\n\nA short time ago, there was a dimension filled with wonderful magic. But then darkness came into power and a great battle began...An army of the Undead led by a powerful warrior - Morticon swarmed over the land setting their signs on the human realm and beyond. All seemed hopeless when a small legion of brave and true wizards came forth against insurmountable odds. They drove the evil back from the edge of the human world. And then the greatest wizard of them all - Leanbow cast a spell that sent the armies into the Underworld. He sealed darkness inside giant gates for eternity. The evil disappeared from the surface world. But with great victory comes great loss. The human world never knew of the great battle or the sacrifices that were made to save them from destruction.\n\nIn the present day, the great sorceress Udonna enlists the help of five teenagers who are destined to become the Power Rangers Mystic Force to fight against the Undead army which has now been released. The Rangers practice their magical skills at a secret haven in the magical realm called Rootcore. The Xenotome grants the Rangers access to magical spells as they grow as individuals","torrent":{"xt":"urn:btih:526116f303c7b11898047c69e7494410535042d1","amp;dn":"Power+Rangers+Mystic+Force+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"526116f303c7b11898047c69e7494410535042d1","infoHashBuffer":{"type":"Buffer","data":[82,97,22,243,3,199,177,24,152,4,124,105,231,73,68,16,83,80,66,209]},"announce":[],"urlList":[]}}