{"title":"Muhammad: His Life Based on the Earliest Sources - By Martin Lin","uid":6555409,"size":365495128,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:52a999a51ec9b5e2a99e5e72023a0f73fd913edf&amp;dn=Muhammad%3A+His+Life+Based+on+the+Earliest+Sources+-+By+Martin+Lin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hamzaibrahim1983","files":8,"time":1311273347,"description":"Review:\n&quot;Lings provides a wealth of detail on the life of Muhammad, the time and place of many Koranic revelations, and the foundation of Islam, all based exclusively on 8th- and 9th-century Arabic biographical sources and collections of the sayings attributed to Muhammad. General readers will find a well-written, straightforward chronological narrative; specialists will find a faithful and convenient rendering of source material.&quot; (by Joseph Gardner, California State Univ. Lib., Northridge Library Journal)\n\n&quot;I have often found it difficult to find any good biographies regarding the Prophet of Islam, but this one is truly a gem. Martin Lings has done an amazing job of taking the life of this Man from the most earliest and reliable sources, then turning it into a narrative that is such a pleasure to read. It feels as though one as reading a novel, and it is difficult to put this book down once one has picked it up. The author shows real talent and i can only imagine how great and difficult a task it was to have done research to such a deep level, and then taking it all and writing it in story form. If i remember correctly i think Martin Lings is a Professor at the famous University of Cambridge, England. \nThere are many strong points of this book, it will give one a thorough understanding of who Muhammed was, his beliefs, mindset and what he was attempting to achieve. The story is given in it's true context without any real interpretation, rather that is left to the reader. &quot; (by Truth Seeker)\n\n&quot;Widely recognised as the best biography of the Prophet in English, Dr. Martin Lings' award winning book is now available on audio as an abridged 6-hour spoken word album, read by well-known narrator Sean Barrett (famous for his TV documentary voice-overs, the BBC World Service and many other spoken word titles). This excellent audiobook is the first of its kind and has been selected by a number of organisations as a worthy introduction to the life of Prophet Muhammad.&quot; (Editorial Reviews)","torrent":{"xt":"urn:btih:52a999a51ec9b5e2a99e5e72023a0f73fd913edf","amp;dn":"Muhammad%3A+His+Life+Based+on+the+Earliest+Sources+-+By+Martin+Lin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52a999a51ec9b5e2a99e5e72023a0f73fd913edf","infoHashBuffer":{"type":"Buffer","data":[82,169,153,165,30,201,181,226,169,158,94,114,2,58,15,115,253,145,62,223]},"announce":[],"urlList":[]}}