{"title":"Suvorov-Aquarium-Career&amp;Defection of a Soviet Spy(1985)","uid":5016846,"size":1954092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52f7851f6ac54743a0a21106f9a1ec8c5bb7abd4&amp;dn=Suvorov-Aquarium-Career%26Defection+of+a+Soviet+Spy%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"red_gonzo","files":1,"time":1248221191,"description":"This is Viktor Suvorov's mindblowing book Aquarium - The Career and Defection of a Soviet Spy (1985) which is a true description of how the less known and far more dangerous of the two biggest soviet spy agencies - the GRU - operated. The Aquarium is the headquarters of the GRU - Soviet Military Intelligence. There is only one way in, via special selection - and only one exit: through the chimney of the crematorium. As a young officer Viktor Suvorov commanded a tank company. But his skill and initiative soon led his superiors to take notice - and he was transferred to Military Intelligence. After training with SPETSNAZ - the Soviet SAS - he was posted abroad to spy. One of the greatest strengths of the book is that he has managed to capture the feeling of all the institutions and the whole situation so overwhelmingly well. Another is definitely the facts themselves - they are just interesting, not to mention important enough for this book to be required reading for anyone who wants to understand the history of the 20th century. Aquarium is the gripping personal story of author's day-to-day work as a Soviet spy in Europe, and of why he defected rather than betray the one associate he admired. 400 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:52f7851f6ac54743a0a21106f9a1ec8c5bb7abd4","amp;dn":"Suvorov-Aquarium-Career%26Defection+of+a+Soviet+Spy%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f7851f6ac54743a0a21106f9a1ec8c5bb7abd4","infoHashBuffer":{"type":"Buffer","data":[82,247,133,31,106,197,71,67,160,162,17,6,249,161,236,140,91,183,171,212]},"announce":[],"urlList":[]}}