{"title":"Bible Difficulties - Edward Andrews","uid":11773452,"size":543488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53227d1067f6ae3e9d029028a2effc795495a9ea&amp;dn=+Bible+Difficulties+-+Edward+Andrews&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1427168537,"description":"\nThe documentary hypothesis (DH), sometimes called the Wellhausen hypothesis, proposes that the Pentateuch (the first five books of the Bible) was derived from originally independent, parallel and complete narratives, which were subsequently combined into the current form by a series of redactors (editors).\n\nTracing the origin of the Documentary Hypothesis through the centuries, Edward Andrews investigates the assumptions and presuppositions underlying every theory, critically analyzing the original Bible text and addressing popular issues and authorial concerns. By comparing the textual evidence and the commentaries of scholars from the past four centuries, Andrews effectively debunks the Documentary Hypothesis, providing an alternative theory that lifts the Bible up as a reliable source of factual information as well as consistent truth.\n\n\nAbout the author:\nEDWARD D. ANDREWS (AS in Criminal Justice from Zane State, BS in Religion at Liberty Baptist Theological Seminary, MA in Biblical Studies at Temple-Baptist Seminary, and MDiv in Theology at Liberty Baptist Theological Seminary) is CEO and President of Christian Publishing House. He is a member of the Society of Biblical Literature and Associates for Biblical Research. He has authored twenty-one books and coauthored and updated and expanded three books, as well as over 200 articles","torrent":{"xt":"urn:btih:53227d1067f6ae3e9d029028a2effc795495a9ea","amp;dn":"+Bible+Difficulties+-+Edward+Andrews","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53227d1067f6ae3e9d029028a2effc795495a9ea","infoHashBuffer":{"type":"Buffer","data":[83,34,125,16,103,246,174,62,157,2,144,40,162,239,252,121,84,149,169,234]},"announce":[],"urlList":[]}}