{"title":"Ark and Life DJ Sets Collection (1991 to 1997)","uid":11674641,"size":12239177047,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:53a2aa319be1240b1716a887766baa97bd3ce01d&amp;dn=Ark+and+Life+DJ+Sets+Collection+%281991+to+1997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RodneyYouPlonker","files":182,"time":1422806506,"description":"These DJ Sets are rare and you cannot get hold of them anymore, they're not for sale in the shops. They are all MP3 quality. Ark was a rave held in Leeds and Preston at the universities and also around other places in Leeds and Blackpool sometimes, all around the north of England. Life was another rave in Manchester held at a place called Bowlers leisure centre near Trafford Park again in northern England. They also had other events like Ark and Life, Fantazia and Life, Ark and Cream which were combinations of different events. There are a few of these included in the collection with various DJs performing sets.\n\nAll the MP3s have been correctly tagged with all the information and artwork. The collection contains a total of 179 MP3s ranging between anything from 30 minutes to 90 minutes in length. Most of them are house sets though there is some more faster style hardcore sets also included amongst the others. The total listening time of the collection is just over a weeks worth of music if you were to play them back to back non stop.\n\nLots and lots of different DJs, obviously the main resident DJs of Ark and Life and also other guest DJs. Some of the best DJs from the 90s which are still going today. Lots of really great tunes played which were very popular at the time. Ark and Life were very special for their atmospheres and the crowds that took part. Some of the best nights in dance music around the north of England in the 1990s.\n\nMP3 quality = CBR, mixed bitrate 128kbps/160kbps/192kbps @ 44.1Khz\nTotal number of MP3s = 179\nTotal listening time = just over 1 week\nTotal size = 11.3 gigabytes","torrent":{"xt":"urn:btih:53a2aa319be1240b1716a887766baa97bd3ce01d","amp;dn":"Ark+and+Life+DJ+Sets+Collection+%281991+to+1997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53a2aa319be1240b1716a887766baa97bd3ce01d","infoHashBuffer":{"type":"Buffer","data":[83,162,170,49,155,225,36,11,23,22,168,135,118,107,170,151,189,60,224,29]},"announce":[],"urlList":[]}}