{"title":"Dope Mania - Something Weird Video","uid":4536084,"size":563652912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5418ccefee9aeb4ebb979a5f08925a9326926d15&amp;dn=Dope+Mania+-+Something+Weird+Video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"frit0","files":1,"time":1227738969,"description":"&quot;Dope Mania&quot; is another fun compilation from the heyday of Rhino Video (a long gone period I must admit). As much as I enjoy flicks such as &quot;Reefer Madness&quot;, I&amp;#039;ll admit many of them are inconsistent, with boring talky sequences going along with the hilariously wrong insanity. This compilation just cuts to the good stuff. It features clips from the 30s roadshow pictures, obscure drug education films, and my personal favorite, a silent anti-weed western (I hope the full length version is still around nowadays). This has been released onto DVD as part of the Johnny Legend &quot;Mania! Mania!&quot; collection, and I strongly recommend it. \n\nFootage of America&amp;#039;s youth ripping their clothes off after a few tokes of reefer. (Funny how no orgies have broken out at any pot parties I&amp;#039;ve ever been to.) A heroin addict who still cares enough about herself to accessorize with a pearl choker. Newspaper headlines like &quot;Murder by Marihuana.&quot; Dope addicts becoming bug-eyed knife wielders during bad trips. A disclaimer stating, &quot;The following sequence features real-life dope fiends and their actual hallucinations as recreated by computer and colorized!&quot; (I.E., rudimentary wipes of primary colors across the screen with high-pitched theremin sounds on the soundtrack.)\n\nSome of the clips this video unearthed are so obscure, and so ridiculously bad, that I can&amp;#039;t find them on IMDb. In addition to those listed here under &quot;movie connections,&quot; titles given in DOPE MANIA include &quot;Where Does Dope Come From,&quot; showing how opium is manufactured; &quot;Chinese Justice,&quot; with stock footage of &quot;real&quot; executions of addicts; &quot;Use Your Eyes,&quot; possibly a police training video for spotting evidence in a drug den; and &quot;Weed of Death,&quot; a scratched, mud-tinted silent movie. These are interspersed with footage of a snake with a monotonic narrator dully pontificating why no intelligent person would want a shot of venom but would seek a narcotic high.\n\nprops to nnahojus for the up/summary","torrent":{"xt":"urn:btih:5418ccefee9aeb4ebb979a5f08925a9326926d15","amp;dn":"Dope+Mania+-+Something+Weird+Video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5418ccefee9aeb4ebb979a5f08925a9326926d15","infoHashBuffer":{"type":"Buffer","data":[84,24,204,239,238,154,235,78,187,151,154,95,8,146,90,147,38,146,109,21]},"announce":[],"urlList":[]}}