{"title":"Rifftrax - The Dark Knight","uid":7872762,"size":1292612899,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:541925d9efbaee10ef20b5619f02ac7b7deccfe6&amp;dn=Rifftrax+-+The+Dark+Knight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jose1337","files":1,"time":1354256375,"description":"As with all Rifftrax movies if you want the original theatrical, or DVD version's of this movie then this is not the torrent you are looking for...\n*******************************************************************************\nIf you can spare a minute, think back on the greatest work of cinema that you have ever seen.  Did you think about The Dark Knight?  No?  Then you are a moron.  Because while you were out doing whatever it is morons do...demolition derbies or...croquet, (we wouldn't know, we loved The Dark Knight), The Dark Knight pimp-slapped Andy Dufresne, spat in the Godfather's face and gave Charles Foster Kane a big ol' wedgie on its way to becoming the greatest movie of all time.\n\nAll this in spite of the bat suit causing our hero to grumble like the offspring of Tom Waits and Cookie Monster.  There is nothing at all silly about that.  We here at RiffTrax regret even having to point out that he sounds like your Great Aunt Vivian sending you out for her third pack of Pall Malls of the day.  Because The Dark Knight is not just a superhero movie.  It's a gritty crime drama about political corruption and the choices men make that just happens to involve a superhero.  A superhero millionaire that dresses as a bat whose voice sounds like your cat heaving up a hairball into your slippers who battles a guy with half a face named Two-Face.  \n\nDespite all this, Mike, Kevin and Bill are ready to take on...(reverent pause)...The Greatest Movie of All Time.*\n\n* Source:  The Internet\n*******************************************************************************\nAs always donate or purchase the MP3's from Rifftrax to keep these coming...","torrent":{"xt":"urn:btih:541925d9efbaee10ef20b5619f02ac7b7deccfe6","amp;dn":"Rifftrax+-+The+Dark+Knight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"541925d9efbaee10ef20b5619f02ac7b7deccfe6","infoHashBuffer":{"type":"Buffer","data":[84,25,37,217,239,186,238,16,239,32,181,97,159,2,172,123,125,236,207,230]},"announce":[],"urlList":[]}}