{"title":"Salamis 480 BC","uid":11786771,"size":103106671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:547054238cca0163be73bd38c4a933bafa7579b4&amp;dn=Salamis+480+BC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427780425,"description":"Osprey's study of a crucial battle of the Grerco-Persian Wars (499-449 BC). Weeks after the glorious disaster at Thermopylae and heavy but inconclusive fighting at sea off Artemisium, with Athens now in barbarian hands and the Acropolis burned, the Greeks dramatically halted the Persian invasion of 480BC.  They brought the 600-strong Persian fleet to battle with their 350 triremes in the confined waters of the straits of Salamis and, through a combination of superior tactics and fighting spirit, won a crushing victory.  This drove the Persian navy out of the western Aegean and enabled the Hellenic Alliance to combine its manpower in sufficient force to destroy the massive occupying army in the following year.  Victory over the Persians secured the 5th century flowering of Greek and, in particular, Athenian culture and institutions that so influenced the subsequent development of western civilisation.\n\nThis book draws extensively on the findings of archaeological, technological and naval research, as well as on the historical sources to vividly recreate one of the most important naval campaigns in world history","torrent":{"xt":"urn:btih:547054238cca0163be73bd38c4a933bafa7579b4","amp;dn":"Salamis+480+BC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"547054238cca0163be73bd38c4a933bafa7579b4","infoHashBuffer":{"type":"Buffer","data":[84,112,84,35,140,202,1,99,190,115,189,56,196,169,51,186,250,117,121,180]},"announce":[],"urlList":[]}}