{"title":"The Great Fiction - Hans-Hermann Hoppe","uid":11709936,"size":587055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55a3d306e74f22017d74faa418ab66cc428f0c26&amp;dn=The+Great+Fiction+-+Hans-Hermann+Hoppe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424284933,"description":"\nNo living writer today is more effective at stripping away the illusions almost everyone has about economics and public life. More fundamentally, Professor Hans-Hermann Hoppe causes the scales to fall from one's eyes on the most critical issue facing humanity today: the choice between liberty and statism. The Great Fiction, published by Laissez Faire Books, is an expansive collection of his writings centering on the theme of the rise of statism and its theoretical underpinning. Some essays have been published in mostly obscure or offbeat places, while others are new and have never appeared in print. Together they constitute a devastating indictment of the many forms of modern despotism and a sweeping reconstruction of the basis of state management itself. The title comes from a quotation by Frederic Bastiat, the 19th-century economist and pamphleteer: &quot;The state is the great fiction by which everyone seeks to live at the expense of everyone else.&quot; He does not say that this is one feature of the state, one possible aspect of public policy gone wrong, or one sign of a state gone bad in a shift from its night-watchman role to become confiscatory. Bastiat is characterizing the core nature of the state itself. The whole of Hoppe's writings on politics can be seen as an elucidation on this point. He sees the state as a gang of thieves that uses propaganda as a means of disguising its true nature. In fleshing this out, Hoppe has made tremendous contributions to the literature, showing how the state originates and how the intellectual class helps perpetuate this cover-up, whether in the name of science, or religion, or the provision of some service like health, security, education, or whatever. The excuses are forever changing; the functioning and goal of the state are always the same.\n\n\nAbout the author:\nHans-Hermann Hoppe was born on September 2, 1949, in Peine, West Germany. He attended the Universit?t des Saarlandes, Saarbr?cken, the Goethe-Universit?t, Frankfurt/M, and the University of Michigan, Ann Arbor, for studies in Philosophy, Sociology, History, and Economics. He earned his Ph.D. (Philosophy, 1974) and his ?Habilitation? (Sociology and Economics, 1981), both from the Goethe-Universit?t, Frankfurt am Main.\n\nHe taught at several German universities as well as at the Johns Hopkins University Bologna Center for Advanced International Studies, Bologna, Italy. In 1986, he moved from Germany to the United States, to study under Murray Rothbard. He remained a close associate of Rothbard until his death in January, 1995.\n\nAn Austrian school economist and libertarian/anarcho-capitalist philosopher, he is currently Professor of Economics at UNLV, Distinguished Fellow with the Ludwig von Mises Institute, Founder and President of The Property and Freedom Society (2006-present), and Editor-at-Large of the Journal of Libertarian Studies (2005-2009).\n\nIn addition to his recent English-language books, Professor Hoppe is the author of Handeln und Erkennen (Bern 1976); Kritik der kausalwissenschaftlichen Sozialforschung (Opladen 1983); Eigentum, Anarchie und Staat (Opladen 1987) and numerous articles on philosophy, economics and the social sciences","torrent":{"xt":"urn:btih:55a3d306e74f22017d74faa418ab66cc428f0c26","amp;dn":"The+Great+Fiction+-+Hans-Hermann+Hoppe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a3d306e74f22017d74faa418ab66cc428f0c26","infoHashBuffer":{"type":"Buffer","data":[85,163,211,6,231,79,34,1,125,116,250,164,24,171,102,204,66,143,12,38]},"announce":[],"urlList":[]}}