{"title":"My Black Brother (2015) - Interracial Porn XXX","uid":11914240,"size":2425484449,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:55d93681a686ff59cbd2001b10556fa1e416fd94&amp;dn=My+Black+Brother+%282015%29+-+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KidAtomic","files":1,"time":1431514268,"description":"My Black Brother (2015)\n\nThese brothas and sisters love to get nasty, and you're about to get front row seats to watch their naughty little hook-ups. It's Brooklyn Chase, Brooke Wylde, Onyx Muse and Katerina Kay, and they're getting it balls deep with their black stepbrothers. These girls are starving for big dick, and lucky enough, their horny ass brothas can't wait to feed it to them!\n\n    Scene 1. Brooke Wylde, Sean Michaels\n    Scene 2. Brooklyn Chase, Jovan Jordan\n    Scene 3. Katerina Kay, Rob Piper\n    Scene 4. Onyx Muse, Jon Jon\n\nLength 1 hrs. 56 mins.\nRating XXX\n\nStudio (Distributor)\n    New Sensations\n\nDirector\n    Eddie Powell\n    Paul Woodcrest\n\nActresses\n\n    Brooke Wylde [IR]\n    Brooklyn Chase [IR]\n    Katerina Kay [IR]\n    Onyx Muse [IR]\n\nActors\n\n    Jon Jon\n    Jovan Jordan\n    Rob Piper\n    Sean Michaels\n\nTime to check out a recent IR themed show from Digital Sin. Four scenes of cute girls taking on big black cocks. You have in this release Katerina Kay, Onyx Muse, Brooke Wylde and Brooklyn Chase to enjoy. A few highlights.\n\nBrooklyn Chase with Jovan Jordan:\n\nThe lovely Miss Chase leads off and also scores the cover for this release. The scene starts off and Brooklyn needs to borrow her brothers car to go off for a weekend at San Diego with the girls. Jovan isn't hearing of it, that is until Brooklyn puts her hands over his covered cock! Brooklyn doesn't stop and soon they are heavily making out- must have been that promise of road head if he'd drive her. But before that happens why not a preview so Jovan gets to sample those large tits making sure to kiss both puppies. Brooklyn loses the rest of her clothes as she begins to take care of her brothers cock. The view looking up was good here as she sucks his cock and there's a big ole view of those boobies! Jovan moves in then to taste her pussy which allows a little more boobage to fill the screen-- these tits are certainly made for my 51 inch screen!! Two great positions lead off as they hit cowgirl and reverse respectively. The latter offers more good boob shots and she hops off for some P2M as well. The scene ends with Jovan standing just over her titties and leaving his cum across them.\n\nKaterina Kay with Rob Piper:\n\nThe next scene begins with a full on ass shot though Katerina is pulling her dress down covering that ass soon after. She is finishing up getting ready and we get a few looks at her tits her while down below we have Rob texting someone on his phone while waiting for her. Katerina is taking her time so he heads up to see what's taking so long and of course she was waiting for him to head up to help finish getting her ready. But getting ready meant the two of them fucking and Rob wasn't opposed to this development as you can imagine. Katerina drops down and in seconds has her lips wrapped around his cock offering up good eye contact too. It wasn't a long blow job but we do get Rob returning the oral favor on his sister. the two work through several positions during the scene not staying to long with any one shot. Ending with Rob fucking her in spoon he leaves his seed just inside that pussy with some cum oozing out when his cock slips out. Katerina dips a couple fingers in for a taste.\n\nOnyx Muse with Jon Jon:\n\nOur third scene opens with a good side full nude shot of Onyx and she starts to dress for us putting on panties and then a bra. Jon Jon just happens to walk by as she is putting on the bra and naturally he pulls back for a second/ closer look! Onyx is good with the hands moving over her body and then a short time later she is spying on a shirtless Jon Jon who is looking at a text on his phone. Onyx is sizing him up! A different time/ day we have the two now together for a study session but it's just Onyx checking Jon Jon out again, lol. She says he is hot so she isn't hiding her desire very well. Jon says he isn't down with that program but his hot step sister soon changes his mind! Onyx is soon hard at it taking his cock into her mouth and she also moves around so that her pussy is over his face-- your basic 69 position. You have some traditional head with him standing and Onyx on her knees. Sex wise you get a nice open shot as they lead off in doggie. Good riding then in reverse and cowgirl with Onyx rocking back and forth for a short time and there's P2M as well. A mish finish yields the load left right on target in her mouth.\n\nBrooke Wylde with Sean Michaels:\n\nThe last scene has Brooke in the kitchen to start cleaning the counter when Sean arrives and she beckons him to head inside to get out of the rain. She is looking real nice here with a breast hugging top and shorts that are so short the white inner pockets are showing on her thighs! Brooke then goes to change and this offers us a view of those dreamy and huge natural tits!!!! Oh my those are certainly made for the big screen. Sean then comes in but didn't know she was topless. Brooke doesn't seem to think it's a big deal and keeps on looking for something to wear as Sean awkwardly stares at her tits. She puts his mind at ease so that they can do what needs to be done and that's Sean kissing those big hooters. Sean keeps up the good foreplay working down to taste Brooke's pussy. A fantastic close in and open shot given here on that pussy. They move nicely then to Brooke getting a firm grip on his dick and she takes him into her mouth. No doubt the best shot sex wise was Brooke riding Sean with those titties facing out to us, lots of boob dancing. A mish finish and the pop flies to those titties and I'd say this was a good welcome home to her big brother!","torrent":{"xt":"urn:btih:55d93681a686ff59cbd2001b10556fa1e416fd94","amp;dn":"My+Black+Brother+%282015%29+-+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d93681a686ff59cbd2001b10556fa1e416fd94","infoHashBuffer":{"type":"Buffer","data":[85,217,54,129,166,134,255,89,203,210,0,27,16,85,111,161,228,22,253,148]},"announce":[],"urlList":[]}}