{"title":"Design of Simple and Robust Process Plants","uid":12096760,"size":4134630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:570e181804c95da82a03a7fa20dc1d16e126d026&amp;dn=Design+of+Simple+and+Robust+Process+Plants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1436180302,"description":"Design of Simple and Robust Process Plants - J. L. A. Koolen (Wiley-VCH).pdf\n\nISBN 3527297847\n\nThe approaches to design process plants described in this book lead to process designs which require 30-40% less capital than usual. The book is unique since it is the first comprehensive work addressing both the total process design and operational approach. \n\nTechnological developments during the last decade made the design of really competitive processes possible.\nMechanical developments have resulted in reliable and robust equipment. Process developments have created opportunities to minimize the amount of equipment; furthermore, different logistic approaches, integration of process functionality and intensification of the unit operations are possible. Computer and control technology allows remote-control operation and first pass prime production. \n\nIn this work design philosophies are discussed and their implementation is shown as a structured approach for planned and existing plants. Numerous examples are presented to illustrate what simple design can create. The work is intended for experienced engineers and managers involved in process design, control design and operation, but is also interesting for students. Project engineers and managers have to apply these new approaches to achieve competitive processes.\n&quot;A process plant should meet the simplicity and robustness of a household refrigerator.&quot; This book has been written to allow to achieve this aim.\n&quot;Chairman of the Judges Award&quot; from IChemE 2003","torrent":{"xt":"urn:btih:570e181804c95da82a03a7fa20dc1d16e126d026","amp;dn":"Design+of+Simple+and+Robust+Process+Plants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570e181804c95da82a03a7fa20dc1d16e126d026","infoHashBuffer":{"type":"Buffer","data":[87,14,24,24,4,201,93,168,42,3,167,250,32,220,29,22,225,38,208,38]},"announce":[],"urlList":[]}}