{"title":"Lowkey - 4 Albums (2005-2011) [FLAC]","uid":8488462,"size":1894893045,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:582da8b8ce6771ec5d0bf7d0fd37bc3e70209df9&amp;dn=Lowkey+-+4+Albums+%282005-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1368937252,"description":"\n  Lowkey - 4 Albums (2005-2011) [FLAC]\n\n  Genre: Rap, Hip-Hop\n  Style: British Rap\n  Source: CD\n  Codec: FLAC\n  Bit Rates: \n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  Key to the Game 2\n  Key to the Game 3\n  Dear Listener\n  Soundtrack to the Struggle \n\n  With his own unique take on racism, war, and global political issues, rapper and activist (and member of several supergroups) Lowkey has emerged as one of the British hip-hop scene's most outspoken artists. Born Kareem Dennis in London in 1986 to an Iraqi mother and English father, he first started rapping at the age of 12 and, after competing at various open-mike sessions on Carnaby Street, won an MC battle to earn the name of Lowkey. Despite generating buzz with his 2003 Key to the Game mixtape, a stint in rap collective Poisonous Poets, and support slots with Canibus, Dead Prez, and Immortal Technique, he took a hiatus from the music industry for several years before returning in 2009 with his first album, Dear Listener. During the same year, he also teamed up with Reverend and the Makers frontman Jon McClure, Arctic Monkeys drummer Matt Helders and ex-bassist Andy Nicholson, and Babyshambles bassist Drew McConnell to form the group Mongrel, who released their debut LP, Better Than Heavy, through the Independent newspaper. Following several humanitarian aid missions in Palestine and various charity projects, he released his sophomore outing, Soundtrack to the Struggle, in 2011.\n \n*This torrent is dedicated to the Associated Press journalists who had their phone records seized by the corporate-government plutocratic duopoly.","torrent":{"xt":"urn:btih:582da8b8ce6771ec5d0bf7d0fd37bc3e70209df9","amp;dn":"Lowkey+-+4+Albums+%282005-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"582da8b8ce6771ec5d0bf7d0fd37bc3e70209df9","infoHashBuffer":{"type":"Buffer","data":[88,45,168,184,206,103,113,236,93,11,247,208,253,55,188,62,112,32,157,249]},"announce":[],"urlList":[]}}