{"title":"Paintbox Knits for Kids/More Paintbox Knits For Kids","uid":9212928,"size":30967004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58a93cf01e34ab7dd6084f3c77ffa00a2e310543&amp;dn=Paintbox+Knits+for+Kids%2FMore+Paintbox+Knits+For+Kids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1384820308,"description":"Paintbox Knits More Than 30 Designs for Kids by Mary H. Bonnette and Jo Lynne Murchland Sporty Knits for Spirited Kids! These playful, pint-size patterns mix vibrant colors with clever motifs that kids will want to put on parade! You'll find designs for every season, from toasty-warm turtlenecks that will beat the winter chill to light-and-breezy sundresses just right for summer fun. Best of all, each project is brimming with splashes and dashes of bright, bold colors that kids will love. Â· More than 30 projects include pullovers, cardigans, tunics, skimmers, pants, and jackets, with many suitable for either boys or girls Â· Each design relies on kid-friendly fibers and generous proportions for those active, growing kids Â· Helpful sections reveal kid-tested secrets for simple sizing, trouble-free blocking and finishing, neckline knitting, and graphing your own designs From stylish twists on old classics to colorful, creative conversation pieces, Paintbox Knits is a must-have for knitters--and their kid-sized friends--who want knitwear with sass and spirit!","torrent":{"xt":"urn:btih:58a93cf01e34ab7dd6084f3c77ffa00a2e310543","amp;dn":"Paintbox+Knits+for+Kids%2FMore+Paintbox+Knits+For+Kids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58a93cf01e34ab7dd6084f3c77ffa00a2e310543","infoHashBuffer":{"type":"Buffer","data":[88,169,60,240,30,52,171,125,214,8,79,60,119,255,160,10,46,49,5,67]},"announce":[],"urlList":[]}}