{"title":"Autism: A Very Short Introduction","uid":8888041,"size":3368973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58af610e46ff8ba3eff2ffbcad6843882d6f58e1&amp;dn=Autism%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1378512528,"description":"Description:\n\nWhat causes autism? Is it a genetic disorder, or due to some unknown environmental hazard? Are we facing an autism epidemic? What are the main symptoms, and how does it relate to Asperger syndrome? Everyone has heard of autism, but the disorder itself is little understood. It has captured the public imagination through films and novels portraying individuals with baffling combinations of disability and extraordinary talent, and yet the reality is that it often places a heavy burden on sufferers and their families. This Very Short Introduction offers a clear statement on what is currently known about autism and Asperger syndrome. Explaining the vast array of different conditions that hide behind these two labels, and looking at symptoms from the full spectrum of autistic disorders, it explores the possible causes for the apparent rise in autism and also evaluates the links with neuroscience, psychology, brain development, genetics, and environmental causes including MMR and Thimerosal. This VSI also explores the psychology behind social impairment and savantism, and sheds light on what it is like to live inside the mind of the sufferer.","torrent":{"xt":"urn:btih:58af610e46ff8ba3eff2ffbcad6843882d6f58e1","amp;dn":"Autism%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58af610e46ff8ba3eff2ffbcad6843882d6f58e1","infoHashBuffer":{"type":"Buffer","data":[88,175,97,14,70,255,139,163,239,242,255,188,173,104,67,136,45,111,88,225]},"announce":[],"urlList":[]}}