{"title":"[ExploitedCollegeGirls] Summer (03.06.2014)","uid":9717498,"size":257916341,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:59146d6944c0aa70fa5835b08931fd2ad31d66c6&amp;dn=%5BExploitedCollegeGirls%5D+Summer+%2803.06.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"chkm8te","files":1,"time":1394174120,"description":"[ExploitedCollegeGirls] Summer (03.06.2014)\n\nSteve fills in this episode while Jay is prepping to nail 2 hotties for ECG this week. The boys are busy! Anyway - This is 21 year old Summer's first, and most likely last porn scene. A girl who doesn't like to talk on camera, and almost starts crying when she finally realizes what she's done (&quot;OMG I'm getting fucked by this stranger in a hotel room and there are 3 cameras pointing at me! What's daddy gonna think??!&quot;) just isn't cut out for porn. So there isn't much talking or BTS going on here, she just &quot;wasn't comfortable talking....whaaaaa&quot;. Yeah 'cuz all it takes in life to be successful is to look pretty, right Summer? Work and effort? Nah, not for this princess, apparently: Summer only agreed to do this shoot if the actual fucking (cock in pussy) is kept to a minimum. A few minutes and that's all she's willing to give up. And no talking. Toys and BJ and giving rimjobs is fine with her though. Weird.\nA shame really. Summer is a hot chick who's even hotter when she takes selfies while Steve is eating our her sugar snatch. (Seriously, watch her face change when she lies down and films herself...it's weird, she goes from like a 7 to a 10!)\nShe has an insanely hot body chiseled by her rock climbing hobby, and which is only mangled by that stupid tattoo on her side. Why do hot girls always do this now???!\nSteve does his best to tickle some enthusiasm and excitement out of her. But Summer is simply too scared and too much in over her head with all this. Except when she sneakily orgasms as Steve eats her out, and tries her best to hide it. In fact, Steve didn't know he got her to cum, that's how quiet she is. Luckily for you, she's pointing the POV camera straight at her face when she cums so you actually get to watch her orgasm in real time (more than once, in fact). She wouldn't ever admit that she got off with a stranger doing a durrrty movie because then she would have to admit to herself that she is, in fact, enjoying herself and that would mean she's much more than just a poor college girl trying to earn extra money and her last resort is this 'porn thing'. If she actually let herself enjoy it, Summer would be great at this. There are toys (yes more Summergasms... but pssst! don't tell anyone!!), and of course some fucking. Despite her distate for fucking, she's really into sucking cock actually. Another surprise is how long and enthusiastically Summer licks Steve's ass. Pretty hardcore for a girl who tries to be all goody-goody. Maybe this girl does have a shot at this after all, with a major attitude adjustment. Oh do not miss the moment of true whore shaming - the instant Summer realizes she is throwing her life away as Steve is plowing her from behind. Priceless!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=yz26z6j5yvjtyi97i356.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=yz26z6j5yvjtyi97i356.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=00n9qp2bd2p3yj2q3ltf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=00n9qp2bd2p3yj2q3ltf.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:59146d6944c0aa70fa5835b08931fd2ad31d66c6","amp;dn":"%5BExploitedCollegeGirls%5D+Summer+%2803.06.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59146d6944c0aa70fa5835b08931fd2ad31d66c6","infoHashBuffer":{"type":"Buffer","data":[89,20,109,105,68,192,170,112,250,88,53,176,137,49,253,42,211,29,102,198]},"announce":[],"urlList":[]}}