{"title":"Experiment and Calculation of Reinforced Concrete at Elevated Te","uid":6586612,"size":16065415,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5973934f7c1af8a594921b33213f356f980de858&amp;dn=Experiment+and+Calculation+of+Reinforced+Concrete+at+Elevated+Te&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1312590820,"description":"Zhenhai Guo, &quot;Experiment and Calculation of Reinforced Concrete at Elevated Temperatures&quot;\nButterworth-Heinemann | 2011 | ISBN: 0123869625 | 336 pages | PDF \n\nConcrete as a construction material goes through both physical and chemical changes under extreme elevated temperatures. As one of the most widely used building materials, it is important that both engineers and architects are able to understand and predict its behavior in under extreme heat conditions. Brief and readable, this book provides the tools and techniques to properly analysis the effects of high temperature of reinforced concrete which will lead to more stable, safer structures.\n\nBased on years of the author's research, Reinforced Concrete at Elevated Temperatures four part treatment starts with an unambiguous and thorough exposition of the mechanical behaviors of materials at elevated temperature followed by a discussion of Temperature field of member sections, Mechanical behaviors of members and structures at elevated temperature, ending with Theoretical analysis and practical calculation methods. The book provides unique insight into:\n\nCoupling thermal-mechanical constitutive relation of concrete\n\nExceptional analyses of beams and columns of rectangular section with three surfaces and two adjacent surfaces exposing to high temperature\n\nMeasurement and analysis of redistribution of internal forces of statically indeterminate structure during heating-loading process\n\nFinite element analysis and calculation charts for two-dimensional temperature field of structural members\n\nFinite element analysis and simplified calculation method for reinforced concrete structure at elevated temperature\n\n\nWith this book, engineers and architects can effectively analyze the effect of high temperature on concrete and materials which will lead to better designs of fire resistant and damage evaluation and treatment after fire.\n\n\nTools and techniques for analyzing the effects of high temperature on concrete and reinforcement materials.\n\nMeasurement and analysis of redistribution of internal forces of statically indeterminate structure during the heating-loading process.\n\nFinite element analysis and calculation charts for two-dimensional temperature field of structural members.\n\nFinite element analysis and simplified calculation method for reinforced concrete structure at elevated temperature. ","torrent":{"xt":"urn:btih:5973934f7c1af8a594921b33213f356f980de858","amp;dn":"Experiment+and+Calculation+of+Reinforced+Concrete+at+Elevated+Te","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5973934f7c1af8a594921b33213f356f980de858","infoHashBuffer":{"type":"Buffer","data":[89,115,147,79,124,26,248,165,148,146,27,51,33,63,53,111,152,13,232,88]},"announce":[],"urlList":[]}}