{"title":"FileSize-FileAnalyzer-FileCatalog-FileDateChanger-MergeExcel-Emp","uid":9772809,"size":14683359,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:59957213ee65e9b4038d04602ebc2a79f9eee8d9&amp;dn=FileSize-FileAnalyzer-FileCatalog-FileDateChanger-MergeExcel-Emp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Bonzaaier","files":15,"time":1394981602,"description":"FMS File Size 2.7.6\nFMS File Size is an easy-to-use disk space analyze tool to scan your whole disks or folders and show various kinds of detail reports to you, such \nas Empty Folders Report,Empty Files Report,The Largest Files Report,The Oldest Files Report,even Files Never Used Last Year Report,etc.\n\nFMS File Analyzer 2.8.6\nAnalyze File Size,File Type,File Date,etc.\nFMS File Analyzer is a powerful and flexible harddisk space manager for Windows All.Find out which folders are the largest,which kinds of files are the most,and show you the files with the last access date or write date on your drives. \nWith 3D charts,it is easy to visually track down disk usage and see the size of all folders including their subfolders.And follow the charts,you can \n\nfind out and organize the files with the same file extension, the same file size range or the same file age range,and export them to files.\n\nFMS File Catalog 3.4.6\nEasy-to-use File-CD-DVD Catalog tool\nDo you have lot's of CDs, DVDs or any other files?Do you want to find out the file you needed quickly and not to check your CDs one by one?\nFMS File Catalog is a hip software tool that helps you to catalog your files and any kinds of disks.This program will scan your disk and then catalog and save the file information. You can collect the infomation of your CDs and export it as an XML file.When you want a file, check the information of the XML file,you can find the CDs and the files directly and quickly.\n\nFMS File Date Changer 2.9.6\nChange File Create Date,File Access Date,File Modified Date.\nFMS File Date Changer allows you to change or modify the dates (timestamp) for one or more files,folders (directories) and subfolders, such as the creation date, last modified date or the last accessed date easily.\n\nFMS Merge Excel 2.5.4\nFMS Excel Merge is a Merge Excel Files Software that can help you to merge multiple excel sheets or workbooks into one. You might be working to merge excel files into one fresh sheet or combine workbooks of excel into one fresh workbook, you must have to use FMS Excel Merge software which can make you comfortable to perform complex merging tasks.\n\nFMS Empty Folder Remover 1.9.6\nAutomatically check and delete empty directories on your disk.\n\nFMS Empty File Remover 2.9.6\nAutomatically check and delete empty files on your disk.\n\n\nFor activation of the program, read the .txt file.\n\nJust have FUN.\nBonzaaier","torrent":{"xt":"urn:btih:59957213ee65e9b4038d04602ebc2a79f9eee8d9","amp;dn":"FileSize-FileAnalyzer-FileCatalog-FileDateChanger-MergeExcel-Emp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59957213ee65e9b4038d04602ebc2a79f9eee8d9","infoHashBuffer":{"type":"Buffer","data":[89,149,114,19,238,101,233,180,3,141,4,96,46,188,42,121,249,238,232,217]},"announce":[],"urlList":[]}}