{"title":"DC Universe 52 Week 130 (darkhomr) [TPB]","uid":9638418,"size":650199521,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:59fd2de694738018c3c9537c1acba84c55e2c599&amp;dn=DC+Universe+52+Week+130+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":13,"time":1392872179,"description":"Welcome to the 2014 version of DC Universe 52.  Each week I will bring you the currrent weeks' comics fresh from the depths of your local comic shop.  This week is week 130 (February 19th) and includes 12 issues.  Join me on this journey, won't you?\n\nBefore uploading these, I am opening them with ComicRack, and made sure they all opened there. If there are problems please let me know. As usual, these are not my scans. Thanks to the original scanners and uppers. If you like what you got here, please purchase them in some form. If this torrent has no seeds please msg me privately. I will be glad to reup anything that has no seeds. It is my policy to not publish my weekly packs unless they are complete, but no later than Friday morning. If you have questions or requests, please message me privately. All descriptions are from DC and taken from Comiclist.\n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nStarhome Scanners (Scans and edits from the members of the Starhome group)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\nBreaking news:   Bleeding cool as well as April solicits confirm that there are six cancellations.  Gone in April are JLoA, Teen Titans, Stormwatch, Suicide Squad, Nightwing and Superman Unchained.  Replacing them will be Sinsetro, Aquaman and the Others, Batman Eternal, Secret Origins,and Justice League United.  Enjoy.\n\n\nAnimal Man #28 (CBR 2/19/2014)\n\n&quot;Evolve or Die!&quot; concludes as Animal Man marshals every last bit of power he has to protect his daughter from Brother Blood! But will it be enough to save Maxine and the Red--or will Buddy lose another child? \n\nBatman And Two Face #28 (CBR 2/19/2014)\n\n&quot;The Big Burn&quot; concludes! In the final showdown, Batman, Two-Face and Erin McKillen fight for their lives against Gotham City's united Mafiosi! \n\nBatwoman #28 (CBR 2/19/2014)\n\nAs Batwoman reels from Maggie's surprising revelation last issue, the two must work together to discover the secret of the Wolf Spider. Who hired him and what are his deadly plans for Gotham? \n\nBirds Of Prey #28 (CBR 2/19/2014) \n\nWelcome to Gothtopia! Die happy! Black Canary confronts Ra's al Ghul--who makes her an offer that could save her husband! Is she willing to pay the ultimate price? \n\nGreen Lantern New Guardians #28 (CBR 2/19/2014)\n\nThe fiery religion of the goddess X'Hal has brought peace to a star system that has only known conflict! Could this be the galactic paradise that Kyle Rayner and the New Guardians have been searching for? If it is, it won't last long--because the mysterious beings known as The God-Killers have X'Hal--and Kyle--in their sights! \n\nHarley Quinn #3 (CBR 2/19/2014)\n\nIt's Valentine's Day, and Harley is getting depressed watching happy couples walk by. Will a special gift from Poison Ivy turn things around for Harley? \n\nJustice League #28 (CBR 2/19/2014)\n\n&quot;FOREVER EVIL&quot; continues! With the Justice League gone, new heroes continue to rise up throughout the DC Universe! The Crime Syndicate tried to kill him, but now Cyborg is back to settle the score -- and with him are The Metal Men!\n\nRed Hood And The Outlaws #28 (CBR 2/19/2014)\n\nThe Outlaws head off for a well-earned rest as Jason tries to rekindle his romance with Isabelle--but they are soon fighting for their lives against a new cartel! \n\nSupergirl #28 (CBR 2/19/2014)\n\nA RED LANTERN RING is coming to get Kara--and it will change her forever! No lie! Not an imaginary story! It's really going to happen! &quot;Red Daughter of Krypton&quot; starts here! \n\nTrinity of Sin Pandora #8 (CBR 2/19/2014)\n\nForever Evil: Blight - Part 13 of 18 Pandora and The Justice League Dark race to save the world's mystics from The Crime Syndicate! Continues in JUSTICE LEAGUE DARK #28! \n\nWonder Woman #28 (CBR 2/19/2014)\n\nThe last time the First Born came for Olympus, it took the death of the God of War to stop him. And if Wonder Woman is now the God of War . . . and if the First Born is more determined than ever to claim his birthright . . . then things are about to get VERY violent indeed! \n\n\n\n\n \n\n\n\n","torrent":{"xt":"urn:btih:59fd2de694738018c3c9537c1acba84c55e2c599","amp;dn":"DC+Universe+52+Week+130+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59fd2de694738018c3c9537c1acba84c55e2c599","infoHashBuffer":{"type":"Buffer","data":[89,253,45,230,148,115,128,24,195,201,83,124,26,203,168,76,85,226,197,153]},"announce":[],"urlList":[]}}