{"title":"FlyJsim Dash 8 Q400","uid":9966095,"size":305591578,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a401dfb1cb03092f009be1efcae5438614a509c&amp;dn=FlyJsim+Dash+8+Q400&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dienadel28","files":1,"time":1397571713,"description":"The Dash 8 Q400 is a high performance twin-engine turboprop airliner produced by Bombardier Aerospace.The Q400 series is the most recent variant and can carry up to 78 passengers. This version produced by FlyJSim is suitable for both novice and experienced X-Plane users. It includes many advanced systems that will make your flight experience enjoyable for months to come whether you are looking for a short flight or an extended route simulation.\n \nAccurate Flight Characteristics: Created from over 60 hours of flight tests with information from real world data and backed by actual Q400 pilots.\nDetailed Exterior Model: Created using thousands of images and references. Everything from the airfoils used on the wings to actual tire sizes modeled with detail in mind. Includes a full set of high resolution textures including normal maps, specular maps, and night lighting.\nHighly Accurate 3D Cockpit: Fly Happy knowing what you are looking at really is to scale. 3D cockpit modeled of thousands of measurements taken from our real world Q400 pilots. Textures created from thousands of images taken of the interior.\nHigh Resolution EFIS Displays: Fly looking at just what real Q400s look at, and in detail. Each display has a resolution of 512x691, which wont leave you guessing what your altimeter setting is cause you cant read it.\nDetailed Interior &amp; Exterior Night Light: Flying at night wont be a nuisance anymore. Be able to see the plane at night along with strobe and beacon lights that light up the fuselage. Cockpit lighting as well allows you to still see everything and enjoy flying in the dark.\nCustom Sounds: Hear what the real Q400 sounds like. We have recorded real world Q400 sounds, including cockpit call-outs. The sounds alone add so much to the experience.\nPlugin enhanced: We use plugins to add more systems and features that would otherwise be impossible to be implemented if left to use the default X-Plane logic\nLoad &amp; Balance Manager: A first in X-Plane, the Load &amp; Balance Manager is a pop up screen which allows you to change the load-out and balance in real time. Pick from thousands of combinations of seating arrangement, cargo hold weights, and fuel amounts. See the Center of Gravity change as you load the aircraft differently and burn fuel in flight.\nMany Liveries available: The package comes with 12+ liveries. Many more available online.\n &lt;a href=&quot;\nhttp://www.flyjsim.com/index.php?option=com_k2&amp;view=item&amp;id=28:dash-8-q400&amp;Itemid=2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flyjsim.com/index.php?option=com_k2&amp;view=item&amp;id=28:dash-8-q400&amp;Itemid=2&lt;/a&gt;\n\nCompatible with PC, Mac and Linux","torrent":{"xt":"urn:btih:5a401dfb1cb03092f009be1efcae5438614a509c","amp;dn":"FlyJsim+Dash+8+Q400","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a401dfb1cb03092f009be1efcae5438614a509c","infoHashBuffer":{"type":"Buffer","data":[90,64,29,251,28,176,48,146,240,9,190,30,252,174,84,56,97,74,80,156]},"announce":[],"urlList":[]}}