{"title":"Enemy Infestation","uid":7300091,"size":647917568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a86cf52257b64ab4971b975347137626ab7447f&amp;dn=Enemy+Infestation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"genjutsu01","files":1,"time":1338003975,"description":"All the torrents available for this are either very few in number, fake or buggy. I have managed to discover a fix for this game. The main issue with all other torrents is that when the game clock hits 10 minutes of gameplay exactly, all of your characters die for no reason, this seems to be a very old technique to stop pirates. In order to play the game and not experience this bug, perform the following instructions to the letter.\n\n1. Extract the 'EI' game files folder from the ISO.\n\n2. Within the EI folder open the file 'EI.cfg' with notepad.\n\n3. Go to the part that says 'cdDir = ?:EI' change the '?' to the drive letter you are going to mount the ISO to and save the file.\n\n4. Mount the ISO to the drive which letter matches the one you put in the config file.\n\n5. Run 'EI.exe' from the folder you initially extracted.\n\n6. Play the game.\n\nThe instructions must be followed exactly otherwise you will fall victim to your characters automatically dying after 10 minutes. The only downfall of this is that the ISO must always be mounted while you play, and must be mounted to the drive letter that you specified. I did not create the files within this torrent and I did not come up with the fix, I have just uploaded this here as this is a great and memorable game that I am sure people will be very happy to play again as it is impossible to find.\n\nEnjoy.","torrent":{"xt":"urn:btih:5a86cf52257b64ab4971b975347137626ab7447f","amp;dn":"Enemy+Infestation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a86cf52257b64ab4971b975347137626ab7447f","infoHashBuffer":{"type":"Buffer","data":[90,134,207,82,37,123,100,171,73,113,185,117,52,113,55,98,106,183,68,127]},"announce":[],"urlList":[]}}