{"title":"Richard of St. Victor: The Twelve Patriarchs (Classics of Wester","uid":10902275,"size":3736150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a9c9ba36451e11c70a41c2b6828feb27e83db5b&amp;dn=Richard+of+St.+Victor%3A+The+Twelve+Patriarchs+%28Classics+of+Wester&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pharmakate","files":-1,"time":1409200461,"description":"Grover A. Zinn (trans. &amp; intro), Jean Chatillon (preface) - Richard of St. Victor: The Twelve Patriarchs, The Mystical Ark, Book Three of the Trinity (Paulist Press, 1979). Classics of Western Spirituality series. 425 pp.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\ndescription:\n\nOne of the great mystics of the Christian Tradition, Richard is the link between the early tradition of Pseudo-Dionysius and the great mystical awakening in Medieval Europe. For his genius in bringing together both the Latin and Greek Traditions all contemplatives owe him a great debt. Born in twelfth century Scotland, he joined the Abbey of St. Victor in Paris where he became Superior and Prior.\n\nThe Twelve Patriarchs (or Benjamin Minor) is his preparation of the soul for contemplation. The framework is a scriptural allegory based on the story of Jacob. Richard uses the meaning of the names and the elements of the story to illustrate a unified view of the person and the relationship between contemplation and action. His Mystical Ark ( or Benjamin Major) completes this study.\n\nIn his Book Three of the Trinity we see Richard's doctrinal basis for the spiritual conclusions of his earlier work. Richard can teach us about the discipline and the dangers of the mystical quest. He can enlighten us concerning the relevance of symbols and symbolic structures as modes of communication.\n\nJean Chatillon, of the University of Paris, who wrote the preface, is the world's major Victorine scholar.","torrent":{"xt":"urn:btih:5a9c9ba36451e11c70a41c2b6828feb27e83db5b","amp;dn":"Richard+of+St.+Victor%3A+The+Twelve+Patriarchs+%28Classics+of+Wester","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a9c9ba36451e11c70a41c2b6828feb27e83db5b","infoHashBuffer":{"type":"Buffer","data":[90,156,155,163,100,81,225,28,112,164,28,43,104,40,254,178,126,131,219,91]},"announce":[],"urlList":[]}}