{"title":"The Order of Things by Barbara Ann Kipfer","uid":9625849,"size":24686202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b0c2e7b88c2e0677f057fcaf5bca052f97f69f1&amp;dn=The+Order+of+Things+by+Barbara+Ann+Kipfer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1392590691,"description":"\nUtterly compelling!\nBarbara Ann Kipfer has elevated the list to high art and bestselling pleasure. A foremost expert of classification, in The Order of Things, she does for life what her previous books do for happiness and wisdomorganize it in a way that is brilliantly conceived.\n\nThe The Order of Things is practical, entertaining, eclectic, and impossible to put down. Beginning with EarthSmog Alert States, Rain Forest Layers, Coal Sizes and ending with General Knowledge and Philosophy (the I Ching's 64 &quot;chapters,&quot; Ludwig Wittgenstein's four-step Method of Overcoming Puzzlement), it is a 14-chapter taxonomy of the world as we know it:\n\nThe Seven Hills of Rome, the Seven Deadly Sins, the Seven Wonders of the Ancient World, the Seven Dwarfscheck.\nThe belt degrees of karate and judo, weight classes of professional and amateur boxing, flower names of the golf holes at Augustacheck.\n\nThe hierarchy of the FBI, publication order of Shakespeare's plays, cuts of beef, Freud's divisions of the human psyche, order of rank in world armies and navies, Jupiter's satellites, ships' bells, traditional and modern wine measures, blood-pressure levels, fastest animalscheck.\nA completely indispensable referencecheck.\n\nGenre: Non Fiction , Science","torrent":{"xt":"urn:btih:5b0c2e7b88c2e0677f057fcaf5bca052f97f69f1","amp;dn":"The+Order+of+Things+by+Barbara+Ann+Kipfer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b0c2e7b88c2e0677f057fcaf5bca052f97f69f1","infoHashBuffer":{"type":"Buffer","data":[91,12,46,123,136,194,224,103,127,5,127,202,245,188,160,82,249,127,105,241]},"announce":[],"urlList":[]}}