{"title":"[FSX/P3D] CaptainSim Lockheed L-1011 TriStar v1.03","uid":15700493,"size":1658716866,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5b19b54718efe89c25ae3f3714c9a7dd3dccd693&amp;dn=%5BFSX%2FP3D%5D+CaptainSim+Lockheed+L-1011+TriStar+v1.03&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":16,"uploader":"Lugburz","files":1,"time":1472473510,"description":"With currently no other torrent of the CaptainSim Lockheed L-1011 TriStar, here it is.\r\n\r\n\r\n1) To install, drag TriStar.exe onto jf_loader.exe (will ask to run as Administrator).\r\nImmediately after selecting the installer language, copy the Updates/Crack/AccountX.dll&quot; file. Then, open with Windows Explorer &quot;%TEMP%&quot; (write in the &quot;address box of Windows Explorer &quot;%TEMP%&quot;, without the quotation marks, and with the percentage signs).\r\n\r\n2) Sort the files in the Temp folder according to Date Modified (descending), and scroll to the first folder (the folder appear separately, below the normal files). It should have a random GUID as a name. Make sure that the Date Modified is indeed matching the time in which you're installing the plane, and if it is, open the folder. There will be one subfolder inside it.\r\nPaste the DLL you previously copied from the &quot;Updates/Crack&quot; folder inside the subfolder you just opened, and allow it to overwrite.\r\n\r\n3) Proceed and complete the installation.\r\n\r\n\r\n4) Then, open the Updates folder, run &quot;Install_Tristar_Pro_up_103.exe&quot;, select the installer language, and after the Installer initializes, do the same thing you did before - copy the DLL, paste in the temporary new folder with the GUID, and so on.\r\n\r\n5) After you do so, select the first Radio Button (labeled &quot;Download Version from Just Flight (may require login).\r\n\r\n6) Type anything as an Email and password in the Login form that appears. It will NOT let you proceed in the installation, and tell you that the password or Email are wrong.\r\n\r\n7) Close the update installer (let it terminate), and then reopen it, select language and the first Radio Button, and the Login form shouldn't appear, but rather a window asking you what Flight Simulator you're trying to install the plane on. If you get the Login form again, repeat steps 4, 5, and 6.\r\n\r\nAfter 2-3 repetitions, the Update must work","torrent":{"xt":"urn:btih:5b19b54718efe89c25ae3f3714c9a7dd3dccd693","amp;dn":"%5BFSX%2FP3D%5D+CaptainSim+Lockheed+L-1011+TriStar+v1.03","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b19b54718efe89c25ae3f3714c9a7dd3dccd693","infoHashBuffer":{"type":"Buffer","data":[91,25,181,71,24,239,232,156,37,174,63,55,20,201,167,221,61,204,214,147]},"announce":[],"urlList":[]}}