{"title":"Becoming Evil: How Ordinary People Commit Genocide and Mass Kill","uid":8642566,"size":82592922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b1b8530a69c999578da66c2f3f17788eb02243e&amp;dn=Becoming+Evil%3A+How+Ordinary+People+Commit+Genocide+and+Mass+Kill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1372903763,"description":"Publication Date: March 22, 2007 | ISBN-10: 0195314565 | ISBN-13: 978-0195314564 | Edition: 2\n\n\nThe first edition of Becoming Evil spoke unforgettably to a world shell-shocked by 9/11 that faced a new war on terror against members of an Axis of Evil. With this second edition, James Waller brings us up to date on some of the horrific events he used in the first edition to illustrate his theory of extraordinary human evil, particularly those from the perennially troubled Balkans and Africa, pointing out steps taken both forward and back. Nearly a third of the references are new, reflecting the rapid pace of scholarship in Holocaust and genocide studies, and the issue of gender now occupies a prominent place in the discussion of the social construction of cruelty. Waller also offers a reconfigured explanatory model of evil to acknowledge that human behavior is multiply influenced, and that any answer to the question &quot;Why did that person act as he or she did?&quot; can be examined at two levels of analysis-- the proximate and the ultimate. Bookended by a powerful new foreword from Greg Stanton, vice-president of the International Association of Genocide Scholars, and a devastating postscript that addresses current outbreaks of genocide and mass killing, this new edition demonstrates that genocide is a problem whose time has not yet passed, but Waller's clear vision gives hope that at least we can begin to understand how ordinary people are recruited into the process of destruction.\n\nReview\n\n&quot;...offers a psychological explanation as to why some human beings are so deliberately harmful to others...A fascinating glimpse of evolutionary psychology is presented... an eyewitness account of inhumanity.&quot;--Journal of American Medicine Association\n\n\nAbout the Author\nJames E. Waller is a Professor and Chair in the Psychology Department at Whitworth College. \n\nPaperback: 384 pages\nPublisher: Oxford University Press, USA; 2 edition (March 22, 2007)\nLanguage: English\nISBN-10: 0195314565\nISBN-13: 978-0195314564\n &lt;a href=&quot;\nhttp://www.amazon.com/Becoming-Evil-Ordinary-Genocide-Killing/dp/0195314565/ref=sr_1_1?ie=UTF8&amp;qid=1372896139&amp;sr=8-1&amp;keywords=becoming+evil&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Becoming-Evil-Ordinary-Genocide-Killing/dp/0195314565/ref=sr_1_1?ie=UTF8&amp;qid=1372896139&amp;sr=8-1&amp;keywords=becoming+evil&lt;/a&gt;","torrent":{"xt":"urn:btih:5b1b8530a69c999578da66c2f3f17788eb02243e","amp;dn":"Becoming+Evil%3A+How+Ordinary+People+Commit+Genocide+and+Mass+Kill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b1b8530a69c999578da66c2f3f17788eb02243e","infoHashBuffer":{"type":"Buffer","data":[91,27,133,48,166,156,153,149,120,218,102,194,243,241,119,136,235,2,36,62]},"announce":[],"urlList":[]}}