{"title":"MIRC v7.29 Incl Crack [TorDigger]","uid":8030976,"size":3039149,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5b3035509fd4b4d2c5ee439baa409ff26544021f&amp;dn=MIRC+v7.29+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":11,"time":1358415187,"description":"mIRC\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies. \n\nChanges:\n\nmIRC 7.29 has been released! (January 16th 2013) \nThis is a small update that addresses a number of issues reported by users since the last release. It includes improvements, changes and fixes to a number of features, including:\nSSL certificate hashes are now stored in the servers.ini file for all certificates and a warning is displayed if a certificate has changed since the last connection.\n\nAn issue with the /help command not displaying the correct location of a search term has been fixed.\n\nThe /run command has been changed to improve backward compatibility with older scripts.\n\nThe way the Escape key works has been changed so that it clears the contents of the current editbox if the &quot;Escape key minimizes window&quot; option is not enabled.\n\nA /hotlink bug that prevented hotlink popup menus from being displayed has been fixed.\n\nThe maximized window position is now saved correctly when the &quot;on startup minimize mIRC to tray&quot; option is enabled.\n\nUrls in your own messages are now once again saved to the urls list.\n\nAn issue with the &quot;Hide tips when locked&quot; option, that caused tips to flicker briefly in view, has been fixed.\n\nThe editbox buffer feature has been improved and should now work more reliably in different contexts.\n\nThe /vol -v command now correctly sets the master volume on newer versions of Windows.\n\nOther changes and bug fixes.\nIn total there have been around 21 changes to this version and although most of them are only small fixes and tweaks, we hope that they result in a more useful and stable mIRC for you.\n\nSupported OS:\n\nWindows 2000/XP/Vista/7/8 \n\nNot compatible with Windows 95/98/ME/NT\n\nHomepage: http://www.mirc.com/\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Run &quot;Regme&quot; and merge it to registry.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:5b3035509fd4b4d2c5ee439baa409ff26544021f","amp;dn":"MIRC+v7.29+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b3035509fd4b4d2c5ee439baa409ff26544021f","infoHashBuffer":{"type":"Buffer","data":[91,48,53,80,159,212,180,210,197,238,67,155,170,64,159,242,101,68,2,31]},"announce":[],"urlList":[]}}