{"title":"Jim Henson Hour: Monster Maker (LD to DVD)","uid":8837144,"size":4127695068,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5babba6553f202d330e647a782ea2158cbe16fbf&amp;dn=Jim+Henson+Hour%3A+Monster+Maker+%28LD+to+DVD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":29,"time":1377150048,"description":"Monster Maker is a 45-minute television special, adapted by Matthew Jacobs from the \nnovel of the same name by Nicholas Fisk. From Jim Henson's London-based Henson \nAssociates, it was produced by Duncan Kenworthy and directed by Giles Foster.\n\nTeenager Matt Banting (Kieran O'Brien)'s greatest dream is to work with a famous \nbut eccentric special effects and creature creator named Chancey Bellows (Harry \nDean Stanton). Matt gets more than he bargained for when one of the creatures, the \ngiant dragon-like Ultragorgon (Michael Gambon), takes Matt under his wing. Matt is \nforced to confront his inner monsters while working out his issues with his father.\n\nBrian Henson makes a cameo performing the slerks.\n\nThis is a transfer of the rare Japanese laserdisc of Monster Maker, with the \noriginal English audio added back from several sources, and one shot (of a credit \ncard) restored from the English version.\n\nNotably, this is the &quot;Jim Henson Hour&quot; version of Monster Maker, with an \nintroduction and outro by Jim Henson and his friends, as aired on NBC in 1989.\n\nBehind the scenes footage is also included, including a shortened (4-minute) edit \nof a 1991 ITV Docurama special, &quot;Hands up for More.&quot;\n\nArguably, The Jim Henson Hour showed the Muppet team at their creative peak, with \nremarkable live-action fantasy like The Storyteller sharing space with Kermit and \nthe Muppet gang. However, the series failed in the ratings and was quickly \ncancelled. Although certain Jim Henson projects from this era have made it to DVD \nor VHS [The Storyteller, Song of the Cloud Forest, Monster Maker, Miss Piggy's \nHollywood], no complete and uncut Jim Henson Hour episode has ever been released on \nDVD or any other format - with two known exceptions.\n\nKSS Films in Japan released a very rare laserdisc of Jim Henson's Dog City, which \nwas dubbed in Japanese but otherwise contained the full Jim Henson Hour episode, \nincluding ten minutes with Kermit and company.\n\nKSS Films also released the Jim Henson Hour version of Monster Maker, and with only \none shot substituted, that's what you see here.\n\nMonster Maker (minus Jim Henson's introductions) is available in better quality on \nNetflix. However, we were unable to capture this version with a satisfactory or \nsensible frame rate. There were all sorts of playback issues and vertical frame \ntearing. We decided to preserve this laserdisc instead.\n\nThe laserdisc, and perhaps the Netflix version, could be improved in quality by \nsomeone who is very good with filtering in AviSynth, VirtualDub and so on. But this \nwill do for now.\n\nSo here we are then. The Jim Henson Hour: Monster Maker.\n\nHarry Dean Stanton as Chancey Bellow\nKieran O'Brien as Matt Banting\nGeorge Costigan as Father\nAmanda Dickinson as Mother\nAlison Steadman as Perriwinkle\nGrant Bardsley as Ben\nBill Moody as Reg\nMatthew Scurfield as Vaughn\nJonathan Coy as Teacher\nMichael Gambon as Ultragorgon (voice)\n\nUltragorgon operated by Martin Anthony, Tony Ashton, Michael Bayliss, Marcus \nClarke, Sue Dacre, David Greenaway, Brian Henson, and Christopher Leith \n","torrent":{"xt":"urn:btih:5babba6553f202d330e647a782ea2158cbe16fbf","amp;dn":"Jim+Henson+Hour%3A+Monster+Maker+%28LD+to+DVD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5babba6553f202d330e647a782ea2158cbe16fbf","infoHashBuffer":{"type":"Buffer","data":[91,171,186,101,83,242,2,211,48,230,71,167,130,234,33,88,203,225,111,191]},"announce":[],"urlList":[]}}