{"title":"[ScoreLand] Kelly Christiansen (SCOREtv Uncut, Uncensored / 2634","uid":8175382,"size":445867471,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5d185e9232902cff18726bbe77ff3b820c8eb0dd&amp;dn=%5BScoreLand%5D+Kelly+Christiansen+%28SCOREtv+Uncut%2C+Uncensored+%2F+2634&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"chkm8te","files":1,"time":1361520028,"description":"[ScoreLand] Kelly Christiansen (SCOREtv Uncut, Uncensored / 26343 / 02.21.2013)\n\nIt was very kind of Juan to try to hook Kelly Christiansen's microphone to her tube-top before her appearance on SCOREtv. As a stagehand, he's barely adequate. While host Dave patiently waits, Juan manages to pull down Kelly's top and expose her wide, world-class areolae in the &quot;green room&quot; where the guests wait. &quot;Don't be shy,&quot; Kelly tells him. &quot;You can touch.&quot; She's just given him a pass to forget about the microphone and concentrate on her fantastic, stacked body, the definition of the term &quot;brick house.&quot; Touching leads to nipple sucking and then to both of them getting naked and fucking on the couch.\n\nKelly kneels while Juan sits back. Observe her excellent technique. She grips his nuts with one hand while holding his cock with the other and licks and sucks it like an ice cream cone. She's playing it like a musical instrument as she stares at him. Now that's true bagpipe playing.\n\nThen comes the laying of the tits upon his pole. Still kneeling, Kelly holds her big boobs with both hands and massages his dick, bring then up and down, the pole squished in her cleavage. Wow! Is she great at this! Practice makes perfect. Kelly ramps up the speed and motion, laughing as she does. She's enjoying it too.\n\nThe clock is running. The show is about to start in the studio. Kelly gets on top of him in reverse cowgirl position and begins riding and grinding. His long horn fills her pussy to the brim. Her breathing speeds up and she pumps up and down, tall in the saddle as her saddle tramp partner pistons back. And that's just the first position. There's a few more they're going to practice.\n\nMeanwhile, SCOREtv host Dave awaits Kelly's entrance. He's anxious to get the show started. In the future, it might be better to have female stagehands help the guests with their microphones.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7h0bjomcpn4qnsp0lucq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7h0bjomcpn4qnsp0lucq.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=uh8vtb0mee58xzuknx23.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=uh8vtb0mee58xzuknx23.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5d185e9232902cff18726bbe77ff3b820c8eb0dd","amp;dn":"%5BScoreLand%5D+Kelly+Christiansen+%28SCOREtv+Uncut%2C+Uncensored+%2F+2634","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d185e9232902cff18726bbe77ff3b820c8eb0dd","infoHashBuffer":{"type":"Buffer","data":[93,24,94,146,50,144,44,255,24,114,107,190,119,255,59,130,12,142,176,221]},"announce":[],"urlList":[]}}