{"title":"Secret Society (suppressed BBC series) (Duncan Campbell) (1987)","uid":4339957,"size":1072501230,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5d36be43e07fe880a3c4ee7efa881248820a7729&amp;dn=Secret+Society+%28suppressed+BBC+series%29+%28Duncan+Campbell%29+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":4,"time":1218539844,"description":"This is Duncan Campbell&amp;#039;s shocking BBC video documentary series Secret Society (1987) which shows the never broadcasted episodes on secret groups, committees and societies that operate silently within British government. The first episode about secret cabinet committees features author Peter Hennessy, Clive Ponting and MP Clement Freud amongst others. In this freedom of information tour de force Campbell exposes the secret decision to buy U.S. Trident nuclear submarines as well as laying bare the cabinet level dirty tricks campaign against CND and its general secretary Bruce Kent. Margaret Thatcher, James Callaghan, the British Atlantic Committee, The ultra-right Coalition for Peace Through Security and the cabinet secretary come in for sharp criticism for keeping key decisions secret from MP&amp;#039;s. The series consists of the following 6 programmes: 1. The Secret Constitution: Secret Cabinet Committees; 2. We&amp;#039;re All Data Now: Secret Data Banks; 3. In Time Of Crisis: Government Emergency Powers; 4. The Association of Chief Police Officers (ACPO): making up their own law and policy; 5. A Gap In Our Defences - about bungling defence manufacturers and incompetent military planners who have botched every new radar system that Britain has installed since World War II; 6. Zircon - about GCHQ with particular reference to a secret 500 million satellite. Missing are last two (5 and 6) programmes. His support for this series was one of the key reasons BBC Director General, Alasdair Milne (who was replaced by Michael Checkland, an accountant) was sacked. This Journalistic Coup d&amp;#039;Etat was conducted by Lord Victor Rothschild, Prime Minister Margaret Thatcher and Marmaduke Hussey in 1986. The BBC&amp;#039;s independence has been under sustained assault ever since. Secret Society was suppressed from high above since it was simply too controversial as it openly exposed various secret groups operating invisibly inside British government. They made damn sure noone would ever discover them but they were very wrong. Find out who they are and what are they doing without your knowledge. Each cca 30 min. long, total cca 2 hours. A must see for everyone.\n\nVideo specs:\nVideo codec: divx, 640x480, 1200 bps\nAudio codec: mp3, 22kHz, Stereo\n","torrent":{"xt":"urn:btih:5d36be43e07fe880a3c4ee7efa881248820a7729","amp;dn":"Secret+Society+%28suppressed+BBC+series%29+%28Duncan+Campbell%29+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d36be43e07fe880a3c4ee7efa881248820a7729","infoHashBuffer":{"type":"Buffer","data":[93,54,190,67,224,127,232,128,163,196,238,126,250,136,18,72,130,10,119,41]},"announce":[],"urlList":[]}}