{"title":"How To Be A Great Lover","uid":5146378,"size":2176665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d723edeb1db99f3f65f22c83208e2d21f9f3a72&amp;dn=How+To+Be+A+Great+Lover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ProDvDRipper","files":2,"time":1257278390,"description":"Lover's Guide - How To Be A Great Lover\nPublisher: Broadway | ISBN: 0767902874 | edition 1999 | PDF | 118 pages | 1.93 MB\n\nSex should be &quot;an experience to be relished from beginning to end,&quot; says Lou Paget in How to Be a Great Lover: Girlfriend-to-Girlfriend Totally Explicit Techniques That Will Blow His Mind. Paget (a woman) aims &quot;to empower you as a woman, heighten the intimacy of your romantic relationship, and enable you and your partner to enjoy yourselves in intense new ways.&quot; She lives up to that promise with this friendly, titillating, educational, and explicit guide to enlivening your sex life and keeping your man coming back for more. Is he a bad kisser? Learn an easy strategy to get him to kiss you just the way you like it. Does he object to using a condom? Use your mouth to put it on him (a six-step process, complete with illustrations). You'll find information you might not find anywhere else, such as dozens of explicit manual and oral techniques (many illustrated) that will drive him crazy, a comparison of different brands of lubricant for different uses (along with sexy ways to apply it), techniques for anal stimulation, and a guide to sex toys. This book is fun to read, and will certainly open up the sensuality in your relationship...","torrent":{"xt":"urn:btih:5d723edeb1db99f3f65f22c83208e2d21f9f3a72","amp;dn":"How+To+Be+A+Great+Lover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d723edeb1db99f3f65f22c83208e2d21f9f3a72","infoHashBuffer":{"type":"Buffer","data":[93,114,62,222,177,219,153,243,246,95,34,200,50,8,226,210,31,159,58,114]},"announce":[],"urlList":[]}}