{"title":"Depeche Mode - Songs Of Faith And Devotion (1993)[FLAC]","uid":3271659,"size":307768647,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5d775a3ddb504af6ac071e8fd6a331ae420585ae&amp;dn=Depeche+Mode+-+Songs+Of+Faith+And+Devotion+%281993%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Flaccube","files":17,"time":1104665214,"description":"I recently decided to stop seeding this and all other albums due to the fact that Piratebay users simply don't seed or care about ratios at all. I will make another try in maybe a month from now at best with a new album. I'm sorry, but the only one you can blame is probably yourself.\n\n\n\n\n\nToday I seed the fourth out of 7 (9 albums, fixed 2 more) Depeche Mode albums I currently have as Flac. For the upcoming week there'll be one new Depeche album every day. So stay tuned =)\n\nNote that FLAC is NOT a lossy format such as Mp3s which might injur your HiFi equipment badly. FLAC is nothing but the best and without all the DRM enabled crap Apple and Microsoft push out these days.\n\nIf you don't know about FLAC or why it is the future, head over to http://flac.sf.net and get convinced yourself.\n_____________________\nDepeche Mode - Songs Of Faith And Devotion (1993)\n\n\nTracklist\n\n01. I Feel You    [0:04:35.46]\n02. Walking In My Shoes    [0:05:35.06]\n03. Condemnation    [0:03:20.42]\n04. Mercy In You    [0:04:17.90]\n05. Judas    [0:05:14.36]\n06. In Your Room    [0:06:26.84]\n07. Get Right With Me    [0:03:52.89]\n08. Rush    [0:04:37.60]\n09. One Caress    [0:03:32.86]\n10. Higher Love    [0:05:56.90]\n\n\nAMG Review by Ned Raggett\n\nIn between Violator and Songs of Faith &amp;amp; Devotion, a lot happened: Nirvana rewrote the ideas of what &amp;quot;alternative&amp;quot; was supposed to be, while Nine Inch Nails, hit the airwaves as the most clearly Depeche-influenced new hit band around. In the meantime, the band went through some high-profile arguing as Gahan turned into a long-haired, leather-clad rocker and pushed for a more guitar-oriented sound. Yet the odd thing about Songs of Faith &amp;amp; Devotion is that it sounds pretty much like a Depeche Mode album, only with some new sonic tricks courtesy of Alan Wilder and co-producer Flood. Perhaps even odder is the fact that it works incredibly well all the same. &amp;quot;I Feel You,&amp;quot; opening with a screech of feedback, works its live drums well, but when the heavy synth bass kicks in with the wailing backing vocals, even most rockers might find it hard to compete. Gore's lyrical bent, as per the title, ponders relationships through distinctly religious imagery; while the gambit is hardly new, on songs like the centerpiece &amp;quot;In Your Room,&amp;quot; the combination of personal and spiritual love blends perfectly. Outside musicians appear for the first time, including female backing singers on a couple of tracks, most notably the gospel-flavored &amp;quot;Condemnation&amp;quot; and the uilleann pipes on &amp;quot;Judas,&amp;quot; providing a lovely intro to the underrated song (later covered by Tricky). &amp;quot;Rush&amp;quot; is the biggest misstep, a too obvious sign that Nine Inch Nails was a recording-session favorite to unwind to. But with other numbers such as &amp;quot;Walking in My Shoes&amp;quot; and &amp;quot;The Mercy in You&amp;quot; to recommend it, Songs of Faith &amp;amp; Devotion continues the Depeche Mode winning streak.\n\n\nExtraction Info\n\nExtracted: EAC\nUsed drive: Lite-on LTR-52327S   Adapter: 1  ID: 0\nRead mode: Secure with NO C2, accurate stream, disable cache\nRead offset correction: 6\nOverread into Lead-In and Lead-Out: Yes\n\nUsed output format: Internal WAV Routines\n                     44.100 Hz; 16 Bit; Stereo\n\nOther options:\n    Fill up missing offset samples with silence: No\n    Delete leading and trailing silent blocks: No\n    Native Win32 interface for Win NT &amp;amp; 2000\n\nConverted: Converted: flac - Command-line FLAC encoder/decoder version 1.1.0 Copyright (C) 2000,2001,2002,2003  Josh Coalson\n\nLog, FLAC and WAV cue and playlist, FLAC fingerprint\n\n\n******************************************** \n\nPlease remember to upload as much as you download\n\n\n...::BE FAIR AND SHARE::... \n\n********************************************\n\n","torrent":{"xt":"urn:btih:5d775a3ddb504af6ac071e8fd6a331ae420585ae","amp;dn":"Depeche+Mode+-+Songs+Of+Faith+And+Devotion+%281993%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d775a3ddb504af6ac071e8fd6a331ae420585ae","infoHashBuffer":{"type":"Buffer","data":[93,119,90,61,219,80,74,246,172,7,30,143,214,163,49,174,66,5,133,174]},"announce":[],"urlList":[]}}