{"title":"The Honeycombs - The Honeycombs (1964) [1990 Bonus Tracks]","uid":8632086,"size":320985602,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5dda8a514c47f5a9c7512cde3f8e026b79c13df1&amp;dn=The+Honeycombs+-+The+Honeycombs+%281964%29+%5B1990+Bonus+Tracks%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":33,"time":1372654547,"description":"This is the same torrent that was uploaded to Demonoid in October 2008.\n\n\nThe Honeycombs - The Honeycombs (1964) [1990]\n &lt;a href=&quot;\nhttp://www.rhis.co.uk/jmas/plus7honeycmbs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rhis.co.uk/jmas/plus7honeycmbs.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail).\nAll relevant artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nMostly renowned for their 1964 Top Five hit &quot;Have I the Right,&quot; the Honeycombs were pretty much a front for producer Joe Meek and the songwriting-management team of Ken Howard and Alan Blaikley. The group was originally called the Sherabons and was formed in Hackney during November of 1963 by Martin Murray. His day job was managing a hair salon, and when he formed the band, he brought along his assistant, Anne Margot Lantree, who was nicknamed &quot;Honey&quot; and used that on-stage -- she played drums and, with her good looks, was a double attention-getter. Her brother John joined on bass, and Alan Ward played lead guitar. And for a lead vocalist, they had Dennis D'Ell (born Denis Dalziel). Their original name was the Sherabons (some sources list it as the Sheratons) -- something Murray remembers seeing on the side of a van -- and they got a three-times weekly gig at a pub called the Mild May Tavern, on Balls Pond Road in London's East End, where they were lucky enough to be spotted by Alan Blaikley, who was attracted by the crowds of teenagers they drew. Visually, the group was highlighted by Lantree's presence at the drums, her good looks topped by a then-fashionable beehive hairdo. Rhythm guitarist and leader Murray also added to the appealing eccentricity of the band's look with his bespectacled presence -- to see him on the cover of their albums, one would think he was the group's accountant, but what made the picture even better was that he was a great player in his own right. At that time, their music consisted entirely of R&amp;B and rock &amp; roll standards interspersed with instrumentals. Blaikley liked their sound and had a song to offer them -- he and his business partner Ken Howard's had written a composition called &quot;Have I the Right&quot; and were looking for a group to record it, and this East End quintet seemed to fit the bill. ....\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:a9fqxqw5ldje~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:a9fqxqw5ldje~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nMost famed for their 1964 one-shot British Invasion hit &quot;Have I the Right&quot; and for being the first rock band of any renown to feature a female drummer, the Honeycombs recorded a surprising amount of material in the mid-'60s. Even for collectors, this definitely falls into the &quot;guilty pleasure&quot; category. Lead singer Dennis O'Dell's wobbly voice sounds like a speeded-up Gene Pitney, and the material, though peppy and catchy, is exceedingly trite and innocuous. The group's chief asset, actually, was producer Joe Meek, who found the band to be a perfect vehicle for his eccentric production techniques. Meek used compression to the point of squashing, and used all manners of odd vari-speed vocals, bee-stinging guitars, tinny keyboards, and echo to achieve a sound that was quite otherworldly by 1964 standards. Besides &quot;Have I the Right,&quot; this 1964 debut LP includes the British Top 20 hit &quot;That's the Way&quot; (featuring drummer Honey Lantree on vocals) and the ghostly ballads &quot;Without You It Is Night&quot; and &quot;This Too Shall Pass Away,&quot; though most of the rest of the material is slight. This 1990 reissue adds seven bonus tracks from non-LP singles, including a German recording of &quot;Have I the Right&quot; and the manic, irresistible &quot;I Can't Stop,&quot; which was a minor hit for the band in the U.S.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fifixq85ld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fifixq85ld0e&lt;/a&gt;\n\nTrack List:\n\n01. Color Slide\n02. Once You Know\n03. Without You It Is Night\n04. That's The Way\n05. I Want To Be Free\n06. How The Mighty Have Fallen\n07. Have I The Right\n08. Just A Face In The Crowd\n09. Nice While It Lasted\n10. Me From You\n11. Leslie Anne\n12. She's Too Way Out\n13. It Ain't Nesessarily So\n14. This Too Shall Pass Away\n15. Please Don't Pretend Again\n16. I'll Cry Tomorrow\n17. If You've Got To Pick A Baby\n18. I'll See You Tomorrow\n19. I Can't Stop\n20. Hab ich das Recht\n21. Du sollst nicht traurig sein\n","torrent":{"xt":"urn:btih:5dda8a514c47f5a9c7512cde3f8e026b79c13df1","amp;dn":"The+Honeycombs+-+The+Honeycombs+%281964%29+%5B1990+Bonus+Tracks%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dda8a514c47f5a9c7512cde3f8e026b79c13df1","infoHashBuffer":{"type":"Buffer","data":[93,218,138,81,76,71,245,169,199,81,44,222,63,142,2,107,121,193,61,241]},"announce":[],"urlList":[]}}