{"title":"Tomb sculpture - four lectures on its changing aspects from Anci","uid":11398892,"size":83154963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5df61d5ee1e366d2c427b755865567ac287c36ca&amp;dn=Tomb+sculpture+-+four+lectures+on+its+changing+aspects+from+Anci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1415401634,"description":"Pdf / English / 319 pages / 1964 / 79.3 MB / Erwin Panofsky \n\nErwin Panofsky was a German art historian, whose academic career was pursued almost entirely in the U.S. after the rise of the Nazi regime. In 1935, while teaching concurrently at New York University and Princeton University (something he continued to do his entire career), he was invited to join the faculty of the newly formed Institute for Advanced Study at Princeton. From 1947 to 1948 Panofsky was the Charles Eliot Norton professor at Harvard University. \n\nThis book presents a distinguished quartet of lectures by the late Erwin Panofsky, universally acknowledged as one of the twentieth century's leading interpreters of the meaning of works of art. In the text of these lectures Dr. Panofsky illuminates the world of tomb sculpture, an art form that has existed since the dawn of civilization, as its imagery expresses humankind's hopes and fears in the face of death, the striving for immortality. Many readers will need no introduction to the scholarship and humanism of Dr. Panofsky, who was Professor Emeritus at the Institute for Advanced Study, Princeton. The uninitiated will find in these lectures a marvelous blend of learning and entertainment, splendidly illustrated by 471 black-and-white photographs. The variety and beauty of these reproductions are themselves breathtaking.\nStarting with Egypt and pursuing the theme of funerary art through its fascinating cultural expressions - Greek, Roman, Early Christian, Romanesque, Gothic, Renaissance, to the great monuments of the Baroque - Tomb Sculpture reveals the many faces that memorials have taken. Each of these looks in some way familiar to us, however exotic its origin, for each one carried in its day a meaning that has never been absent in our lives. Dr. Panofsky's exploration of tomb sculpture through the ages, from many religions, countries, and cultures, enriches our understanding of these monuments in countless ways. With wisely chosen analogies from poetry, philosophy, and even music, he broadens our view as he brings nearer to us the common range of our human experience. Abrams is proud to reissue this classic volume, which has long been unavailable. It includes a new foreword by Professor Martin Warnke of Hamburg, a well-known art historian and co-founder of the magazine Idea","torrent":{"xt":"urn:btih:5df61d5ee1e366d2c427b755865567ac287c36ca","amp;dn":"Tomb+sculpture+-+four+lectures+on+its+changing+aspects+from+Anci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5df61d5ee1e366d2c427b755865567ac287c36ca","infoHashBuffer":{"type":"Buffer","data":[93,246,29,94,225,227,102,210,196,39,183,85,134,85,103,172,40,124,54,202]},"announce":[],"urlList":[]}}