{"title":"Bee Gees 24 Bit Vinyl Pack","uid":9046277,"size":30280496474,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e8092898e52eb7484f1d1ca068419b86c6bad0a&amp;dn=Bee+Gees+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":11,"uploader":"politux","files":-1,"time":1381760021,"description":"\n  Bee Gees 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Disco, Soft Rock\n  Source: vinyl \n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rates: 96,000 - 192,000 Hz\n\n  1967 1st\n  1968 Horizontal\n  1968 Idea\n  1969 Odessa\n  1970 Cucumber Castle \n  1970 2 Years On\n  1971 Trafalgar\n  1972 To Whom It May Concern\n  1974 Mr. Natural\n  1975 Main Course \n  1976 Children of the World\n  1979 Spirits Having Flown\n  1979 Greatest\n  1981 Living Eyes\n  1989 One\n  1991 High Civilization\n  1993 Size Isn't Everything\n  1987 You Win Again\n  1987 E.S.P. (two versions)\n  \n  No popular music act of the '60s, '70s, '80s, or '90s attracted a more varied audience than the Bee Gees. Beginning in the mid- to late '60s as a Beatlesque ensemble, they quickly developed as songwriters and singers to create a style of their own that carried them from psychedelia to progressive pop. Then, after hitting a popular trough, they reinvented themselves as perhaps the most successful white soul act of all time. What remained a constant throughout their history is their extraordinary singing, rooted in three voices that were appealing individually and melded together perfectly.\n\n  The group was also music's most successful brother act. Barry Gibb, born on September 1, 1946, in Manchester, England, and his fraternal twin brothers Robin Gibb and Maurice Gibb, born on December 22, 1949, on the Isle of Man, were three of five children. The three of them gravitated toward music, encouraged by their father, who saw his sons at first as a diminutive version of the Mills Brothers. The three Gibb brothers made their earliest performances at local movie theaters in Manchester in 1955, singing between shows. The family moved to Australia in 1958, resettling in Brisbane. Now known as the Brothers Gibb -- with Barry writing songs -- they attracted the attention of a local DJ, and eventually got their own local television show. It was around this time that they took on the name the Bee Gees (for Brothers Gibb). The trio was astoundingly popular in the press and on television, but actual hit records eluded them.\n\n  By late 1966, they'd decided to return to England -- which, thanks to the Beatles, was now the center of the world for rock and popular music. The group had sent demo recordings ahead of them, and &quot;Spicks &amp; Specks&quot; -- which became their first Australian hit while they were in mid-ocean -- had attracted the interest of manager Robert Stigwood. The trio was signed by Stigwood upon their arrival, and began shaping their sound in the environment of Swinging London. Barry and Robin Gibb alternated the lead vocal spot, harmonizing together and with Maurice. Barry played rhythm guitar, while Maurice played bass, piano, organ, and Mellotron, among other instruments. Their first English recording, &quot;New York Mining Disaster 1941,&quot; an original by the group with a haunting melody and a strangely surreal, almost psychedelic ambience, was released in mid-1967 and made the Top 20 in England and America. They had successful follow-ups with &quot;Holiday&quot; and &quot;To Love Somebody,&quot; the latter actually written for Otis Redding to record, and &quot;Massachusetts,&quot; which topped the U.K. charts.\n\n  After Bee Gees' 1st, the Gibb brothers took over producing their own records. It was easy, amid the sheer beauty of their recordings, to overlook the range of influences that went into their sound, which came from a multitude of sources, including American country music and soul music. At this point in their history, they were most comfortable deconstructing elements in the singing and harmonies of black American music and rebuilding them in their style.\n\n  In 1969, the trio split up in a dispute involving the Odessa album. A lushly orchestrated double LP, it was their most ambitious recording to date, but they were unable to agree on which song would be the single, and Robin walked out. Barry and Maurice held on to the Bee Gees name for one LP, Cucumber Castle, while Robin released Robin's Reign. Without a group to promote it, the Odessa album never sold the way it might have, even with a hit, &quot;First of May.&quot; Cucumber Castle generated several successful singles in England and Germany, including the gorgeous, African-influenced &quot;I.O.I.O.,&quot; while Robin had a hit with &quot;Saved by the Bell.&quot;\n\n  In 1970, almost two years older and a good deal wiser, they decided to get back together. They related to each other better and had also evolved musically, now creating a progressive pop/rock sound similar to the Moody Blues. They came back on a high note with two dazzling songs: the soulful &quot;Lonely Days,&quot; the group's first number one hit in America; and the achingly lyrical &quot;Morning of My Life,&quot; which proved so popular with fans that the group was still doing it in concert decades later.","torrent":{"xt":"urn:btih:5e8092898e52eb7484f1d1ca068419b86c6bad0a","amp;dn":"Bee+Gees+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8092898e52eb7484f1d1ca068419b86c6bad0a","infoHashBuffer":{"type":"Buffer","data":[94,128,146,137,142,82,235,116,132,241,209,202,6,132,25,184,108,107,173,10]},"announce":[],"urlList":[]}}