{"title":"Bones S05E22 720p HDTV X264-DIMENSION","uid":5577483,"size":1172894943,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:606b82064ea7b899aae77a0e71cb0f083ff6208a&amp;dn=Bones+S05E22+720p+HDTV+X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CHD242522","files":-1,"time":1274431334,"description":"Bones is an American drama television series that premiered on the Fox Network on September 13, 2005. The show is based on forensics and police procedurals in which each episode focuses on an FBI case file concerning the mystery behind human remains brought by FBI Special Agent Seeley Booth to the forensic anthropology team of Dr. Temperance &quot;Bones&quot; Brennan. Emily Deschanel stars in the title role, opposite David Boreanaz as Special Agent Seeley Booth. The rest of the cast includes Michaela Conlin, T. J. Thyne, Eric Millegan, Tamara Taylor and John Francis Daley. The series, created by Hart Hanson, is very loosely based on the life of forensic anthropologist Kathy Reichs, who is a producer on the show. Its title character, Dr. Temperance &quot;Bones&quot; Brennan is named after the protagonist of Reichs' crime novel series. Bones is a joint production by Josephson Entertainment, Far Field Productions and 20th Century Fox Television. The fourth season premiered on September 3, 2008 on Fox. In the UK, it aired on Sky1 on Thursdays, starting on September 25. The show was picked up for two more seasons, with the fifth season set to premiere September 17, 2009 on Fox. ","torrent":{"xt":"urn:btih:606b82064ea7b899aae77a0e71cb0f083ff6208a","amp;dn":"Bones+S05E22+720p+HDTV+X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"606b82064ea7b899aae77a0e71cb0f083ff6208a","infoHashBuffer":{"type":"Buffer","data":[96,107,130,6,78,167,184,153,170,231,122,14,113,203,15,8,63,246,32,138]},"announce":[],"urlList":[]}}