{"title":"Jerry Lee Lewis - The Killer's Private Stash (1991) [320]","uid":7260932,"size":77012825,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60a5ab88921a33702c932d474aa9b03c3ea6b8f7&amp;dn=Jerry+Lee+Lewis+-+The+Killer%27s+Private+Stash+%281991%29+%5B320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1336724428,"description":"\n\n\nJerry Lee Lewis\nThe Killer's Private Stash (1991)\n\n\n\n\nIs there an early rock &amp; roller who has a crazier reputation than the Killer, Jerry Lee Lewis? His exploits as a piano-thumping, egocentric wild man with an unquenchable thirst for living have become the fodder for numerous biographies, film documentaries, and a full-length Hollywood movie. Certainly few other artists came to the party with more ego and talent than he and lived to tell the tale. And certainly even fewer could successfully channel that energy into their music and prosper doing it as well as Jerry Lee. When he broke on the national scene in 1957 with his classic &quot;Whole Lotta Shakin' Goin' On,&quot; he was every parents' worst nightmare perfectly realized: a long, blonde-haired Southerner who played the piano and sang with uncontrolled fury and abandon, while simultaneously reveling in his own sexuality. He was rock &amp; roll's first great wild man and also rock &amp; roll's first great eclectic. Ignoring all manner of musical boundaries is something that has not only allowed his music to have wide variety, but to survive the fads and fashions as well. Whether singing a melancholy country ballad, a lowdown blues, or a blazing rocker, Lewis' wholesale commitment to the moment brings forth performances that are totally grounded in his personality and all singularly of one piece. Like the recordings of Hank Williams, Louis Armstrong, and few others, Jerry Lee's early recorded work is one of the most amazing collections of American music in existence.\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\nAudio-Info:\n\n\n01.I Don't Hurt Anymore\n02.If I Ever Needed You\n03.Lust Of The Blood\n04.Let A Soldier Drink\n05.My God Is Real\n06.Real Wild Child\n07.I'm Throwing Rice\n08.Crazy Arms\n09.Whole Lotta Shakin' Goin' On (Special X-Rated Version)\n10.I'm Using My Bible For A Road Map And I Long To See Jesus\n\n\n\n\n\n\n\n\n\n          \n\n\n\n\n            ****Enjoy &amp; Please Don't Forget To Seed. Thanks!****\n\n\n\n\n","torrent":{"xt":"urn:btih:60a5ab88921a33702c932d474aa9b03c3ea6b8f7","amp;dn":"Jerry+Lee+Lewis+-+The+Killer%27s+Private+Stash+%281991%29+%5B320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a5ab88921a33702c932d474aa9b03c3ea6b8f7","infoHashBuffer":{"type":"Buffer","data":[96,165,171,136,146,26,51,112,44,147,45,71,74,169,176,60,62,166,184,247]},"announce":[],"urlList":[]}}