{"title":"cracker...Greenland(2006)[FLAC]","uid":5877233,"size":463226565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60b313e1ce42195b9dc014805273827899bb826b&amp;dn=cracker...Greenland%282006%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":27,"time":1286683328,"description":"2006 Greenland    CD  Cooking Vinyl 4777 \n\n1 Something You Ain't Got  5:17 \n2 Maggie  3:43 \n3 Where Have These Days Gone  4:12 \n4 Fluffy Lucy  3:24 \n5 The Riverside  4:21 \n6 Gimme One More Chance  4:14 \n7 I'm So Glad She Ain't Never Coming Back  1:54 \n8 Sidi Infi  6:05 \n9 I Need Better Friends  3:49 \n10 Minotaur  4:27 \n11 Night Falls  5:24 \n12 Better Times Are Coming Our Way  5:01 \n13 Everybody Gets One for Free  6:43 \n14 Darling We're out of Time  4:36 \n\n\n\nSince his days with the genre-busting 1980s alternative rock outfit Camper Van Beethoven, David Lowery has been moving progressively toward a more roots-oriented, singer-songwriter sound. His later work with Cracker bears this out, and the band's 2006 release GREENLAND is Lowery's most stripped-down and straightforward to date, miles away from the grungey bombast of earlier releases.\n\nSteeped in the sounds of folk and alt-country, with a touch of indie rock thrown in for balance, GREENLAND floats gently along the surface, yet there is a deeply personal undercurrent to nearly every song on the record. Lowery's songs explore themes of loss, heartbreak, and personal upheaval in a way that feels pointedly autobiographical, giving his clever, detail-rich lyrics an added poignancy. This is particularly notable for a band that's often big on tongue-in-cheek irony, and it is this poignancy that gives GREENLAND its winning edge.\n\nPersonnel: David Lowery (vocals, guitar, strings, piano, keyboards, synthesizer); Johnny Hickman (vocals, guitar); Alan Weatherhead (guitar, slide guitar, keyboards); Mark Linkous (guitar, synthesizer); David ImmerglÃƒÂ¼ck (electric guitar); Margaret White (violin); Kenny Margolis (accordion, piano, keyboards); Craig Harmon (organ, keyboards); Lauren Hoffman (synthesizer, background vocals); Miguel Urbiztondo (drums, tabla, percussion); Frank Funaro (drums, percussion); John Morand (percussion); Casey Martin, Caitlin Cary (background vocals).\n\nPhotographer: Jonathan Segel.\n\nCMJ (p.5) - &quot;The stubborn sarcasm deep in Lowery's larnyx and the skillful veteran alt-rock instrumentation add more depth than any other surviving alt-rock also-ran...&quot;\nNo Depression (p.110) - &quot;Frontman David Lowery sounds more reflective than usual as he wonders whatever happened to his California heyday...&quot;\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:60b313e1ce42195b9dc014805273827899bb826b","amp;dn":"cracker...Greenland%282006%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b313e1ce42195b9dc014805273827899bb826b","infoHashBuffer":{"type":"Buffer","data":[96,179,19,225,206,66,25,91,157,192,20,128,82,115,130,120,153,187,130,107]},"announce":[],"urlList":[]}}