{"title":"Eric Burdon - 'Til Your River Runs Dry (2013) [FLAC] vtwin88cube","uid":8129558,"size":362723896,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60cd10b303a712eac40803b4dcb9684c927cdfb9&amp;dn=Eric+Burdon+-+%27Til+Your+River+Runs+Dry+%282013%29+%5BFLAC%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1360566218,"description":"\n\n\nEric Burdon\n'Til Your River Runs Dry (2013)\n\n\n\n\n\nAs the lead singer of the Animals, Eric Burdon was one of the British Invasion's most distinctive vocalists, with a searingly powerful blues-rock voice. When the first lineup of the group fell apart in 1966, Burdon kept the Animals' name going with various players for a few years. Usually billed as Eric Burdon &amp; the Animals, the group was essentially Burdon's vehicle, which he used to purvey a far more psychedelic and less R&amp;B-oriented vision. Occasionally he came up with a good second-division psychedelic hit, like &quot;Sky Pilot&quot;; more often, the music was indulgent, dating almost immediately. Burdon's real triumphs as a solo artist came at the beginning of the '70s, when he hooked up with a bunch of L.A. journeyman soul/funksters who became his backing band, War. Recording three albums' worth of material in the year or two that they were together, the Burdon/War records could ramble on interminably, and would have benefited from a lot of editing. But they contained some spacy funkadelia of real quality, especially their number three hit single &quot;Spill the Wine,&quot; which was almost recorded as an afterthought in the midst of sessions dominated by exploratory jams. Eric Burdon &amp; War were already big stars on record and stage when Burdon, for reasons unclear to almost everyone, quit the band in 1971. War defied expectations and became even bigger when left to their own devices; Burdon, after recording an album with veteran bluesman Jimmy Witherspoon, cut a series of generally desultory solo albums. He recorded off and on after that, at times with the Animals, but has never come close to reaching the heights of his work with the early Animals and War. Burdon was always a riveting live performer, though, and he continued to tour into the 21st century with various incarnations of the Animals and as a solo act, branching out as a painter and author as well, and working in the studio when it suited him. \n\n\n\n\nAudio Quality:\t\tPerfect (Lossless)\nAudiochecker:\t\t100.00% CDDA - *Track 9 ERROR (Plays Fine Though)*\nLabel:\t\t\tABKCO Records\nCatalogue:\t\t8906-2\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAudio-Info:\n\n\n01.Water\n02.Memorial Day\n03.Devil And Jesus\n04.Wait\n05.Old Habits Die Hard\n06.Bo Diddley Special\n07.In The Ground\n08.27 Forever\n09.River Is Rising\n10.Medicine Man\n11.Invitation To The White House\n12.Before You Accuse Me\n\n\n\n\n\n\n\n\n\n                            ****Thanks For Seeding!****\n                                     \n                                   ***Enjoy!***\n\n\n","torrent":{"xt":"urn:btih:60cd10b303a712eac40803b4dcb9684c927cdfb9","amp;dn":"Eric+Burdon+-+%27Til+Your+River+Runs+Dry+%282013%29+%5BFLAC%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60cd10b303a712eac40803b4dcb9684c927cdfb9","infoHashBuffer":{"type":"Buffer","data":[96,205,16,179,3,167,18,234,196,8,3,180,220,185,104,76,146,124,223,185]},"announce":[],"urlList":[]}}