{"title":"Homeward Bound: The Incredible Journey","uid":4009224,"size":734054500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61148b759eee9f8fd66124e8fc23d63552b9e583&amp;dn=Homeward+Bound%3A+The+Incredible+Journey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"westlock420","files":2,"time":1201988301,"description":"Three pets (Chance, a young dog unfamiliar with the world; Shadow, an aging, wise dog; and Sassy, a snobby cat) are left behind when their family goes on vacation. Unsure of what happened, the animals set out on a quest to find their family. This journey across America is very dangerous and the animals risk never seeing their masters again. The group of pets travel across forested mountains and areas of wide-open countryside, while their family searches for them in the same areas.\n\nThe adventure begins when the loving owners of three irresistible pets (Chance, a fun-loving American bulldog pup; Sassy, a hilarious Himalayan cat who lives up to her name; and Shadow, a wise old golden retriever) are forced to leave them in the temporary care of a friend who lives hundreds of miles away. But after several days, the worried animals begin to their family must be in trouble, so they decide to head for home. On their incredible journey across the ruggedly beautiful Sierras, they encounter unexpected surprises from man, beast, and nature alike.","torrent":{"xt":"urn:btih:61148b759eee9f8fd66124e8fc23d63552b9e583","amp;dn":"Homeward+Bound%3A+The+Incredible+Journey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61148b759eee9f8fd66124e8fc23d63552b9e583","infoHashBuffer":{"type":"Buffer","data":[97,20,139,117,158,238,159,143,214,97,36,232,252,35,214,53,82,185,229,131]},"announce":[],"urlList":[]}}