{"title":"Consilience - The Unity of Knowledge by Edward O. Wilson (1998) ","uid":10662901,"size":1834180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:614f4f75dfb44d2289c811f958dc39f181c2a5f0&amp;dn=Consilience+-+The+Unity+of+Knowledge+by+Edward+O.+Wilson+%281998%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1406749419,"description":"Title: Consilience - The Unity of Knowledge\nAuthor: Edward O. Wilson\nCategory: Academic/Science/Biology/Theory of Knowledge\nPublisher: Knopf; 1 edition (March 17, 1998)\nLanguage: English\nISBN-10: 0679450777\nISBN-13: 978-0679450771\n\nPromotional info/Publisher's summary - &quot;An enormous intellectual adventure. In this groundbreaking new book, the American biologist Edward O. Wilson, considered to be one of the world's greatest living scientists, argues for the fundamental unity of all knowledge and the need to search for consilience--the proof that everything in our world is organized in terms of a small number of fundamental natural laws that comprise the principles underlying every branch of learning. Professor Wilson, the pioneer of sociobiology and biodiversity, now once again breaks out of the conventions of current thinking. He shows how and why our explosive rise in intellectual mastery of the truths of our universe has its roots in the ancient Greek concept of an intrinsic orderliness that governs our cosmos and the human species--a vision that found its apogee in the Age of Enlightenment, then gradually was lost in the increasing fragmentation and specialization of knowledge in the last two centuries. Drawing on the physical sciences and biology, anthropology, psychology, religion, philosophy, and the arts, Professor Wilson shows why the goals of the original Enlightenment are surging back to life, why they are reappearing on the very frontiers of science and humanistic scholarship, and how they are beginning to sketch themselves as the blueprint of our world as it most profoundly, elegantly, and excitingly is.&quot;\n\nReview:\n&quot;Historically, all of the sciences were once united under the rubric of &quot;natural science.&quot; Over time, they became fragmented and specialized. Nevertheless, Wilson argues that there is a genetic and neurological basis for knowledge and that all subjects of human inquiry can be reunited under the umbrella of &quot;consilience.&quot; -Library Journal\n\nThis torrent contains a fully indexed, browse-able and searchable copy of the book in PDF format. The front cover image is also included. Please seed, and enjoy.","torrent":{"xt":"urn:btih:614f4f75dfb44d2289c811f958dc39f181c2a5f0","amp;dn":"Consilience+-+The+Unity+of+Knowledge+by+Edward+O.+Wilson+%281998%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"614f4f75dfb44d2289c811f958dc39f181c2a5f0","infoHashBuffer":{"type":"Buffer","data":[97,79,79,117,223,180,77,34,137,200,17,249,88,220,57,241,129,194,165,240]},"announce":[],"urlList":[]}}