{"title":"Michael Asher - The Real Bravo Two Zero (mobi + epub)","uid":7887379,"size":1326402,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:617cf95f36c743391c9ddb606d4bd93e75ba7a66&amp;dn=Michael+Asher+-+The+Real+Bravo+Two+Zero+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"kevinkray","files":-1,"time":1354648074,"description":"The Bravo Two Zero mission, in which an eight-man SAS patrol was discovered many miles behind Iraqui lines and had to make a run back for the border and safety, is probably the most famous incident involving British troops in the Gulf War. Two bestselling books--Bravo Two Zero and The One That Got Away--were published and two of the soldiers, using the pseudonyms &quot;Andy McNab&quot; and &quot;Chris Ryan&quot;, were launched into new careers as writers. Even the most uncritical reader of the two books would have been aware that some artistic licence had been employed. What Michael Asher claims is the truth about Bravo Two Zero is, however, astonishing. Asher, fluent in Arabic and familiar with the ways of the desert Arabs, travelled to Iraq 10 years after the Gulf War and re-traced the steps of the SAS patrol, finding Bedouin eyewitnesses to events. There is an almost comical disparity between McNab and Ryan's version of the mission and the version Asher reports. According to McNab, when the patrol was discovered, it was by Iraqi soldiers and a furious firefight ensued with the SAS men downing a dozen or more men before fleeing. According to Asher, the mission was &quot;compromised&quot; by three Arab locals, one of them a man in his 70s, and the SAS wisely decided that discretion was the better part of valour and withdrew. According to Ryan, on his lonely journey to the Syrian border, he was obliged to kill two Iraqis, one with his bare hands. According to Asher's sources, he omitted to mention this at his initial de-briefing. One of Asher's aims in his book is to rehabilitate the reputation of Vince Phillips, one of the dead. Most readers of this book and of the tale told by the Arab who discovered Phillips's body will probably decide that he has done so. Yet Asher does not seem motivated by a desire to denigrate the heroism of McNab and Ryan. We get the heroes we want and Asher understands that the Rambo-like exploits they reported were what we, and the media, demanded of them. Their real heroism, respected by both Asher and the Bedouins to whom he spoke, lay in their powers of endurance and determination when utterly isolated and alone, hundreds of miles inside enemy territory. In The Real Bravo Two Zero Asher has written a far better and more humane book than either of the two he deconstructs, but he still seems to understand why McNab and Ryan produced the books they did.--Nick Rennison","torrent":{"xt":"urn:btih:617cf95f36c743391c9ddb606d4bd93e75ba7a66","amp;dn":"Michael+Asher+-+The+Real+Bravo+Two+Zero+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"617cf95f36c743391c9ddb606d4bd93e75ba7a66","infoHashBuffer":{"type":"Buffer","data":[97,124,249,95,54,199,67,57,28,157,219,96,109,75,217,62,117,186,122,102]},"announce":[],"urlList":[]}}