{"title":"Bob Woodward - State of Denial (America-911-WTC-Bush-Neocons-Ter","uid":3630341,"size":2529873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:622e0df8cc12d2fc49ba936fec4a0d36a6358841&amp;dn=Bob+Woodward+-+State+of+Denial+%28America-911-WTC-Bush-Neocons-Ter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sampooran","files":1,"time":1172856539,"description":"Book Description\n&quot;Insurgents and terrorists retain the resources and capabilities to sustain and even increase current level of violence through the next year.&quot; This was the secret Pentagon assessment sent to the White House in May 2006. The forecast of a more violent 2007 in Iraq contradicted the repeated optimistic statements of President Bush, including one, two days earlier, when he said we were at a &quot;turning point&quot; that history would mark as the time &quot;the forces of terror began their long retreat.&quot; \n\nState of Denial examines how the Bush administration avoided telling the truth about Iraq to the public, to Congress, and often to themselves. Two days after the May report, the Pentagon told Congress, in a report required by law, that the &quot;appeal and motivation for continued violent action will begin to wane in early 2007.&quot; \n\n\nIn this detailed inside story of a war-torn White House, Bob Woodward reveals how White House Chief of Staff Andrew Card, with the indirect support of other high officials, tried for 18 months to get Defense Secretary Donald Rumsfeld replaced. The president and Vice President Cheney refused. At the beginning of Bush&amp;#039;s second term, Stephen Hadley, who replaced Condoleezza Rice as national security adviser, gave the administration a &quot;D minus&quot; on implementing its policies. A SECRET report to the new Secretary of State Rice from her counselor stated that, nearly two years after the invasion, Iraq was a &quot;failed state.&quot;\n\n\nState of Denial reveals that at the urging of Vice President Cheney and Rumsfeld, the most frequent outside visitor and Iraq adviser to President Bush is former Secretary of State Henry Kissinger, who, haunted still by the loss in Vietnam, emerges as a hidden and potent voice.\n\n\nWoodward reveals that the secretary of defense himself believes that the system of coordination among departments and agencies is broken, and in a SECRET May 1, 2006, memo, Rumsfeld stated, &quot;the current system of government makes competence next to impossible.&quot;\n\n\nState of Denial answers the core questions: What happened after the invasion of Iraq? Why? How does Bush make decisions and manage a war that he chose to define his presidency? And is there an achievable plan for victory? \n\n\nBob Woodward&amp;#039;s third book on President Bush is a sweeping narrative -- from the first days George W. Bush thought seriously about running for president through the recruitment of his national security team, the war in Afghanistan, the invasion and occupation of Iraq, and the struggle for political survival in the second term. \n\n\nAfter more than three decades of reporting on national security decision making -- including his two #1 national bestsellers on the wars in Afghanistan and Iraq, Bush at War (2002) and Plan of Attack (2004) -- Woodward provides the fullest account, and explanation, of the road Bush, Cheney, Rumsfeld, Rice and the White House staff have walked.\n\nAbout the Author\nBob Woodward is Assistant Managing Editor at THE WASHINGTON POST. His Pulitzer Prize-winning Watergate reporting is said to have set the standard for modern investigative reporting. Over the last 22 years he has authored or co-authored nine #1 internationally bestselling books\n\n(America-911-WTC-Bush-Neocons-Terrorism-Fascism-Iraq).","torrent":{"xt":"urn:btih:622e0df8cc12d2fc49ba936fec4a0d36a6358841","amp;dn":"Bob+Woodward+-+State+of+Denial+%28America-911-WTC-Bush-Neocons-Ter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"622e0df8cc12d2fc49ba936fec4a0d36a6358841","infoHashBuffer":{"type":"Buffer","data":[98,46,13,248,204,18,210,252,73,186,147,111,236,74,13,54,166,53,136,65]},"announce":[],"urlList":[]}}