{"title":"John Herman Randall - The Making of the Modern Mind (pdf)","uid":8537865,"size":8699552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62910e02c058e9ac536e538d3e8bc3ec396731c7&amp;dn=John+Herman+Randall+-+The+Making+of+the+Modern+Mind+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pharmakate","files":-1,"time":1370306716,"description":"John Herman Randall - The Making of the Modern Mind (Columbia Univ. Press, 1940, 1976). 696 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nSurveys main currents in Western thought through eight centuries. In his Foreword, Jacques Barzun describes this as one of the best textbooks ever written.\n\nFrom Library Journal\n\nRandall was one of the great American minds of the 20th century, and this was his classic textbook written for Columbia's contemporary civilization course. First published in 1926 and last revised in 1940, this is another book that Gress sees as an example of the Grand Narrative, but as he points out, it was &quot;brilliantly learned and well written.&quot; It thus still serves as a solid introduction to the history of ideas for undergraduates and adults.\n\nAbout the Author\n\nJohn Herman Randall, Jr., is Frederick J. E. Woodbridge Professor Emeritus of Philosophy, Columbia University. He is the author of many works in philosophy and intellectual history, among them Aristotle, The Career of Philosophy, Vols. I and II, How Philosophy Uses its Past, Nature and Historical Experience and Philosophy After Darwin: Chapters for The Career of Philosophy, Volume III, and Other Essays, all published by Columbia University Press.\n","torrent":{"xt":"urn:btih:62910e02c058e9ac536e538d3e8bc3ec396731c7","amp;dn":"John+Herman+Randall+-+The+Making+of+the+Modern+Mind+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62910e02c058e9ac536e538d3e8bc3ec396731c7","infoHashBuffer":{"type":"Buffer","data":[98,145,14,2,192,88,233,172,83,110,83,141,62,139,195,236,57,103,49,199]},"announce":[],"urlList":[]}}