{"title":"Aida64 Extreme[Engineer]Edition 2.70.2200+keys by Senzati.rar","uid":7770351,"size":14406762,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:632ea1b4f4b81295910646872a3362e8b0ab1cf3&amp;dn=Aida64+Extreme%5BEngineer%5DEdition+2.70.2200%2Bkeys+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BySenzati","files":1,"time":1351508259,"description":"AIDA64 Extreme Edition is a streamlined Windows diagnostic and benchmarking software for home users. AIDA64 Extreme Edition provides a wide range of features to assist in overclocking, hardware error diagnosis, stress testing, and sensor monitoring\n\nVIA VX11 platform, Nano X2 and QuadCore CPU support\n\nOptimized benchmarks for VIA Nano X2 and QuadCore processors, and for the upcoming VIA VX11 platform. Detailed chipset information for VIA VX11 and VX900 platform controllers, VN1000 north bridge, VT8261 south bridge. Preliminary multi-threaded OpenCL-based GPGPU stress test for VIA VX11 platform. For legacy processors all benchmarks and the System Stability Test are available in 32-bit version as well.\n\nOptimized 64-bit benchmarks for AMD A-Series Î“Ã‡Â£TrinityÎ“Ã‡Â¥ APU\n\nAIDA64 CPUID Panel, Cache &amp; Memory Benchmark panel, System Stability Test, and all memory and processor benchmarks are fully optimized for AMD A-Series Î“Ã‡Â£TrinityÎ“Ã‡Â¥ desktop and mobile APUs, utilizing FMA4 and XOP instructions. Detailed chipset information for AMD A55, A60M, A68, A68M, A70M, A75, A85X Î“Ã‡Â£HudsonÎ“Ã‡Â¥ Fusion Controller Hubs. Preliminary support for AMD Î“Ã‡Â£VisheraÎ“Ã‡Â¥ processors and high performance DDR3 memory modules with AMD Memory Profiles.\nMicrosoft Windows 8 RTM and Windows Server 2012 RTM support\n\nOperating system details, installed programs list, and security software information for the final production build of Microsoft Windows 8 and Windows Server 2012. Optimized ACPI query and temperature measurement module; anti-virus and anti-spyware software details for the new generation Microsoft Windows Defender. A series of bug fixes related to the latest Windows release: CPU clock measurement via APIC timer, Windows product key decoding, Windows product activation status detection.\nOpenGL 4.3, APP SDK 2.7, CUDA 5.0 support\n\nOpenGL video adapter details, OpenGL extensions list, OpenGL complicancy test with OpenGL 4.3 support. GPGPU information is available for Direct3D Compute Shader, AMD Stream, nVIDIA CUDA, and OpenCL devices, now with APP SDK 2.7, CUDA 5.0 and OpenCL 1.2 updates.\nSupport for the latest hardware technologies\n\nGraphics processor, OpenGL and GPGPU details, temperature and cooling fan monitoring for the latest GPUs: nVIDIA GeForce 620M, GeForce GTX 650, GeForce GTX 650M, GeForce GTX 660, GeForce GTX 660 Ti, GeForce GTX 680M, Quadro K-Series, Tesla K10, AMD FirePro V-Series, FirePro W-Series. Improved support for Marvell 88SS9174 controller based SSDs. Fixed RAID member enumeration and RAID SMART support for Intel RAID controllers.\n\nSystem requirements\n\nOperating system: \nWindows 95/98/Me \nWindows NT4/2000\nWindows XP\nWindows PE\nWindows Server 2003\nWindows Vista\nWindows Server 2008\nWindows 7\nWindows Server 2008 R2\nWindows 8\nWindows Server 2012\t","torrent":{"xt":"urn:btih:632ea1b4f4b81295910646872a3362e8b0ab1cf3","amp;dn":"Aida64+Extreme%5BEngineer%5DEdition+2.70.2200%2Bkeys+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"632ea1b4f4b81295910646872a3362e8b0ab1cf3","infoHashBuffer":{"type":"Buffer","data":[99,46,161,180,244,184,18,149,145,6,70,135,42,51,98,232,176,171,28,243]},"announce":[],"urlList":[]}}