{"title":"Masterminds 1997 Movie","uid":4195326,"size":3717421056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:634f89961d70dd837b523bea9a28438110d4053f&amp;dn=Masterminds+1997+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Criptor","files":9,"time":1211186972,"description":"Plot Synopsis\tby Mark Deming\n\nA criminal genius who has carefully planned the ultimate score runs across an unexpected obstacle -- a 16-year-old computer hacker -- in this youth-oriented action-adventure story. Ozzie Paxton (Vincent Kartheiser) is a teenager with a knack for causing trouble; he&amp;#039;s been expelled from the Shady Glen School, an exclusive private academy, for pulling one too many pranks on the faculty. Besides, he prefers to stay home with his computer, where for fun and profit he hacks into the systems of computer game designers, downloads new games before they can go on the market, and burns bootleg CD-ROMs that he can sell to his friends. One day, Ozzie&amp;#039;s younger sister Melissa (Katie Stuart) talks him into giving her a lift to Shady Glen, where she still attends; looking for a little revenge, he sneaks into the school and intends to have a little fun with their computer system. As it turns out, Ozzie runs afoul of the school&amp;#039;s new security chief, former British Secret Service agent Rafe Bentley (Patrick Stewart), who was hired by Principal Maloney (Brenda Fricker) after Ozzie&amp;#039;s most recent bit of computer terrorism. But Bentley is not the friend of the law that he seems to be; several of the wealthiest families in America send their children to Shady Glen, and Bentley has a scheme to kidnap ten of the school&amp;#039;s richest children and hold them for a ransom of $650 million. Ozzie is caught in the middle of Bentley&amp;#039;s kidnapping plot and must now use his computer skills in order to save the children and put Bentley behind bars.\n\ncourtesy","torrent":{"xt":"urn:btih:634f89961d70dd837b523bea9a28438110d4053f","amp;dn":"Masterminds+1997+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"634f89961d70dd837b523bea9a28438110d4053f","infoHashBuffer":{"type":"Buffer","data":[99,79,137,150,29,112,221,131,123,82,59,234,154,40,67,129,16,212,5,63]},"announce":[],"urlList":[]}}