{"title":"Earthworm Jim Special Edition [PC] [1995]","uid":5323258,"size":629423194,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:636d64dd7241f5e9b8096d556066222ebd0259a0&amp;dn=Earthworm+Jim+Special+Edition+%5BPC%5D+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thenoobish","files":1,"time":1264938773,"description":"Information\nTitle: Earthworm Jim \nGenre: Arcade / Platform\nDeveloper: Shiny Entertainment\nPublisher: Activision\nReleased: 1995\nLanguage: English only\nMedicine: Not required\n\nDescription: Earthworm Jim - a computer game developed by Shiny Entertainment, the protagonist of which is the earthworm named Jim, dressed in a robotic suit and to fight evil. The game was released for the platform Sega Mega Drive / Genesis in 1994, was later ported to the SNES, Game Gear, Game Boy, PC. After release it was praised for its detailed animation, polished gameplay and eccentric absurd humor.\nIn the game a lot of colorful characters. Jim himself was originally a common earthworm has been dealing with the fact that usually do earthworms: eating humus and hid from the ravens. Once, in the space above Earth, the evil Psy-Crow (Psy-Crow) caught up with a spaceship piloted by a rebel who stole the &quot;Ultra-high-super-space-cyber-suit&quot; built by Professor Obezyanogolovym (Professor Monkey-For-A - Head). The suit by the evil Queen of pulsating, sulky, rotten, sweaty, festering, ugly, Ulitkozadoy (Queen Pulsating, Bloated, Festering, Sweaty, Pus-filled, Malformed, Slug-for-a-Butt), wishing to continue the conquest of the galaxy. As a result of the battle space suit fell to Earth, and by chance, Jim was inside his collar. As a result, he mutated into a large and intelligent (at least by earthworm standards) superhero.\nJim overhears Psy-Crow and Queen Ulitkozadoy about her plans for her sister, Princess what's-her-there (Princess What's-Her-Name). As a result, Jim went to rescue the princess, having won on his way a lot of enemies.\n\nExtras. Information:\nSpecial Edition differs from the usual ol 'DOS versions support Windows, the presence of several additional levels, a large number of digitized speech, improved graphics, new weapons, as well as the increased amount of animation for our spineless rescuer galaxy. And, of course, on the spot all CD-Audio tracks.\nFor normal operation of the game is best to write the image on the disc.\n\nSystem requirements: 80486 CPU or better, 8 megabytes of RAM, 2x CD-ROM\nCheck your private, runs on Vista and XP","torrent":{"xt":"urn:btih:636d64dd7241f5e9b8096d556066222ebd0259a0","amp;dn":"Earthworm+Jim+Special+Edition+%5BPC%5D+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"636d64dd7241f5e9b8096d556066222ebd0259a0","infoHashBuffer":{"type":"Buffer","data":[99,109,100,221,114,65,245,233,184,9,109,85,96,102,34,46,189,2,89,160]},"announce":[],"urlList":[]}}