{"title":"Harry Browne - Why Government Does Not Work","uid":5333767,"size":1213136,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6395a9c0a5dcca2331eb12b0d7878f26fd2c0f72&amp;dn=Harry+Browne+-+Why+Government+Does+Not+Work&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Libertywithout","files":1,"time":1265254154,"description":"Haven't seen many Harry Browne books up so I thought I would share one.\n\n\nThis book demonstrates persuasively why government programs:\n\n    * Have a failure rate over 99%,\n    * Never live up to their promises,\n    * Too often do the exact opposite of what was promised for them,\n    * Always cost far more than their initial estimates, and\n    * Create the conditions that justify enlarging themselves and adding more government programs.\n\nThe book provides answers to numerous questions that are sometimes perplexing:\n\n    * Why so many people keep falling for political promises,\n    * How America went from the land of the free to the land of government dominance,\n    * Why new government intrusions always wind up hurting the innocent more than the guilty, and\n    * How to get people to give up their favorite government programs.\n\nAnd the book offers some surprising conclusions:\n\n    * How the civil rights laws have turned into a national nightmare,\n    * How America has an overwhelming national offense, but practically no national defense,\n    * How school vouchers could destroy private schools,\n    * Why America has no missile defense after 20 years of the government working on it,\n    * How government regulation makes your life less safe, and\n    * Why every political complaint about our &quot;free market&quot; health-care system is a reason to get the government completely out of health care.\n\nIn addition, the book shows why the libertarian message should resonate with the young, the elderly, the poor, the rich, people of every religion, people on welfare, reformers, and even government employees.\n\nThere are chapters on education, welfare, health care, law enforcement, the military, Social Security, family values, and the income tax. There's a plan for freeing you immediately from the Social Security tax, without having to deny retired people what they've been led to expect.\n\nThere's even a Freedom Budget - showing how the federal government could get by on just $100 billion a year, and how we can get from here to there quickly.\n\nWritten in Harry Browne's patented easy-to-follow style, sprinkled with his good humor, and with every detail covered, this book is guaranteed to help you become a more persuasive salesman of liberty.","torrent":{"xt":"urn:btih:6395a9c0a5dcca2331eb12b0d7878f26fd2c0f72","amp;dn":"Harry+Browne+-+Why+Government+Does+Not+Work","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6395a9c0a5dcca2331eb12b0d7878f26fd2c0f72","infoHashBuffer":{"type":"Buffer","data":[99,149,169,192,165,220,202,35,49,235,18,176,215,135,143,38,253,44,15,114]},"announce":[],"urlList":[]}}