{"title":"Hackproofing Your Wireless Network","uid":8313328,"size":6923604,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:645941a97a3788af56b16717c3eb70527a8cc46b&amp;dn=Hackproofing+Your+Wireless+Network&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1364526335,"description":"Christian Barnes, Tony Bautts, Donald Lloyd, Eric Ouellet, Jeffrey Posluns, David M. Zendzian, Neal O'Farrell - Hackproofing Your Wireless Network\nPublished: 2002-02-28 | ISBN: 1928994598 | PDF | 512 pages | 6 MB\n\n\nThe only way to stop a hacker is to think like one!\nWireless technology is a new and rapidly growing field of concentration for network engineers and administrators. Innovative technology is now making the communication between computers a cordless affair. Wireless devices and networks are vulnerable to additional security risks because of their presence in the mobile environment.\nHack Proofing Your Wireless Network is the only book written specifically for architects, engineers, and administrators responsible for securing their wireless networks. From making sense of the various acronyms (WAP, WEP, SSL, PKE, PKI, SSL, SSH, IPSEC) to the implementation of security policies, plans, and recovery protocols, this book will help users secure their wireless network before its security is compromised. The only way to stop a hacker is to think like one...this book details the multiple ways a hacker can attack a wireless network - and then provides users with the knowledge they need to prevent said attacks.\nUses forensic-based analysis to give the reader an insight into the mind of a hacker\nWith the growth of wireless networks architects, engineers and administrators will need this book","torrent":{"xt":"urn:btih:645941a97a3788af56b16717c3eb70527a8cc46b","amp;dn":"Hackproofing+Your+Wireless+Network","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645941a97a3788af56b16717c3eb70527a8cc46b","infoHashBuffer":{"type":"Buffer","data":[100,89,65,169,122,55,136,175,86,177,103,23,195,235,112,82,122,140,196,107]},"announce":[],"urlList":[]}}