{"title":"Willie Nelson - One Hell Of A Ride (2008) [FLAC]","uid":10782967,"size":1910718309,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:64a6e09dc1dc4d30e0e483aa35ba8e9f97f6c8e5&amp;dn=Willie+Nelson+-+One+Hell+Of+A+Ride+%282008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"huck53","files":144,"time":1408186802,"description":" Review by Stephen Thomas Erlewine  [-]\n\nNavigating Willie Nelson's immense body of recordings can be daunting even for committed fans. There is so much music and so much of it good that it's hard to keep straight, especially as each of his many eras has been compiled, collected, and reissued countless time, leading to a discography thick with redundancies -- and then there's the stubborn fact that for Willie, making music is like breathing, something that comes naturally, something that happens every day, so he keeps building upon that discography, releasing an album or two each year, which only adds to the confusion for neophytes and longtime fans alike. All of this is a roundabout way to say that there are plenty of Willie Nelson albums out there, that there's a surplus of compilations, but of all these, nothing offers such a complete, useful overview of his entire career as Columbia/Legacy's four-disc 2008 box One Hell of a Ride. This is not the first Willie box that Legacy has released, of course -- in 1995 they put out the triple-disc Revolutions of Time: The Journey 1975-1993 -- but this is the first box to ever attempt a thorough overview of his career, beginning with his earliest singles for Sarg and D, running through the countrypolitan Nashville productions of his Liberty Records and his wonderfully rambling RCA recordings of the '60s, then settling into the star-making sides for Columbia in the '70s and '80s, yet the set doesn't end there, as it runs through his albums for Island and Mercury in the '90s and 2000s. For sheer scope, this beats all, but what makes One Hell of a Ride so useful is that it covers all the ground accurately, picking a blend of hits, concert staples, and relative obscurities to present a career overview that may be illuminating even for serious fans, as this tells a full, complete story with its 100 tracks\n\nLike many great stories, the details may be fudged a bit here -- on the second disc the tracks don't quite follow in chronological order -- but that doesn't matter because all this tweaking is done in service of the bigger picture, which is as it should be when a picture is this large. Listening to the whole of One Hell of a Ride, it's hard not to marvel yet again at the enormity of Willie's career. If he had only authored the standards &quot;Nite Life,&quot; &quot;Crazy,&quot; &quot;Hello Walls,&quot; and &quot;Funny How Time Slips Away,&quot; his place in history would be assured, but this set illustrates how Nelson strengthened the jazzy sophistication underpinning these tunes by digging deeper into Western swing, just as he slyly brought rock, folk, and pop flourishes into his music. By the time the Outlaw years roll around in the midst of the second disc here, his music was hard to peg -- certainly it was country, but not in the strictest definition, as it encompassed so much more, from the stark Red Headed Stranger to the lush Stardust, and what is remarkable about One Hell of a Ride is that by listening to it from beginning to end, none of these moves feel forced, all the evolutions feel natural, and the excellent fourth disc -- which neatly cherry-picks from a rollercoaster two decades of recordings -- illustrates that his evolution did not end when he achieved superstardom, but rather he kept finding new truths in music, sometimes through new tunes, sometimes by revisiting the past, as the nifty book-ending of the set with a new version of his first recording &quot;When I've Sung My Last Hillbilly Song&quot; makes clear. Willie will continue to build upon the legacy offered within this box, but that will not change the fact that this is the best place to learn and appreciate that legacy, and to learn to love it.\n","torrent":{"xt":"urn:btih:64a6e09dc1dc4d30e0e483aa35ba8e9f97f6c8e5","amp;dn":"Willie+Nelson+-+One+Hell+Of+A+Ride+%282008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64a6e09dc1dc4d30e0e483aa35ba8e9f97f6c8e5","infoHashBuffer":{"type":"Buffer","data":[100,166,224,157,193,220,77,48,224,228,131,170,53,186,142,159,151,246,200,229]},"announce":[],"urlList":[]}}