{"title":"Eleanor of Aquitaine: A Life - Alison Weir  (Unabridged)","uid":12113645,"size":501758665,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6526b5784fb28dd8f44ec3c64090e66a72dd1c7e&amp;dn=+Eleanor+of+Aquitaine%3A+A+Life+-+Alison+Weir++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"davieboy1966","files":23,"time":1436633966,"description":"Written by Alison Weir\nRead by Jill Tanner\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\nLength: about 22hrs\nPublisher: Recorded Books,LLC\nRelease date: 2002\nFormat: mp3, 64kbps, stereo\nin chapters\n\nCombining the pace and descriptive quality of a novel with the authority of a textbook, Alison Weir's study of the revered and reviled Eleanor of Aquitaine should be valuable to anyone with an interest in medieval European history.\n\nWife of Louis VII of France and subsequently of Henry II of England, and mother of Richard &quot;the Lion-Hearted,&quot; Eleanor played a prominent part in the politics of the 12th century. Weir brings all the color and ever-present dangers of Eleanor's world to life, filling the text with absorbing background detail and revelatory contemporary anecdotes. She is concerned throughout to make critical analysis of the primary sources, the later myths about Eleanor, and other modern biographies. This results in a fresh and thoughtful perspective on the energetic life of a determined and ambitious woman living with the sexism, excesses, and violence of a society in which the word of a single man could condemn thousands to death.\n\nEleanor of Aquitaine is a vivacious but scholarly book with extensive notes and references, giving an objective and rich account of the staunch Eleanor, her feuding family and her complex and unstable world.\n\nOriginal from cassette not my rip. Sound quality and speed vary from side to side. Altered where I could to make Jill Tanner sound more like Jill Tanner.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:6526b5784fb28dd8f44ec3c64090e66a72dd1c7e","amp;dn":"+Eleanor+of+Aquitaine%3A+A+Life+-+Alison+Weir++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6526b5784fb28dd8f44ec3c64090e66a72dd1c7e","infoHashBuffer":{"type":"Buffer","data":[101,38,181,120,79,178,141,216,244,78,195,198,64,144,230,106,114,221,28,126]},"announce":[],"urlList":[]}}