{"title":"Penetration Testing - A Hands-On Introduction to Hacking","uid":10293765,"size":30986290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:655ebb25adbad237c89f7c9e00be6b7e5be4a800&amp;dn=Penetration+Testing+-+A+Hands-On+Introduction+to+Hacking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1401894596,"description":"\n\n\nNo Starch Penetration Testing: A Hands-On Introduction to Hacking (2014)\n\n\n\nDescription:\n\n\nPenetration testers simulate cyber attacks to find security weaknesses in networks, operating systems, and applications. Information security experts worldwide use penetration techniques to evaluate enterprise defenses.\n\nIn Penetration Testing, security expert, researcher, and trainer Georgia Weidman introduces you to the core skills and techniques that every pentester needs. Using a virtual machine-based lab that includes Kali Linux and vulnerable operating systems, you'll run through a series of practical lessons with tools like Wireshark, Nmap, and Burp Suite. As you follow along with the labs and launch attacks, you'll experience the key stages of an actual assessment - including information gathering, finding exploitable vulnerabilities, gaining access to systems, post exploitation, and more.\n\nLearn how to:\n\nCrack passwords and wireless network keys with brute-forcing and wordlists\nTest web applications for vulnerabilities\nUse the Metasploit Framework to launch exploits and write your own Metasploit modules\nAutomate social-engineering attacks\nBypass antivirus software\nTurn access to one machine into total control of the enterprise in the post exploitation phase\n\n\nYou'll even explore writing your own exploits. Then it's on to mobile hacking - Weidman's particular area of research - with her tool, the Smartphone Pentest Framework.\n\nWith its collection of hands-on lessons that cover key tools and strategies, Penetration Testing is the introduction that every aspiring hacker needs.\n\n\n\nNote:\n\n1. The book has a 528 pages but the PDF here has over 800 pages(read below).\n\n2. No Index\n\n                     \n\n***********************************************************************************\n\n\n  THIS IS NOT THE OFFICIAL COPY OF THE PDF BUT A DOWNLOAD THEN MERGER OF THE PDFs INTO ONE PDF FROM SAFARI. A FEW PAGES OVERLAP BUT THE REST OF THE PAGES ARE &quot;DECENT QUAILITY.&quot;\n\n\n","torrent":{"xt":"urn:btih:655ebb25adbad237c89f7c9e00be6b7e5be4a800","amp;dn":"Penetration+Testing+-+A+Hands-On+Introduction+to+Hacking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"655ebb25adbad237c89f7c9e00be6b7e5be4a800","infoHashBuffer":{"type":"Buffer","data":[101,94,187,37,173,186,210,55,200,159,124,158,0,190,107,126,91,228,168,0]},"announce":[],"urlList":[]}}