{"title":"FSX Challenges Over The Rockies - 9 Payware Missions","uid":5183769,"size":30160985,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:65683c10d10132620d04c2e269e22d9b693e0a2a&amp;dn=FSX+Challenges+Over+The+Rockies+-+9+Payware+Missions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"glupy","files":3,"time":1259369389,"description":"The Caffeinated Man Productions Group is proud to present this NEW Missions pack that is being sold exclusively here on Caffeinatedman.com.\n\nSo, why purchase a Mission pack? This Mission pack brings variety to the user. The virtual pilot can go from saving lives in a search and rescue mission to racing the clock in several timed events. Other missions include difficult landings in challenging weather conditions and you never know when a failure might create a serious problem for the crew to adapt to. Whether you are a serious flight simmer or just a casual user, you are bound to enjoy the variety in this mission pack.\n\nMany custom features have been added into this mission pack as well. Dozens of voiceover recordings are utilized in the missions. Air traffic control is heard in these voiceover recordings too. Don't know much about air traffic control? No problem. We designed some of the ATC communications in a simplified form for beginners and in other missions we included more realistic ATC commands.\n\nOther custom features included scenery placement of aircraft, helicopters, fuel trucks, emergency vehicles, and vehicles. Please note though, some of these scenery objects are only viewable if you are using this mission pack on a FSX install that also has the Acceleration Expansion pack installed.\n\nPRICE - $5.85. Why so inexpensive? We know other mission packs can sell from $25 to $40+ dollars but we strongly believe in providing a Payware Product that is accessible to more users and the lower price is aimed at making it easier for more people to purchase this product.\n\nFinally, all profits from the sales of this Payware Product go towards the continuation of this website, Caffeinatedman.com, and the continuation of the most successful Flight Simulation and Aviation basedChannel, the Cessna154 Channel.\n\nWe thank you for your business and support. Please ask any questions before purchasing.\n\n \n\nMissions Included\n\n \n\n9 Missions included:\n\n    * Rescue in the Rockies\n    * Rescue in the Rockies Part 2\n    * Denver Landing\n    * Denver Landing (Rough Conditions)\n    * Aspen Emergency\n    * Boulder Race\n    * Aspen Race\n    * Aspen Race Extreme\n    * Denver Race\n\n\n\n\nBUY THIS IF YOU LIKE IT, OR ELSE DELETE IT. ITS ONLY 5 DOLLARS AND IS WORTH IT. I OFFER THIS AS A &quot;TRIAL&quot;. SUPPORT CESSNA154 and BUY IT!!!!!!!","torrent":{"xt":"urn:btih:65683c10d10132620d04c2e269e22d9b693e0a2a","amp;dn":"FSX+Challenges+Over+The+Rockies+-+9+Payware+Missions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65683c10d10132620d04c2e269e22d9b693e0a2a","infoHashBuffer":{"type":"Buffer","data":[101,104,60,16,209,1,50,98,13,4,194,226,105,226,45,155,105,62,10,42]},"announce":[],"urlList":[]}}