{"title":"Drive a Crooked Road 1954 DvdRip Mp4 Lee1001","uid":9915384,"size":746808155,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6571ca5a918bc4b5af728df8b323ba079dcd4e0d&amp;dn=Drive+a+Crooked+Road+1954+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"xultfoad","files":2,"time":1396935603,"description":"Drive a Crooked Road 1954 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0046935/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0046935/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Drive_a_Crooked_Road&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Drive_a_Crooked_Road&lt;/a&gt;\nDrive a Crooked Road is an American thriller film first released in 1954, directed by Richard Quine. The film stars Mickey Rooney, Dianne Foster, Kevin McCarthy, Jack Kelly and Harry Landers. Our overall rating for this film is: good. \n\nA real surprise is Drive a Crooked Road, which shows a number of talents at their best. Director Richard Quine works very well with his actors and a script by Blake Edwards, and star Mickey Rooney proves that he can carry a low-key crime picture as brilliantly as he did his old MGM musicals. The use of L.A. locations is particularly adept. We expect to see the Kiss Me Deadly house on the Malibu beach, and the heroine's Hollywood apartment is up on Orange Avenue, right off of Franklin behind Grauman's Chinese Theater. The Palm Springs scenes feature a convincing race across some remote desert roads.\n\nLonely guy Eddie Shannon (Rooney) repairs cars by day and wins auto racing trophies on the weekend. When customer Barbara (looker Dianne Foster) shows an interest, Eddie can hardly believe his luck. But Barbara is baiting Eddie for her crook boyfriend Steve (Kevin McCarthy), a smoothie who needs a crack getaway car driver for his planned Palm Springs bank heist. With a few changes, the plot was re-used for a section of Don Siegel's 1964 remake of The Killers.\n\nForget Rooney's over-earnest grandstanding in his more famous pictures. He's terrific here as a conflicted guy working his way through feelings of inadequacy. Our concern for the character builds throughout, aided by the screenplay's avoidance of unrealistic plot developments: nobody acts foolish or cracks up to provide a violent finish.The getaway is a race against the clock, which seems arbitrary when nothing whatsoever goes wrong; it looks as if the crooks could have escaped by taking a bus out of town. The concluding showdown compensates completely. Director Quine invests his modest film with polished production,\n\nVIDEO\nSize.... 712mb\nDuration.... 01:22:51\nCodec.... h264\nFrame Width..... 720\nFrame Height.... 460\nData Rate....1080kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 115kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample ","torrent":{"xt":"urn:btih:6571ca5a918bc4b5af728df8b323ba079dcd4e0d","amp;dn":"Drive+a+Crooked+Road+1954+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6571ca5a918bc4b5af728df8b323ba079dcd4e0d","infoHashBuffer":{"type":"Buffer","data":[101,113,202,90,145,139,196,181,175,114,141,248,179,35,186,7,157,205,78,13]},"announce":[],"urlList":[]}}