{"title":"The History of Romanism - by John-Dowling 1853 - Htm-Pdf-Text","uid":5933322,"size":30941451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6586f7b5b2dfd1cdec9603df20b55039d0e79b2a&amp;dn=The+History+of+Romanism+-+by+John-Dowling+1853+-+Htm-Pdf-Text&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"UR-Djavu","files":3,"time":1288858991,"description":"The History of Romanism - by John-Dowling - Htm-Pdf-Text 1853\n\nThe History of Romanism - by John-Dowling - From The Earliest Corruptions Of Christianity upto 1853.\n\n(taken from the 700 page book - with extensive references)\njust open the page index_History-of-Romanism.htm in your favorite browser.\n(This file includes a PDF version of 29 MB and a Text version of 2.5 MB)\n\n\nPublishers Notice\n...has already obtained a circulation much more extensive than any other large volume ever published in America, upon the subject of which it treats; or perhaps in England, with the single exception of Fox s Book of Martyrs.\n...in pronouncing upon the work, and upon its character as a standard authority upon the subject of which it treats\n\nBOOK I\nPopery in Embryo.\nFrom The Earliest Corruptions of Christianity to the Papal Supremacy A.D. 606.\n\nCHAPTER I.\nChristianity Primitive and Papal.\n\nCHAPTER II.\nReligion in Alliance with the State.\n\nCHAPTER III.\nSteps Towards Papal Supremacy.\n\nCHAPTER IV.\nDivine Right of Supremacy Claimed and Disproved.\n\nCHAPTER V.\nPopery Fully Established. The Man of Sin Revealed.\n\nCHAPTER VI.\nPapal Supremacy. The Actors in its Establishment. The Tyrant Phocas. The Saint Gregory, and the Pope Boniface.\n\n \nBOOK II\nPopery at its Birth, A.D. 606.\nIts Doctrinal and Ritual Character at This Epoch.\n\nCHAPTER I.\nRomish Errors Traced to their Origin. Their Early Growth - No Argument in Their Favor.\n\nCHAPTER II.\nOrigin of Romish Errors Continued. Celibacy of the Clergy.\n\nCHAPTER III.\nOrigin of Romish Errors Continued. Worship of the Virgin Mary.\n\nCHAPTER IV.\nOrigin of Romish Errors Continued. Monkery.\n\nCHAPTER V.\nOrigin of Romish Errors Continued. Worship of Saints and Relics, etc.\n\nCHAPTER VI.\nStriking Resemblance Between Pagan and Papal Ceremonies. The Latter Derived from the Former.\n\n \nBOOK III\nPopery Advancing. From the Establishment of the Spiritual Supremacy, A.D. 606,\nTo the Popes Temporal Sovereignty, 756, and to the Crowning of the Emperor Charlemagne, 800.\n\nCHAPTER I.\nGradual Increase of the Papal Power. Darkness, Superstition, and Ignorance of this Period.\n\nCHAPTER II.\nHistory of the Monothelite Controversy. Pope Honorius Condemned as a Heretic by the Sixth General Council, A.D. 680.\n\nCHAPTER III.\nImage Worship. From the Beginning of the Great Controversy on This Subject, to the Death of the Emperor Leo, and of Pope Gregory III., Both in the Same Year, A. D. 741.\n\nCHAPTER IV.\nContinuation of the Controversy on Image-Worship. From the Death of Leo and Gregory, A. D. 741, to the Final Establishment of This Idolatry, by the Second Council of Nice, A. D. 787.\n\nCHAPTER V.\nThe Pope Finally Becomes a Temporal Sovereign, A. D. 756.\n\nCHAPTER VI.\nThe Confirmation and Increase of the Pope's Temporal Power, to the Coronation of Charlemagne, A. D. 800.\n\n \nBOOK IV\nPopery in its Glory. - The Worlds Midnight. - A.D, 800-1073,\nFrom the Coronation of Charlemagne, A.D. 800. to the Beginning of the Pontificate of Pope Hildebrand or Gregory VII., A.D. 1073.\n\nCHAPTER I.\nProofs of the Darkness of This Period. Forged Decretals. Reverence for Monks, Saints and Relics. Worship of the Virgin. Purgatory.\n\nCHAPTER II.\nProofs of the Darkness of this Period Continued. Origin and Final Establishment of Transubstantiation. Persecution of Berenger, its Famous Opposer. Popish Miracles in its Proof.\n\nCHAPTER III.\nProofs of the Darkness of This Period Continued. Baptism of Bells, and Festival of the Asses.\n\nCHAPTER IV.\nProfligate Popes and Clergy of This Period.\n\nCHAPTER V.\nPopery in England, Prior to the Conquest. Augustin the Missionary, and Dunstan the Monk.\n\n \nBOOK V\nPopery the Worlds Despot.\nFrom the Accession of Pope Gregory VII., A.D. 1073, to the Death of Boniface VIII., A.D. 1303.\n\nCHAPTER I.\nThe Life and Reign of Pope Hildebrand or Gregory VII.\n\nCHAPTER II.\nLife of Gregory VII. Continued. Other Instances of His Tyranny and Usurpation.\n\nCHAPTER III.\nPope Urban and the Crusades.\n\nCHAPTER IV.\nPopery in England After the Conquest. Archbishops Anselm and Thomas A Becket.\n\nCHAPTER V.\nPopery in England Continued. Pope Innocent and King John.\n\nCHAPTER VI.\nMore Instances of Papal Despotism. Popes Adrian IV., Alexander III., and Innocent III.\n\nCHAPTER VII.\nThe Waldenses and Albigenses.\n\nCHAPTER VIII.\nPope Innocent's Bloody Crusade Against the Albigenses, Under His Legate, The Ferocious Abbot of Citeaux, and Simon, Earl of Montfort.\n\nCHAPTER IX.\nEstablishment of the Mendicant Orders. Saint Dominic and Saint Francis.\n\nCHAPTER X.\nThe Fourth Council of Lateran Decrees the Extermination of Heretics, Transubstantiation, and Auricular Confession.\n\nCHAPTER XI.\nContests Between the Popes and the Emperor Frederick II. Guelphs and Ghibelines.\n\nCHAPTER XII.\nPurgatory, Indulgences, and Romish Jubilees.\n\n \nBOOK VI\nPopery on a Tottering Throne,\nFrom the Death of Boniface VIII. A.D. 1303, to the Commencement of the Council of Trent, A.D. 1545.\n\nCHAPTER I.\nThe Residence of the Popes at Avignon, and the Great Western Schism.\n\nCHAPTER II.\nWickliff, the English Reformer. The Condemnation of His Works, and the Burning of His Bones, by Order of the Council of Constance.\n\nCHAPTER III.\nJohn Huss of Bohemia. His Condemnation and Martyrdom by the Council of Constance.\n\nCHAPTER IV.\nJerome of Prague, at the Council of Constance. His Condemnation and Martyrdom.\n\nCHAPTER V.\nPopery and the Popes for the Century Preceding the Reformation.\n\nCHAPTER VI.\nThe Reformation. Luther and Tetzel. The Reformer's War Against Indulgences.\n\nCHAPTER VII.\nLuther and Cajetan. - The Noble Constancy of the Reformer.\n\nCHAPTER VIII.\nLuther Strikes at the Throne of Anti-Christ. The Breach Made Irreparable.\n\nCHAPTER IX.\nLuther at the Diet of Worms, and in His Patmos at Wartburg.\n\n \nBOOK VII\nPopery at Trent,\nFrom the Opening Session of the Council of Trent, A.D. 1545, to the Closing Session, A.D. 1563.\n\nCHAPTER I.\nThe First Four Sessions. Preliminaries, and Decree Upon the Authority of Tradition and the Apocrypha.\n\nCHAPTER II.\nFourth Session Continued. Latin Vulgate Exalted Above the Inspired Hebrew and Greek Scriptures. Private Judgment and Liberty of the Press Forbidden, and a Popish Censorship of the Press Established.\n\nCHAPTER III.\nOriginal Sin and Justification.\n\nCHAPTER IV.\nThe Sacraments and the Doctrine of Intention. - Baptism and Confirmation.\n\nCHAPTER V.\nSuspension of the Council in 1549, and Resumption Under Pope Julius III. in 1551. - Decree on Transubstantiation.\n\nCHAPTER VI.\nOn Penance, Auricular Confession, Satisfaction, and Extreme Unction - to the Second Suspension in April, 1552.\n\nCHAPTER VII.\nFrom the Seventeenth to the Twenty-Fifth and Closing Session. - Denial of the Cup to the Laity. The Mass. Sacraments of Orders and Matrimony. Purgatory. Indulgences. Relics, &amp;C.\n\nCHAPTER VIII.\nConclusion of the Council. - Acclamations of the Fathers, and Pope Pius's Creed.\n\n \nBOOK VIII\nPopery Drunk With the Blood of the Saints,\nPersecutions of Popery to the Revocation of the Edict of Nantes, A.D. 1685.\n\nCHAPTER I.\nPersecution Proved From Decrees of General Councils and Writings of Celebrated Divines to be an Essential Doctrine of Popery.\n\nCHAPTER II.\nSufferings of the English Protestants Under Bloody Queen Mary. - The Burning of Latimer, Ridley, Cranmer, &amp;C.\n\nCHAPTER III.\nThe Inquisition. - Seizure of the Victims. - Modes of Torture, and Celebration of the Auto Da Fe.\n\nCHAPTER IV.\nInhuman Persecutions of the Waldenses.\n\nCHAPTER V.\nPersecutions in France. - Massacre of St. Bartholomew, and Revocation of the Edict of Nantes.\n\n \nBOOK IX\nPopery in its Dotage.\nFrom the Revocation of the Edict of Nantes, A.D. 1685, to the Present Time, A.D. 1845.\n\nCHAPTER I.\nThe Jesuits. - Their Missions. - Their Suppression, Revival, and Present Position.\n\nCHAPTER II.\nThe Persecuting and Intolerant Spirit of Popery, as Exhibited in the Eighteenth And Nineteenth Centuries.\n\nCHAPTER III.\nPopery Unchanged. - Modern Documentary Evidence of its Hatred to Liberty of Opinion, Separation of Church and State, Freedom of the Press, and a Translated Bible.\n\nCHAPTER IV.\nPopery as it Now is. - Testimony of Eye-Witnesses. - Its Modern Pious Frauds and Pretended Miracles.\n\nCHAPTER V.\nRecent Events. - Discontent in Italy. - Puseyism. - The Holy Coat, and the Priest Ronge. - Jesuits in Switzerland. - Statistics. - Conclusion.\n\n \nSUPPLEMENT - 1\nFrom the Election of Pope Pius IX. to the Present Time A.D. 1846-1853.\n\n \nSUPPLEMENT - 2\nFrom the Election of Pope Pius IX. to the Present Time A.D. 1846-1853.\n\n\nExcellent historical account with plenty of references from an abundance of noteworthy historians and scholars throughout the centuries !\n","torrent":{"xt":"urn:btih:6586f7b5b2dfd1cdec9603df20b55039d0e79b2a","amp;dn":"The+History+of+Romanism+-+by+John-Dowling+1853+-+Htm-Pdf-Text","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6586f7b5b2dfd1cdec9603df20b55039d0e79b2a","infoHashBuffer":{"type":"Buffer","data":[101,134,247,181,178,223,209,205,236,150,3,223,32,181,80,57,208,231,155,42]},"announce":[],"urlList":[]}}