{"title":"George Jones - She Thinks I Still Care - 1962-1964 - Bear Family","uid":6373865,"size":620816524,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:65e2db331f642ce19d6ed11b8496ff3294869ec6&amp;dn=George+Jones+-+She+Thinks+I+Still+Care+-+1962-1964+-+Bear+Family&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"bonnie335","files":172,"time":1304781354,"description":"She Thinks I Still Care: The Complete United Artists Recordings, 1962-1964 5CD.\n\nBear Family Records. Release: 2007. Remastered.\n\nGeorge Jones was at United Artists for just three years -- and in those three years he recorded enough music to fill the five discs of Bear Family's She Thinks I Still Care: The Complete United Artists Recordings, 1962-1964. That's an amazing stat in itself, and it becomes even more remarkable when you consider that of the 150 songs on this box just six are previously unreleased, a miniscule number for a set this size, testament to how thoroughly the vaults were plundered, not just via CD reissues but at the time, when new George Jones albums appeared in a frenzied flood that did not abate until after he parted ways with Pappy Daily in the '70s, after a five-year stint with Musicor. That stint with Musicor remains largely ignored -- partially due to legal reasons it simply hasn't been reissued, but as Rich Kienzle points out in his liner notes to this set, &quot;Musicor grossly over-recorded him,&quot; so it's harder to sort out -- but these UA recordings have almost all seen the light of day on CD, compiled in a set of highlights for Razor &amp; Tie, which also issued a bunch of these proper albums during the '90s. As such, there isn't much of a sense of discovery on She Thinks I Still Care, but discovery often isn't the point of Bear Family boxes such as these. Context is, and revelations are often present in how familiar music is presented anew in these sets, and such is the case with this set.\n\nDuring his time at United Artists, George started turning into a slicker star than he was at Mercury. The productions got bigger, the music got sillier, the packaging got slicker -- he recycled &quot;White Lightning&quot; as &quot;Root Beer,&quot; he did historical numbers in the vein of Johnny Horton, he improbably cut a twist number aimed at the rock &amp; roll market, he recorded Christmas novelties, he sang seemingly countless songs written by J.P. Richardson, aka the Big Bopper, a pal of Pappy's who provided him with countless ditties for his acts to sing. Many of these made their way to his biggest star, George, and as always it's hard to tell whether Jones chose these songs to sing, or if he just sang everything that was presented to him. The sheer number of sides he cut at UA and Musicor suggests that he simply sang whatever came his way, exercising his control by directing sessions, making the records as good as they could be. Given the source material, this sometimes resulted in little more than appealing fluff, but it was appealing, as Jones always sang with conviction, no matter what kind of song was at hand.\n\nAs She Thinks I Still Care indicates, George sang more poppy material at UA than he did at Mercury, but sometimes he struck an ideal balance between hardcore country and pop, particularly the storming &quot;The Race Is On,&quot; a riotous classic that rivaled &quot;She Thinks I Still Care&quot; as his biggest hit for UA. Even with these two major crossover hits and the occasional cornball production, George spent a significant amount of time at UA cutting purer, harder country music, ranging from a bunch of gospel tunes to outright tributes to such heroes as Hank Williams, Bob Wills, and Little Jimmy Dickens. These tributes are some of his finest music -- the Hank is lean and cool, the Wills as wide-open and swaggering as Texas (thanks in part to the inclusion of some prime instrumentals, too), the Jimmy Dickens side-stepping novelties to zero in on his hardest country. Each of these records was the kind of standard-issue classic country LP -- no more than ten or 12 tracks that in total clock in at a half-hour -- that is easy to underrate as they're so tight and easy to enjoy (and in George's case, he made so many of them they're easy to take for granted), but when heard on this set, they form a strong core for Jones' UA work, especially when they're taken together with his duets with Melba Montgomery. Many (including the man himself) rank these as Jones' best duets ever, putting them above his work with Tammy Wynette collaborations, when in truth they're kind of hard to compare -- not only are they different from the lush, dramatic work with Tammy, they're quite a bit different than any other country he ever did, occasionally veering into the pile-driving intensity of bluegrass.\n\nThese hard country numbers form the heart of George's UA recordings, and their spirit bled into even some of his hit singles of the era, such as the desolate &quot;Open Pit Mine,&quot; but most of his charting singles found Jones smoother, developing his ballad style, best represented by the stone classic &quot;She Thinks I Still Care.&quot; This all can be heard on hits comps -- including Razor &amp; Tie's fine double-disc UA overview of the same name -- but what makes this Bear Family box valuable is how it's not only these hard country, novelties, and barroom ballads that surface; there's also Western swing, bluegrass, gospel, holiday tunes, even that twisting oddity. Not all of this is good, but George's performances always are. It often seems that George would sing anything put in front of him and sing it well -- in some ways, that's a detriment, as there's such a surplus of material, but it also gives fanatics plenty of minor moments to cherish, whether it's in neglected gems or mere turns of phase. Even so, it's hard to deny that Pappy Daily and Art Talmadage -- the head of UA who would later depart to form Musicor and, when he did, Daily and Jones followed right along -- treated George Jones as a mere commodity. While that resulted in too much music, much of it is saved by George's brilliant, intuitive performances, an almost accidental art that turns out to give even the fluff some permanence. ","torrent":{"xt":"urn:btih:65e2db331f642ce19d6ed11b8496ff3294869ec6","amp;dn":"George+Jones+-+She+Thinks+I+Still+Care+-+1962-1964+-+Bear+Family","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65e2db331f642ce19d6ed11b8496ff3294869ec6","infoHashBuffer":{"type":"Buffer","data":[101,226,219,51,31,100,44,225,157,110,209,27,132,150,255,50,148,134,158,198]},"announce":[],"urlList":[]}}