{"title":"How The Universe Works - Season 01 [Bluray]","uid":12587000,"size":9509291235,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:65f515be29a3092e65ce118dc64368a253b0dafd&amp;dn=How+The+Universe+Works+-+Season+01+%5BBluray%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"redback9","files":8,"time":1445037505,"description":"A users guide to the cosmos from the big bang to galaxies, stars, planets and moons. Where did it all come from and how does it all fit together. A primer for anyone who has ever looked up at the night sky and wondered.\r\n\r\nThanks to tlacatlc6 for providing and ripping the documentary. \r\n\r\nSeason 01 - 8 Episodes\r\n\r\nBig Bang S1, Ep1\r\nThis is the greatest story ever told, the creation of everything us. The programme investigates how the Universe came into existence out of nothing, and how it grew from a miniscule point, smaller than an atomic particle, to the vast cosmos we see today.\r\n \r\nBlack Holes S1, Ep2\r\nBlack Holes,the most powerful destroyers in the Universe, the most mysterious phenomena in the heavens. For years they were only speculation, now modern astronomy is proving them frighteningly real and showing that they may well shape everything we see.\r\n \r\nGalaxies S1, Ep3\r\nGalaxies, home to stars, planets and us, come in all shapes and sizes. Witnesses the evolution of galaxies; from clouds of cold gas floating in the voids of space 13 billion years ago, to the magnificent spirals that fill our night sky.\r\n \r\nStars S1, Ep4\r\nThe story of how stars were made by the Universe and how Stars then went on to engineer everything else in that very universe. They changed the Universe by spawning further generations of stars, then planets and eventually the building blocks of life.\r\n \r\nSupernovas S1, Ep5\r\nStars are not eternal; they are dying in unimaginably large explosions called supernovas. Second only to the Big Bang, these explosions are where creation and destruction meet. Only now have we begun to understand how these wonders in our sky work.\r\n \r\nExtreme Planets S1, Ep6\r\nThere are just eight planets in our solar system, but there could be a hundred billion planets in our Milky Way galaxy alone. This show follows the journey of planets as they grow from grains of dust to the magnificently diverse worlds we see today.\r\n \r\nSolar Systems S1, Ep7\r\nIs our solar system unique? Since the first discovery of a planet orbiting another star, some 280 alien solar systems have been identified. It's only by looking at solar systems far beyond our own, that we can understand how remarkable our universe is.\r\n \r\nMoons S1, Ep8\r\nMoons come in every possible shape and size. Home to incredible natural phenomena like gigantic geysers and colossal volcanoes, moons also offer perhaps the best chance of finding alien life in the Universe - and they probably exist in the billions","torrent":{"xt":"urn:btih:65f515be29a3092e65ce118dc64368a253b0dafd","amp;dn":"How+The+Universe+Works+-+Season+01+%5BBluray%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65f515be29a3092e65ce118dc64368a253b0dafd","infoHashBuffer":{"type":"Buffer","data":[101,245,21,190,41,163,9,46,101,206,17,141,198,67,104,162,83,176,218,253]},"announce":[],"urlList":[]}}