{"title":"Marion - The Program [1998]","uid":9392647,"size":353323719,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:663b30097bc7f0192a8683585aa464ef7f957d9d&amp;dn=Marion+-+The+Program+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387914221,"description":"Shuddering in with a roiling solo guitar and a slow, doomy rhythm before amping up the energy and activity in the rest of &quot;Smile,&quot; The Program makes for a strong second effort from Marion. Arguably it's a much more successful record than This World and Body, keeping the immediate, sudden joys of that album with a much more nuanced performance from Jaime Harding in particular. His higher registers aren't as overwhelming, and his singing in general sounds far more natural, knowing when to breathe and relax as much as when to shoot forth. The Tony Grantham/Phil Cunningham guitar team still sounds great; there are more than enough moments to show that they might be among Britpop's least appreciated fretbenders. If not quite on the same level of Radiohead's Jonny Greenwood in terms of tweaking with their chosen instruments, their performances throw in a wide array of sudden surprises, building on their earlier efforts with attractive results. Johnny Marr's production work likely helped on these and other fronts; the sound is generally warmer than Al Clay's earlier work without sacrificing visceral impact. &quot;Miyako Hideaway,&quot; the lead single, is a fair effort with a slightly dreamy midsection highlighted by a gentle echo for Harding's singing, but the best songs are elsewhere on the disc. &quot;What Are We Waiting For?&quot; in particular is a treasure. With an opening guitar figure that could be from a Cocteau Twins song and a fine vocal from Harding, it leads into a repetition of the title at the end over a soft but propulsive arrangement from the band as a whole. It's true subtlety from the band at last, and it works wonders. Other winners include the brisk acoustic/electric guitar combination on &quot;Sparkle,&quot; which unsurprisingly was released as a single later (admittedly only in Japan), and the low-key energy of the title track. (4/5)","torrent":{"xt":"urn:btih:663b30097bc7f0192a8683585aa464ef7f957d9d","amp;dn":"Marion+-+The+Program+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663b30097bc7f0192a8683585aa464ef7f957d9d","infoHashBuffer":{"type":"Buffer","data":[102,59,48,9,123,199,240,25,42,134,131,88,90,164,100,239,127,149,125,157]},"announce":[],"urlList":[]}}