{"title":"Edgar Box (aka Gore Vidal) - Death  Hot (pdf)","uid":8664839,"size":2908172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6641a623250a8d2aed9c8ba589c0171aab03a720&amp;dn=Edgar+Box+%28aka+Gore+Vidal%29+-+Death++Hot+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373391601,"description":"Edgar Box (aka Gore Vidal) - Death Likes It Hot (Signet, 1954). 128 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nEarly in his career, bestselling novelist Gore Vidal wrote three sparkling mysteries under the pseudonym Edgar Box starring amateur sleuth Peter Cutler Sargeant II. Death Likes It Hot, originally published in 1954, is the third of the trilogy.\n\nYoung public relations whiz Peter Cutler Sargeant II is invited by socialite Rose Veering to spend a weekend at her palatial Easthampton home. Sargeant, eager to escape New York city's summer heat, readily accepts, although his aging hostess soon has him doing double duty arranging publicity for an upcoming society party. \n\nPublicity soon arrives in a gruesome form when a guest is drowned. Was it an accident or murder? As the police investigate, Sargeant does his own snooping into the lives of his fellow suspects - and what he learns convinces him that something is dangerously amiss. This diabolically funny locked-room mystery is filled with Vidal's witty observations and dissections of the upper class.\n\n----\n\nNote the cover blurb from none other than Gore Vidal himself!\n\nI also have the first Edgar Box book and will upload it soon.","torrent":{"xt":"urn:btih:6641a623250a8d2aed9c8ba589c0171aab03a720","amp;dn":"Edgar+Box+%28aka+Gore+Vidal%29+-+Death++Hot+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6641a623250a8d2aed9c8ba589c0171aab03a720","infoHashBuffer":{"type":"Buffer","data":[102,65,166,35,37,10,141,42,237,156,139,165,137,192,23,26,171,3,167,32]},"announce":[],"urlList":[]}}