{"title":"Barry Manilow - The Greatest Songs Of The Fifties -(2006)[FLAC-E","uid":4568849,"size":324495021,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:670f8f125627954bafbd29c69e4fd9cdb71ade2a&amp;dn=Barry+Manilow+-+The+Greatest+Songs+Of+The+Fifties+-%282006%29%5BFLAC-E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"seanprince","files":24,"time":1228980928,"description":"Barry Manilow - The Greatest Songs Of The Fifties -(2006)[FLAC-EAC-CUE]\n\n\n\nTrack list\n\nBarry Manilow - The Greatest Songs Of The Fifties\n\n01. Moments To Remember 03:34\n02. It&amp;#039;s All In The Game 02:54\n03. Unchained Melody 03:45\n04. Venus 02:26\n05. It&amp;#039;s Not For Me To Say 03:23\n06. Love Is A Many Splendored Thing 02:42\n07. Rags To Riches 03:21\n08. Sincerely/Teach Me Tonight (Duet With Phyllis McGuire) 03:18\n09. Are You Lonesome Tonight 02:57\n10. Young At Heart 03:34\n11. All I Have To Do Is Dream 02:48\n12. What A Diff&amp;#039;rence A Day Made 03:03\n13. Beyond The Sea 04:08\n14. If You Love Me, Really Love Me 03:49\n15. As Time Goes By\n\n\nBiography by Steve Huey\n\nIn terms of both record sales and career longevity, Barry Manilow is one of the most successful adult contemporary singers ever. That success hasn&amp;#039;t necessarily translated to respect (or even ironic hipster appreciation) in most quarters; Manilow&amp;#039;s music has been much maligned by critics and listeners alike, particularly the romantic ballads that made his career, which were derided as maudlin schlock even during his heyday. It&amp;#039;s true that Manilow&amp;#039;s taste for swelling choruses and lush arrangements often bordered on bombastic, but unlike many of his MOR peers, Manilow wasn&amp;#039;t aiming to make smooth, restrained background music -- he conceived of himself as a pop entertainer and all-around showman in the classic mold, and his performances and stage shows were accordingly theatrical.\n\nManilow dominated pop music during the latter half of the &amp;#039;70s like few other performers, spinning off a long series of hit singles (including 13 number one hits on the adult contemporary charts) and platinum albums that essentially made the Arista label. The well began to run dry by the early &amp;#039;80s; no longer a superstar expected to deliver blockbuster hits, Manilow was free to explore his long-held taste for swing, pop standards, and Broadway show tunes, which dominated his albums from the mid-&amp;#039;80s on. He has continued to record steadily, and his popularity never completely eroded, as evidenced by the number three chart debut of his 2002 greatest-hits package, Ultimate Manilow, and the number one peak of his 2006 covers album, Greatest Songs of the Fifties.\n\nBarry Manilow was born Barry Alan Pincus on June 17, 1943, in Brooklyn, and grew up in its low-income Williamsburg section. His father left the family when Barry was two, and he eventually adopted his mother&amp;#039;s maiden name of Manilow. He began playing piano and accordion at age seven, and following high school, he was accepted to the prestigious Juilliard School of Music, which he paid for by working in the CBS mail room. From there, he became musical director of the CBS show Callback, and supported himself for the next few years by writing, producing, and performing advertising jingles (including high-profile campaigns for State Farm, Dr. Pepper, McDonald&amp;#039;s, Kentucky Fried Chicken, and more).\n\nIn 1971, he met Bette Midler, who hired him as her pianist, arranger, and musical director; he served as her accompanist on her legendary pre-fame tour of New York City&amp;#039;s gay bathhouses, masterminded her first two albums (1972&amp;#039;s The Divine Miss M and its self-titled follow-up), and debuted some of his original material at her Carnegie Hall show in the summer of 1972. Thanks to his gig with Midler, Manilow was able to land a record deal of his own with the fledgling Bell label, and his debut album, Barry Manilow I, was released in 1973. It didn&amp;#039;t sell very well, and when Bell became Arista, label head Clive Davis asked Manilow to record a pop tune called &quot;Brandy,&quot; which had been a U.K. hit for its co-writer, Scott English. Manilow changed the song into a ballad and changed the title to &quot;Mandy&quot; (to avoid confusion with the Looking Glass hit &quot;Brandy (You&amp;#039;re a Fine Girl)&quot;); released on 1974&amp;#039;s Barry Manilow II, &quot;Mandy&quot; became a number one hit early the next year. The Broadway-esque follow-up, &quot;It&amp;#039;s a Miracle,&quot; hit the Top 20, and a re-release of the Chopin-adapted ballad &quot;Could It Be Magic&quot; (from the first album) hit the Top Ten.\n\nWith his career thus established, Manilow recorded an even stronger follow-up album in 1975&amp;#039;s Tryin&amp;#039; to Get the Feeling. &quot;I Write the Songs&quot; (ironically, written by Beach Boys sideman Bruce Johnston) became his second number one pop hit in early 1976, and with the title track also hitting the Top Ten, the album went triple platinum. Manilow consolidated his emerging stardom with This One&amp;#039;s for You, released toward the end of the year; it produced hits in the title track, the Top Ten &quot;Weekend in New England,&quot; and the number one &quot;Looks Like We Made It.&quot; In 1977, Manilow released the concert double-LP Live, which became his first and only number one album, as well as his biggest hit with sales of over four million copies. The same year, he won an Emmy for his first prime-time special on ABC (aptly titled The Barry Manilow Special); the network would air Manilow specials for the next several years. Even Now was another triple-platinum success in 1978; &quot;Can&amp;#039;t Smile Without You,&quot; the disco-tinged &quot;Copacabana,&quot; and &quot;Somewhere in the Night&quot; all hit the Top Ten, with the first two marking a departure from Manilow&amp;#039;s typical reliance on ballads for his hits.\n\nThe first signs that Manilow&amp;#039;s run of success was in jeopardy came on 1979&amp;#039;s One Voice, which -- although it sold well and produced a Top Ten hit in an unlikely cover of former Mott the Hoople frontman Ian Hunter&amp;#039;s &quot;Ships&quot; -- didn&amp;#039;t have the same consistency of craftsmanship as its predecessors. Released in 1980, Barry spawned Manilow&amp;#039;s last Top Ten hit, &quot;I Made It Through the Rain&quot;; though he remained a massively popular international touring act, and continued to place hits on the adult contemporary charts for a few more years, the prime of his pop success was over. In 1984, Manilow officially changed direction, recording an album of swinging, jazzy originals called 2:00 A.M. Paradise CafÃƒÂ©; it featured jazz greats like Mel TormÃƒÂ©, Sarah Vaughan, Shelly Manne, and Gerry Mulligan. Subsequent ventures like 1987&amp;#039;s Swing Street, 1991&amp;#039;s Showstoppers, 1994&amp;#039;s Singin&amp;#039; with the Big Bands, and 1998&amp;#039;s Manilow Sings Sinatra all explored various facets of swing, vocal jazz, and traditional pop. In addition, Manilow&amp;#039;s stage musical Barry Manilow&amp;#039;s Copacabana: The Musical premiered in 1994, and continued to tour the U.S. and U.K.; another musical, Harmony, was premiered in 1999.\n\nManilow&amp;#039;s long relationship with Arista ended when he signed to the jazz-oriented Concord label, for which he debuted in late 2001 with the concept album Here at the Mayflower, which continued his evolution into a pre-rock pop stylist. Manilow began to reenter the wider public eye in 2002, performing &quot;Let Freedom Ring&quot; at the Super Bowl pre-game show; aided by television advertising, Ultimate Manilow entered the album charts at a stunning number three position that March. A DVD release of the collection followed, as well as a two-disc set of live music called 2 Nights Live that had been culled from a weekend in New Jersey. Manilow went back to the studio in 2005 to record a diverse collection of tracks from the 1950s with producer and music mogul Clive Davis. The resulting Greatest Songs of the Fifties, a labor of love, became a surprise hit and topped the charts in early 2006. A sequel, The Greatest Songs of the Sixties, arrived at the end of that year and reached number two, which paved the inevitable way for The Greatest Songs of the Seventies in September 2007.\n\nReview by Stephen Thomas Erlewine\n\nA kind of a variation on Clive Davis&amp;#039; wildly successful American Classic Songbook albums for Rod Stewart, The Greatest Songs of the Fifties finds Barry Manilow singing vocal pop favorites of the Eisenhower era. Although there are songs that are indeed classics of the rock &amp; roll era, there is no rock &amp; roll here. Manilow has picked songs like &quot;Venus,&quot; &quot;Are You Lonesome Tonight?,&quot; &quot;All I Have to Do Is Dream,&quot; and &quot;Unchained Melody&quot; (which originated in the &amp;#039;50s, but the Righteous Brothers had the biggest hit with it in 1965), which were on the pop crossover side of rock &amp; roll in the latter half of the &amp;#039;50s. These are complemented by pop standards -- such as &quot;It&amp;#039;s Not for Me to Say,&quot; &quot;Sincerely/Teach Me Tonight,&quot; &quot;What a Diff&amp;#039;rence a Day Made,&quot; &quot;Beyond the Sea&quot; -- on an album that, in terms of repertoire, would not be out of step with the MOR pop LPs Mitch Miller produced at Columbia in the &amp;#039;50s and &amp;#039;60s. Of course, The Greatest Songs of the Fifties is a 2006 release, so it has a slick, semi-synthesized sheen and a warm, hazy glaze of nostalgia which, truth be told, isn&amp;#039;t all that far removed from Manilow&amp;#039;s big hits of the &amp;#039;70s, when Barry was romanticizing the Copacabana and doing big-band medleys on-stage. Given this, it shouldn&amp;#039;t be a shock that Barry comes across as a slick, accomplished professional on these songs, never doing anything surprising but never resorting to hammy shtick, either, the way that Rod occasionally does on his songbook albums. That said, Greatest Songs isn&amp;#039;t as rich musically as Rod&amp;#039;s records, primarily because Manilow doesn&amp;#039;t collaborate with an outside arranger here, or even many other producers: as the back cover says, &quot;all song layouts created by Barry Manilow,&quot; and he keeps this within the realm of a nostalgic supper club revue. He does it well and he does it professionally, which will certainly make this record pleasing to his fans, but the record is just a shade too predictable (but never unpleasant) for listeners who aren&amp;#039;t already firmly within Manilow&amp;#039;s camp.","torrent":{"xt":"urn:btih:670f8f125627954bafbd29c69e4fd9cdb71ade2a","amp;dn":"Barry+Manilow+-+The+Greatest+Songs+Of+The+Fifties+-%282006%29%5BFLAC-E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670f8f125627954bafbd29c69e4fd9cdb71ade2a","infoHashBuffer":{"type":"Buffer","data":[103,15,143,18,86,39,149,75,175,189,41,198,158,79,217,205,183,26,222,42]},"announce":[],"urlList":[]}}