{"title":"Trends in Packaging of Food, Beverages and Other Fast-Moving Con","uid":15326218,"size":10641838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67365cd828624ceb2a0e3445a56d1748e7f6156a&amp;dn=Trends+in+Packaging+of+Food%2C+Beverages+and+Other+Fast-Moving+Con&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1468700521,"description":"Trends in Packaging of Food, Beverages and Other Fast-Moving Consumer Goods (FMCG) - Neil Farmer (WP, 2013).pdf\r\n\r\nISBN 978-0-85709-503-9\r\n\r\nPackaging plays an essential role in protecting and extending the shelf life of a wide range of foods, beverages and other fast-moving consumer goods. There have been many key developments in packaging materials and technologies in recent years, and Trends in packaging of food, beverages and other fast-moving consumer goods (FMCG) provides a concise review of these developments and international market trends.\r\n\r\nBeginning with a concise introduction to the present status and trends in innovations in packaging for food, beverages and other fast-moving consumer goods, the book goes on to consider modified atmosphere packaging and other active packaging systems, including smart and intelligent packaging, and the role these play in augmenting and securing the consumer brand experience. Developments in plastic and bioplastic materials and recycling systems are then discussed, followed by innovations and trends in metal, paper and paperboard packaging. Further chapters review international environmental and sustainability regulatory and legislative frameworks, before the use of nanotechnology, smart and interactive packaging developments for enhanced communication at the packaging/user interface are explored. Finally, the book concludes by considering potential future trends in materials and technologies across the international packaging market.\r\n\r\nWith its distinguished editor and international team of expert contributors, Trends in packaging of food, beverages and other fast-moving consumer goods (FMCG) is an important reference tool, providing a practical overview of emerging packaging technologies and market trends for research and design professionals in the food and packaging industry, and academics working in this area.\r\n\r\nIntroduces the present status, current trends and new innovations in the field whilst considering future trends in materials and technologies\r\nConsiders modified atmosphere packaging and other active packaging systems including smart and intelligent packaging\r\nDiscusses developments in plastic and bioplastic materials and recycling systems","torrent":{"xt":"urn:btih:67365cd828624ceb2a0e3445a56d1748e7f6156a","amp;dn":"Trends+in+Packaging+of+Food%2C+Beverages+and+Other+Fast-Moving+Con","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67365cd828624ceb2a0e3445a56d1748e7f6156a","infoHashBuffer":{"type":"Buffer","data":[103,54,92,216,40,98,76,235,42,14,52,69,165,109,23,72,231,246,21,106]},"announce":[],"urlList":[]}}