{"title":"Desperate Passage: The Donner Party's Perilous Journey West [PDF","uid":9378832,"size":2082283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:681566b1830546b9d91962349803b7475f7236c1&amp;dn=Desperate+Passage%3A+The+Donner+Party%27s+Perilous+Journey+West+%5BPDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bey0nd","files":-1,"time":1387674812,"description":"In late October 1846, the last wagon train of that year's westward migration stopped overnight before resuming its arduous climb over the Sierra Nevada Mountains, unaware that a fearsome storm was gathering force. After months of grueling travel, the 81 men, women and children would be trapped for a brutal winter with little food and only primitive shelter. The conclusion is known: by spring of the next year, the Donner Party was synonymous with the most harrowing extremes of human survival. But until now, the full story of what happened - and what it tells us about human nature and about America's westward expansion - remained shrouded in myth. Drawing on fresh archeological evidence, recent research on topics ranging from survival rates to snowfall totals, and heartbreaking letters and diaries made public by descendants a century-and-a-half after the tragedy, Ethan Rarick offers an intimate portrait of the Donner party and their unimaginable ordeal: a mother who must divide her family, a little girl who shines with courage, a devoted wife who refuses to abandon her husband, a man who risks his life merely to keep his word. Rarick resists both the gruesomely sensationalist accounts of the Donner party as well as later attempts to turn the survivors into archetypal pioneer heroes. &quot;The Donner Party,&quot; Rarick writes, &quot;is a story of hard decisions that were neither heroic nor villainous. Often, the emigrants displayed a more realistic and typically human mixture of generosity and selfishness, an alloy born of necessity.&quot; A fast-paced, heart-wrenching, clear-eyed narrative history, Desperate Passage casts new light on one of America's most horrific encounters between the dream of a better life and the harsh realities such dreams so often must confront.\n\nAbout the Author:\nEthan Rarick has written about politics, crime, business and sports throughout the West. His work has appeared in many publications, including the Los Angles Times and the San Francisco Chronicle, and he is the author of California Rising: The Life and Times of Pat Brown. He lives in Berkeley, California. \n\nPaperback: 304 pages\nPublisher: Oxford University Press (July 22 2009)\nLanguage: English\nISBN-10: 0195383311\nISBN-13: 978-0195383317","torrent":{"xt":"urn:btih:681566b1830546b9d91962349803b7475f7236c1","amp;dn":"Desperate+Passage%3A+The+Donner+Party%27s+Perilous+Journey+West+%5BPDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"681566b1830546b9d91962349803b7475f7236c1","infoHashBuffer":{"type":"Buffer","data":[104,21,102,177,131,5,70,185,217,25,98,52,152,3,183,71,95,114,54,193]},"announce":[],"urlList":[]}}