{"title":"[FSX] - Lotus Simulations - L-39C Albatros v1.35","uid":7167249,"size":229722476,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:68384a12e4c7b4de3bea273aae946769996e0838&amp;dn=%5BFSX%5D+-+Lotus+Simulations+-+L-39C+Albatros+v1.35&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"whtvr2","files":1,"time":1333820454,"description":"The Lotus L-39 Albatros bucks the trend in framerate sapping high-polygon aircraft models by careful and considered design of geometry, textures, and mapping. It employs every trick in the book (and many that aren\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t) to simultaneously achieve high detail and high framerate performance. This aircraft was built from scratch to specifically accomodate the greater performance demands of FSX multiplayer flight and features a highly optimized virtual cockpit and extremely low overhead external model. Just as the real Albatros was designed for student pilot training, Shared Cockpit flight in FSX is the defining purpose of this aircraft. It was designed for this mode from day one.\n\n Single seat cockpit variants are also included for those who desire even greater VC performance. In addition, a special stripped down model designed specifically for those who fly online in large formation teams is included. All of this extra effort to keep framerate high in the demanding multiplayer environment results in a plane that is simply sublime for singleplayer use as well.\n\n Along with an emphasis on high framerate performance comes the systems and flight model fidelity that FSX users have come to expect in a quality addon aircraft, and this L-39 contains a number of never before seen features and special effects.\n\nImmersion is everything.\n  &lt;a href=&quot;\nhttp://www.lotussim.com/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lotussim.com/index.html&lt;/a&gt;","torrent":{"xt":"urn:btih:68384a12e4c7b4de3bea273aae946769996e0838","amp;dn":"%5BFSX%5D+-+Lotus+Simulations+-+L-39C+Albatros+v1.35","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68384a12e4c7b4de3bea273aae946769996e0838","infoHashBuffer":{"type":"Buffer","data":[104,56,74,18,228,199,180,222,59,234,39,58,174,148,103,105,153,110,8,56]},"announce":[],"urlList":[]}}