{"title":"Healthy Fruit Dessert Recipes 101 Recipes from Cookies and Cake ","uid":9383664,"size":5256268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6857ee9309097e179152b18f6237ef4b1445e31a&amp;dn=Healthy+Fruit+Dessert+Recipes+101+Recipes+from+Cookies+and+Cake+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":7,"time":1387758755,"description":"No meal is complete without a decadent dessert, don't you agree? For most of us, a dessert is that treat we wait for the whole day, is that moment when we indulge on something sweet without thinking how many calories it has, how much sugar or how healthy it is. However, the after dessert moments sometimes turn into guilt feelings.\nBut it doesn't have to be like that if you know for sure that the dessert you make is healthy and nutritious. This book does exactly that - compiles healthy dessert recipes for your convenience.\nAdmit it! How many times you looked for easy healthy recipes or low calorie recipes and found too few? Look no more as you have all the answers in this book. All the healthy dessert recipes you want are here. From the most decadent fruit cake recipes to light cookies or breads, you name it, this book has it.\nThe idea behind this book is to teach you that dessert and fruit cakes can be decadent and rich without having too much fat and sugar, but containing healthyand nutritious ingredients. ","torrent":{"xt":"urn:btih:6857ee9309097e179152b18f6237ef4b1445e31a","amp;dn":"Healthy+Fruit+Dessert+Recipes+101+Recipes+from+Cookies+and+Cake+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6857ee9309097e179152b18f6237ef4b1445e31a","infoHashBuffer":{"type":"Buffer","data":[104,87,238,147,9,9,126,23,145,82,177,143,98,55,239,75,20,69,227,26]},"announce":[],"urlList":[]}}