{"title":"80+ iDoser doses, converted to SBa gen .sbg sequenced files","uid":4975627,"size":84666,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6889cb4edf21cb162fa720f04c646aa56305023e&amp;dn=80%2B+iDoser+doses%2C+converted+to+SBa+gen+.sbg+sequenced+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid22","files":86,"time":1245980592,"description":"This torrent and archive contains 82 i-doser doses, converted into .sbg files.\n\nQuick explanation:\n\nA corporation, known as i-doser  has been producing things called &quot;drugs&quot; for a few years now. These &quot;drugs&quot; are scientifically known as brainwave entrainment (or binaural brainwave technology). \n\nBinaural sounds work by playing a tone in each ear. The idea stems from the concept of Indian drums: When the Indian or Native Americans played certain drum beats or noises in a drum cyrcle, they could change their brainwave and thus achieve consciousness levels far beyond the perception of everyday life. \n\nThis is exactly how binaural sounds work: The varying pitch in each ear creates a &quot;beat&quot; and rythm, which, when focused upon the right way, can help you achieve certain consciousness states. These sounds &quot;tune&quot; or entrain your brain to a frequency level.\n\nOn a personal note, these did not work for me - however, many friends have reported successes with the dose. My soul seems to block the sound: I raise an energy shield when I listen to these doses. I also have difficulties focusing on the dose itself and my mind drifts very easily.\n\nusage and install:\n1. download SBaGen, by visiting the website of Jim Peters, program author: &lt;a href=&quot;\nhttp://uazu.net/sbagen/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uazu.net/sbagen/&lt;/a&gt; \n2. click on download, and select the appropriate platform you want to use for the doses. (Windows/Mac/Linux/pocket pc)\n3. install\n4. simply locate the .sbg file you wish to hear. They are in the /sbg sequence files directory of this torrent or package. PLEASE DON'T FORGET TO CHECK OUT THE 00dose_descriptions.txt file for descriptions of the following .sbg files. For easier navigation, look for a :: sign using the find function of your text editor, or find the name of the desired dose.\nIncluded 84 doses are:\n\n5HTP\nAnti-Migraine\nA-BOMB\nAbsinthe\nacidQH\nAdrenaline\nADRENOCHROME\nAlcohol\nAlpha\nAnesthesia\nAntiSad\nAstral Projection\nBeta\nBlack Sunshine\nbrain+\nCalm ME\nChakra\nCliff Hanger\nCocaine\ncocaine quick hit(QH):\nCondition\nConfidence\nContent\nCrack\nCrystal Meth\nDelta\nDexies\nDiet+\nDivinorum\nDowner\nDXM\nepsilon\nEcstasy\nExcite\nExtend\nFrench Roast\nFirst Love\nGamma\nGate of Hades\nGenesis\nGinkgo\nHand of God\nhangover cure\nHASH\nHash - Quick Hit\nHeroin\nInsomniac\nInspire\nJuiceIT!\nKava\nKetamine\nLSD\nLucid Dream\nMarijuana\nmarijuana Quick Hit\nMasochist\nMorning Glory\nMorphine\nNitrous\nOpium\nOpium Quick Hit\nOrgasm\nOrgasm Quick hit\nOut of Body\noxy\nPeyote\nPeyote Quick Hit\nQuickHappy\n!RAVE!\nReset\nreset QH\nSleeping Angel\nSpeed\nspeed quick hit\nTheta\nTranquil\nTrip\ntrip Quick hit\nViagra\nVico\nWhite Crosses\nYaBa\n\n---\nEnjoy! Prepare to fry your brain - for free! No more computer limits or buying expensive doses from a company which, for a few years, used the SBA gen program in their comercial software without proper licensing! (yes, the iDoser software also uses SBaGen as their core engine).\n\np.s:\nTo convert to mp3, right-click the file and choose convert to wav (30 min). Next, download gold-wave  and convert the .wav file into .mp3. You may also use your own prefered wav to mp3 converter. If your dose is larger than 30 minutes (some are 50), you may hit &quot;convert wto wav&quot; in the right-click menu of the .sbg file. This will make your file 1 hour long. At the end of the sequence (50 minutes is up), there will be a 10 minute pause or break. \nIf you wish to make your .wav output exactly 50 minutes, you will need to read the SBaGen manual and dig deeper into the program. I do know that there are ways to specify exact length for the .wav file.\n","torrent":{"xt":"urn:btih:6889cb4edf21cb162fa720f04c646aa56305023e","amp;dn":"80%2B+iDoser+doses%2C+converted+to+SBa+gen+.sbg+sequenced+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6889cb4edf21cb162fa720f04c646aa56305023e","infoHashBuffer":{"type":"Buffer","data":[104,137,203,78,223,33,203,22,47,167,32,240,76,100,106,165,99,5,2,62]},"announce":[],"urlList":[]}}