{"title":"FSX - Aerosoft - Mega Airport Budapest v1.20","uid":3822868,"size":588097964,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:68ec48564eab2cba52292b9ebb5087b04061d8d3&amp;dn=FSX+-+Aerosoft+-+Mega+Airport+Budapest+v1.20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"4X-AXG","files":13,"time":1191014917,"description":"Mega Airport Budapest \n\nA pretty nice scenery of the Budapest main airport, Ferihegy International Airport and the capital with photorealistic ground textures and extensive autogen. This full FSX scenery has been created by Andras Kozma (a native of Budapest) and well known for his award winning scenery projects! \n\nBudapest is the capital of Hungary and one of the oldest cities in Central Europe. ItÃƒ?Ã‚Â¢??s history is rich and varied, with many highlights and several very sad periods. With Hungary being the odd one out in the Soviet Block (it had more freedom then the other Eastern European states) it was able to recover from the devastation of the last part of World War II with much more style and feeling for its history then most other cities in Eastern Europe. As the thousands of tourists can testify to, it is a city that certainly deserves a visit. \n\nThe Budapest main airport, Ferihegy International Airport is the most important airport in Hungary and has handled over 8 million passengers last year. Large enough to handle B747 (and most likely the A380) it has connections to most European airports and has recently seen a big increase in low costs airline flights. MalÃƒ??Ãƒ?Ã‚Â©v Hungarian Airlines is the main Hungarian airline and it has its home base at Ferihegy. MalÃƒ??Ãƒ?Ã‚Â©v and Delta operate flights from Budapest to New York. The three main terminals (1, 2A, 2B) and the General aviation terminal will be joined by a new Freight terminal soon and companies like UPS are starting to use Ferihegy more and more. Most striking on the airport is for sure the control tower, a large structure build up from ground level on two massive pillars. \n\nBudapest main features:\n\nHighly detailed taxiway and runway layout, with high definition textures\nFully compatible with standard and third party AI-Traffic \nFull winter textures\nFull night textures\nIncludes high density mesh of surrounding\nIncludes full photographic ground texture of Budapest (so on your approaches you will get a good chance to see the layout of the city)\nHigh level of animated car and bus traffic on airport\nFull and detailed lighting\nVery high number of objects on tarmac\nSuperb optimization on every view angle so frame rates are stable\nA version of this scenery is used in MalÃƒ??Ãƒ?Ã‚Â©v simulators at Ferihegy!\nClick here to view the screenshots of the FS2004 version! \n\nBudapest FSX specific features:\n\nAll textures in DDS format (better suitable for modern graphics cards)\nBumpmaps and specular textures maps (increasing details and adding new visual features)\nCompatible with the new FSX round world model (no floating objects near the edges of the covered area)\nPhoto coverage bitmaps inside the BGL (faster loading than all separate textures)\nSounds added to objects (so you hear the truck you are going to crash into)\nExtensive car traffic on highways in the area\nBirds in the surrounding (better avoid those, they can crash your aircraft)\nPerformance warning (FSX only) !\nAt the current state of FSX you will have to expect to drop between 40 and 45% in frame rate when comparing default Ferihegy and the Mega Airport Budapest Ferihegy. So before you buy, load LHBP in FSX and check your frame rates there. You could also visit the default KLAX in FSX as Mega Airport Budapest has very similar performance (also note that we are able to show around 3 times the number of objects for the same performance!)","torrent":{"xt":"urn:btih:68ec48564eab2cba52292b9ebb5087b04061d8d3","amp;dn":"FSX+-+Aerosoft+-+Mega+Airport+Budapest+v1.20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68ec48564eab2cba52292b9ebb5087b04061d8d3","infoHashBuffer":{"type":"Buffer","data":[104,236,72,86,78,171,44,186,82,41,43,158,187,80,135,176,64,97,216,211]},"announce":[],"urlList":[]}}