{"title":"How Come They're Happy And I'm Not - Peter Bongiorno.epub","uid":9580296,"size":1654124,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:696f087fe42724aab8110f8117e11b89f0fc6638&amp;dn=How+Come+They%27re+Happy+And+I%27m+Not+-+Peter+Bongiorno.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391749211,"description":"Millions of people suffer debilitating depression. For many people who suffer from depression and anxiety, prescription drugs have either not been effective or have produced intolerable side effects. Now, New York naturopathic doctor and acupuncturist Peter Bongiorno offers a proven drug-free approach for healing depression.\n\nIn How Come They're Happy and I'm Not? Dr. Bongiorno explains that depression and chronic low moods often have roots in physical ailments: inflammation, digestive problems, poor nutrient absorption, disease. Depression can also be brought on by spiritual concerns, life events, or simply insufficient resources in dealing with day-to-day stress.\n\nBongiorno's integrative, natural approach to healing, which he has used successfully with his own patients, features a personalized approach: working with one's doctor to help identify underlying causes with blood tests and recommendations for dietary changes, botanical medicines, yoga, massage, and acupuncture points, to tailor a treatment plan based on an individual's particular symptoms and circumstances.\n\nHow Come They're Happy and I'm Not? offers a safe alternative to drugs for treatment of depression as well as a way to safely wean oneself off medication without relapsing or side-effects.","torrent":{"xt":"urn:btih:696f087fe42724aab8110f8117e11b89f0fc6638","amp;dn":"How+Come+They%27re+Happy+And+I%27m+Not+-+Peter+Bongiorno.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"696f087fe42724aab8110f8117e11b89f0fc6638","infoHashBuffer":{"type":"Buffer","data":[105,111,8,127,228,39,36,170,184,17,15,129,23,225,27,137,240,252,102,56]},"announce":[],"urlList":[]}}