{"title":"Richard Donkin - The History of Work [2010][A]","uid":10396681,"size":3788005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a954a08b62cc4a3319e42d9d426d610994ac999&amp;dn=Richard+Donkin+-+The+History+of+Work+%5B2010%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403276189,"description":"Description\nProduct Details\nBook Title: The History of Work\nBook Author: Richard Donkin (Author)\nPaperback: 350 pages\nPublisher: Palgrave Macmillan (June 15, 2010)\nLanguage: English\nISBN-10: 0230238939\nISBN-13: 978-0230238930\n\n===================================================================================\nBook Description\nPublication Date: June 15, 2010\nThis sweeping survey of the history of work, from hunter-gatherers to dotcom telecommuters, deftly compresses thousands of years of human evolution into an incisive volume It is a book about work, about the organization and management of work, but it is also a book about people.\n\n===================================================================================\nReviews\n'Richard Donkin is a humane, thoughtful writer who has spent years considering the changing shape of work.' - Financial Times Review\n\n'This book is huge. In every good sense of the word. It certainly belongs on the bookshelf of every leader and every scholar in the area of management and organizational life.' - Warren Bennis, author of the bestselling On Becoming a Leader\n\n'There are a lot of books about work and employment. Richard Donkin has written a book that stands apart from the rest. Blood Sweat&amp; Tears is engaging and intelligent reading, rooted in both historical and personal understanding and insight.' - Jeffrey Pfeffer, Professor, Stanford Business School, USA and author of The Human Equation: Building Profit by Putting People First\n\n'A rich and varied treasure trove. Donkin is a great storyteller.' - Management Today\n\n'An absorbing, thoughtful and stimulating read for anyone involved with directing or managing business enterprises.' -The Director\n\n'Powerful and wide-ranging.' - Times Literary Supplement.\n\n'A must read.' - Scotland on Sunday\n\n'This work poses thoughtful questions about our definition of work and is recommended for academic and business libraries.' - New York Times\n\n'Mr Donkin has turned the dull as nails question of what labour is through history in to a page turner of a book.' - The Globe and Mail, Toronto\n\n'This historical analysis of the Protestant work ethic makes for provocative reading in an age of unprecedented affluence.' - Harvard Business Review.\n\n'A crie de coeur for the white collar middle class.' - The Washington Book Review.\n\n'An intelligent and thoroughly readable analysis of the nature of work.' - Business Books.\n\n'Donkin introduces excellent and intellectual analysis about the theories, practices and individuals that have helped change and change the working world.' - United Press International.\n\n'An excellent primer on the human dynamics and great possibilities of the new economy.' - Don Tapscott\n\nReview for The Future of Work: 'Richard has written one of the best histories of work and now repeats the trick looking forward at the future of work. Separating popular myths and dogma from the truly transforming trends in the workplace, he ably reveals what is, will and should be happening at work in response to key environmental, social and business changes. Essential reading for executives with any responsibility for people in work and for all those of us trying to plot our own way successfully through this shifting employment landscape.' - Duncan Brown, Director, HR Business Development, IES\n\n===================================================================================\nFrom the Author\nIf you're thinking about buying this book, let me assure you that it's as fresh now as it was when it was written more than 10 years ago. The revision brought it up to date with the internet revolution. If you're just starting a career in human resources, I can't think of a better primer. If you're interested in history but get a bit fed up with constant references to wars and rulers, this is the book for you. Do you ever look at a stoneage tool and wonder about the people who fashioned it? If, so you'll like this book. It's very well written too, not some dry academic tome.\nA year of my life went in to this book and it was the best year. It brought together all the learning I'd acquired in writing my columns and much new learning from books and travel. I didn't just write about people like F W Taylor, but went to the factory where he worked and to his home. You learn a lot about people that way. Travelling this way helped to give the book a sense of place.\n\n===================================================================================\nAbout the Author\nRICHARD DONKIN is one of the UK's leading thinkers on employment. For fourteen years he wrote a weekly column on work and employment in the Financial Times that became required reading for human resources professionals and recruiters. Today he works as an author, commentator and presenter on management and employment issues. Alongside regular commitments, that include a monthly column for Human Resources Magazine, he writes on travel, fishing and sailing. Donkin undertakes regular speaking engagements and consultancy work. He is a former adviser to the Future Employment Working Group of the Recruitment and Employment Confederation and an honorary visiting fellow in the faculty of Management at Cass Business School.\n===================================================================================","torrent":{"xt":"urn:btih:6a954a08b62cc4a3319e42d9d426d610994ac999","amp;dn":"Richard+Donkin+-+The+History+of+Work+%5B2010%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a954a08b62cc4a3319e42d9d426d610994ac999","infoHashBuffer":{"type":"Buffer","data":[106,149,74,8,182,44,196,163,49,158,66,217,212,38,214,16,153,74,201,153]},"announce":[],"urlList":[]}}