{"title":"Darkwood Alpha v5.0","uid":12012293,"size":923263568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6accc13800156ad263a3df841c3cf91af12c0d7d&amp;dn=Darkwood+Alpha+v5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1434230712,"description":"About This Game\nPLEASE READ BEFORE BUYING:\nDarkwood is in Early Access right now. This means the game will have bugs (ranging from minor annoyances to not being able to run the game at all) and will change during development. Your savegames will be wiped on each update, which will happen about once a month. However it may happen that if we are in the middle of implementing a new chapter, or making a transition to a newer version of our game engine, these updates may be slower. If these things bother you and you'd rather just play the finished game, simply wait until the final release.\nPLEASE READ THE KNOWN ISSUES THREAD BEFORE BUYING\n\nDarkwood is a unforgiving, story-driven survival horror with a procedurally generated, open world. If you crave for a deep and rewarding experience with dense atmosphere, memorable characters, satisfying exploration, crafting and challenging combat, Darkwood will suck you in for days.\n\nThe fear of unknown is powerful. Your senses will be deceived by Darkwood's surreal terrors. No answer will be given to you for free, yet somewhere in the woods lies the truth, an explanation to what has happened in this godforsaken place.\n\n    By day, explore the randomly generated woods, scavenge for materials and weapons, discover secrets, solve mysteries and talk, trade with or kill the various inhabitants of Darkwood.\n    By night, find shelter, barricade, set up traps and hide or defend yourself from the horrors that lurk in the dark.\n    Gain skills or perks by extracting essence from mutated fauna and flora and injecting it into your bloodstream. This might also have various unexpected consequences...\n    Each action you take will have impact on Darkwood and its inhabitants. The choices you make will define the story which you will experience.\n    As days go by, the lines between reality and nightmarish fantasies will begin to blur. You will start to question the protagonist's sanity, but may also stumble upon your own hidden fears","torrent":{"xt":"urn:btih:6accc13800156ad263a3df841c3cf91af12c0d7d","amp;dn":"Darkwood+Alpha+v5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6accc13800156ad263a3df841c3cf91af12c0d7d","infoHashBuffer":{"type":"Buffer","data":[106,204,193,56,0,21,106,210,99,163,223,132,28,60,249,26,241,44,13,125]},"announce":[],"urlList":[]}}