{"title":"David Wellington - A Werewolf Tale series (Retail)","uid":10079505,"size":5433541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ad94bd6c8d8f736093f7bd9dfd149d4d835ba0d&amp;dn=David+Wellington+-+A+Werewolf+Tale+series+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheRose88","files":8,"time":1398975147,"description":"David Wellington - A Werewolf Tale series - Retail (epub &amp; mobi)\n\n01 Frostbite\n02 Overwinter\n\nFrostbite\nFor Cheyenne Clark, there's a bad moon on the rise . . .\n\nThere's one sound a woman doesn't want to hear when she's lost and alone in the Arctic wilderness: a howl. \n\nWhen a strange wolf's teeth slash Cheyenne's ankle to the bone, her old life ends, and she becomes the very monster that has haunted her nightmares for years. Worse, the only one who can understand what Chey has become is the man--or wolf--who's doomed her to this fate. He also wants to chop her head off with an axe. \n\nYet as the line between human and beast blurs, so too does the distinction between hunter and hunted . . . for Chey is more than just the victim she appears to be. But once she's within killing range, she may find that--even for a werewolf--it's not always easy to go for the jugular.\n\nOverwinter\nThe days grow colder. The nights grow longer. And every time the moon rises, the wolf inside her grows a little stronger.\n\nCheyenne Clark--a woman whose hatred for werewolves has turned her into the very beast she most despises--prowls the Arctic Circle on the trail of an ancient secret, hunting for the one thing that could remove the lycanthropic curse and make her human again. \n\nYet standing between Chey and her goal are a werewolf hunter armed with a diabolically brilliant weapon, a centuries-old werewolf with her own mysterious agenda...and Chey's own complicated feelings for the man who doomed her to this existence but on whom her life now depends. \n\nWorse, with every hour that passes, the wolf inside Chey becomes more powerful. It won't be long before the woman disappears completely, and only the beast is left. \n\n","torrent":{"xt":"urn:btih:6ad94bd6c8d8f736093f7bd9dfd149d4d835ba0d","amp;dn":"David+Wellington+-+A+Werewolf+Tale+series+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad94bd6c8d8f736093f7bd9dfd149d4d835ba0d","infoHashBuffer":{"type":"Buffer","data":[106,217,75,214,200,216,247,54,9,63,123,217,223,209,73,212,216,53,186,13]},"announce":[],"urlList":[]}}