{"title":"Nanoparticles,  Nanocomposites, Nanomaterials [PDF]~StormRG~","uid":9711860,"size":19109317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b1c1205e304c1c88b2ded96050f44be21485177&amp;dn=Nanoparticles%2C++Nanocomposites%2C+Nanomaterials+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"0xmovva","files":-1,"time":1394120077,"description":"Author: Dieter Vollath\nPaperback: 320 pages\nPublisher: Wiley-VCH; 1 edition (October 14, 2013)\nLanguage: English\nISBN-10: 3527334602\nISBN-13: 978-3527334605\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\nMeeting the demand for a readily understandable introduction to nanomaterials and nanotechnology, this textbook specifically addresses the needs of students - and engineers - who need to get the gist of nanoscale phenomena in materials without having to delve too deeply into the physical and chemical details.\n\nThe book begins with an overview of the consequences of small particle size, such as the growing importance of surface effects, and covers successful, field-tested synthesis techniques of nanomaterials. The largest part of the book is devoted to the particular magnetic, optical, electrical and mechanical properties of materials at the nanoscale, leading on to emerging and already commercialized applications, such as nanofluids in magnetic resonance imaging, high-performance nanocomposites and carbon nanotube-based electronics.\n\nBased on the author's experience in teaching nanomaterials courses and adapted, in style and level, for students with only limited background knowledge, the textbook includes further reading, as well as information boxes that can be skipped upon first reading.","torrent":{"xt":"urn:btih:6b1c1205e304c1c88b2ded96050f44be21485177","amp;dn":"Nanoparticles%2C++Nanocomposites%2C+Nanomaterials+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b1c1205e304c1c88b2ded96050f44be21485177","infoHashBuffer":{"type":"Buffer","data":[107,28,18,5,227,4,193,200,139,45,237,150,5,15,68,190,33,72,81,119]},"announce":[],"urlList":[]}}