{"title":"The Islands at the End of the World - Austin Aslan","uid":10721026,"size":875204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b49ea5f265f29826fac2283d1036acb7cfa1e0e&amp;dn=The+Islands+at+the+End+of+the+World+-+Austin+Aslan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1407482574,"description":"In this fast-paced survival story set in Hawaii, electronics fail worldwide, the islands become completely isolated, and a strange starscape fills the sky. Leilani and her father embark on a nightmare odyssey from Oahu to their home on the Big Island. Leilani's epilepsy holds a clue to the disaster, if only they can survive as the islands revert to earlier ways. \n   A powerful story enriched by fascinating elements of Hawaiian ecology, culture, and warfare, this captivating and dramatic debut from Austin Aslan is the first of two novels. The author has a master's degree in tropical conservation biology from the University of Hawaii at Hilo.\n\nPraise for Islands at the End of the World:&quot;Aslan's debut honors Hawaii's unique cultural strengths--family ties and love of home, amplified by geography and history--while remaining true to a genre that affirms the mysterious grandeur of the universe waiting to be discovered.&quot;--Kirkus Reviews, Starred\n\n&quot;Aslan's debut is a riveting tale of belonging, family, overcoming perceived limitations, and finding a home.&quot;--School Library Journal, Starred\n\n&quot;This well-paced novel successfully provokes a palpable sense of urgency, and the mystery surrounding the nature of the &quot;Emerald Orchid&quot; and the hope that Leilani's family will be reunited drive the narrative forward effectively. Aslan has developed his protagonist fully; Leilani is admirable yet flawed, and readers will connect with her struggle to fit in both as an ethnic minority in her community and as an epileptic. Teens should enjoy this utterly unique eco-thriller and eagerly await its sequel.&quot;","torrent":{"xt":"urn:btih:6b49ea5f265f29826fac2283d1036acb7cfa1e0e","amp;dn":"The+Islands+at+the+End+of+the+World+-+Austin+Aslan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b49ea5f265f29826fac2283d1036acb7cfa1e0e","infoHashBuffer":{"type":"Buffer","data":[107,73,234,95,38,95,41,130,111,172,34,131,209,3,106,203,124,250,30,14]},"announce":[],"urlList":[]}}