{"title":"PC_Gamer_UK_2013-06.pdf","uid":8554767,"size":121696876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b5aa28977ce2855e9b15207206b574afc1f895a&amp;dn=PC_Gamer_UK_2013-06.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1370730842,"description":"\n\nWhat a scowl! There are only two ways to hone a scowl like that. A) browse the Daily Mail for 15 seconds or B) take a leadership position in the Red Army in Stalingrad during World War 2. The gentleman on our cover this month represents the latter, having just emerged angry and sweaty from the ballistic single player campaign for Company of Heroes 2. We've played it for five hours and can't wait to tell you all about it in our six page preview. We're also gifting readers codes for Company of Heroes: Tales of Valor, the standalone expansion for Company of Heroes 1 worth 10 pounds.\n\nThere's lots more inside of course. This month we've also got a first-hand account of what it's like to run a clan from our man John Strike. Rich strains his sanity as he delves even deeper into Dark Souls, we get an early peek at Amnesia: Machine for Pigs and much more besides. So much more that I'm going to give in and just put it in a nice readable list for you below.\n\n\n\n\n\nThis month we...\n\n* battle for Stalingrad in Company of Heroes 2\n* discover the strange highs and lows of running a shooter clan\n* dissect Dark Soul's lordly land of ... Lordran.\n* analyse the latest info on Battlefield 4\n* take a look at competitive Minesweeper. Yes, that's a thing.\n* venture, terrified, into the dark, dark world of Amnesia: A Machine for Pigs.\n* take an early look at Age of Wonders 3, Transistor, Anomaly 2, Dark Souls 2, Audiosurf 2, Call of Juarez: Gunslinger and Civ V's next expansion, Brave New World.\n* deliver verdicts on Metro: Last Light, Trials Evolution, Cart Life, DLC Quest, Monster Loves You! Shattered Haven, Defiance, Resident Evil 6, Lunar Pack, The Organ Trail, Monaco and Cities in Motion 2.\n* round up the latest headsets in our Hardware Supertest.\n* review the 2k pounds Z77 Vengeance Titan gaming PC.\n* check up on Chivalry: Medieval Warfare in this month's Update.\n* reinstall STALKER. Because STALKER.\n* continue to survive against the odds in our Game of Thrones Crusader Kings 2 diary\n* and loads more!","torrent":{"xt":"urn:btih:6b5aa28977ce2855e9b15207206b574afc1f895a","amp;dn":"PC_Gamer_UK_2013-06.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b5aa28977ce2855e9b15207206b574afc1f895a","infoHashBuffer":{"type":"Buffer","data":[107,90,162,137,119,206,40,85,233,177,82,7,32,107,87,74,252,31,137,90]},"announce":[],"urlList":[]}}