{"title":"Nuclear Physics - Exploring the Heart of Matter (gnv64)","uid":7417874,"size":12378285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b75af375f01aef61f462d7f9ce4d6cbd9b1f2fd&amp;dn=Nuclear+Physics+-+Exploring+the+Heart+of+Matter+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1341580741,"description":"Nuclear Physics: Exploring the Heart of Matter\nby The Committee on the Assessment of and Outlook for Nuclear Physics, Board on Physics and Astronomy, Division on Engineering and Physical Sciences and National Research Council\nNational Academy of Sciences Press | December 2012 | ISBN-10: 030926040X | 264 pages | PDF | 11.8 mb &lt;a href=&quot;\nhttp://www.amazon.com/Nuclear-Physics-Exploring-Heart-Matter/dp/030926040X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Nuclear-Physics-Exploring-Heart-Matter/dp/030926040X&lt;/a&gt;\n\nThe principal goals of the study were to articulate the scientific rationale and objectives of the field and then to take a long-term strategic view of U.S. nuclear science in the global context for setting future directions for the field. Nuclear Physics: Exploring the Heart of Matter provides a long-term assessment of an outlook for nuclear physics.\nThe first phase of the report articulates the scientific rationale and objectives of the field, while the second phase provides a global context for the field and its long-term priorities and proposes a framework for progress through 2020 and beyond. In the second phase of the study, also developing a framework for progress through 2020 and beyond, the committee carefully considered the balance between universities and government facilities in terms of research and workforce development and the role of international collaborations in leveraging future investments.\nNuclear physics today is a diverse field, encompassing research that spans dimensions from a tiny fraction of the volume of the individual particles (neutrons and protons) in the atomic nucleus to the enormous scales of astrophysical objects in the cosmos. Nuclear Physics: Exploring the Heart of Matter explains the research objectives, which include the desire not only to better understand the nature of matter interacting at the nuclear level, but also to describe the state of the universe that existed at the big bang. This report explains how the universe can now be studied in the most advanced colliding-beam accelerators, where strong forces are the dominant interactions, as well as the nature of neutrinos.","torrent":{"xt":"urn:btih:6b75af375f01aef61f462d7f9ce4d6cbd9b1f2fd","amp;dn":"Nuclear+Physics+-+Exploring+the+Heart+of+Matter+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b75af375f01aef61f462d7f9ce4d6cbd9b1f2fd","infoHashBuffer":{"type":"Buffer","data":[107,117,175,55,95,1,174,246,31,70,45,127,156,228,214,203,217,177,242,253]},"announce":[],"urlList":[]}}