{"title":"Richard Herring Megapack","uid":6388486,"size":7446040456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c090618e3ca1873e64bccce57e1d5cf6d4c27ea&amp;dn=Richard+Herring+Megapack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alexoo444","files":513,"time":1305279391,"description":"Someone Likes Yoghurt \nIn his excellent Someone Likes Yoghurt, Herrring shares with us his world of gonorrhoea-transmiting magpies, his attempts to become successor to Pope John Paul II, and his local supermarket's utterly humiliating new checkout service: the grocery interrogation. \n\nHitler Moustache \nHas Adolf Hitler ruined that moustache for everyone? The only place you will see it these days is carved into a woman's pubic hair. Is it possible to reclaim the toothbrush moustache for comedy? After all, Chaplin had it first. \n\nThe Headmaster's Son \nIn The Headmaster's Son, a nostalgic and faintly disturbing juvenile romp through the 1980s, Richard Herring considers what could possibly be worse than being a podgy, swotty, virginal schoolboy. What if your dad's the headmaster too? \n\nOh Fuck, I`m 40! \nThis is a recording of the show made in March 2008, when Rich was coming to the end of his 40th year. \n\nMenage a Un \nmenage a un sees Herring consolidate his position as one of the UK s most uncompromising and innovative stand-ups in a show which deals with loneliness, only-ness and Onanism, and attempts to determine whether three-in-a-bed sex romps are really better than one-in-a-bed sex romps. \n\nAlong the way he reveals why Olivio is the most dangerous spread for the confirmed bachelor, claims that we can save humanity by having sex with sea creatures and discusses the existential angst of being a comedy character who exists solely to deliver a disappointing punch-line. He also provides the correct solution to the Riddle of the Sphinx, proposes that the English should rename apples  sky potatoes  in order to demonstrate the ultimate folly of the French, and controversially calls for the disenfranchisement of the stupid. \n\nTwelve Tasks of Hercules Terrace \nWhilst perfectly watchable, this DVD was recorded on low grade cameras, and as such, the picture is a bit grainy. And while you can hear everything, the sound is pretty lo-fi too. \n\nIn the Twelve Tasks of Hercules Terrace, Rich shares with us his mission to make something of his sad comedian's existence through a catalogue of seemingly impossible challenges. \nSo will he succeed in running the marathon, going skydiving, and dating 50 women in 50 nights? Or will he fail in his vain attempt to prove his superiority to the Greek demi-god? \nAnd does steeling Germaine Greer's bra strictly count as a Herculean task? Yes - I suppose it does.","torrent":{"xt":"urn:btih:6c090618e3ca1873e64bccce57e1d5cf6d4c27ea","amp;dn":"Richard+Herring+Megapack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c090618e3ca1873e64bccce57e1d5cf6d4c27ea","infoHashBuffer":{"type":"Buffer","data":[108,9,6,24,227,202,24,115,230,75,204,206,87,225,213,207,109,76,39,234]},"announce":[],"urlList":[]}}