{"title":"Genetic Roulette - Jeffrey Smith","uid":11704841,"size":1461819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c6552be2b9d8f5c009f123552777fc49eafe0d1&amp;dn=Genetic+Roulette+-+Jeffrey+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424084316,"description":"The biotech industry's claim that genetically modified (GM) foods are safe is shattered in this groundbreaking book. Sixty-five health risks of the foods that Americans eat every day are presented in easy-to-read two-page spreads. The left page is designed for the quick scanning reader; it includes bullets, illustrations, and quotes. The right side offers fully referenced text, describing both research studies and theoretical risks. The second half of Genetic Roulette shows how safety assessments on GM crops are not competent to identify the health problems presented in the first half. It also exposes how industry research is rigged to avoid finding problems.\n\nThis book, prepared in with input by more than 30 scientists, is for anyone wanting to understand GM technology, to learn how to protect themselves, or to share their concerns with others. It is presented in the clear, accessible style that made Jeffrey Smith's Seeds of Deception the world's best-selling book on genetically engineered foods. As the world's most complete reference on the health risks of GM foods, Genetic Roulette is also ideal for schools and libraries.\n\nAbout the Author:\nInternational bestselling author of Seeds of Deception and Genetic Roulette, Jeffrey M. Smith is a widely popular spokesperson on the documented health risks of genetically modified organisms (GMOs) and how biotech companies rig research, gag critics, hijack regulators, and spin fantastic unfulfilled promises. His Institute for Responsible Technology's Campaign for Healthier Eating in America is designed to achieve the tipping point of consumer rejection of GMOs to force them out of the food supply","torrent":{"xt":"urn:btih:6c6552be2b9d8f5c009f123552777fc49eafe0d1","amp;dn":"Genetic+Roulette+-+Jeffrey+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c6552be2b9d8f5c009f123552777fc49eafe0d1","infoHashBuffer":{"type":"Buffer","data":[108,101,82,190,43,157,143,92,0,159,18,53,82,119,127,196,158,175,224,209]},"announce":[],"urlList":[]}}