{"title":"The Effect of Creep and other Time Related Factors on Plastics a","uid":15576321,"size":240604911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c7bbf7b3d0534917c757962cfcd5e6139d9c931&amp;dn=The+Effect+of+Creep+and+other+Time+Related+Factors+on+Plastics+a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1471338588,"description":"The Effect of Creep and other Time Related Factors on Plastics and Elastomers 3rd ed - Laurence W. McKeen (WA, 2015).pdf\r\n\r\nThis reference guide brings together a wide range of critical data on the effect of creep and other long term effects on plastics and elastomers, enabling engineers to make optimal material choices and design decisions. The data are supported by explanations of how to make use of the data in real world engineering contexts and provides the long-term properties data that designers need to create a product that will stand the test of time. This new edition represents a full update of the data, removing all obsolete data, adding new data, and updating the list of plastics manufacturers. Additional plastics have also been included for polyesters, polyamides and others where available, including polyolefins, elastomers and fluoropolymers. Entirely new sections on biodegradable polymers and thermosets have been added to the book. The level of data included – along with the large number of graphs and tables for easy comparison – saves readers the need to contact suppliers, and the selection guide has been fully updated, giving assistance on the questions which engineers should be asking when specifying materials for any given application.\r\n\r\n\r\n\r\nTrustworthy, current data on creep, stress-strain and environmental stress cracking, enabling easier and more effective material selection and product design.\r\nIncludes expert guidance to help practitioners make best use of the data.\r\nEntirely new sections added on sustainable and biodegradable polymers, and thermosets","torrent":{"xt":"urn:btih:6c7bbf7b3d0534917c757962cfcd5e6139d9c931","amp;dn":"The+Effect+of+Creep+and+other+Time+Related+Factors+on+Plastics+a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c7bbf7b3d0534917c757962cfcd5e6139d9c931","infoHashBuffer":{"type":"Buffer","data":[108,123,191,123,61,5,52,145,124,117,121,98,207,205,94,97,57,217,201,49]},"announce":[],"urlList":[]}}