{"title":"Making Scotland's Landscape  (BBC 2010 - Complete Series)","uid":6543372,"size":3910287406,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6cfc5ce5f60ada7bb8f2b959d951b09089235ec8&amp;dn=Making+Scotland%5C%27s+Landscape++%28BBC+2010+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"neil1966hardy","files":6,"time":1310770420,"description":"Nature Documentary hosted by Dr Iain Stewart, published by BBC in 2010 - English narration\n\nMaking Scotland's Landscape\nProfessor Iain Stewart presents a landmark five-part series in which he reveals how Scotland's unique and beautiful landscape has been shaped over the centuries. In a country celebrated for its unique 'natural' beauty, he reveals how every square inch of Scotland's landscape has been affected by centuries of human activity.\n\n\n1) Scotlands Trees\nIn this first programme, he uncovers how, over thousands of years, the actions of mankind and the climate nearly led to the downfall of Scotland's trees and forests. It was only in the 18th century that man realised the extent of the damage to timber stocks, and measures were taken to re-populate the landscape. The impact was profound, but not everyone agreed with the results.\n\n2) The Land\nFor centuries, the beauty and drama of Scotland's landscape has been regarded by most visitors as natural. But in 1950, an eminent ecologist concluded the Highlands had been devastated.\nOnce it was rich and diverse he said, but humans had destroyed it and in the process created what he described as a wet desert. Professor Iain Stewart discovers how man made the proverbially beautiful Highlands.\n\n3) The Sea\nProfessor Stewart reveals how hearts and not heads have ruled the least understood landscape of them all - the sea. The public's emotions have played a key role in the fate of Scotland's maritime creatures and the upshot has been a form of lottery. While some species like seals and sea birds have been protected, others - like cod - have been fished nearly out of existence.\n\n4) Scotlands Water\nAs 'natural' icons, Scotland's rivers and lochs represent how the nation imagines itself. However as Professor Iain Stewart discovers, the only thing that happens naturally is rain. As soon as it hits the ground, it is ours and we do with it what we will. Today there are scarcely any rivers or natural large bodies of water left untouched by human activity. This is the story of how Scotland's waters became some of the most managed on earth.\n\n5) The Climate\nProfessor Iain Stewart concludes a landmark five-part series in which he reveals how Scotland's unique and beautiful landscape has been shaped over the centuries. During the Industrial Revolution, Scottish scientists and engineers helped unwittingly set off a chain of events that today we know as climate change - a process that is transforming our atmosphere and warming our planet. Professor Iain Stewart looks at how Scotland is on the verge of another revolution: the transformation of a carbon economy to a green one.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:6cfc5ce5f60ada7bb8f2b959d951b09089235ec8","amp;dn":"Making+Scotland%5C%27s+Landscape++%28BBC+2010+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cfc5ce5f60ada7bb8f2b959d951b09089235ec8","infoHashBuffer":{"type":"Buffer","data":[108,252,92,229,246,10,218,123,184,242,185,89,217,81,176,144,137,35,94,200]},"announce":[],"urlList":[]}}