{"title":"Letters to My Great-Granddaughter (2008) Sidney Poitier-Life Bey","uid":11602198,"size":2779411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d19ba527dac5fdd5aaad44b0acd9e93287ba37c&amp;dn=Letters+to+My+Great-Granddaughter+%282008%29+Sidney+Poitier-Life+Bey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417367470,"description":"Title: Life Beyond Measure: Letters to My Great-Granddaughter\nAuthor: Sidney Poitier\nHardcover: 304 pages\nPublisher: HarperOne (April 29, 2008)\nLanguage: English\nISBN-10: 9780061496189\nISBN-13: 978-0061496189\n\nDescription:\nSidney Poitier is one of the most revered actors in the history of Hollywood. He has overcome enormous obstacles in extraordinary times and is a role model for many Americans because of his convictions, bravery, and grace. Poitier reflects on his amazing life in Life Beyond Measure, offering inspirational advice and personal stories in the form of extended letters to his great-granddaughter. Writing for all who admire his example and who search for wisdom only a man of great experience can offer, this American icon shares his thoughts on love, faith, courage, and the future.\n\nPoitier draws upon the perspective and wisdom gained from his memories as a poor boy in the Bahamas, his experience of racism coming to the United States, falling in love and raising a family, breaking the race barrier in theatre and film during the Civil Rights Era, achieving stardom and success in Hollywood, and being a diplomat and humanitarian. He reflects on the deepest questions and the significant passages of his life, the virtues that helped him through tough times, and the sense of purpose and history that strengthened him. He emphasises the importance of the role of faith in a technological age, as well as our responsibility to the earth and future generations. Throughout, Poitier shares stories about the people of courage he has met along the way and the meaning of life in the face of death.\n\nLife Beyond Measure is the perfect book to inspire readers to live the fullest life with integrity, from one of our most respected celebrities and a national treasure","torrent":{"xt":"urn:btih:6d19ba527dac5fdd5aaad44b0acd9e93287ba37c","amp;dn":"Letters+to+My+Great-Granddaughter+%282008%29+Sidney+Poitier-Life+Bey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d19ba527dac5fdd5aaad44b0acd9e93287ba37c","infoHashBuffer":{"type":"Buffer","data":[109,25,186,82,125,172,95,221,90,170,212,75,10,205,158,147,40,123,163,124]},"announce":[],"urlList":[]}}