{"title":"Among the Chaos ( Soldiers of Chaos MC Series #2) - A.A. Askevol","uid":11012087,"size":2272160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d7b2e8c71594e957e72f8353530b5abb67b6d62&amp;dn=Among+the+Chaos+%28+Soldiers+of+Chaos+MC+Series+%232%29+-+A.A.+Askevol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DethHolly","files":6,"time":1410379714,"description":"The most important rule in the world of the outlaw MC is 'Club first. Always.' \n\nEverything she has, her club, her patch and the love of those two men, is riding on her ability to keep her stuff locked up tight. She'd left Cole in the past and locked away the darkness in a prison built of determination, will and her love for Tex and Trace. The problem with the past though is that it doesn't always stay there. \n\nNow that they had Nikki back Trace was determined not to let her go. He had a plan, an unorthodox plan he'd admit but one that would keep her focused on the club and on he and Tex. But even the best laid plans don't always turn out the way you want them to. \n\nTex is constantly haunted by that night, Nikki's bloodied back and the screams of agony she'd made when Doc treated her. He would do anything not to see her hurt like that again. That was why he agreed to Trace's plan, why they'd all agreed to Trace's plan. It also meant he'd finally get her back where she belonged, in his arms. \n\nAs the Soldiers of Chaos MC's man-at-arms Nikki's father, 'Reaper' Jones, was constantly putting the club first, to the point where he sacrificed everything including his relationship with his daughter for the sake of the club. So when Nikki finds out that her old man has an illness whose symptoms will jeopardise the safety of himself and the club, she intervenes and negotiates a compromise. She will allow him to keep his condition hidden from the club for a short time under one condition, she becomes his shadow. \n\nThe death of a brother, Reaper's illness and implications they have a traitor in their midst plunge Nikki into turmoil both inside and out. \n\nWhat will she find among the chaos? \n\n- - -\n\nFormats: EPUB, MOBI, AZW3, PDF\nASIN#: B00M77V4IG\nISBN13#: 9781310299094\nPublished: July 27th, 2014\nLanguage: English","torrent":{"xt":"urn:btih:6d7b2e8c71594e957e72f8353530b5abb67b6d62","amp;dn":"Among+the+Chaos+%28+Soldiers+of+Chaos+MC+Series+%232%29+-+A.A.+Askevol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d7b2e8c71594e957e72f8353530b5abb67b6d62","infoHashBuffer":{"type":"Buffer","data":[109,123,46,140,113,89,78,149,126,114,248,53,53,48,181,171,182,123,109,98]},"announce":[],"urlList":[]}}