{"title":"R.E.M. - Monster [rock] - 1994  (MP3-320kbps) - [=Faith=]","uid":9876748,"size":119407031,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6db271fc765ad10fbcf69e1a75541c34a40785f6&amp;dn=R.E.M.+-+Monster+%5Brock%5D+-+1994++%28MP3-320kbps%29+-+%5B%3DFaith%3D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Faithwyn","files":19,"time":1396483396,"description":"R.E.M. - Monster\n\nMonster is the ninth studio album by the American alternative rock band R.E.M., released in 1994 on Warner Bros. Records. Co-produced by the band and Scott Litt, Monster was an intentional stylistic shift from the group's preceding albums, Out of Time (1991) and Automatic for the People (1992), consisting of loud, distorted guitar tones and simple song arrangements. Singer Michael Stipe's lyrics dealt with the nature of celebrity, which he sang while assuming various characters. Led by the single &quot;What's the Frequency, Kenneth?&quot;, Monster debuted at number one in the United States. The band promoted the record with its first concert tour since 1989.\n\nGeneral:\nArtist       : R.E.M.\nAlbum        : Monster\nGenre        : Alternative Rock\nYear         : 1994\nLabel        : Warner Bros. Records\nTracks       : 12\nPlaytime     : 00:49:11\nSize         : 113.05 MB\nCodec        : MPEG 1 Layer III / Lame 3.97 / 320 kbps\n\nTrack List:\n01. What's The Frequency, Kenneth? (04:00)\n02. Crush With Eyeliner (04:38)\n03. King Of Comedy (03:41)\n04. I Don't Sleep, I Dream (03:28)\n05. Star 69 (03:08)\n06. Strange Currencies (03:53)\n07. Tongue (04:13)\n08. Bang And Blame (05:30)\n09. I Took Your Name (04:03)\n10. Let Me In (03:27)\n11. Circus Envy (04:15)\n12. You (04:53)\n\n\nThe Music:\nIn contrast to the sound of R.E.M.'s previous two records, the music of Monster consisted of distorted guitar tones, minimal overdubs, and touches of 1970s glam rock. Peter Buck described Monster as &quot;a 'rock' record, with the rock in quotation marks.&quot; He explained, &quot;That's not what we started out to make, but that's certainly how it turned out to be. There's a nudge, nudge, wink, wink feel to the whole record. Like, it's a rock record, but is it really?&quot;Mike Mills told Time, &quot;On past albums we had been exploring acoustic instruments, trying to use the piano and mandolin, and we did it about all we wanted to do it. And you come back to the fact that playing loud electric-guitar music is about as fun as music can be.&quot;Stipe's vocals were pushed back in the mix.\n\nStipe wrote the lyrics of Monster in character. This, according to biographer Dan Buckley, &quot;set the real Stipe at a distance from the mask adopted for each song.&quot; The album dealt with the nature of celebrity and &quot;the creepiness of fandom as pathology&quot;.Buck said the album was a reaction to the band's popularity. He added, &quot;When I read the lyrics I thought, all these guys are totally fucked up. I don't know who they are, because they're not Michael. I would say that this was the only time where he's done characters that are creepy, and I don't know if anyone got that. He was getting out his things by acting out these parts that are not him.&quot;The band noted that at the end of certain songs, they left blank choruses where Mills and Berry would traditionally sing harmonies so fans could sing along.\n\n\n","torrent":{"xt":"urn:btih:6db271fc765ad10fbcf69e1a75541c34a40785f6","amp;dn":"R.E.M.+-+Monster+%5Brock%5D+-+1994++%28MP3-320kbps%29+-+%5B%3DFaith%3D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db271fc765ad10fbcf69e1a75541c34a40785f6","infoHashBuffer":{"type":"Buffer","data":[109,178,113,252,118,90,209,15,188,246,158,26,117,84,28,52,164,7,133,246]},"announce":[],"urlList":[]}}