{"title":"The Bone Bed - Patricia Cornwell  (Unabridged)","uid":7865600,"size":856148087,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6dcbeb340ee58691b75e4f80b5032c0503873e37&amp;dn=The+Bone+Bed+-+Patricia+Cornwell++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"michilllie","files":-1,"time":1354051355,"description":"Okay, this is my third attempt at my first upload, so be gentle with me. You know what they say, &quot;third time's a charm&quot;&gt;! \nI have learned that cda files need to converted to mp3 and figured out how to do that (it took forever! of course it didn't help that I kept falling asleep while waiting). Thank you Google! I have verified that the files work on both Media Player and VLC. \nMy only concern is the order the tracks play in. I'm hoping they play in the proper order. My fingers are crossed.\n\nPlease comment and let me know if does or does not work. Thanks\n\n=============================================================================\nThe Bone Bed (Kay Scarpetta #20) (Unabridged)\nby Patricia Cornwell\n\nA woman has vanished while digging a dinosaur bone bed in the remote wilderness of Canada. Somehow, the only evidence has made its way to the inbox of Chief Medical Examiner Kay Scarpetta, over two thousand miles away in Boston. She has no idea why. But as events unfold with alarming speed, Scarpetta begins to suspect that the paleontologistÎ“Ã‡Ã–s disappearance is connected to a series of crimes much closer to home: a gruesome murder, inexplicable tortures, and trace evidence from the last living creatures of the dinosaur age.\n\nWhen she turns to those around her, Scarpetta finds that the danger and suspicion have penetrated even her closest circles. Her niece Lucy speaks in riddles. Her lead investigator, Pete Marino, and FBI forensic psychologist and husband, Benton Wesley, have secrets of their own. Feeling alone and betrayed, Scarpetta is tempted by someone from her past as she tracks a killer both cunning and cruel.\n\nThis is Kay Scarpetta as you have never seen her before. The Bone Bed is a must read for any fan of this series, or an ideal starting point for new readers.\n\nEnjoy!\tAnd Seed Please. :)","torrent":{"xt":"urn:btih:6dcbeb340ee58691b75e4f80b5032c0503873e37","amp;dn":"The+Bone+Bed+-+Patricia+Cornwell++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dcbeb340ee58691b75e4f80b5032c0503873e37","infoHashBuffer":{"type":"Buffer","data":[109,203,235,52,14,229,134,145,183,94,79,128,181,3,44,5,3,135,62,55]},"announce":[],"urlList":[]}}