{"title":"TotÃƒÂ², Vittorio e la dottoressa, [DVD9 - Ita - Sub NUIta] Commed","uid":5252630,"size":5695006720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e3f3df6c044d5ed86b2bc7e1340a82829e81bbe&amp;dn=Tot%C3%83%C2%B2%2C+Vittorio+e+la+dottoressa%2C+%5BDVD9+-+Ita+-+Sub+NUIta%5D+Commed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"year2012","files":18,"time":1262428488,"description":"TotÃƒÂ², Vittorio e la dottoressa, [DVD9 - Ita - Sub NUIta] Commedia [Tntvillage]\n\nTotÃƒÂ², Vittorio e la dottoressa\nby anno2036\n\nLocandina del film\n Visit this link: http://www.antoniodecurtis.com/loc351.jpg\n\n\nSCHEDA DEL FILM\nRegia :  Camillo Mastrocinque\nSoggetto : da un'idea di D.Sabatello,R.Gianviti\nSceneggiatura : Vittorio Metz, Marcello Marchesi\nFotografia : Pogany, Mancori, Berenguer\nScenografia : Piero Filippone,Gianfranco Cuppini\nMusica : Carlo Innocenzi\nMontaggio : Roberto Cinquini, Juan Pison\nAiuto regia : Leo Lenoir\nDirettore produzione : Seriano, Palaggi, Rodriguez\nProduzione : Jolly Film,Roma / Gallus Film-Film F. Rivers,Paris /\n                      FÃƒÂ¨nix Film,Madrid\nDurata: 99 minuti\n\nInterpreti e personaggi:\nTotÃƒÂ² ( Michele Spillone detto Mike )\nVittorio De Sica( il marchese Vittorio De Vitti )\nTitina De Filippo( sua madre )\nPierre Mondy( Romeo, il cameriere )\nAbbe Lane( la dott. Brigitte Baker )\nAgostino Salvietti( Gennaro detto Johnny )\nGermano Cobos( l'avvocato Otello Bellomo )\nTecla Scarano( zia Ada Barbalunga )\nAmelia Perella( zia Ida )\nLuigi Pavese( il capo di &quot;Nulla sfugge&quot; )\nFranco Coop( il maitre del night )\nDante Maggio( un cameriere )\nTeddy Reno( se stesso )\nDarry Cowl( Egisto )\nFulvia Franco( Caterina )\nArturo Bragaglia( il signore del comizio )\nRafael Bardem( Elia Vagoni )\nBenedetta Rutili( un'infermiera )\nGianni Partanna( un cliente del ritrovo notturno )\nGiulio CalÃƒÂ¬( un malato di mente )\nAmedeo Trilli( altro malato di mente )\n\nAltri interpreti :\nMarino De Guidi, Amilcare Pettinelli, Angela Lavagna,\nPino Sciacqua, Donatella Marrosu, Mario Meniconi,\nSandro Pistolini, Amalia Pellegrini,Antonio Acqua,\nNino Marchetti \n\nTRAMA\nDue vecchie sorelle incaricano due investigatori improvvisati (TotÃƒÂ² e Agostino Salvietti) di indagare sulla moralitÃƒÂ  della moglie del loro unico nipote, una dottoressa americana (Abbe Lane). Contemporaneamente la dottoressa ÃƒÂ¨ chiamata a curare Vittorio De Sica che in realtÃƒÂ  ÃƒÂ¨ stato impallinato nel fondoschiena e per questo non vuole essere curato da una dottoressa donna, bensÃƒÂ¬ da un dottore maschio ma ÃƒÂ¨ troppo pudico per dirlo. Ci si trova davanti cosÃƒÂ¬ ad un intreccio comico in cui i due investigatori credono che De Sica sia l'amante della dottoressa. Di fatto, perÃƒÂ², TotÃƒÂ² e Vittorio De Sica si trovano insieme soltanto nel titolo. La vicenda si svolge a Napoli\n\nRECENSIONE\nfonte:  Visit this link: http://www.antoniodecurtis.org/dottor.htm\nE' il film che segna il ritorno di TotÃƒÂ² al cinema dopo una breve parentesi teatrale ma soprattutto dopo la grave malattia agli occhi che lo fa rimanere in casa per sette lunghi mesi. In questo periodo di crisi del cinema italiano vanno di moda le coproduzioni internazionali, questo infatti ÃƒÂ¨ una coproduzione italo-franco-spagnola. Ma TotÃƒÂ² ÃƒÂ¨ visibilmente stanco e malato, e la critica fu impietosa.\n\nScriveva Franco Maria Pranzo: Rieccoci al film con TotÃƒÂ². Benvenuto TotÃƒÂ² , ci hai fatto ridere, ci hai divertito. Rivederti nei panni del poliziotto ÃƒÂ¨ stato un vero piacere. Ad majora dunque. Ma il film, scusaci TotÃƒÂ² se usiamo una tua vecchia battuta di commento, ÃƒÂ¨ una vera &quot;ciofeca&quot;. Una di quelle &quot;schifezze&quot; che piacciono al pubblico, e modestia a parte , anche a noi [..].\nE il solito &quot;vice&quot; dall'UnitÃƒÂ : &quot;Dicendo che TotÃƒÂ², Vittorio a la dottoressa ÃƒÂ¨ il solito film della serie TotÃƒÂ², commetteremmo una grave inesattezza: infatti, ÃƒÂ¨ molto peggio dei precedenti [..] &quot;.\n\nE dal Giorno un articolo senza firma : &quot;Nel filmetto che [..] ÃƒÂ¨ interpretato da TotÃƒÂ² un pÃƒÂ² stanco [..] si possono ascoltare tre o quattro battute di una rara grossolanitÃƒÂ . Davvero allegra la nostra censura &quot;.\n\nIl film, che si svolge in una Napoli astratta, senza dimensione, dove tutti parlano un italiano perfetto e si muovono in modo non caratterizzato, ÃƒÂ¨ irrimediabilmente infarcito dl sketches da teatro di quarta categoria, senza logica e senza intreccio. Tutto ÃƒÂ¨ lasciato andare, minuto dopo minuto, per permettere a TotÃƒÂ² e alla sua spalla Agostino Salvietti di interpretare qualche pezzo da un repertorio vecchio e scontato.\nLa solita sceneggiatura di Metz e Marchesi con una svogliata regia di Mastrocinque, non elevano il film nemmeno al livello di una dignitosa farsa.\nSchiacciato al rango di macchietta, TotÃƒÂ², sempre con grandissima padronanza, gioca sulla solita deformazione del linguaggio, con sÃƒÂ¨dano per siedano, sotto semaforo per sotto metafora, parocchia per parecchi, Corea per correa, metro per maitrÃƒÂ¨, fotografi per fedigrafi, ecc.\nIn un'altra scena (plagiata da &quot;Fifa e arena&quot;, &quot;TotÃƒÂ² le MokÃƒÂ²&quot; e poi in &quot;TotÃƒÂ² sexy&quot;), vestito da cameriere, ÃƒÂ¨ invitato ad un tavolo perchÃƒÂ¨ non funziona il sifone del seltz e lo fa funzionare senza toccarlo facendo &quot;psss&quot;. Alla meraviglia dei presenti, si giustifica dicendo: me lo ha insegnato la mia mamma da bambino.\nIn questo genere di film TotÃƒÂ² si limita ad esaurire tutta la recitazione all'interno del carattere, non potendone uscire in alcun modo; si tratta, infatti, di puro avanspettacolo filmato, un canovaccio alla Ridolini, come la scena del ristorante, dove i due si travestono da camerieri, creando una baraonda immotivata o quella finale della fuga per l'ospedale accompagnata da adeguata marcetta.\nCiÃƒÂ² nonostante, TotÃƒÂ² conferma le sue qualitÃƒÂ  di clown Augusto, ben evidenziate, in tutte le scene in coppia con il vecchio e appesantito Agostino Salvietti (clown bianco).\nGiÃƒÂ  dal primo fotogramma, quando entra in scena, lo vediamo con la bombetta sulla testa, ultimo residuo della sua &quot;maschera&quot; primordiale, alla quale si collega tutto il recitativo del film, che ÃƒÂ¨ anche una parodia di un certo cinema giallo americano (non a caso il personaggio si chiama Michele Spillone, deformazione di Mike Spillane).\nA confronto con i due film precedenti, sempre diretti da Mastrocinque, nei quali le sue qualitÃƒÂ  di clown Augusto, in coppia con Peppino, emergevano in forma evidente e creativa, qui risultano soffocate e rimpicciolite da una spalla poco adeguata, che lo costringe praticamente a recitare da solo.\nUtilissimo il confronto tra i duetti TotÃƒÂ²-Peppino e quelli TotÃƒÂ²-Salvietti, perchÃƒÂ¨ permettono di capire piÃƒÂ¹ in profonditÃƒÂ  quanto per TotÃƒÂ² fosse determinante, per l' effetto finale, recitare con attori che sapessero sfruttare al massimo le sue qualitÃƒÂ  recitative, fortemente collegate alla commedia dell'arte. \n\nCONTENUTI EXTRA\nSelezione scene\nTrailer originale\nCuriositÃƒÂ \nBiofilmografia di Camillo MAstrocinque\n\nCARATTERISTICHE DEL DVD\nDurata: 99 min.\nLingue: Italiano\nSottotitoli: Italiano per non udenti\nFormato Video: 1,66:1 16/9\nFormato Audio: Mono 1.0; Dobly Digital 5.1\nMenÃƒÂ¹: si\nContenuti extra: sÃƒÂ¬\nCompressione: no\n\nVisit","torrent":{"xt":"urn:btih:6e3f3df6c044d5ed86b2bc7e1340a82829e81bbe","amp;dn":"Tot%C3%83%C2%B2%2C+Vittorio+e+la+dottoressa%2C+%5BDVD9+-+Ita+-+Sub+NUIta%5D+Commed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3f3df6c044d5ed86b2bc7e1340a82829e81bbe","infoHashBuffer":{"type":"Buffer","data":[110,63,61,246,192,68,213,237,134,178,188,126,19,64,168,40,41,232,27,190]},"announce":[],"urlList":[]}}