{"title":"VMware Workstation Pro v12.0.1.3160714 + Serials","uid":15351559,"size":351657427,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e5547aaf2c8b0650b126d89a776ce5149598111&amp;dn=VMware+Workstation+Pro+v12.0.1.3160714+%2B+Serials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Dresses9","files":2,"time":1468941904,"description":"VMware Workstation Pro transforms the way technical professionals develop, test, demonstrate and deploy software by running multiple x86-based operating systems simultaneously on the same PC. Built on 15 years of virtualization excellence and winner of more than 50 industry awards, VMware Workstation Pro takes desktop virtualization to the next level by giving users an unmatched operating system support, rich user experience and incredible performance.\r\n\r\n\r\nFeatures:\r\n\r\n-State of the Art Performance – Workstation 10 enables you to create faster, more powerful virtual machines with up to 16 vCPUs, 64GB of memory, 8 TB disks and faster USB connections, a new vSATA controller and twice as many virtual networks.\r\n-Expiring Virtual Machines – Restricted virtual machines can be set to expire at a specified date and time. An expired virtual machine automatically suspends and will not restart without administrator intervention.\r\n-Tablet Sensors – VMware Workstation 10 includes the first-ever virtual accelerometer, gyroscope, compass and ambient light sensor to enable applications running in a virtual machine to respond when a user juggles their tablet.\r\n-Run a Cloud on Your PC – Workstation 10 lets you build a cloud on your PC running popular applications from Pivotal, Puppet Labs and Vagrant","torrent":{"xt":"urn:btih:6e5547aaf2c8b0650b126d89a776ce5149598111","amp;dn":"VMware+Workstation+Pro+v12.0.1.3160714+%2B+Serials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e5547aaf2c8b0650b126d89a776ce5149598111","infoHashBuffer":{"type":"Buffer","data":[110,85,71,170,242,200,176,101,11,18,109,137,167,118,206,81,73,89,129,17]},"announce":[],"urlList":[]}}