{"title":"Stephen Baxter - Evolution","uid":12593420,"size":797145574,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6e6965bef56af39d43c0fe5e75207a07dceaa6ea&amp;dn=Stephen+Baxter+-+Evolution&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":22,"time":1445197879,"description":"\nStretching from the distant past into the remote future, from primordial Earth to the stars, Evolution is a soaring symphony of struggle, extinction, and survival, a dazzling epic that combines a dozen scientific disciplines and a cast of unforgettable characters to convey the grand drama of evolution in all its awesome majesty and rigorous beauty.\r\n\r\nSixty-five million years ago, when dinosaurs ruled the Earth, lived a small mammal, a proto-primate of the species Purgatorius. From this humble beginning, Baxter traces the human lineage forward through time. The adventure that unfolds is a gripping odyssey governed by chance and competition, a perilous journey to an uncertain destination along a route beset by sudden and catastrophic upheavals. It is a route that ends, for most species, in stagnation or extinction. Why should humanity escape this fate?\r\n\r\nA generation from today, a group of concerned scientists—distant descendants of that primitive Purgatorius—gathers on a remote island to discuss this very question. The ceaseless expansion of human civilization has triggered an urgent environmental crisis that must be solved now if the Earth is to survive as a place hospitable to human life. But just when a peaceful solution seems within reach, two acts of shocking violence set in motion a cataclysmic chain of events that will expose the limitations of human intellect and adaptability in the face of the blind and implacable processes of Darwin’s dangerous idea.\r\n\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:6e6965bef56af39d43c0fe5e75207a07dceaa6ea","amp;dn":"Stephen+Baxter+-+Evolution","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6965bef56af39d43c0fe5e75207a07dceaa6ea","infoHashBuffer":{"type":"Buffer","data":[110,105,101,190,245,106,243,157,67,192,254,94,117,32,122,7,220,234,166,234]},"announce":[],"urlList":[]}}