{"title":"HISTORY OF POP AND ROCK MUSIC - part 561","uid":10288912,"size":540018901,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6f090fa7deceb4bdfaaeb33e8ee8eccad2dc1188&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+561&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1401830294,"description":"\n\n                  PART  561\n\n\n\n         FOREIGNER  -   I Want To Know What Love Is  (1984)\n         TINA ARENA  -  I Want To Know What Love Is  (1998)\n         MARIAH CAREY  -  I Want To Know What Love Is  (2009)\n\n\n\n    &quot;I Want to Know What Love Is&quot; is a 1984 power ballad recorded by the British-American rock band Foreigner. The song hit #1 in both the United Kingdom and the United States and is the group's biggest hit to date. It remains one of the band's best known songs and most enduring radio hits charting in the top 25 in 2000, 2001, and 2002 on the Billboard Hot Adult Contemporary Recurrents chart.\n\n    &quot;I Want to Know What Love Is&quot; was covered by Australian singer Tina Arena and her recording was released as a single in 1998 from her album &quot;In Deep&quot;. Arena's version of the song was produced by Foreigner band member Mick Jones, who was the song's writer. This version of the song includes a previously unrecorded bridge between the second and third choruses, specifically written for Tina Arena by Mick Jones.\n\n    &quot;I Want to Know What Love Is&quot; was also covered by Mariah Carey and released as the second single from her twelfth studio album, &quot;Memoirs of an Imperfect Angel&quot; (2009). The single, produced by Carey, C. &quot;Tricky&quot; Stewart and James &quot;Big Jim&quot; Wright, was sent to European radio stations on August 28 and official impacted U.S. radio on September 14, 2009. Mick Jones said of her version: &quot;I think she's actually retained the integrity of the song. You know, the arrangement is very similar to the original. They haven't tampered with the song too much. She's captured a certain emotional thing, a feeling.&quot;  Carey filmed a music video for &quot;I Want to Know What Love Is&quot; in September 2009 in New York City, directed by Hype Williams. The video premiered on Mariah's official website on November 13, 2009. The video features Carey singing in Yankee Stadium, intercut with shots of audience members, often accompanied by loved ones, and some glimpses into the tough times in their past, as they grow emotional from the song's performance. A gospel choir joins Carey at the center of the stadium at the video's end. ","torrent":{"xt":"urn:btih:6f090fa7deceb4bdfaaeb33e8ee8eccad2dc1188","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+561","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f090fa7deceb4bdfaaeb33e8ee8eccad2dc1188","infoHashBuffer":{"type":"Buffer","data":[111,9,15,167,222,206,180,189,250,174,179,62,142,232,236,202,210,220,17,136]},"announce":[],"urlList":[]}}