{"title":"Hybrid Vehicles and the Future of Personal Transportation - (Mal","uid":8067833,"size":11390236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fa20fbfbbaa8538a15af96f24cf45bff3d4739e&amp;dn=Hybrid+Vehicles+and+the+Future+of+Personal+Transportation+-+%28Mal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1359214412,"description":"By Allen Fuhs&quot;Hybrid Vehicles: and the Future of Personal Transportation&quot;\nPublisher: CRC | Number Of Pages: 504 | Publication Date: 2008-09-19 | ISBN: 1420075349 | PDF\n\nUncover the Technology behind Hybrids and Make an Intelligent Decision When Purchasing Your Next Vehicle\n\nWith one billion cars expected to be on the roads of the world in the near future, the potential for war over oil and the negative environmental effects of emissions will be greater than ever before. Now is the time to seriously consider an alternative to standard automobiles.\n\nExploring practical solutions to these problems, Hybrid Vehicles and the Future of Personal Transportation provides broad coverage of the technologies involved in manufacturing and operating hybrids. It reviews key components of hybrid and pure electric vehicles, including batteries, fuel cells, and ultracapacitors. The book also discusses both concept and production-bound hybrids as well as the economics and safety issues of hybrid ownership. In addition, the author supplies effective tips on how to save gasoline with conventional and hybrid automobiles.\n\nMaking the jargon of fuel-efficient vehicles accessible to a wide audience, this guide explains the history of hybrids, how they work, and their impact on the environment. It will help you make a sound decision concerning the purchase and operation of a hybrid or electric vehicle.","torrent":{"xt":"urn:btih:6fa20fbfbbaa8538a15af96f24cf45bff3d4739e","amp;dn":"Hybrid+Vehicles+and+the+Future+of+Personal+Transportation+-+%28Mal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fa20fbfbbaa8538a15af96f24cf45bff3d4739e","infoHashBuffer":{"type":"Buffer","data":[111,162,15,191,187,170,133,56,161,90,249,111,36,207,69,191,243,212,115,158]},"announce":[],"urlList":[]}}