{"title":"Hiren's Boot v15.2","uid":15472899,"size":621283886,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6fdecb365eda0492f9efd1418a6e5f270ed27e33&amp;dn=Hiren%27s+Boot+v15.2+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sckayler","files":1,"time":1470158918,"description":"Hirens.BootCD\r\n\r\nChanges From Version 15.1 to 15.2\r\n\r\n*New Added Softwares, Updated Functions:\r\n\r\n-BattStat 0.99b: Battery Status monitor and power management freeware for Windows 7/Vista/XP/2000 x86/x64.\r\n- BrowsingHistoryView 1.05: To view history data of Internet Explorer, Mozilla Firefox, Google Chrome, and Safari Web browsers in one table.\r\n- ClearLock 1.4.0: To lock your desktop with a transparent layer, allowing you to see what is happening on your desktop and at the same time prevent access to the computer without the proper password.\r\n- DRevitalize 1.2: Repairs bad sectors (physical defects) on hard drives by generating a special sequence of high and low signals around the physically damaged area.\r\n- EncFS 1.7.4: This should be used for secure online file backup services such as Google Drive, Dropbox and Sugarsync as the encryption do not occupy a fixed size containers and backup programs can copy encrypted files and can be accessed from linux, iPhone/iOS and android using BoxCryptor and Cryptonite.\r\n- ImDisk 1.6.0: To create/mount virtual hard disk, floppy or CD/DVD drives using image files or system memory.\r\n- MBRCheck 1.2.3: Checks the legitimacy of the Master Boot Record (MBR) code of the hard drives.\r\n- McAfee Removal Tool 6.0.152.0: McAfee Consumer Product Removal Tool removes all 2005 – 2012 versions of McAfee products.\r\n- MiniXP: Added/updated Storage/LAN/WLAN drivers and other minor improvements, iso boot works, path can be changed in HBCDXPX using notepad.\r\n- Norton Removal Tool 20.0.0.21: SymNRT uninstalls most Norton AntiVirus, Norton Internet Security, Norton 360, and Norton SystemWorks even when the uninstaller fails to remove them.\r\n- Remove Non Present Drivers: Automatically remove all non-present/disconnected devices from a Windows and can often be useful to prevent misbehaving/unnecessary drivers from being loaded, cleanup drivers when you replaced motherboard or used backup image of different hardware.\r\n- Tor Browser 2.2.39: Surf the internet anonymously through encryption, even https sites can be browsed safely where it is blocked by your local ISP.\r\n- WifiInfoView 1.05: Wireless networks information including Network Name (SSID), MAC Address, PHY Type (802.11g or 802.11n), RSSI, Signal Quality, Frequency, Channel Number, Maximum Speed, Company Name, Router Name/Model and more.\r\n- Windows Product Key Update Tool 1.7: This tool is from microsoft to change the key of illegal/pirated installed xp to legit xp keys from the sticker on the PC, even if it is oem and not retail/corporate","torrent":{"xt":"urn:btih:6fdecb365eda0492f9efd1418a6e5f270ed27e33","amp;dn":"Hiren%27s+Boot+v15.2+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fdecb365eda0492f9efd1418a6e5f270ed27e33","infoHashBuffer":{"type":"Buffer","data":[111,222,203,54,94,218,4,146,249,239,209,65,138,110,95,39,14,210,126,51]},"announce":[],"urlList":[]}}