{"title":"Oxford.Very.Short.Introduction.Earth.2003.AUDIOBOOK-PHC","uid":6225937,"size":131047267,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:711b07c02657fa0ce85da0447ddd7561c779cb44&amp;dn=Oxford.Very.Short.Introduction.Earth.2003.AUDIOBOOK-PHC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thearches","files":33,"time":1299508832,"description":"Review\n\n&quot;A useful overview of the processes that have shaped our planet. All in all, if you have limited time and only want to dip into a subject, this sort of condensed introduction to a complicated topic like the Earth will hopefully whet your appetite for a more in-depth knowledge.&quot;--Katherine Joy, The Astrobiology Society of Britain\n\n\nProduct Description\nFor generations, the ground beneath the feet of our ancestors seemed solid and unchanging. Around 30 years ago, two things happened that were to revolutionize the understanding of our home planet. First, geologists realized that the continents themselves were drifting across the surface of the globe and that oceans were being created and destroyed. Secondly, pictures of the entire planet were returned from space. As the astronomer Fred Hoyle had predicted, this 'let loose an idea as\npowerful as any in history'. Suddenly, the Earth began to be viewed as a single entity; a dynamic, interacting whole, controlled by complex processes we scarcely understood. It began to seem less solid. As one astronaut put it, 'a blue jewel on black velvet; small, fragile and touchingly alone'.\nGeologists at last were able to see the whole as well as the detail; the wood as well as the trees. This book brings their account up to date with the latest understanding of the processes that govern our planet.\nAbout the Author\n\nMartin Redfern studied geology at University College London. He has written extensively for magazines and newspapers such as New Scientist, The Economist, the Sunday Times, and the Independent on Sunday.","torrent":{"xt":"urn:btih:711b07c02657fa0ce85da0447ddd7561c779cb44","amp;dn":"Oxford.Very.Short.Introduction.Earth.2003.AUDIOBOOK-PHC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"711b07c02657fa0ce85da0447ddd7561c779cb44","infoHashBuffer":{"type":"Buffer","data":[113,27,7,192,38,87,250,12,232,93,160,68,125,221,117,97,199,121,203,68]},"announce":[],"urlList":[]}}