{"title":"COSMO-RS - From Quantum Chemistry to Fluid Phase Thermodynamics","uid":15560972,"size":7965020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71ce0f12f5218e711f4603697fddf52a575fe95c&amp;dn=COSMO-RS+-+From+Quantum+Chemistry+to+Fluid+Phase+Thermodynamics+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1471128234,"description":"COSMO-RS - From Quantum Chemistry to Fluid Phase Thermodynamics and Drug Design - Andreas Klamt (Elsevier, 2005).pdf\r\n\r\nThe COSMO-RS technique is a novel method for predicting the thermodynamic properties of pure and mixed fluids which are important in many areas, ranging from chemical engineering to drug design.\r\nCOSMO-RS, From Quantum Chemistry to Fluid Phase Thermodynamics and Drug Design is about this novel technology, which has recently proven to be the most reliable and efficient tool for the prediction of vapour-liquid equilibria. In contrast to group contribution methods, which depend on an extremely large number of experimental data, COSMO-RS calculates the thermodynamic data from molecular surface polarity distributions, resulting from quantum chemical calculations of the individual compounds in the mixture. In this book, the author cleverly combines a vivid overview of the partly demanding theoretical steps with a deeper analysis of their scientific background and justification.\r\n\r\nAimed at theoretical chemists, computational chemists, physical chemists, chemical engineers, thermodynamicists as well as students,academic and industrial experts, COSMO-RS, From Quantum Chemistry to Fluid Phase Thermodynamics and Drug Design provides a novel viewpoint to anyone looking to gain more insight into the theory and potential of the unique method, COSMO-RS.\r\n\r\nAll disc-based content for this title is now available on the Web.\r\n\r\n\r\n\r\n* The only book currently available on COSMO-RS technique\r\n* Provides a novel viewpoint for the scientific understanding and for the practical quantitative treatment of fluid phase thermodynamics\r\n* Includes illustrative examples of the COSMOtherm program","torrent":{"xt":"urn:btih:71ce0f12f5218e711f4603697fddf52a575fe95c","amp;dn":"COSMO-RS+-+From+Quantum+Chemistry+to+Fluid+Phase+Thermodynamics+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71ce0f12f5218e711f4603697fddf52a575fe95c","infoHashBuffer":{"type":"Buffer","data":[113,206,15,18,245,33,142,113,31,70,3,105,127,221,245,42,87,95,233,92]},"announce":[],"urlList":[]}}