{"title":"Batman.Arkham.Origins-RELOADED","uid":9096472,"size":19788463145,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:71d4fff5cafb6346e3d6b6f122fcf60710c1130e&amp;dn=Batman.Arkham.Origins-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Thhaque","files":2,"time":1382690880,"description":"Batman: Arkham Origins\n\nPublisher: Warner Bros. Interactive Entertainment\nDeveloper: Warner Bros. Games Montreal, Splash Damage, NetherRealm Studios\nGenre: Action Detective\nLanguage: English\nDescription: Batman learns of a breakout at Blackgate Prison being led by Black Mask who has also taken Commissioner Gillian B. Loeb hostage. Arriving at the Prison Batman discovers a ferocious humanoid Crocodile like creature calling himself Killer Croc aiding Black Mask. Tracking Black Mask and Loeb to the execution chamber Black Mask states that he's starting a clean slate, of which Loeb is not a part of.\n\nSimultaneously releasing Calendar Man and killing Loeb in his place Black Mask makes his escape while Killer Croc fights Batman. Defeating Croc Batman threatens to throw him off a cliff while Croc mockingly explains that Black Mask has set up a contest of sorts inviting 8 of the world's top assassins to kill Batman in one night for a 50 000 dollar bounty.\n\nEscaping the GCPD as they retake the prison Batman goes back to the Batcave to analyze the data from a drone he found in the prison and learns that including Croc there are a total of 8 assassins trying to kill Batman:\n\n- The veteran mercenary Deathstroke.\n- The unrivaled marksman Deadshot.\n- The Spanish super soldier Bane.\n- The unstable pyromaniac Firefly.\n- The Tazer gauntlet armed Electrocutioner.\n- The unmatched Lady Shiva.\n- And the mysterious Copperhead.\n\nBelieving that the drone belongs to The Penguin Batman tracks him to his ship The Final Offer where Penguin is hosting his annual &quot;Broiler Deck Brawls.&quot; There Batman encounters two of the assassins: Electrocutioner goes down after one hit, Deathstroke on the other hand puts up a resounding fight against Batman but none the less he dominates the fight to the point that he's left wondering if Batman is even human.\n\nTaking Deathstroke's Remote Claw Batman is able learn from Penguin, before he escapes into his safe room, of a double murder in one of Black Mask's safe houses at Lacey Towers on his way out of the Final offer Batman receives a broadcast from the vigilante appropriately named Anarky which he interprets as more bad news on top of the rest of the madness of the night.\n\nAccording to the police the murder victims appears to be Black Mask himself and one of his many girlfriends and Penguin is the prime suspect. Arriving at Lacey Towers Batman learns that Penguin was not responsible and that the murder is connected to someone calling himself The Joker, further more the victim is not Black Mask because of the fact that he was killed several days earlier, before the Blackgate incident.\n\nIn order to identify the victims and the assailant Batman needs to compare their DNA samples to the National Criminal Database, and the only place Batman can do that is from inside the GCPD Building. To this end Batman retrieves the Concussion Detonator from the Batcave to provide some non-lethal muscle. Infiltrating the building Batman learns that Anarky is recruiting homeless to his cause and that a Disruptor device is in evidence lock up.\n\nSystem requirements\nMinimum System Requirements:\nOperating System: Windows Vista/7/8\nProcessor: Core 2 Duo E4600 2.4GHz / Athlon 64 X2 Dual Core 4800+\nRAM: 2 Gb\nDisk Space: 15 Gb free\nVideo RAM: 512 Mb\nVideo Card: nVidia GeForce 8800 GTS / ATI Radeon HD 3850\nSound Card: DirectX Compatible\nDirect X: 10\n\nInstallation:\n\n1. Burn or mount the image.\n2. Install the game.\n3. Copy over the cracked content from the /Crack directory on the image to your game directory\n5. Play the game.\n\nScreenshot: &lt;a href=&quot;\nhttp://s21.postimg.org/7gr7ayxqf/41f62a110590e360.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s21.postimg.org/7gr7ayxqf/41f62a110590e360.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s21.postimg.org/mukvyeypz/f633b32f4f9f5514.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s21.postimg.org/mukvyeypz/f633b32f4f9f5514.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s22.postimg.org/e26mvjxc1/3aad848129b0c7a2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s22.postimg.org/e26mvjxc1/3aad848129b0c7a2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s12.postimg.org/qrwwn1bxp/63f57ebdb980228d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s12.postimg.org/qrwwn1bxp/63f57ebdb980228d.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:71d4fff5cafb6346e3d6b6f122fcf60710c1130e","amp;dn":"Batman.Arkham.Origins-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71d4fff5cafb6346e3d6b6f122fcf60710c1130e","infoHashBuffer":{"type":"Buffer","data":[113,212,255,245,202,251,99,70,227,214,182,241,34,252,246,7,16,193,19,14]},"announce":[],"urlList":[]}}