{"title":"Manhunter","uid":4427275,"size":443932018,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7276e6231a3e49101d89efc316f75aeb7ee30ada&amp;dn=Manhunter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gilgamesh07","files":37,"time":1223099501,"description":"By request from the forums, this torrent contains the most recent incarnation of DC Comics&amp;#039; Manhunter.\n\nManhunter is the name given to several different DC Comics superheroes/antiheroes, as well as the Manhunters, an entire race of androids created by the Guardians of the Universe as a forerunner to the Green Lantern Corps. (Note: None of these should be confused with the more well-known and similarly-named DC Comics superhero called the Martian Manhunter#.\n\nKate Spencer, like Mark Shaw, is a lawyer, but instead works as a prosecutor. Outraged by the ability of supercriminals to escape justice, Spencer assembled a costume from a variety of devices left over from various heroes and villains. A Darkstar costume and Azrael&amp;#039;s Batman gloves give Spencer enhanced strength, agility and resistance to injury while Mark Shaw&amp;#039;s power staff allows her to fire bolts of energy. Spencer has taken on several minor league supervillains including Copperhead and the Shadow Thief.\n\nRecently Spencer fought her father, a minor league supervillain who erroneously claimed to be the son of Al Pratt - the Golden Age Atom. Kate is in fact the granddaughter of Phantom Lady and Iron Munro. Al Pratt allowed Sandra Knight #the Phantom Lady) to use his contact information in order to enter a home for unwed mothers, which led to the mix-up.\n\nMost recently Kate Spencer, in her heroic identity as Manhunter, began working with the US government&amp;#039;s Department of Extranormal Operations, headed by the former criminal Mister Bones. The new Manhunter series in which she appears began in 2004. This current series has featured appearances by Dan Richards, Mark Shaw, Chase Lawler, and Kirk DePaul.\n\nManhunter was initially slated to be cancelled due to low sales. However, a massive and organized fan campaign, along with support from DC Comics&amp;#039; management, allowed for another five-issue arc to be commissioned. It was revealed at the 2007 New York Comic-Con by Dan DiDio that the series had been given a second reprieve from cancellation. The series was meant to be restarted in July 2007, but has been put on hold until several issues have been written and drawn before the title resumes publication. The series returned in June 2008 with issue #31, written by co-creator Marc Andreyko and pencilled by Michael Gaydos.\n\nThanks to the scanners and the varied original sources.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:7276e6231a3e49101d89efc316f75aeb7ee30ada","amp;dn":"Manhunter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7276e6231a3e49101d89efc316f75aeb7ee30ada","infoHashBuffer":{"type":"Buffer","data":[114,118,230,35,26,62,73,16,29,137,239,195,22,247,90,235,126,227,10,218]},"announce":[],"urlList":[]}}