{"title":"Little House on the Prairie (Season 1) DVDR NTSC","uid":7140103,"size":47418050560,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:72d84e07f15eec0da8f2a39dcd23d43d5aa190bf&amp;dn=Little+House+on+the+Prairie+%28Season+1%29+DVDR+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gunnsalius","files":-1,"time":1332972149,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0071007/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0071007/&lt;/a&gt;\n\n A long-running drama based upon the &quot;Little House&quot; series of books by Laura Ingalls Wilder, &quot;Little House on the Prairie&quot; follows the lives of the simple, farming Ingalls family: Charles, Caroline, Mary, Laura, Carrie and then Grace and the later adopted Albert, James and Cassandra, who settle into a quaint little house on the banks of Plum Creek near the small town of Walnut Grove during the late 1800s. Often narrated by Laura, the series follows her simple farm upbringing from her childhood until her adulthood with Almanzo Wilder with whom she starts a family of her own. While the series is based upon the Little House books (and thus the real life of author Laura Ingalls Wilder), it is a very loose adaptation, with mostly only key events and elements of fact surviving the transition from book to TV series, the most important being Mary's eventual blindness, and Laura's future. Several other fictitious (some factual) characters make up the friendly community of Walnut Grove, including teacher Miss Beadle (succeeded by two other teachers, then Laura, then Etta Plum), Dr. Hiram Baker, Rev. Robert Alden, Mr. Hanson (of the Hanson lumber mill), and the well-to-do Olesons, owners of the local mercantile, and also the primary rivals of the Ingalls family (except the Oleson patriarch). Family friends include the Edwards family, the Garvey family and the Carters, who, in the final season, move into the Ingalls' little house.\n\nAudio: English.\nSubs.: None.\n\nPlease seed after downloading..","torrent":{"xt":"urn:btih:72d84e07f15eec0da8f2a39dcd23d43d5aa190bf","amp;dn":"Little+House+on+the+Prairie+%28Season+1%29+DVDR+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72d84e07f15eec0da8f2a39dcd23d43d5aa190bf","infoHashBuffer":{"type":"Buffer","data":[114,216,78,7,241,94,236,13,168,242,163,157,205,35,212,61,90,161,144,191]},"announce":[],"urlList":[]}}