{"title":"Daily Life in the Age of Sail (History Ebook).pdf","uid":9691130,"size":19554068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73e688cb693479fbdaa4044e54f970d0da928579&amp;dn=Daily+Life+in+the+Age+of+Sail+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1393866459,"description":"Daily Life in the Age of Sail (The Greenwood Press 'Daily Life Through History'' Series)\nAuthor(s): Dorothy Denneen Volo, James M. Volo\nPublisher: Greenwood\tCity:\t\n2001 / English / Pag 343 / ISBN: 0313310262 / 19 MB / pdf\n\nFrom the Thirteenth century through the Nineteenth, the waterways of the world provided the major means of transportation for exploration, trade, the military, and even criminals. Find out what life was like for those who chose to sail the high seas, as well as for those who didn't choose to be on board, like wives brought to sea by husbands and slaves en route to the auction block. What were their quarters like? What did they eat? How did they pass their long days at sea? These and other questions are answered in animated prose that brings the lives of ordinary people who oftentimes engaged in extraordinary activities, into sharp focus.First-hand accounts from such sources as personal journals and magazine articles are provided to help bring the time period alive. Students will also learn what life was like in the seaport towns and what the sailors did when they visited these towns, as well as the physical parts of the ships and the different roles different members of the crew played. This engaging history helps to separate fact from fiction while exploring the reasons the sea and sea life have held such prominent roles in popular fiction, and will help students understand what life was truly like for these people.","torrent":{"xt":"urn:btih:73e688cb693479fbdaa4044e54f970d0da928579","amp;dn":"Daily+Life+in+the+Age+of+Sail+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73e688cb693479fbdaa4044e54f970d0da928579","infoHashBuffer":{"type":"Buffer","data":[115,230,136,203,105,52,121,251,218,164,4,78,84,249,112,208,218,146,133,121]},"announce":[],"urlList":[]}}