{"title":"The Revised English Bible with the Apocrypha (pdf)","uid":10810646,"size":41895280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74af535e54f293ba5aafd457fd36d6d5d6945a5b&amp;dn=The+Revised+English+Bible+with+the+Apocrypha+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1408425186,"description":"The Revised English Bible With the Apocrypha (Oxford UP / Cambridge UP, 1989). 1298 pages.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\nThis a very good translation that has never found an audience, especially in the USA. It's on about the same level as the NRSV, but more literary, a bit more free, and it no longer has echoes of the AV in every verse.\n\n\ndescription:\n\nThis acclaimed translation is a revision of the best-selling New English Bible. Compiled by a committee representing all major churches, the REB is praised for its modern style and accuracy. It is regarded as the most eloquent and literary translation available.\n\nFrom Library Journal\n\nFrom its inception the New English Bible was intended to be revised. This revision, which has taken into account praise and criticism of the New English Bible and advances in biblical scholarship, is the fruit of 15 years' labor. The style has remained dignified but not stuffy, vigorous but not coarse. Many Briticisms and awkward phrases have been reworked (&quot;loose livers&quot; in I Cor. 5:9 is now &quot;those who are sexually immoral&quot;), though some remain (&quot;a rod in pickle&quot; in Prov. 19:29). The removal of &quot;thee&quot; and &quot;thou&quot; from address to God and the cautious, discriminating use of inclusive language reflect current usage. Transposition of words, verses, and whole passages in the name of clarity --carried over from the New English Bible -- will cause continued concern and will decrease somewhat this work's value as a study Bible. All things considered, however, this is an excellent translation that will easily find a place in public and private reading. Highly recommended.\n","torrent":{"xt":"urn:btih:74af535e54f293ba5aafd457fd36d6d5d6945a5b","amp;dn":"The+Revised+English+Bible+with+the+Apocrypha+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74af535e54f293ba5aafd457fd36d6d5d6945a5b","infoHashBuffer":{"type":"Buffer","data":[116,175,83,94,84,242,147,186,90,175,212,87,253,54,214,213,214,148,90,91]},"announce":[],"urlList":[]}}