{"title":"The Ridley Scott Encyclopedia (pdf){Zzzzz}","uid":11459853,"size":3007904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74cd5cf99650448aec5fcbd3cb5c0d217bd099e2&amp;dn=The+Ridley+Scott+Encyclopedia+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"zombie_rox","files":1,"time":1415974615,"description":"From his first feature film, The Duellists, to his international successes Alien, Blade Runner, Thelma and Louise, Black Hawk Down, Gladiator, and American Gangster, Ridley Scott has directed some of the most compelling films of the last 30 years. Apart from his work as a film director, Scott has engaged in a vast range of activities, including that as a designer, producer, film mogul, and advertising executive. The Ridley Scott Encyclopedia is the first book that focuses on all aspects of his work in a wide-ranging career that spans nearly 50 years.\n\nThe entries in this encyclopedia focus on all aspects of his work and are divided into four categories. The first focuses on Ridley Scott's work as a director, encompassing his feature films from The Duellists to Body of Lies, as well as his work in television, including commercials. The second category focuses on the people who have been involved in Scott's projects, including actors, directors, producers, designers, writers and other creative personnel. The third focuses on general thematic issues raised in Scott's work, such as gender construction, political issues, and geographical locations. Finally the encyclopedia incorporates entries on films by other directors who have influenced Scott's approach to his work as a director or producer. Each entry is followed by a bibliography of published sources, both in print and online, making this the most comprehensive reference on Scott's body of work.\n\nPublisher: Scarecrow Press (September 28, 2009)\nLanguage: English\nISBN-10: 0810869519\nISBN-13: 978-0810869516","torrent":{"xt":"urn:btih:74cd5cf99650448aec5fcbd3cb5c0d217bd099e2","amp;dn":"The+Ridley+Scott+Encyclopedia+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74cd5cf99650448aec5fcbd3cb5c0d217bd099e2","infoHashBuffer":{"type":"Buffer","data":[116,205,92,249,150,80,68,138,236,95,203,211,203,92,13,33,123,208,153,226]},"announce":[],"urlList":[]}}