{"title":"G. Love and Special Sauce - [Self Titled] -1994- 320 kbps CBR","uid":4408332,"size":140825739,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74ce990bdcac6b6701f99f922f1b86682b0466d8&amp;dn=G.+Love+and+Special+Sauce+-+%5BSelf+Titled%5D+-1994-+320+kbps+CBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SideSkroll","files":24,"time":1222083809,"description":"Editorial Reviews\nAmazon.com\nWith Beck's unexpected commercial breakthrough, everyone's suddenly interested in a new kind of music best described as &quot;slacker-rap.&quot; Although it uses the sing-song cadences of hip-hop, it's the polar opposite of gangsta rap; in both its laid-back delivery and self-deprecating lyrics, slacker-rap acknowledges vulnerability and failure. It was done first and best by Washington's Basehead, but it gets an invigorating twist on &quot;G. Love and Special Sauce,&quot; the eponymous debut album from this Philadelphia trio.\n\nG. Love not only looks like Michael Stipe, but he has the same mealy-mouthed vocal delivery. If Stipe ever decided to record his first rap album with an unplugged blues trio, it'd probably sound a lot like &quot;G. Love and Special Sauce.&quot; Recorded live with no drum machines, samples or overdubs, the album creates a fresh, distinctive sound with its odd blend of lazy rapping and funky acoustic blues. Unfortunately, G. Love's absurdist observations on life aren't as funny as those by John S. Hall of King Missle, and the laid-back minimalism of the music wears thin after a while. Only &quot;Baby's Got Sauce,&quot; which boasts a pop hook and a valentine to a domineering woman, holds up on repeated listens. --Geoffrey Himes\n\nRemember to seed please.","torrent":{"xt":"urn:btih:74ce990bdcac6b6701f99f922f1b86682b0466d8","amp;dn":"G.+Love+and+Special+Sauce+-+%5BSelf+Titled%5D+-1994-+320+kbps+CBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74ce990bdcac6b6701f99f922f1b86682b0466d8","infoHashBuffer":{"type":"Buffer","data":[116,206,153,11,220,172,107,103,1,249,159,146,47,27,134,104,43,4,102,216]},"announce":[],"urlList":[]}}