{"title":"Bloom's Literary Themes Set II","uid":9462032,"size":4302362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:754dfa030ffe5b7af8367af1731243965ef6ab74&amp;dn=Bloom%27s+Literary+Themes+Set+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1389373110,"description":"About the Series\nCertain great literary themes reappear continually throughout the world's literature and are a major component of today's literature curriculum standards. The Bloom's Literary Themes series examines how these themes function in classic literary works, from the Bible to the novels of Toni Morrison. Some of the approximately 20 essays in each title were written specifically for the series; others are excerpts of important critical analyses published in books or journals. This latest addition to the Bloom's Literary Criticism imprint is the perfect complement to other Bloom's critically acclaimed series, such as Bloom's Guides, Bloom's Modern Critical Views, and Bloom's Modern Critical Interpretations.\n\nEach title features:\n\nOriginal essays and excerpts from published critical analyses that discuss the role of the title theme in various works\nAn index for easy reference\nTwo introductory essays by Harold Bloom.\n\nBloom's Literary Themes: Enslavement and Emancipation\nPerhaps the most famous treatment of the themes of enslavement and emancipation is in the biblical Book of Exodus, but the two themes continue to be prominent in great literature today. This title examines the themes of enslavement and emancipation in Beloved, the speeches of Abraham Lincoln, A Narrative of the Life of Frederick Douglass, A Room of One's Own, the novels of Elie Wiesel, and many other notable works.\n\nFeaturing original essays and excerpts from previously published critical analyses, this addition to the Bloom's Literary Themes series gives students valuable insight into the title's subject theme.\n\nBloom's Literary Themes: Exploration and Colonization\nHistorically, exploration and colonization have been linked in troubling ways. This new volume discusses the roles of exploration and colonization in Heart of Darkness, The Iliad, One Hundred Years of Solitude, Things Fall Apart, Wide Sargasso Sea, and other literary works.\n\nFeaturing original essays and excerpts from previously published critical analyses, this addition to the Bloom's Literary Themes series gives students valuable insight into the title's subject theme.\n\nBloom's Literary Themes: Human Sexuality\nFrom the time of Plato to the present day, human sexuality has been a central subject to the literary imagination. Human Sexuality explores the role of this important literary theme in Lolita, Madame Bovary, Oedipus Rex, Sons and Lovers, and many others. This new offering from the Bloom's Literary Themes series covers a topic often found in the high school curriculum, lending support for students of literature.\n\nBloom's Literary Themes: Rebirth and Renewal\nTranformation in the form of rebirth and renewal has long been a central theme in literature. This volume explores this theme as found in Crime and Punishment, Heart of Darkness, The Tempest, Their Eyes Were Watching God, and many more works. Rebirth and Renewal provides about 20 explanatory essays and critical analyses from which students studying literature can gain valuable insights.","torrent":{"xt":"urn:btih:754dfa030ffe5b7af8367af1731243965ef6ab74","amp;dn":"Bloom%27s+Literary+Themes+Set+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"754dfa030ffe5b7af8367af1731243965ef6ab74","infoHashBuffer":{"type":"Buffer","data":[117,77,250,3,15,254,91,122,248,54,122,241,115,18,67,150,94,246,171,116]},"announce":[],"urlList":[]}}