{"title":"SUPER-VILLAIN TEAM-UP (1975-1980) Complete Plus Extras REQUESTED","uid":7976683,"size":294661754,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:754ded349651c471c9b0a5efadcf0a8686862260&amp;dn=SUPER-VILLAIN+TEAM-UP+%281975-1980%29+Complete+Plus+Extras+REQUESTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1357014938,"description":"This fills a request by jccman33! Enjoy and please seed to share with our friends on TPB!\n\nIn this torrent, I've included: the original series; both Giant-Size issues; a few Avengers issues that crossed over with SVTU #9; and the CHAMPIONS issue that finishes the story from #14. And just for the heck of it, the 5-issue SVTU revival from '07 that stars MODOK.\n\nThe description below is swiped from Wikipedia, with extensive re-writing/corrections by STFmaryville!  ;-)\n\n------\n\nThe first series started in 1975 with two Giant-Size issues before changing into a regular bi-monthly series. It initially teamed up Dr. Doom and Sub-Mariner, who had lost his own series, from which it picked up the unresolved plots, especially that of comatose Atlanteans. After several changes of writers and artists and a crossover with The Avengers, the plot gets resolved in issue #13 when Dr. Doom revives the Atlanteans, thus dissolving his alliance with Sub-Mariner.\n\nIssue #14 featured Magneto and Dr. Doom and was the final issue of the series, and its plot-line was resolved in Champions #16. However, SVTU continued with issue #15 the next year, but it was just a reprint of the Doom stories from Astonishing Tales #4 and 5. SVTU issues #16 and 17 featured the Red Skull and the Hate-Monger. Inexplicably, the final issue (17) was cover-dated June 1980, more than a year after #16.\n\nSVTU includes the death of 1940s Sub-Mariner sweetheart Betty Dean and the gruesome death of her murderer, Dr. Dorcas. Steve Englehart created The Shroud, a character partly inspired by Batman, shortly before he started to work for DC Comics on Detective Comics. The series also features a bizarre guest-appearance by Henry Kissinger.\n\nSuper-Villain Team-Up: MODOK's 11 was a 2007-2008 mini-series, featuring eleven super-villains in the manner of the movie &quot;Ocean's Eleven.&quot;","torrent":{"xt":"urn:btih:754ded349651c471c9b0a5efadcf0a8686862260","amp;dn":"SUPER-VILLAIN+TEAM-UP+%281975-1980%29+Complete+Plus+Extras+REQUESTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"754ded349651c471c9b0a5efadcf0a8686862260","infoHashBuffer":{"type":"Buffer","data":[117,77,237,52,150,81,196,113,201,176,165,239,173,207,10,134,134,134,34,96]},"announce":[],"urlList":[]}}