{"title":"Shutter [DVDRIP][2004][Tailandes Subs English-Spanish] pctor","uid":3297014,"size":734099946,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75b416e0bc95d2816775b6a65db20ec5219410b5&amp;dn=Shutter+%5BDVDRIP%5D%5B2004%5D%5BTailandes+Subs+English-Spanish%5D+pctor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pctorrent","files":7,"time":1109761741,"description":"Asian horror finds some talent to watch in Banjong Pisonthanakun and Parkpoom Wongpoom, directors of the horror-thriller Shutter! Tun (Ananda Everingham) and Jane (Natthaveeranuch Thongmee) unwittingly unleash a chilling mystery when they hit a girl with their car one evening. The rattled couple leave her for dead, but her presence extends beyond their one-night encounter. Soon, ghostly shadows begin appearing on the negatives and prints of professional photographer Tun, and even their friends are starting to feel a ghostly presence! Tun doesn't believe in the supernatural, but Jane does, and her belief in the otherworldly shows this young couple that you cannot escape nor hide from your past. Shutter is a tense and haunting thriller that preys on our paranoid imagination and lingering fear, and further promotes Thailand as a region to watch in Asian Cinema.\n\n------------------------------------------------------------------------------------------------\n\nEl cine de Terror asiatico, encuentra una nueva forma de manejar este genero en los directores de Shutter (Banjong Pisonthanakun y Parkpoom Wongpoom) los cuales han creado un dran fil de horror y suspense.Tun (Ananda Everingham) and Jane (Natthaveeranuch Thongmee) descubren un gran misterio cuando atropellan a una muchacha con su coche, muy pronto las sombras fantasmales empiezan a aparecer en los negativos y fotos de Tun e incluso amigos de ellos empiezan a sentir presencias fantasmales, el no cree en lo sobrenatural pero jane y sus creencia de el otro mundo no lo dejan indiferente. Shutter es un gran film tailandes que esta marcando el tiempo a el cine asiatico en general, el cual nos hara presas de nuestra imaginacion paranoica y un miedo persistente.","torrent":{"xt":"urn:btih:75b416e0bc95d2816775b6a65db20ec5219410b5","amp;dn":"Shutter+%5BDVDRIP%5D%5B2004%5D%5BTailandes+Subs+English-Spanish%5D+pctor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b416e0bc95d2816775b6a65db20ec5219410b5","infoHashBuffer":{"type":"Buffer","data":[117,180,22,224,188,149,210,129,103,117,182,166,93,178,14,197,33,148,16,181]},"announce":[],"urlList":[]}}