{"title":"SafeInCloud Password Manager ( APK )","uid":10806787,"size":2509013,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:75b95658d02905f1a42be3443da5b2bd4bbb51c7&amp;dn=+SafeInCloud+Password+Manager+%28+APK+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dougstamper","files":-1,"time":1408388791,"description":"Description\nProtect your data with unique and secure passwords! Forget the headache of remembering PINs and passwords! START USING A PASSWORD MANAGER TODAY!\n\nSafeInCloud is a complete PASSWORD MANAGEMENT SOLUTION: Free Desktop Application + Mobile Application for Phones and Tablets.\n\nAWESOME FEATURES\nâ—† Easy To Use\nâ—† Strong Encryption\nâ—† Cloud Synchronization\nâ—† Browser Integration\nâ—† Cross-Platform\nâ—† Automatic Data Import\nâ—† Multi-Language Support\n\nEASY TO USE\nTry it yourself and enjoy an easy-to-use yet powerful user interface.\n\nSTRONG ENCRYPTION\nYour data is always encrypted on a device and in a cloud with a strong 256-bit Advanced Encryption Standard (AES). This algorithm is used by the U.S. Government for protection of a top secret information. AES is also widely adopted worldwide and became the de facto encryption standard.\n\nCLOUD SYNCHRONIZATION\nYour database is automatically synchronized with your own cloud account (Google Drive, Dropbox, or OneDrive). Thus you can easily restore your entire database from a cloud to a new phone or computer (in case of a loss or an upgrade). Your phone, tablet and computer are also automatically synchronized between each other via a cloud.\n\nBROWSER INTEGRATION\nThe Desktop application integrates with a browser. This allows you to paste passwords directly into web pages. You don't need to manually copy and paste passwords from SafeInCloud into a browser.\n\nCROSS-PLATFORM\nSafeInCloud is available on the following platforms: OS X (Mac), iOS (iPhone and iPad), Windows (7 and 8), and Android.\n\nAUTOMATIC DATA IMPORT\nThe Desktop application can automatically import your data from another password manager. You don't need to manually reenter all your passwords.\n\nMULTI-LANGUAGE SUPPORT\nSafeInCloud is localized to German, French, Italian, Spanish, Russian, Japanese, Korean, Chinese, and many other languages.\n\nCan you help to improve SafeInCloud translation on your native language? No special skills required. It is easy and even fun: https://crowdin.net/project/safeincloud/invite\n\n\nBy Doug Stamper\n","torrent":{"xt":"urn:btih:75b95658d02905f1a42be3443da5b2bd4bbb51c7","amp;dn":"+SafeInCloud+Password+Manager+%28+APK+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b95658d02905f1a42be3443da5b2bd4bbb51c7","infoHashBuffer":{"type":"Buffer","data":[117,185,86,88,208,41,5,241,164,43,227,68,61,165,178,189,75,187,81,199]},"announce":[],"urlList":[]}}