{"title":"Marvel NOW! Week 7 (darkhomr) [TPB]","uid":7980819,"size":109707791,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7642831293ba52f16ae7165fe58d0fc0150f5e65&amp;dn=Marvel+NOW%21+Week+7+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":4,"time":1357169128,"description":"Starting the week of January 2, 2013 I will be posting the ongoing adventures in the Marvel NOW! storyline. Each week I will be posting the current week's Marvel NOW titles. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\nAll New X-Men #5 (CBR 1/2/2013)\n\nThe first story of a new era comes to its conclusion.  One of the original X-Men will be forever changed! \n\nIron Man #5 (CBR 1/2/2013)\n\nEXTREMIS plus the final frontier equals universal doom!  Will Tony have to betray an old friend?  The debut of the All-New Space Armor! \n\nMorbius Living Vampire #1 (CBR 1/2/2013)\n\nMorbius....the hunted, haunted fugitive.  Morbius...the dead souled scientist.  Morbius...the Living Vampire.  Somewhere inside Doctor Michael Morbius is a good man who just needs a second chance. After escaping from The Raft in Amazing Spider-Man 699.1, Morbius is scraping desperately through each day trying to carve out a life in a world that has turned its back on him. However his redemption...may be worse than his sin.  NOW Morbius returns in this long-awaited ongoing series, where the line between hero and villain becomes brutally and bloodily blurred. \n\nNew Avengers #1 (CBR 1/2/2013)\n\nTo prevent the collision of our universe with another, the Illuminati, led by the Black Panther, must assemble NOW!  It's the most powerful and brilliant team in the Marvel Universe--The Black Panther, Iron Man, Doctor Strange, Black Bolt, Mister Fantastic, Namor the Sub-Mariner and The Beast--against an infinite legion of parallel realities. \n\nRed She-hulk #61 (CBR 1/2/2013)\n\nNO LIMITS!  The issue that reveals that Betty Ross has more in common with Bruce Banner than the name HULK! The secret connection of Echelon and the end of humanity as the World Computer CRASHES!  The last stand of MACHINE MAN!!! \n","torrent":{"xt":"urn:btih:7642831293ba52f16ae7165fe58d0fc0150f5e65","amp;dn":"Marvel+NOW%21+Week+7+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7642831293ba52f16ae7165fe58d0fc0150f5e65","infoHashBuffer":{"type":"Buffer","data":[118,66,131,18,147,186,82,241,106,231,22,95,229,141,15,192,21,15,94,101]},"announce":[],"urlList":[]}}