{"title":"Flatfishes: Biology and Exploitation [myebookShelf]","uid":11649543,"size":7840054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7673b505ee50a0d308ebc9e20a85788e71d7f03a&amp;dn=Flatfishes%3A+Biology+and+Exploitation+%5BmyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1417857851,"description":"Flatfishes: Biology and Exploitation [myebookShelf]\n[img]http://s30.postimg.org/bzeqn4aot/Flatfishes_Biology_and_Exploitation.jpg[/img]\n\nEnglish | 2015 | ISBN: 1118501195 | 576 pages | PDF | 7 MB\n\nFascinating and instantly recognizable, flatfishes are unique in their asymmetric postlarval body form. With over 800 extant species recognized and a distribution stretching around the globe, these fishes are of considerable research interest and provide a major contribution to commercial and recreational fisheries worldwide. This second edition of Flatfishes: Biology and Exploitation has been completely revised, updated and enlarged to respond to the ever-growing body of research. It provides: * Overviews of systematics, distribution, life history strategies, reproduction, recruitment, ecology and behaviour * Descriptions of the major fisheries and their management * An assessment of the synergies between ecological and aquaculture research of flatfishes. Carefully compiled and edited by four internationally-known scientists and with chapters written by many world leaders in the field, this excellent new edition of a very popular and successful book is essential reading for fish biologists, fisheries scientists, marine biologists, aquaculture personnel, ecologists, environmental scientists, and government workers in fisheries and fish and wildlife departments. Flatfishes: Biology and Exploitation, Second Edition, should be found in all libraries of research establishments and universities where life sciences, fish biology, fisheries, aquaculture, marine sciences, oceanography, ecology and environmental sciences are studied and taught.\n\nReviews of the First Edition * A solid, up-to-date book that advanced students and research scientists with interests in fish biology will find interesting and useful. Aquaculture International * A data-rich book that outlines much of what you might ever want to know about flatfishes. Fish &amp; Fisheries * Well presented with clear illustrations and a valuable source of information for those with a general interest in fish ecology or for the more specialist reader. You should make sure that your library has a copy. J Fish Biology * An excellent and very practical overview of the whole, global flatfish scene. Anyone interested in flatfish at whichever stage of the economic food chain should invest in a copy immediately. Ausmarine * Because of the high quality of each chapter, written by international experts, it is a valuable reference. Reviews in Fish Biology and Fisheries","torrent":{"xt":"urn:btih:7673b505ee50a0d308ebc9e20a85788e71d7f03a","amp;dn":"Flatfishes%3A+Biology+and+Exploitation+%5BmyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7673b505ee50a0d308ebc9e20a85788e71d7f03a","infoHashBuffer":{"type":"Buffer","data":[118,115,181,5,238,80,160,211,8,235,201,226,10,133,120,142,113,215,240,58]},"announce":[],"urlList":[]}}