{"title":"SayNotoStatins.pdf","uid":16022260,"size":875230,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:775a28e0bb4582ad6460cc45dbfe7d4bc862cbc7&amp;dn=SayNotoStatins.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"sam_179","files":1,"time":1476351580,"description":"Statins are the most commonly prescribed class of drugs in the world, with the #1 seller the cholesterol-lowering drug Lipitor (atorvastatin).  They are commonly prescribed under the assumption that they can help protect heart health and lower the risk of heart attack. However, as with all medicines, they carry a risk of side effects. \r\n\r\nStatins were first discovered in the 1980s, and Lipitor was the first to win U.S. Food and Drug Administration (FDA) approval in 1987. The original protocol was to only prescribe the drug if the patient had made significant lifestyle changes such as diet but was still unable to get their cholesterol down to heart healthy levels. However, Lipitor soon became a cash cow that was far too easy to milk. It became part of a ‘one pill fits all approach’ for anyone who had high cholesterol. \r\n\r\nOther statins soon emerged and jockeyed for market share, but as more and more post-approval studies for statins emerged, so too did a growing number of side effects and risks that patients had suffered as a result of taking the medication.\r\n\r\nAs with all drugs, both prescription and over the counter, it is always a case of balancing risk on the one hand with benefits on the other. In the case of many medications, however, the patient is not being give the full facts needed to make intelligent decisions and what is termed informed consent.\r\n\r\nIn this guide, you will discover what cholesterol is, how statins lower blood serum cholesterol, and what major risks and side effects have been reported in relation to statins. You will also discover easy, natural ways to reduce dietary cholesterol so you can decide for yourself whether statins are worth the risk or whether you can go the all-natural route","torrent":{"xt":"urn:btih:775a28e0bb4582ad6460cc45dbfe7d4bc862cbc7","amp;dn":"SayNotoStatins.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775a28e0bb4582ad6460cc45dbfe7d4bc862cbc7","infoHashBuffer":{"type":"Buffer","data":[119,90,40,224,187,69,130,173,100,96,204,69,219,254,125,75,200,98,203,199]},"announce":[],"urlList":[]}}