{"title":"Dean M. Cole - Retribution (Sector 64 #2)","uid":14547960,"size":312543777,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:781ed1e79115d606a0991f5c45119dd804c5c8b2&amp;dn=Dean+M.+Cole+-+Retribution+%28Sector+64+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":50,"time":1462607903,"description":"Conclusion to the Sector 64 duology.\r\n\r\nFollowing the apocalyptic events of Ambush, Jake must board and somehow control the advanced alien fleet of huge ghost ships before they start falling into the Atlantic.\r\n\r\nYesterday, Captain Sandra Fitzpatrick found out she’s pregnant. Then she helped save the world. Tomorrow, if she can keep her condition a secret (even from Jake, the father to be), Sandy may lead space fighters into combat.\r\n\r\nIf Jake and Sandy prevail, can Earth’s ravaged militaries master the fleet’s technologies? Can today’s naval forces adapt now outdated tactics to the limitless battlefield of space?\r\n\r\nOn the newly settled Argonian colony world of Chuvarti, scientist Remulkin Thramorus watched the enemy vaporize his entire family along with every man, woman, and child. As the world’s sole survivor, Remulkin joins the ravaged Galactic Defense Forces en route to Galactic Sector 64. Will Remulkin find peace, or will his thirst for vengeance destroy him?\r\n\r\nAfter the battle for Chuvarti, the GDF’s Supreme Commander needs to find out what happened to the fleet he sent to Earth space. However, with an unknown spy threatening to tip the balance and the remainder of the enemy fleet on the move, it’s a race against time. The Galactic Defense Forces must get to the Sol System before the enemy’s main force. But if they do, what happens when the GDF discovers Earth’s militaries operating their ships?\r\n\r\nAs the Milky Way’s two most powerful armadas loose their engines of destruction over present day Earth, the remnants of humankind must rise from the ashes like a Phoenix.\r\n\r\nWith the fate of the galaxy in their hands, can Jake and his ragtag team make a stand?\r\n\r\n\r\n\r\n\r\nRead by Mike Ortego\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:781ed1e79115d606a0991f5c45119dd804c5c8b2","amp;dn":"Dean+M.+Cole+-+Retribution+%28Sector+64+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"781ed1e79115d606a0991f5c45119dd804c5c8b2","infoHashBuffer":{"type":"Buffer","data":[120,30,209,231,145,21,214,6,160,153,31,92,69,17,157,216,4,197,200,178]},"announce":[],"urlList":[]}}