{"title":"The Electronics Handbook - 2nd Edition (Malestrom)","uid":5864443,"size":26080227,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:785df7a9e4ae66fb2975612cdcf78dde42b2cd95&amp;dn=The+Electronics+Handbook+-+2nd+Edition+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1286101092,"description":"Jerry C. Whitaker, &quot;The Electronics Handbook, Second Edition (Electrical Engineering Handbook)\nPublisher: CRC | Number Of Pages:2640 | 2005-04-13 | ISBN: 0849318890 | PDF\n\nDuring the ten years since the appearance of the groundbreaking, bestselling first edition of The Electronics Handbook, the field has grown and changed tremendously. With a focus on fundamental theory and practical applications, the first edition guided novice and veteran engineers along the cutting edge in the design, production, installation, operation, and maintenance of electronic devices and systems. Completely updated and expanded to reflect recent advances, this second edition continues the tradition. \n\nThe Electronics Handbook, Second Edition provides a comprehensive reference to the key concepts, models, and equations necessary to analyze, design, and predict the behavior of complex electrical devices, circuits, instruments, and systems. With 23 sections that encompass the entire electronics field, from classical devices and circuits to emerging technologies and applications, The Electronics Handbook, Second Edition not only covers the engineering aspects, but also includes sections on reliability, safety, and engineering management. \n\nThe book features an individual table of contents at the beginning of each chapter, which enables engineers from industry, government, and academia to navigate easily to the vital information they need. This is truly the most comprehensive, easy-to-use reference on electronics available.","torrent":{"xt":"urn:btih:785df7a9e4ae66fb2975612cdcf78dde42b2cd95","amp;dn":"The+Electronics+Handbook+-+2nd+Edition+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"785df7a9e4ae66fb2975612cdcf78dde42b2cd95","infoHashBuffer":{"type":"Buffer","data":[120,93,247,169,228,174,102,251,41,117,97,44,220,247,141,222,66,178,205,149]},"announce":[],"urlList":[]}}