{"title":"Jodorowsky&amp;rsquo;s Dune (2013) (Cinavia removed)","uid":10808590,"size":1327414902,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7902686d7f7d47ec2f841ba211a11cea66ae39d5&amp;dn=Jodorowsky%26rsquo%3Bs+Dune+%282013%29+%28Cinavia+removed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fantom87","files":-1,"time":1408401393,"description":"Originally uploaded by YIFY, I've taken the liberty of removing the Cinavia copy protection for all to enjoy how they please!\n\nFilmmaker Frank Pavich explores one of cinema's great &quot;what ifs&quot; in this documentary detailing Alejandro Jodorowsky's aborted feature adaptation of Frank Herbert's celebrated sci-fi novel Dune. With the release of El Topo (1970) and its psychedelic follow-up The Holy Mountain (1973), Jodorowsky became not only a pioneer of psychedelic surrealism in film, but also the father of the &quot;Midnight Movie.&quot; Following the success of those two films, the Chilean director began focusing all of his energies on translating Dune to the big screen. The film was to star Jodorowsky's own son Brontis along with a stunning cast that included Orson Welles, David Carradine, Mick Jagger, and Salvador Dali, with Pink Floyd providing the score, and art direction by H.R. Giger and Jean &quot;Moebius&quot; Giraud. Two years into the massive production, however, the film was suddenly and unceremoniously cancelled. Yet even today, numerous relics of that ambitious production -- including thousands of enticingly vivid storyboards -- still exist. In this film, Pavich offers movie lovers a tantalizing glimpse at a masterpiece that was never meant to be. ","torrent":{"xt":"urn:btih:7902686d7f7d47ec2f841ba211a11cea66ae39d5","amp;dn":"Jodorowsky%26rsquo%3Bs+Dune+%282013%29+%28Cinavia+removed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7902686d7f7d47ec2f841ba211a11cea66ae39d5","infoHashBuffer":{"type":"Buffer","data":[121,2,104,109,127,125,71,236,47,132,27,162,17,161,28,234,102,174,57,213]},"announce":[],"urlList":[]}}