{"title":"Ultra Video Splitter 5.4(latest)-serial incl","uid":5068554,"size":11913513,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7960eb13e299c8329315d25034ac87ec52582bc8&amp;dn=Ultra+Video+Splitter+5.4%28latest%29-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jmb2012","files":2,"time":1251218224,"description":"Ultra Video Splitter 5.4.0822 is a professional video file splitting tool which split, cut or trim a large video file into smaller clips, it supports so many video formats including AVI, Divx, XviD, MPEG, WMV, ASF, RM, MOV, 3GP, MP4, FLV formats.\n\nThe Movie Splitter supports splitting video directly without re-encoding; it also supprots splitting video to other formats like AVI, MPEG,VCD,DVD,WMV,ASF,MP4,FLV etc.\n\nUltra Video Splitter provides different splitting mode to make splitting easy.You can extract multiple segments of any size by using the visual editing mode, or split the selection into multiple pieces of equal size automatically.\n\nIt already includes all video encoders and decoders , you don't need to download any other codecs to make it work.\n\n Key Functions\n\n    * Direct stream cut, without re-encoding\n      Ultra Video Splitter supports splitting video directly without re-encoding, it's very fast and without any quality loss.\n    * Split video from one file to another format\n      Ultra Video Splitter supprots splitting video to other formats like AVI, MPEG,VCD,DVD,WMV,ASF,MP4,FLV etc.\n    * AVI Splitter - split AVI DivX video files\n      You can use Ultra Video Splitter to split AVI DivX files with Fast conversion speeds because All encoders/codec are built-in\n    * MPEG Splitter\n      Ultra Video Splitter to split MPEG1, MPEG2 file. A lot of settings you can tweak to achieve high quality.\n    * MP4 Splitter\n      Ultra Video Splitter is a MP4 splitter which split MP4, iPod, iPhone, Apple TV file into several video segments\n    * Video Cutter\n      Cut unwanted parts by specifying start time and end time\n\nKey Features\n\n    * Split,cut or trim large video files into smaller clips in various format\n    * Supports AVI, Divx, XviD, MPEG, WMV, ASF, RM, MOV, 3GP, MP4, FLV and VCD SVCD bin/cue image\n    * Split supported files to AVI, DivX, Xvid , Archos, iRiver, Creative Zen Vision\n    * Split supported files to MPEG1, MPEG2, VCD SVCD DVD compatible MPEG formats\n    * Split supported files to VCD, SVCD BIN/CUE Image, DVD Video files\n    * Split supported files to WMV, ASF\n    * Split supported files to MP4, iPod, iPhone, Apple TV\n    * Split supported files to 3GP, BlackBerry\n    * Split supported files to FLV\n    * All encoders/codec are built-in and any supported conversion can be done once you downloading the software\n    * Support &quot;Drag and Drop&quot; from Windows Explorer\n    * Preview is supported for you to preview the original files\n    * Custom define the output audio volume\n    * Add letterbox to keep the original aspect ratio\n    * High conversion speed and wonderful output quality\n    * Simple GUI and very EASY to use \n\n\n\nWindows\tWin (All)\nRequirements\tMicrosoft DirectX\n","torrent":{"xt":"urn:btih:7960eb13e299c8329315d25034ac87ec52582bc8","amp;dn":"Ultra+Video+Splitter+5.4%28latest%29-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7960eb13e299c8329315d25034ac87ec52582bc8","infoHashBuffer":{"type":"Buffer","data":[121,96,235,19,226,153,200,50,147,21,210,80,52,172,135,236,82,88,43,200]},"announce":[],"urlList":[]}}