{"title":"Arzachel - Arzachel (1969) (2002 Akarma re-issue)(mp3)(320 kbps)","uid":8886761,"size":110906130,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79e45a782a0aa3313e779c1b736ce1fe21ef28fc&amp;dn=Arzachel+-+Arzachel+%281969%29+%282002+Akarma+re-issue%29%28mp3%29%28320+kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"glngwl","files":8,"time":1378479031,"description":"Arzachel - &quot;Arzachel&quot; (1969) (mp3) (320 kbps) (cover scans included)\n\n\nRe-issued AKARMA AK184 (2002)\n\n\nPersonnel:\n\nSimeon Sasparella (Steve Hillage) - Lead Guitar and Vocals\nSam Lee-Uff (Dave Stewart) - Organ\nBasil Dowling (Clive Brooks) - Drums\nNjerogi Gategaka (Mont Campbell) - Bass\n\n\nTrack Listing:\n\n  1. Garden Of Earthly Delights - (2:47) \n  2. Azathoth - (4:25) \n  3. Queen St. Gang - (4:28) \n  4. Leg - (5:45) \n  5. Clean Innocent Fun - (10:31) \n  6. Metempsychosis - (16:51) \n\n\nComprised of what was then the band URIEL, this was the earliest formation of Steve HILLAGE and Dave STEWART.  ARZACHEL had two things which helped it when the CD era came: the music is better than most other psych rarities, and the four musicians later achieved marginal success in the '70s progressive rock &quot;Canterbury scene&quot;.\n\nThe record itself featured some of the most explosive psychedelia by an English group.  The sustained keyboard and guitar passages are full-blown drawn-out psychedelia of the best kind.  Think EGG, GONG, NATIONAL HEALTH, or CARAVAN.  Collectors of rare psychedelia recognize ARZACHEL's sole LP as being one of the most desired (and pricy) relics of the late '60s.\n\nAn excellent album from this British progressive group, recorded in June 1969 by a band of mysterious pseudonyms.  In fact, this was a formation of some of the biggest names in UK progressive rock: Steve Hillage (who later played in Gong) had left URIEL to attend university, and the other 3 members (Dave Stewart, Clive Brooks and Mont Campbell) changed the band's name in early 1969, under pressure from their managers, to form EGG.  When the opportunity arose to fill the market's need and record a heavy psychedelic album, the trio chose the pseydonym ARZACHEL, since this material clearly didn't fit their new EGG moniker.  Besides, they were then under contract to Decca anyway.\n\nSo URIEL reunited (ie, Hillage rejoined) for this album only, a one-off psychedelic project under the name ARZACHEL (named after a crater on the moon, itself named after a medieval Spanish astronomer).\n\nThe album was recorded and mixed in a single session in London, in June 1969.  The 'A' side has four songs, while the 'B' side consists of two long psychedelic tracks, the longer of which is a 17-minute jam entitled 'Metempsychosis'.  The album was issued on the short-lived Evolution label (also home to the debut by Raw Material), and quickly became a collectors' item.  This heavy spacy keyboard-driven album is often favourably compared to Pink Floyd's &quot;Saucerful of Secrets&quot;: the track 'Garden of Earthly Delights' is an influential classic of early UK progressive psychedelia.","torrent":{"xt":"urn:btih:79e45a782a0aa3313e779c1b736ce1fe21ef28fc","amp;dn":"Arzachel+-+Arzachel+%281969%29+%282002+Akarma+re-issue%29%28mp3%29%28320+kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79e45a782a0aa3313e779c1b736ce1fe21ef28fc","infoHashBuffer":{"type":"Buffer","data":[121,228,90,120,42,10,163,49,62,119,156,27,115,108,225,254,33,239,40,252]},"announce":[],"urlList":[]}}