{"title":"Information Technology Control and Audit","uid":4723185,"size":9271261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b1ec918ad928f56509c413ed08af102e6e0c671&amp;dn=Information+Technology+Control+and+Audit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"VasiaZozulia","files":1,"time":1234621642,"description":"Gallegos Frederick - Information Technology Control and Audit, Second Edition \n\nInformation Technology Control and Audit, Second Edition is an excellent introductory textbook for IT auditing. It covers a wide range of topics in the field including the audit process, the legal environment of IT auditing, security and privacy, and much more.This textbook first examines the foundation of IT audit and control, discussing what IT auditing involves and the guidance provided by organizations in dealing with control and auditability issues. It then analyzes the process of audit and review, explores IT governance and control, and discusses the CobiT framework and steps that align IT decisions with business strategy. This volume examines project management processes that ensure that projects are controlled from inception through integration.It continues by addressing auditing IT acquisition and implementation, describing risks and controls as related to the life cycle of application systems. It highlights the purchase and installation of new systems, as well as change management. The next section examines the auditing of IT operations in both standalone and global environments, covering types of IT operation, issues related to specific platforms, risk and control assessment, and audit methods and support tools.The textbook concludes with a review of emerging issues, providing undergraduate and graduate students with a thorough overview of a topic critical to organizational security and integrity","torrent":{"xt":"urn:btih:7b1ec918ad928f56509c413ed08af102e6e0c671","amp;dn":"Information+Technology+Control+and+Audit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1ec918ad928f56509c413ed08af102e6e0c671","infoHashBuffer":{"type":"Buffer","data":[123,30,201,24,173,146,143,86,80,156,65,62,208,138,241,2,230,224,198,113]},"announce":[],"urlList":[]}}