{"title":"Royal Deaths and Diseases (Discovery Channel - 2003)","uid":9179142,"size":1959970399,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7b5c4e5bb9b878b3ad27871a91a68155d233b974&amp;dn=Royal+Deaths+and+Diseases+%28Discovery+Channel+-+2003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Robin1966","files":11,"time":1384205714,"description":"TV : Documentary : TV quality : English\n\n\nPlot Summary:\n\nWith an aging monarch and an intense interest in the health of the royal family, Royal Deaths and Diseases brings to light the most intimate records of Britain's kings and queens. It exposes the secrets of their illnesses and dealings with doctors and reveals the truth behind deaths on the battlefield, failed successions and the often catastrophic consequences of an untimely royal death.\n\nThe Episodes are:\n\n01. Living by the sword (medieval and early modern monarchs who went into battle)\nThis episode looks at the treatment of royal injuries in battle.\n\n02. Madness (Explores the history of royal insanity in Britain, and the ways in which it was treated.)\n\nExplores the dramatic history of royal insanity in Britain, including King George III, Queen Victoria's depression and Henry VI's acute schizophrenia. (There is an excellent film about King George's issues, appropriately named The Madness of King George , starring Nigel Hawthorne, Ian holm and Helen Mirren, really worth a look. Similarly, Her Majesty, Mrs. Brown is another fantastic film, starring Dame Judi Dench and Billy Connolly, dealing with her inconsolable sadness at the death of Prince Albert and how she managed to partially overcome it).\n\n03 - Decadence (sexual indulgence, gluttony, alcoholism, and drug addiction)\n\nFrom Henry VIII's overeating and lack of exercise to Charles II's death at the hands of his own doctors and George IV's opium-fuelled reign, this film examines how Royal misbehaviour changed the image of the monarchy. In spite of having the best doctors in the land, they have been plagued by medical mysteries brought on by their own behaviour. In the end medicine, politics and public ridicule would force them to behave properly, with the effects still felt by the royal family to this day.\n\n04. Tainted blood (Hereditary Diseases) The latest in genetic technology reveals how illnesses, madness and premature death has historically wreaked havoc through the British royal family. Naturally, it delves into the issue of haemophilia, with Queen Victoria being a carrier and passing on the condition to one of her sons, as well as to some of her daughters. The consequences of the disease would be surprisingly far-reaching, eventually playing a part in the demise of the Romanovs.\n\n05 - Royal Childbirth. (the importance of producing a male heir, and the difficulties faced).\n\nThe last in the series uncovers the secret history of royal childbirth. Every pregnancy is a life-changing event, but for royalty it can change the course of history. The royals had access to the best doctors of the day, but delivering a future ruler was an enormous responsibility. When Mary Tudor thought she'd fallen pregnant her dreams of restoring England to Catholicism looked to have come true. Now, for the first time, modern doctors solve the mystery of why she wasn't actually able to give birth. Queen Anne sacrificed her body to the cause, enduring 17 pregnancies and yet no heir survived her - a recent medical breakthrough may explain her tragic story. And then there's the battle between midwives and obstetricians over Princess Charlotte (the Princess Diana of her day), which ultimately destroyed two generations of heirs and brought Queen Victoria to the throne.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7b5c4e5bb9b878b3ad27871a91a68155d233b974","amp;dn":"Royal+Deaths+and+Diseases+%28Discovery+Channel+-+2003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5c4e5bb9b878b3ad27871a91a68155d233b974","infoHashBuffer":{"type":"Buffer","data":[123,92,78,91,185,184,120,179,173,39,135,26,145,166,129,85,210,51,185,116]},"announce":[],"urlList":[]}}