{"title":"Um Pistoleiro chamado Papaco (1986)","uid":5234674,"size":628271104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7b6bceadbb5fdbd1f775797c028b945c9b5ffccd&amp;dn=Um+Pistoleiro+chamado+Papaco+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"grebmops","files":1,"time":1261443245,"description":"Pistoleiro chamado Papaco (1986) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0459011/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0459011/&lt;/a&gt;\n\nMore Fun Brazilian Exploit/Smut - This Time With A Western &quot;Feel&quot;..., 23 February 2007\n8/10\nAuthor: EVOL666 from St. John's Abortion Clinic\n\n*** This comment may contain spoilers ***\n\nI really can't believe that I haven't cum across the underground Brazilian exploitation market sooner. It seems that our south-of-the-border brothers have been churning out some seriously insane sleaze for years now, and until recently, it's slipped under my radar. Having newly discovered this niche-genre, I've gone on a bit of a binge, and will be sure to look into these films more fully. I don't speak Portugese, so I'm sure I'm losing some plot-points in translation, but A GUNMAN CALLED PAPACO is another trashy bit of sexy fun that is reminiscent of the spaghetti-westerns that it obviously is inspired by, and even has a healthy bit of a Jodorowsky feel to it.\n\nPapaco is a kick-ass gunman on his way to deliver an important parcel of sex-toys, contained in a coffin that he drags from location to location. Along the way, Papaco runs into several unsavory characters (including a midget pistolieri played by Chumbinho, of FUK FUK A BRASILEIRA &quot;fame&quot;), and several savory females who both help and hinder him during his travails...\n\nA GUNMAN CALLED PAPACO contains many elements that seem to be staples amongst 80s-era Brazilian hardcore/exploit films - namely graphic depictions of both gay and straight sex, some of which may turn off potential viewers. For those that are brave and open-minded, I think that Brazilian exploitation films will become to the newer-generation of exploitation fans what the Italian films were to mine. Thoroughly fun, often depraved, and always tongue-in-cheek (or &quot;cheeks&quot;, depending on what set your talking about) - these zero-budget trash-fests are a delight, even if I can't understand what the f!ck they're talking about...8/10","torrent":{"xt":"urn:btih:7b6bceadbb5fdbd1f775797c028b945c9b5ffccd","amp;dn":"Um+Pistoleiro+chamado+Papaco+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b6bceadbb5fdbd1f775797c028b945c9b5ffccd","infoHashBuffer":{"type":"Buffer","data":[123,107,206,173,187,95,219,209,247,117,121,124,2,139,148,92,155,95,252,205]},"announce":[],"urlList":[]}}