{"title":"DRISHYAM.(2015)-DVD.Rip-HEVC-x265.AAC.Esubs- 1 GB -[DDR]","uid":12596503,"size":1082623015,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7b94eddb2a6abbe7bd393cca439e2333516bf86b&amp;dn=DRISHYAM.%282015%29-DVD.Rip-HEVC-x265.AAC.Esubs-+1+GB+-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":1,"time":1445268577,"description":"DDR Presents\r\n\r\n\r\nDrishyam(2015)- Visuals Can Be Deceptive\r\n(A film by Nishikant Kamat)\r\n\r\nHindi - DVD rip - 720x304p (2.35:1)- 1GB - x.265.AAC (2 Ch) - 2 Hrs:43 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/MNW\r\n\r\nScreens\r\n \nhttp://extraimago.com/image/MTc \nhttp://extraimago.com/image/MTs \nhttp://extraimago.com/image/MTn \nhttp://extraimago.com/image/MTj \nhttp://extraimago.com/image/MTT \nhttp://extraimago.com/image/MTN \nhttp://extraimago.com/image/MT2 \nhttp://extraimago.com/image/MTw \nhttp://extraimago.com/image/MTa \nhttp://extraimago.com/image/MT8 \nhttp://extraimago.com/image/MNf \nhttp://extraimago.com/image/MNv\r\n\r\n\r\nSynopsis:\r\nVishal Salgaonkar (Ajay Devgn) is a small time cable operator who lives in a small village inGoa with his wife Nandini (Shriya Saran)and daughters Anju (Ishita Dutta) and Anu (Mrunal Jhadhav). One day Sam Deshmukh (Rishabh Chandra), the son of the Inspector General of Police, Goa, Meera Deshmukh (Tabu) and her businessman husband Mahesh (Rajat Kapoor), enters their lives. The consequences become grave when Sam disappears and the Salgaonkar family emerge as the prime suspects.\r\n\r\nThe rest of the story is that of a cat and mouse game as the Police egged on by their IG opens all stops to find what happened to Sam and Vishal has touse all his ingenuity to stay one step ahead...\r\n\r\nComments:\r\nA remake of a superhit Malayalam movie in which Mohanlal played the part of Vishal Deshmukh,Drishyam should hold no surprises. Yet this movie keeps you glued to your seat for two and three quarter hours as you keep wondering what comes next and how will Vishal meet hius new challenge. And as the investigation progresses and the brutish Inspector Gaitonde takes over, you squirm. Just when you think its all over, comes the final scene and you learn what actually happened to Sam. The film keeps its suspense throughout, with some splendid performances from Ajay Devgn, Shriya Saran and Tabu. I liked Tabu the best, for she had a role with conflicting emotions, that of a distraught mother and the steely IG of police. Others like Rajat Kapoor also do well.\r\n\r\nThe film is somewhat slow in picking up and the languid unfolding of the first half contrasts with the pace of the second. The Editor could perhaps have reduced the first half and the length of the film a bit. But we do get to see some beautiful sights of Goa (Is it all Goa?) thanks to the super outdoor camera of Avinas Arun. The two songs in the film are melodious, but except for that the primary feature of the music is that it is unostrusive.\r\n\r\nOverall a fil to sit back and watch. I enjoyed the full 2 hours and 43 minutes and would recommend it to anyone.\r\n\r\n\r\nUploader's Notes:\r\nA reasonably good DVD. There was some doubt as to whether the pulldown was one in six or one in five (was the base rate 24.975 or 23.976). After a lot of deliberation I decided to keep it at the standard 23.976 and since there is no jerky movement or dupe frames, I think my decision is justified. It won't make any difference to you as a viewer, but only serves to emphasize what we rippers have to do to bring a decent rip to you!\r\n\r\nYou will like the rip because of the amount of shadow-gaining that has been done and how the colours, masked by that now familiar dirty Teal overlay have been brought out by careful color corrrection. The purist may find the screenshots just a bit oversharpened, but this is aimed at bringing out the detail in the video. In continuous play this does not show, but the detail is more visible.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4430212/","torrent":{"xt":"urn:btih:7b94eddb2a6abbe7bd393cca439e2333516bf86b","amp;dn":"DRISHYAM.%282015%29-DVD.Rip-HEVC-x265.AAC.Esubs-+1+GB+-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b94eddb2a6abbe7bd393cca439e2333516bf86b","infoHashBuffer":{"type":"Buffer","data":[123,148,237,219,42,106,187,231,189,57,60,202,67,158,35,51,81,107,248,107]},"announce":[],"urlList":[]}}