{"title":"A Cue Ball Mystery Series -  Cindy Blackburn","uid":9404929,"size":2024529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7be3b66f69aaa2a3aa896a9450c5d94ba39f7752&amp;dn=A+Cue+Ball+Mystery+Series+-++Cindy+Blackburn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1388140064,"description":"Jessie Hewitt is a pool shark that usually can run the table and knows where the balls will fall. She had no idea that a body would fall on her couch or that a cop would show up in her kitchen and accuse her of murder. How is she going to get out of this mess?\n\nPlaying With Poison #1 Pool shark Jessie Hewitt usually knows where the balls will fall and how the game will end. But when a body lands on her couch, and the cute cop in her kitchen accuses her of murder, even Jessie isn't sure what will happen next. \nPlaying With Poison is a cozy mystery with a lot of humor, a little romance, and far too much champagne.\n\nDouble Shot #2 Jessie Hewitt thought her pool-hustling days were long gone. But when uber-hunky cop Wilson Rye asks her to go undercover to catch a killer, she jumps at the chance to return to a sleazy poolroom. Jessie is confident she can handle a double homicide, but the doubly-annoying Wilson Rye is another matter altogether. What's he doing flirting with a woman half his age? Will Jessie have what it takes to deal with Tiffany La-Dee-Doo-Da Sass and solve the murders? Take a guess.\n\nThree Odd Balls #3 A romantic vacation for...five? This wasn't exactly what Jessie and Wilson had in mind when they planned their trip to the tropics. But when Jessie's delightfully spry mother, Wilson's surfer dude son, and Jessie's rabidly hyperactive New York agent decide to tag along the fun begins. What kind of trouble can these three oddest of odd balls possibly get into? Take a guess.","torrent":{"xt":"urn:btih:7be3b66f69aaa2a3aa896a9450c5d94ba39f7752","amp;dn":"A+Cue+Ball+Mystery+Series+-++Cindy+Blackburn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7be3b66f69aaa2a3aa896a9450c5d94ba39f7752","infoHashBuffer":{"type":"Buffer","data":[123,227,182,111,105,170,162,163,170,137,106,148,80,197,217,75,163,159,119,82]},"announce":[],"urlList":[]}}