{"title":"Osho_Bodhidharma The Greatest Zen Master-03.avi","uid":15220484,"size":164381956,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7c32e646f4113170a581954e9de090988d86e263&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-03.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467731509,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #3\r\nChapter title: Beyond this nature there's no Buddha\r\n6 July 1987 am in Chuang Tzu Auditorium\t\r\nFull Length:\t87 mins\r\nBELOVED OSHO,\r\nIF YOU DON'T UNDERSTAND BY YOURSELF, YOU'LL HAVE TO FIND A TEACHER TO GET TO THE BOTTOM OF LIFE AND DEATH. BUT UNLESS HE SEES HIS NATURE, SUCH A PERSON ISN'T A TEACHER. EVEN IF HE CAN RECITE THE TWELVEFOLD CANON, HE CAN'T ESCAPE THE WHEEL OF BIRTH AND DEATH. HE SUFFERS IN THE THREE REALMS WITHOUT HOPE OF RELEASE.\r\nLONG AGO, THE MONK GOOD STAR WAS ABLE TO RECITE THE ENTIRE CANON. BUT HE DIDN'T ESCAPE THE WHEEL BECAUSE HE DIDN'T SEE HIS NATURE. IF THIS WAS THE CASE WITH GOOD STAR, THEN PEOPLE NOWADAYS WHO RECITE A FEW SUTRAS OR SHASTRAS AND THINK IT'S THE DHARMA ARE FOOLS. UNLESS YOU SEE YOUR MIND, RECITING SO MUCH PROSE IS USELESS.\r\nTO FIND A BUDDHA, ALL YOU HAVE TO DO IS SEE YOUR NATURE. YOUR NATURE IS THE BUDDHA. AND THE BUDDHA IS THE PERSON WHO'S FREE, FREE OF PLANS, FREE OF CARES. IF YOU DON'T SEE YOUR NATURE AND RUN AROUND ALL DAY LOOKING SOMEWHERE ELSE, YOU'LL NEVER FIND A BUDDHA. THE TRUTH IS, THERE'S NOTHING TO FIND. BUT TO REACH SUCH AN UNDERSTANDING YOU NEED A TEACHER. AND YOU NEED TO STRUGGLE TO MAKE YOURSELF UNDERSTAND. LIFE AND DEATH ARE IMPORTANT. DON'T SUFFER THEM IN VAIN. THERE'S NO ADVANTAGE IN DECEIVING YOURSELF. EVEN IF YOU HAVE MOUNTAINS OF JEWELS AND AS MANY SERVANTS AS THERE ARE GRAINS OF SAND ALONG THE GANGES, YOU SEE THEM WHEN YOUR EYES ARE OPEN. BUT WHAT ABOUT WHEN YOUR EYES ARE SHUT? YOU SHOULD REALIZE THEN THAT EVERYTHING YOU SEE IS LIKE A DREAM OR ILLUSION.\r\nIF YOU DON'T FIND A TEACHER SOON, YOU'LL LIVE THIS LIFE IN VAIN. IT'S TRUE, YOU HAVE THE BUDDHA-NATURE. BUT WITHOUT THE HELP OF A TEACHER YOU'LL NEVER KNOW IT. ONLY ONE PERSON IN A MILLION BECOMES ENLIGHTENED WITHOUT A TEACHER'S HELP.\r\nIF THOUGH, BY THE CONJUNCTION OF CONDITIONS, SOMEONE UNDERSTANDS WHAT THE BUDDHA MEANT, THAT PERSON DOESN'T NEED A TEACHER. SUCH A PERSON HAS A NATURAL AWARENESS SUPERIOR TO ANYTHING TAUGHT. BUT UNLESS YOU'RE SO BLESSED, STUDY HARD. AND BY MEANS OF INSTRUCTION, YOU'LL UNDERSTAND.\r\nPEOPLE WHO DON'T UNDERSTAND AND THINK THEY CAN DO SO WITHOUT STUDY ARE NO DIFFERENT FROM THOSE DELUDED SOULS WHO CAN'T TELL WHITE FROM BLACK. FALSELY PROCLAIMING THE BUDDHADHARMA, SUCH PERSONS, IN FACT, BLASPHEME THE BUDDHA AND SUBVERT THE DHARMA. THEY PREACH AS IF THEY WERE BRINGING RAIN. BUT THEIRS IS THE PREACHING OF DEVILS NOT OF BUDDHAS. THEIR TEACHER IS THE KING OF DEVILS. AND THEIR DISCIPLES ARE THE DEVIL'S MINIONS. DELUDED PEOPLE WHO FOLLOW SUCH INSTRUCTION UNWITTINGLY SINK DEEPER IN THE SEA OF BIRTH AND DEATH.\r\nUNLESS THEY SEE THEIR NATURE, HOW CAN PEOPLE CALL THEMSELVES BUDDHAS? THEY'RE LIARS WHO DECEIVE OTHERS INTO ENTERING THE REALM OF DEVILS. UNLESS THEY SEE THEIR NATURE, THEIR PREACHING OF THE TWELVEFOLD CANON IS NOTHING BUT THE PREACHING OF DEVILS. THEIR ALLEGIANCE IS TO MARA, NOT TO THE BUDDHA. UNABLE TO DISTINGUISH WHITE FROM BLACK, HOW CAN THEY ESCAPE BIRTH AND DEATH?\r\nWHOEVER SEES HIS NATURE IS A BUDDHA. WHOEVER DOESN'T IS A MORTAL. BUT APART FROM OUR MORTAL NATURE IF YOU CAN FIND A BUDDHA-NATURE SOMEWHERE ELSE, WHERE IS IT? OUR MORTAL NATURE IS OUR BUDDHA-NATURE. BEYOND THIS NATURE THERE'S NO BUDDHA. THE BUDDHA IS OUR NATURE. THERE'S NO BUDDHA BESIDES THIS NATURE. AND THERE'S NO NATURE BESIDES THE BUDDHA","torrent":{"xt":"urn:btih:7c32e646f4113170a581954e9de090988d86e263","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-03.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c32e646f4113170a581954e9de090988d86e263","infoHashBuffer":{"type":"Buffer","data":[124,50,230,70,244,17,49,112,165,129,149,78,157,224,144,152,141,134,226,99]},"announce":[],"urlList":[]}}