{"title":"dTective Forensic Video Analysis Suite for Avid MC [Cracked]","uid":4329475,"size":28976546,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c340d586350718fdf35f845b6ce871f96010108&amp;dn=dTective+Forensic+Video+Analysis+Suite+for+Avid+MC+%5BCracked%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"captainelliotspencer","files":1,"time":1217960633,"description":"       Ocean Systems Forensic Video Enhancement Systems for Avid Media Composer\n\nAbout dTective:\n\nA revolutionary way to clarify digital and analog forensic video evidence dTective from Ocean Systems, balancing power with ease of use.\n\ndTective, from Ocean Systems, is the most widely used video, image and audio evidence clarification system available.  With over 1000 systems in service in the U.S. and around the world, dTective is courtroom tested, having been used in a wide range of high profile cases.  Because of the power of these tools and Ocean Systems commitment to our customers, dTective is considered by most law enforcement agencies to be the standard, and their system of choice.\n\nIndustry Standard Tools\nOcean Systems dTective video clarification tools are powered Avid Technology&amp;#039;s video engine.  Avid is the market leader for professional broadcast quality editing tools.  This allows us to provide you the most advanced, innovative, one step technology available today.  For over 15 years, Avid Technology has revolutionized the speed and power by which video can be processed.\n\nAvid has set the standards by which others follow.\n\ndTective adds to the Avid Technology video engine a full suite forensic video enhancement tools allowing you a wide range of analysis capabilities for a wide range of applications.  These high end professional tools are now available to you at prices normally assigned to consumer grade products.\n\nCapture Uncompressed Video\ndTective seamlessly captures, processes and outputs uncompressed video, providing you a pixel to pixel copy of all 349,920 pixels per frame. Compressed file formats such as DV and MPEG throw away valuable details needed for the best forensic video analysis.\n\nPrint Stills From Video and Archive your Video Evidence\nWith your dTective forensic video clarification system, investigators can digitally archive their cases to provide fast, accurate, and complete disclosure on CD-ROM or DVD or print stills from video.\n\nToolset: Avid, dPlex, dPlex Pro, dVeloper, dVeloper 4D, SpotLight, MAGNIFi, DVR dCoder and ARITHmatic\n\n    * Demultiplex video\n    * Enhance dark video and poor quality video security and surveillance video\n    * DVR security video  - decode digital video (DVR) files from proprietary security systems into uncompressed video\n    * Print stills from Video to photo paper or digital files for fast distribution\n    * Archive to CD or DVD\n    * Highlight or obscure an important areas of forensic video tapes\n    * Magnify video to display the result either full screen, or to a user defined portion on screen.\n    * De-interlace field recorded forensic video to avoid blurry stills printed from video  \n    * Frame averaging\n    * Contrast and brightness adjustment\n    * Video stabilization\n    * Insert case notes linked to forensic video evidence\n    * Automatic project archiving\n    * Variable slow motion speed adjustment to compensate for time lapsed video  \n    * Picture in Picture \n    * Titling and labeling\n    * Combine and stack tools\n    * User definable layout and keyboard/interface short cuts\n\nIncludes the following plugins for use within Avid Media Composer:\n\n1) dVeloper RT and dVeloper 4d \n2) dPlex\n3) dPlex Pro\n4) MAGNIFi RT\n5) SpotLight RT\n6) arithMATIC RT\n7) CID - Universal Noise Remover\n8) CID - Color safe Levels\n9) CID - Color Safe Curves\n\n\n&gt; What is dVeloper?\n\nMany times crucial details are hidden in video due to poor lighting or improperly adjusted and maintained cameras and video equipment. When dealing with color video, details are often more prevalent in one color than another. With dVeloper, it&amp;#039;s easy to isolate the video color space that holds the most valuable information. With the click of the mouse, dVeloper compensates for the poorly exposed video. By analyzing the entire video, or just a region of interest, dVeloper automatically adjusts brightness, contrast and gamma to bring out more detail.\n\ndVeloper removes noise and video graininess through a time-lapse processing technique called frame averaging. When the target remains still for even a moment, video noise and other transient items like rain and snow are removed, revealing the details hidden beneath. \n\n\n&gt; dPlex &amp; dPlex Pro - What is multiplexed video?\n\nSecurity cameras often store video in a multiplexed video format. Instead of an individual video recorder for each camera, the security system rotates through the cameras and records an individual image from each camera to a single video recorder.  The reordering process goes something like this (keep in mind there are 30 frames per second available on NTSC video):\n\nCamera 1/Frame 1 - Camera 2/Frame 2 - Camera 3/Frame 3\n\nOnce the rotation is complete, the recording goes back to Camera 1 and starts the whole process over again. dPlex, from Ocean Systems, is a universal video demultiplexing tool that allows you to isolate individual cameras from multiplexed video.  The results are amazing.\n\n\n&gt; What is Magnifi?\n\nMagnifi enlarges a section of the video and displays the result either full screen, or to a user defined portion of the screen. Once the target area is defined, and an output mode is selected, the analyst magnifies the image using the zoom control. The analyst can leave the enlarged image as is, or select a mathematical filter to further clarify the results. Magnifi provides independent controls of both target and output borders. These are especially useful when presenting the results in court.\n\nYou have complete control over the Target and Output Border color, shape and size. For your output, you can choose from four output views (off, full, 90% full, and quad), adjust a variable zoom control, adjust brightness, contrast, gamma and opacity, rotate your footage 360 degrees, and apply any of 12 mathematical filters to further clarify the results.\n\n\n&gt; What is Spotlight? \n\nSpotlight is a quick and easy to use dTective module that allows the analyst to select a region of video highlight or blur.  You can define a shape anywhere from a square to a circle, then work with either the inside or outside of that shape using different filters, including blur, mosaic and scatter. All of these filters have a variable intensity setting.  You can even apply a border color to the shape to focus more attention on your area of interest.  All of the settings can be changed over time, allowing you to track a face or object as it moves as well as adjust your settings to accommodate for the object changing size as it gets closer or further away in the video.\n\n\n&gt; What is arithMATIC?\n\narithMATIC allows you to perform mathematical operations on a single video clip or you can two do comparisions between 2 pieces of video.\n\nListed below is a summary of the tools available in the arithMATIC plug in:\n\nAddition - will allow the user to brighten an image by adding the corresponding pixel values from two tracks of video.\n\nSubtraction - will allow the user to see what has changed between two images by subtracting the pixel values of the second video track minus the corresponding pixel values from the first video track.\n\nMultiplication - will also allow the user to brighten the image by multiplying the corresponding pixel values from two tracks of video.\n\nDivision - will also allow the user to perform change detection in the image by dividing the pixel values of the second video track by the corresponding pixel values from the first video track.\n\nScaling - is a subset of the Multiplication function. It allows the user to multiply the two tracks by a number of greater than 1 to brighten the image and less then 1 to darken an image.  Scaling works on all four modes.\n\n\n*********************************\nBONUS INCLUDED: DVR dCoder v2.5.1\n\nDigital surveillance video presents unique and often frustrating challenges to a forensic video analyst. Many times the digital file is recorded in a proprietary format and it requires a proprietary player to simply view the file. DVR dCoder solves this problem.\n\nDVR dCoder is designed to solve the problem of working with proprietary digital surveillance files so potentially case breaking evidence is easy to access.\n\nSimply play the digital surveillance file and allow DVR dCoder to capture the video.  This captured footage is a duplicate of the original file in an uncompressed digital format. Once captured, import the media into your dTective system for further examination.\n\n*********************************\n\nFor more information and samples of each of the particular plugins and their capabilities visit:  &lt;a href=&quot;\nhttp://www.oceansystems.com/dtective/about.htm.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.oceansystems.com/dtective/about.htm.&lt;/a&gt;\n\n*********************************\n\t\t\n\n ----------------------------------------------------\n| RE UPLOADED BY Captain Elliot Spencer For The Haole |\n ----------------------------------------------------","torrent":{"xt":"urn:btih:7c340d586350718fdf35f845b6ce871f96010108","amp;dn":"dTective+Forensic+Video+Analysis+Suite+for+Avid+MC+%5BCracked%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c340d586350718fdf35f845b6ce871f96010108","infoHashBuffer":{"type":"Buffer","data":[124,52,13,88,99,80,113,143,223,53,248,69,182,206,135,31,150,1,1,8]},"announce":[],"urlList":[]}}