{"title":"The Fool and His Money","uid":8840952,"size":141630899,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c38bc260a919a87808553a9f9bc70b24b37cb45&amp;dn=The+Fool+and+His+Money&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377242400,"description":"&quot;The Fool and his money&quot; is the long belated 2012 sequel to &quot;The Fool's Errand&quot; - and I do mean LONG, as the original was released in 1987. It was extremely well received at the time, and I recommend all puzzle games aficionados give it a shot (it's now available as freeware).\n\nCliff Johnson, the developer, started collecting pre-orders for &quot;The Fool and his money&quot; as early as 2003, with release planned for the same year. Cliff's constant delays, coupled with his choice of name for the game, made some blame him of never intending to release it at all, the whole deal being some sort of weird scam/performance art combo.\n\nWell, 10 years(!) later, they were proven wrong.\n\n&quot;The Fool and his money&quot; is... Well, it somewhat defies description. It's a puzzle/riddle game, with a strange, dreamlike, potentially non-linear narrative, culminating in a huge metapuzzle, solvable based on data gathered from all the smaller ones.\n\nIt's also EXTREMELY hard, way more so than the original (which wasn't a piece of cake either). A lot of the puzzles are based on wordplay and anagrams, often with very little in the way of hints. Many puzzles give no initial indication as to what is expected of the player, discovering the rules being half the challenge.  Expect to spend a few dozens of hours on this one if you take the dive. Just don't go in there expecting triple-A production values; It's a one man effort, and it shows.\n\nInstallation instructions:\nSimply unRAR the file wherever and run &quot;The Fool and his Money.exe&quot; to play.","torrent":{"xt":"urn:btih:7c38bc260a919a87808553a9f9bc70b24b37cb45","amp;dn":"The+Fool+and+His+Money","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c38bc260a919a87808553a9f9bc70b24b37cb45","infoHashBuffer":{"type":"Buffer","data":[124,56,188,38,10,145,154,135,128,133,83,169,249,188,112,178,75,55,203,69]},"announce":[],"urlList":[]}}