{"title":"Evil.Anal.18.XXX.DVDRip.x264-CHiKANi","uid":8551936,"size":1395094965,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7c6f7eab16da13050ee13e91e46053f54bc7e36e&amp;dn=Evil.Anal.18.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"chkm8te","files":1,"time":1370661744,"description":"Evil.Anal.18.XXX.DVDRip.x264-CHiKANi\n\nCAST\nBailey Blue, Dana Dearmond, London Keyes, Mia Gold, Princess Donna\n\nEvil Anal 18: French-American director Manuel Ferrara brings us another sizzling-hot collection of nasty gonzo scenes, all taking place in a world where the girls are gorgeous and willing, and all the sex is anal... evilly anal! Manuels Evil Anal 18 showcases the acclaimed stud doing what he does best using hislegendary cock to tame the assholes of the hottest babes in porn. Athletic, all-natural blonde Bailey Blue interrupts her workout routine to invade her big ass with a series of sphincter-stretching toys. The sultry vixen teases Manuel and his camera, then rides his enormous dick in a passionate, slow-burn session of rectal reaming. Upon thoroughly ravaging her asshole, he showers Baileys pretty face in sperm. Busty Asian superslut London Keyes enjoys a steamy shower, then answers the front door to receive a package. Its the Manuel Ferrara Realistic Dong she ordered! By stroking and slurping on the massive rubber dick, London makes the director appear, genie-like, and grant her deepest wish: a ferocious butt-fuck with a messy facial finish. Fishnet-clad fetish bombshell Princess Donna loosens herself up with various phallic accessories before worshiping Manuels meat in an intimate, kinky scene of male domination, rough sodomy and breath control. Competing for the attentions of sexy Mia Gold, Dana DeArmond and Manuel decide to combine their interests with a filthy threesome of nonstop backdoor banging and ass-to-mouth debauchery. Evil Anal 18 is so wrong, its just right!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=l1u06cfiehvbmzybawbm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=l1u06cfiehvbmzybawbm.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=pq801rzj2d9sznaueu3q.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=pq801rzj2d9sznaueu3q.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7c6f7eab16da13050ee13e91e46053f54bc7e36e","amp;dn":"Evil.Anal.18.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6f7eab16da13050ee13e91e46053f54bc7e36e","infoHashBuffer":{"type":"Buffer","data":[124,111,126,171,22,218,19,5,14,225,62,145,228,96,83,245,75,199,227,110]},"announce":[],"urlList":[]}}