{"title":"Age Discrimination: An Historical and Contemporary Analysis [bla","uid":8782596,"size":1577026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7daa21d598f397dacdaed2495a150a9fc05d46f2&amp;dn=Age+Discrimination%3A+An+Historical+and+Contemporary+Analysis+%5Bbla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1375751343,"description":"Publication Date: January 30, 2006 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\nAge discrimination is a highly topical issue in all industrialized societies. Based upon detailed research, and adopting an interdisciplinary approach, this unique study traces the history of the age discrimination debate in Britain and the U.S. since the 1930s. It critically analyzes the concepts of ageism in social relations and age discrimination in employment. Case-studies on generational equity and health care rationing by age are followed by an analysis of the British government's initiatives against age discrimination in employment. The book then traces the history of the debate on health status and old age.\n\n\n[b] Review[/b]\n'The great virtue of John Macnicol's book is precisely that it forces the reader to question many of the assumptions that are often made in the debate about ageism, mandatory retirement and what the appropriate pensionable age should be ... otherwise a book marked by wide-ranging scholarship and careful analysis.' Journal of Public Policy\n\n'It merits wide reading by policy analysts, activists and gerontologists on both sides of the Atlantic.' History\nBook Description\nAge discrimination is a topical issue in all industrialized societies. This unique interdisciplinary study examines the age discrimination debate in Britain and the USA in its historical context, critically analyzing the concepts of ageism and age discrimination, the British government's current interest, generational equity, health care rationing by age, health status, working capacity and old age, and the USA's 1967 legislation. It will be of interest to academic researchers, postgraduates and undergraduates in social policy, social history, politics, sociology, and gerontology. \n\n\nPaperback: 316 pages\nPublisher: Cambridge University Press (January 30, 2006)\nLanguage: English\nISBN-10: 0521612608\nISBN-13: 978-0521612609\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Age-Discrimination-Historical-Contemporary-Analysis/dp/0521612608/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Age-Discrimination-Historical-Contemporary-Analysis/dp/0521612608/&lt;/a&gt;\n\n\n\nTags: uk, britain, age, old, elderly, aging, geriatrics, gerontology, geriatrician, geriatric physician, social, healthcare, medicine, discrimination, ageist, ageism, oppression, social, sociology, psychology, life, resident, residence, youth, young, ethics, usa, america, academic researchers, postgraduates, undergraduates , social policy, social history, politics, sociology, hospice, development, workplace, employee, corporation, HR, ","torrent":{"xt":"urn:btih:7daa21d598f397dacdaed2495a150a9fc05d46f2","amp;dn":"Age+Discrimination%3A+An+Historical+and+Contemporary+Analysis+%5Bbla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7daa21d598f397dacdaed2495a150a9fc05d46f2","infoHashBuffer":{"type":"Buffer","data":[125,170,33,213,152,243,151,218,205,174,210,73,90,21,10,159,192,93,70,242]},"announce":[],"urlList":[]}}