{"title":"Japanese Tattoos: History  Culture  Design (2016) epub","uid":14977554,"size":43017582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e2d59a4f5a2dbf9a59068bb25b7a7fa434e3602&amp;dn=Japanese+Tattoos%3A+History++Culture++Design+%282016%29+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1466249383,"description":"Thinking of getting a Japanese-style tattoo? Want to avoid a permanent mistake? Japanese Tattoos is an insider's look at the world of Japanese irezumi (tattoos).\r\n\r\nJapanese Tattoos explains the imagery featured in Japanese tattoos so that readers can avoid getting ink they don't understand or, worse, that they'll regret. This photo-heavy book will also trace the history of Japanese tattooing, putting the iconography and kanji symbols in their proper context so readers will be better informed as to what they mean and have a deeper understanding of irezumi. Tattoos featured will range from traditional tebori (hand-poked) and kanji tattoos to anime-inspired and modern works—as well as everything in between. For the first time, Japanese tattooing will be put together in a visually attractive, informative, and authoritative way.\r\n\r\nAlong with the 350+ photos of tattoos, Japanese Tattoos will also feature interviews with Japanese tattoo artists on a variety of topics. What's more, there will be interviews with clients, who are typically overlooked in similar books, allowing them to discuss what their Japanese tattoos mean to them. Those who read this informative tattoo guide will be more knowledgeable about Japanese tattoos should they want to get inked or if they are simply interested in Japanese art and culture","torrent":{"xt":"urn:btih:7e2d59a4f5a2dbf9a59068bb25b7a7fa434e3602","amp;dn":"Japanese+Tattoos%3A+History++Culture++Design+%282016%29+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e2d59a4f5a2dbf9a59068bb25b7a7fa434e3602","infoHashBuffer":{"type":"Buffer","data":[126,45,89,164,245,162,219,249,165,144,104,187,37,183,167,250,67,78,54,2]},"announce":[],"urlList":[]}}