{"title":"Genome Mapping and Genomics in Human and Non-Human Primates","uid":12834572,"size":6641541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f56003ea31c498c833a7abb28e8f0c739d567b8&amp;dn=Genome+Mapping+and+Genomics+in+Human+and+Non-Human+Primates&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1448432291,"description":"This book provides an introduction to the latest gene mapping techniques and their applications in biomedical research and evolutionary biology. It especially highlights the advances made in large-scale genomic sequencing. Results of studies that illustrate how the new approaches have improved our understanding of the genetic basis of complex phenotypes including multifactorial diseases (e.g., cardiovascular disease, type 2 diabetes, and obesity), anatomic characteristics (e.g., the craniofacial complex), and neurological and behavioral phenotypes (e.g., human brain structure and nonhuman primate behavior) are presented.\r\n\r\nTopics covered include linkage and association methods, gene expression, copy number variation, next-generation sequencing, comparative genomics, population structure, and a discussion of the Human Genome Project. Further included are discussions of the use of statistical genetic and genetic epidemiologic techniques to decipher the genetic architecture of normal and disease-related complex phenotypes using data from both humans and non-human primates","torrent":{"xt":"urn:btih:7f56003ea31c498c833a7abb28e8f0c739d567b8","amp;dn":"Genome+Mapping+and+Genomics+in+Human+and+Non-Human+Primates","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f56003ea31c498c833a7abb28e8f0c739d567b8","infoHashBuffer":{"type":"Buffer","data":[127,86,0,62,163,28,73,140,131,58,122,187,40,232,240,199,57,213,103,184]},"announce":[],"urlList":[]}}