{"title":"Harry Connick, Jr. - When Harry Met Sally","uid":9380082,"size":69653892,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fe419176e227bfda68b709748e7747fd8ed4a16&amp;dn=Harry+Connick%2C+Jr.+-+When+Harry+Met+Sally&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387696599,"description":"Source: 1989 CD\n\nWhat a reviewer at Amazon has to say:\n\n&quot;Music from the motion picture&quot;, what a misleading title. If you do not pay particular attention to this, you might think that the songs in this CD are those heard in the movie. In fact, none of them is, including those songs sung by Harry Connick, Jr., his versions here are different from those in the movie.\nThe followings are the songs featured in the movie and their origin:\n1. Our love is here to stay - Ella Fitzgerald and Louis Armstrong\n2. Let's call the whole thing off - Ella Fitzgerald and Louis Armstrong (the above two comes from the Verve CD &quot;Ella &amp; Louis Again&quot;)\n3. Don't pull your love - Hamilton, Joe Frank and Reynolds (From the MCA CD &quot;Hamilton, Joe Frank &amp; Reynolds - Greatest Hits)\n4. Rambling man - Allman Brothers (From the Polygram CD &quot;A Decade of Hits 1969-1979)\n5. Right time of the night - Jennifer Warnes (From the Arista CD &quot;The best of Jennifer Warnes)\n6. Where or when - Ella Fitzgerald (From the Verve CD (1) &quot;Sings the Rodgers and Hart Song Book [ORIGINAL RECORDING REMASTERED]&quot; (2) &quot;The very best of Rodgers and Hart Song Book&quot; released in 2007. (Updated on 29 Feb 2008)\n7. Winter Wonderland - Ray Charles (From the CBS CD &quot;The spirit of Christmas&quot;)\n8. Have yourself a Merry little Christmas - Bing Crosby (From the Capitol CD &quot; Bing Crosby's Christmas Classics [ORIGINAL RECORDING REISSUED] [ORIGINAL RECORDING REMASTERED])\n9. It had to be you - Frank Sinatra (From the WEA International CD &quot;Romance&quot;[IMPORT])\n\nTwo songs were sung by Billy Crystal in the movie:\n1. The Surrey with the fringe on top (with Meg Ryan when singing thru the Karaoke machine)(originally a song featured in &quot;Oklahoma! by Gordon MacRae/Shirley Jones/Charlotte Greenwood &quot;, my choice is Frank Sinatra's version from &quot;Sinatra Sings Rodgers &amp; Hammerstein&quot; which I think is the most appropriate version)\n2. Call me (singing to the answering machine of Sally)(originally a hit by Petula Clark in the 60's)\n\nThe following are the music heard in the movie:\nSongs sung by Harry Connick, Jr. featured in the movie included:\n1. Don't get around much anymore\n2. The Tables have turned (Composed by Marc Shaiman)\n3. Medley : It had to be you/Let's call the whole thing off/But not for me (heard at the end credit sequence)\n\n&quot;Adante of Mozart's String Quintet in E Flat, KV 614&quot; is performed during the wedding ceremony of Carrie Fisher and Bruno Kirby. &quot;Autumn in New York&quot;,&quot;Isn't it romantic&quot;, &quot;I could write a book&quot;, &quot;Stomping at the Savoy&quot;, &quot;But not for me&quot;, &quot;Say it isn't so&quot; and &quot;Don't be that way&quot; all featured in the movie as score and are beautifully played (as shown in the end credit, some of these songs are performed by Harry Connick, Jr Trio, Orchestrations by Marc Shaiman and Thom Sharp), but you can only hear them in the movie.","torrent":{"xt":"urn:btih:7fe419176e227bfda68b709748e7747fd8ed4a16","amp;dn":"Harry+Connick%2C+Jr.+-+When+Harry+Met+Sally","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe419176e227bfda68b709748e7747fd8ed4a16","infoHashBuffer":{"type":"Buffer","data":[127,228,25,23,110,34,123,253,166,139,112,151,72,231,116,127,216,237,74,22]},"announce":[],"urlList":[]}}