{"title":"Shuggie Otis - Inspiration Information (1974) [FLAC]","uid":8041730,"size":349550595,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8008a3e6995ea8348e1b829cf7fb4fdfb417f254&amp;dn=Shuggie+Otis+-+Inspiration+Information+%281974%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1358646588,"description":"01 - Inspiration Information 4:12\n02 - Island Letter 4:41\n03 - Sparkle City 5:58\n04 - Aht Uh Mi Hed 4:16\n05 - Happy House 1:16\n06 - Rainy Day 2:42\n07 - XL-30 2:09\n08 - Pling! 4:28\n09 - Not Available 2:31\n10 - Strawberry Letter 23 3:59\n11 - Sweet Thang 4:03\n12 - Ice Cold Daydream 2:30\n13 - Freedom Flight 12:56\n\nCredits\n\nIgnored upon its release in 1974 and celebrated upon its reissue in 2001, Shuggie Otis' fourth and last album Inspiration Information exists out of time -- a record that was of its time, but didn't belong of it; a record that was idiosyncratic but not necessarily visionary. It was psychedelic soul that was released far too late to be part of any zeitgeist and it was buried at the time. Yet no matter what Luaka Bop's grand poobah David Byrne claims on the sticker -- he says Shuggie's &quot;trippy R&amp;B jams are equal to Marvin's and Curtis', but somehow more contemporary sounding...closer to D'Angelo meets DJ Shadow&quot; -- this isn't revolutionary. It can occasionally sound modern, such as on the rolling head trip &quot;XL-30,&quot; but only because it's the kind of groove Shadow would sample and build on; the slow, liquid instrumental head trips sound the same way. Perhaps that's why it can seem more contemporary -- contemporary ears are more attuned to these relaxed, warmly trippy soundscapes. Otis crafted all of this essentially alone, playing each instrument himself, and it's quite clearly a reflection of his inner psyche, and no matter how much it floats and skates upon its own sound, it's a welcoming, inviting sound. But, no matter how much the partisans claim -- and their effusive praise is plastered all over the liner notes, with Sean O'Hagan claiming that it shocks you out of a rut, Stereolab's Tim Gane says it is &quot;almost like a new style of music that could've developed but never did&quot; -- this isn't revolutionary, even if it's delightfully idiosyncratic. So, don't fall for the hyperbole. This isn't an album that knocks your head off -- it's subtle, intricate music that's equal parts head music and elegant funk, a record that slowly works its way under your skin. Part of the reason it sounds so intriguing in 2001 is that there just aren't that many musicians that doggedly pursue their individual vision while retaining a sense of focus. But it isn't a record without precedent, nor is it startling. It's a record for people that have heard a lot of music, maybe too much, and are looking for a new musical romance. [Luaka Bop's reissue contains four fine bonus tracks, including the original version of &quot;Strawberry Letter 23,&quot; which the Brothers Johnson later had a hit with. The reissue also replaces the original cover -- which is nowhere to be seen in the liner notes -- with a &quot;hip,&quot; self-consciously retro cover. Also, it has put in the &quot;World Psychedelic Classics&quot; with Os Mutantes, which is slightly misleading and a little unsettling -- with that subheading, there's just a little too much self-conscious, scholarly distance at play.]\n\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:8008a3e6995ea8348e1b829cf7fb4fdfb417f254","amp;dn":"Shuggie+Otis+-+Inspiration+Information+%281974%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8008a3e6995ea8348e1b829cf7fb4fdfb417f254","infoHashBuffer":{"type":"Buffer","data":[128,8,163,230,153,94,168,52,142,27,130,156,247,251,79,223,180,23,242,84]},"announce":[],"urlList":[]}}