{"title":"Ballance","uid":3534576,"size":137246344,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:80504aee1c59c5835c4735ae1d84ca2f363d6ce7&amp;dn=Ballance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bogz_pocs","files":3,"time":1160133713,"description":"Fight against the force of gravity! Face dizzying heights and plummeting depths. Steer a ball through a surreal cloud world full of puzzling mechanisms, over metal rails, wooden bridges and more. There are 12 increasingly challenging levels, each one bringing with it ever more complex puzzles and mechanisms to overcome.\n\n\nBallance is a level-based puzzle game. The player has to move a ball through a hovering maze of paths and rails. When moving, the player will face many mechanical obstacles like seesaws, suspension bridges, pendulums etc. to overcome. It is the aim of the game to reach to the end of each level without dropping the ball.\nBallance takes its special appeal from the physically realistic simulation of its elements. A good feeling of the ball&amp;#039;s inertia and an understanding of simple mechanical processes will enable the player to succeed.\n\n\nThe special feature of the ball is that the player can change its material, and thus its physical properties. The material can be changed from wood to stone or paper. For changing the material of the ball, the player has to steer the ball onto one of the transforming fields (transformers) that can be found at various places in the levels.\nBallance is played against the time. The faster a player gets through a level the more scores will be granted. Picking up various Extra Scores may provide the player with additional &quot;time scores&quot; or even an &quot;extra life&quot;.\n\n\nBallance is a combination of a puzzle and a game of skill. While the skill component is omnipresent - everything finally depends on steering the ball - the element of intelligence reveals itself in the form of &quot;physical puzzles&quot;. These puzzles count on an intuitive grasping of the level architecture and the principles of simple mechanics. They often refer to the physical transformation of the ball.\nWhen exploring the world of this game and its rules, the view into endless depths gives the player a continuous thrill.\n\n\n\nSystem Requirements\nMinimum:\n- CPU: 350 MHz Intel Pentium II or similar\n- Windows 98/ME/2000/XP (not compatible with NT)\n- Memory: 64 MB RAM (128 MB for Win 2000/XP)\n- Hard Disk Space: 150 MB\n- CD ROM drive\n- Audio System: Sound card (optional)\n- Video System: 8 MB DirectX 8.1 compatible video card\n- DirectX version 8.1 (DX 9 included on game disc)\n- Mouse, Keyboard \tRecommended:\n- CPU: 450 MHz Intel Pentium III or similar\n- Windows 98/ME/2000/XP (not compatible with NT)\n- Memory: 128 MB RAM\n- Hard Disk Space: 150 MB\n- CD ROM drive\n- Audio System: Sound card (optional)\n- Video System: 16 MB DirectX 8.1 compatible video card\n- DirectX version 9 (DX 9 included on game disc)\n- Mouse, Keyboard\n\nFor more info visit: www.ballace.org\n\nIn my oppinion it&amp;#039;s a great game, if you&amp;#039;re tired of FPS you can relax playing one level. Try it!","torrent":{"xt":"urn:btih:80504aee1c59c5835c4735ae1d84ca2f363d6ce7","amp;dn":"Ballance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80504aee1c59c5835c4735ae1d84ca2f363d6ce7","infoHashBuffer":{"type":"Buffer","data":[128,80,74,238,28,89,197,131,92,71,53,174,29,132,202,47,54,61,108,231]},"announce":[],"urlList":[]}}