{"title":"Call of Duty: Modern Warfare 3[Scrubbed][Wii][NTSC]","uid":6806279,"size":4335891887,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:806281030297aae59893ed1d2645c505b1afcc67&amp;dn=Call+of+Duty%3A+Modern+Warfare+3%5BScrubbed%5D%5BWii%5D%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":".BONE.","files":2,"time":1320874148,"description":"Release Title: Call of Duty: Modern Warfare 3[Scrubbed][Wii][NTSC]\nGame I.D: SM8E52\nRelease Date: Nov 8, 2011\nPlatform: Wii\nGenre: Action, Strategy\nSize: 4.11GB Compressed, 4.37GB Extracted\nReq. Accessories: wiimote, nunchuck\nOptional Accessories: classic controller\nScrubbed by: Need I say more?\n\n\nGames Description:\n\nOne man pushes the free world to the brink as Modern Warfare crashes the borders of the most powerful nations on Earth. This campaign is not about flushing out terrorists in far-away locales. It's a desperate fight to survive, right on the homefront. Take up arms to defend England, Germany, France, and the United States in urban settings where freedom is on the line. Multiplayer retains its key features and adds a few choice upgrades, while the action takes a furious new turn with the addition of Survival Mode. Team up with a friend and see how long you can withstand a continuous onslaught of enemy fire. \n\nModern Warfare is back. The best-selling first person action series of all-time returns with the epic sequel to multiple Game of the Year award winner, Call of DutyÃ‚Â®: Modern Warfare 2. \n\n\nReleaser's Notes:\n\nThis is the FULL VERSION OF THE GAME!\n\nExtract to .iso with WinRar and burn at 4 - 6 speed with IMGBurn using high quality discs, preferably Verbatim.\n\nUpdate Partition removed :)\n\nTested on 4.3 Softmodded Wii using USBLoader GX 2.3 (latest rev) cIOSx r.21 (YOU MUST SET IT TO IOS 250, AND IT WILL WORK). Leaving it set on IOS 249 will result in constant loading of the game, so set it to 250! Also, if you are using a PAL console you must force the video settings to PAL through USBLoader GX, or whatever loader you use, otherwise the video will be in black and white. If you are running an NTSC console, leave it as is and do not mess with video settings.\n\nIn Order to play this Game your wii MUST be Softmodded or Hardchipped- I recommend using SoftMod because it is free and you do not have to solder which is very user friendly, and compatibility for gameplay is MUCH MUCH BETTER! (currently 99.4%).\n\nBringing you Quality Scrubbed Wii games for faster download's, ALL games are tested and 100% Virus Free for your safety.\n\n\n&quot;Scrubbed&quot; refers to using the program wiiscrubber. What this program does is examine the game image and looks for what people call garbage or unused data. This is filler in the image that has no game data in it. Wiiscrubber takes this and converts the code to 0s so that the image will in turn compress much more. The result is usually a huge cut in size once the image is compressed. Some images will\ncompress to only a few hundred mb! Keep in mind that when you extract these images, the images themselves will still be over 4gb in size according to Windows. This process is intended to save space for storing your games as compressed files. The games will play exactly as unscrubbed images do, there is no game data missing. This entire process has already been done for you!\n\n\nPLEASE HELP SEED THIS WHEN DONE! The More Seeds means More GAME Releases!!!\n\nAll Games Are WBFS, ULoader, Wii Flow, USBLoader GX, CFG USB Loader, Mighty Loader, and Channel Loader Compatible.\n\nCAN YOU SEED GAMES BACK and not set your client to seed back at lowest kbps!!!!!!\n\nWe bring you games, we want you to seed em back!\n\nENJOY, AND PLEASE COMMENT IF YOU LIKED THIS RELEASE!","torrent":{"xt":"urn:btih:806281030297aae59893ed1d2645c505b1afcc67","amp;dn":"Call+of+Duty%3A+Modern+Warfare+3%5BScrubbed%5D%5BWii%5D%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"806281030297aae59893ed1d2645c505b1afcc67","infoHashBuffer":{"type":"Buffer","data":[128,98,129,3,2,151,170,229,152,147,237,29,38,69,197,5,177,175,204,103]},"announce":[],"urlList":[]}}