{"title":"Peter Tinniswood - Winston - Audio Comedy - 128K - MP3 - Slimoo","uid":5305329,"size":840221451,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:81058bab3d2c968aef5066bbf17ecb9283bce3ff&amp;dn=Peter+Tinniswood+-+Winston+-+Audio+Comedy+-+128K+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_Slimoo_","files":31,"time":1264368065,"description":"Peter Tinniswood's - Winston - Audio Comedy - BBC7 via DVB-T\n31 x 30 minute episodes - 128Kbps - Mp3 - Slimoo \n\nWinston Hayballs, the beer-bellied village poacher in this acclaimed Radio 4 institution.  \n\n\nWinston is the creation of the well-known comic writer Peter Tinniswood (whose credits also include Uncle Mort, whose central preoccupation is British eccentricity.  \n\nThe five differently-titled series, which grew out of a 1987 radio play entitled The Village FÃƒÂªte, chart the exploits of Winston and the decidedly odd middle-class Empson family, to whom he attaches himself, as they struggle to make sense of the world around them.  \n\nNancy has recently moved to the village with her sister Rosie, her brother William and her father. When Winston the local poacher and handyman is thrown out by his wife he invites himself to stay with them.\n\n\nCast:\nMaurice Denham\nShirley Dixon\nLiz Goulding\nChristian Rodska\nBill Wallis\n\nWritten by Peter Tinniswood\n\n\nWinston - S01 - E01 - A Happy Family\nWinston - S01 - E02 - Weaving The Spells\nWinston - S01 - E03 - Without A Doubt\nWinston - S01 - E04 - What Do You Reckon\nWinston - S01 - E05 - Whacko Jolly Dee\nWinston - S01 - E06 - The Village Fete\n\nWinston Comes To Town - S01 - E01 - A Tweak Of Thread\nWinston Comes To Town - S01 - E02 - Line Of Communication\nWinston Comes To Town - S01 - E03 - Has Anyone Seen Winston\nWinston Comes To Town - S01 - E04 - Repeat After Me\nWinston Comes To Town - S01 - E05 - Easy To Love\nWinston Comes To Town - S01 - E06 - The Best Place For Them\n\nWinston In Love - S01 - E01 - I'm In Love, I'm In Love\nWinston In Love - S01 - E02 - Taking Tea With Roland\nWinston In Love - S01 - E03 - Happy Days In Cawnpore\nWinston In Love - S01 - E04 - A Dangerous Critter\nWinston In Love - S01 - E05 - Figuratively Speaking\nWinston In Love - S01 - E06 - Clip Clop, Clip Clop\nWinston In Love - S01 - E07 - Winston At Christmas\n\nWinston In Europe - S01 - E01 - Don't Gush, Nancy\nWinston In Europe - S01 - E02 - An Educated Woman\nWinston In Europe - S01 - E03 - Where Are We Now\nWinston In Europe - S01 - E04 - Coping With Urges\nWinston In Europe - S01 - E05 - Questions And Answers\nWinston In Europe - S01 - E06 - Finis\n\nWinston Back Home - S01 - E01 - So This Is What Happiness Is All About\nWinston Back Home - S01 - E02 - A Whale of A Time With Chekhov\nWinston Back Home - S01 - E03 - Don't Call Me Soams\nWinston Back Home - S01 - E04 - Say It Again, Winston\nWinston Back Home - S01 - E05 - A Born Natural\nWinston Back Home - S01 - E06 - After All This Time A Happy Ending \n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n. \n\n\n[","torrent":{"xt":"urn:btih:81058bab3d2c968aef5066bbf17ecb9283bce3ff","amp;dn":"Peter+Tinniswood+-+Winston+-+Audio+Comedy+-+128K+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81058bab3d2c968aef5066bbf17ecb9283bce3ff","infoHashBuffer":{"type":"Buffer","data":[129,5,139,171,61,44,150,138,239,80,102,187,241,126,203,146,131,188,227,255]},"announce":[],"urlList":[]}}