{"title":"Joanne Shaw Taylor-White Sugar-2009-Blues","uid":4629504,"size":132940898,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8149d24bde49e95538160b0dd2d8bb61b375724e&amp;dn=Joanne+Shaw+Taylor-White+Sugar-2009-Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1231340325,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n&quot;I have played with all sorts of blues musicians all over the world, I even made a film Ã‚Â´Deep BluesÃ‚Â´ where I went to Mississippi and recorded some legendary players such as R.L Burnside and Jesse -Mae Hemphill. Last year I heard something I thought I would never hear....a British White Girl playing blues guitar so deep and passionately it made the hairs on the back of my neck stand on end!&quot; (Dave Stewart/Eurythmics)\n\nWhen Dave Stewart had his big experience, Joanne Shaw Taylor was only 16. Her skills at the Telecaster were so perfect that the bluesfan and Eurythmics-frontman asked her to join his supergroup D.U.P. to tour europe in 2002. She was also offered a record contract but the label went bust. Today Joanne is 23 and happy about the fact that she took her time with the recording debut: &quot;I wanted to take time out to really work on my craft and make sure that when I did an album it was the best that I could do.&quot;\n\nFor &quot;White Sugar&quot; Joanne took a plane to Memphis where her label RUF had booked Jim GainesÃ‚Â´ studio. Jim had worked with some of JoanneÃ‚Â´s idols like Albert Collins and Stevie Ray Vaughan. He brought in the experienced sessionmen Steve Potts (Drums) und Dave Smith (Bass). &quot;Working with these guys was totally easy. I knew of them because of Luther Allison and the Jonny Lang albums. They didnÃ‚Â´t know the tracks until five minutes before we recorded them. I made them listen to the songs once and then play them. It was fantastic. They got so much feeling and soul. They are amazing guys to work with.&quot;\n\nThe power trio - thatÃ‚Â´s the kind of band which suits Joanne Shaw Taylor, also at home in Birmingham, where she and her trio play the pubs, clubs and festivals. &quot;I always wanted to try the power trio thing, like Stevie Ray Vaughan, the Paladins or Jimi Hendrix. I thought it would bring me on as a guitar player and a singer - which I think it has done. And&quot; - Joanne chuckles - &quot;itÃ‚Â´s also cheaper, you know.&quot;\n\nShe talks about some influences. When Joanne was a little schoolgirl, she was caught by the rough side of the blues: SRV, Albert Collins, the Paladins, Jimi Hendrix. At christmas she got her first electric guitar. The old classical guitar, which she had played since she was eight, vanished from the childrenÃ‚Â´s room. &quot;As soon as I heard SRV and Albert Collins I knew pretty much that I wanted to do that full stop. That was the lifestyle route that I was goinÃ‚Â´ to go down. It was never a hobby. It was always very serious and dedicated to it.&quot;\n\n&quot;White Sugar&quot; is the proof. The confident and young british woman keeps the traditions of her idols but she is going her own way. With her record debut she demonstrates her talent with ten songs that she has written herself. Playing the hard stuff ÃƒÂ  la SRV, making us feel the bite of her telecaster just like Albert Collins did or working out charming little riffs from the Jimi Hendrix book - Joanne is always seeking - and finding - new terrain. Funky shuffles, soulful ballads or the hypnotic hookline of the title track, a burning instrumental, she presents her craft powerfully. Some songs were written during the the flight to Memphis, a few others were written 10 years ago and are kind of her signature tunes. There is the autobiographical &quot;Kiss The Ground Goodbye&quot;, deep feelings come wirh &quot;Heavy Heart&quot; or &quot;Blackest Day&quot;, a song that Joanne wrote when she was 14. &quot;With Ã‚Â´Blackest DayÃ‚Â´ I really wanted to show my influences.&quot; She can be proud of her first album. &quot;&quot;SheÃ‚Â´s my pride &amp; joy...&quot; SRV once sang. Her fans will be proud of Joanne, too...\n\n&quot;She plays with more attitude and flare than most.\nMassive potential here. Inspiring.&quot; \nGUITARIST magazine \n\n&quot; Catch her live if you can, then you can say: I was there at the beginning&quot; \nBlue Print Magazine\n\n&quot;Joanne IS the new face of the blues&quot; \nBlues Matters\n\n","torrent":{"xt":"urn:btih:8149d24bde49e95538160b0dd2d8bb61b375724e","amp;dn":"Joanne+Shaw+Taylor-White+Sugar-2009-Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8149d24bde49e95538160b0dd2d8bb61b375724e","infoHashBuffer":{"type":"Buffer","data":[129,73,210,75,222,73,233,85,56,22,11,13,210,216,187,97,179,117,114,78]},"announce":[],"urlList":[]}}