{"title":"August Rush","uid":4262664,"size":4680958408,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:814d684de2f557c5e830360c02745149b0a23054&amp;dn=August+Rush&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Jaba.MegaSeedersJp","files":25,"time":1214543895,"description":"August Rush\n\n\nThis is a story of a music prodigy. Lyla is a renowned and beautiful cellist and Louis is a bass player in club. Lyla and Louis falls in love once they meet each other following the music. Since they have different life, they have to separate without seeing each other once again. However, Lyla has had their baby-Evan, a prodigy born to music. Lyla has an accident and bears the baby but Lyla&amp;#039;s father gives the baby to an orphanage but does not tell her this in case of affecting her career. After that, both Louis and Lyla give up the music career. Eleven years later, the poor little Evan believes that their parents are waiting for him and goes to New York to find his parents. In New York, his music gift leads him to success but also gives him some trouble. A monger uses Evan to make money and prevents him from success. He escapes and runs into a church and people there are surprised by his gift and send him to the best music school, Juilliard. In the Juilliard school, he receive the normal education but his genius makes him brilliant and created his composition--August Rhapsody in C major. At the same time, Lyla and Louis both begin to play music again and Louis has been in New York. Because of his perfect performance, Evan is granted an opportunity to play his music in the central park in front of thousands of people. There are totally three composers and he is feathered last, in fact, his mother is the second one. As Evan is directing the orchestra to play his rhapsody, Lyla and Louis come to the concert following the music again. The family get together finally!\n\n\nCast\n\nFreddie Highmore (August Rush)\nKeri Russell (Lyla Novacek)\nJonathan Rhys Meyers (Louis Connelly)\nRobin Williams (Wizard)\nLeon G. Thomas III (Arthur)\nTerrence Howard (Richard Jeffries)\nJamia Simone Nash (Hope)\nWilliam Sadler (Thomas)\nAlex O&amp;#039;Loughlin (Marshall)\nAaron Staton (Nick)\nJamie O&amp;#039;Keefe (Steve)\n\n\nAudio:\n\nEnglish and Portuguese(fron Brazil)\n\n\nSubs:\n\nPortuguese(fron Brazil) ","torrent":{"xt":"urn:btih:814d684de2f557c5e830360c02745149b0a23054","amp;dn":"August+Rush","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"814d684de2f557c5e830360c02745149b0a23054","infoHashBuffer":{"type":"Buffer","data":[129,77,104,77,226,245,87,197,232,48,54,12,2,116,81,73,176,162,48,84]},"announce":[],"urlList":[]}}