{"title":"Girls Like Us - Rachel Lloyd.epub","uid":9026320,"size":334296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8176e231c86f62523ea62364eae74b12cef90953&amp;dn=Girls+Like+Us+-+Rachel+Lloyd.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381368929,"description":"A deeply moving story by a survivor of the commercial sex industry who has devoted her career to activism and helping other young girls escape &quot;the life&quot; \n\nAt thirteen, Rachel Lloyd found herself caught up in a world of pain and abuse, struggling to survive as a child with no responsible adults to support her. Vulnerable yet tough, she eventually ended up a victim of commercial sexual exploitation. It took time and incredible resilience, but finally, with the help of a local church community, she broke free of her pimp and her past.\n\nThree years later, Lloyd arrived in the United States to work with adult women in the sex industry and soon founded her own nonprofitÂ—GEMS, Girls Educational and Mentoring ServicesÂ—to meet the needs of other girls with her history. She also earned her GED and won full scholarships to college and a graduate program. Today Lloyd is executive director of GEMS in New York City and has turned it into one of the nation's most groundbreaking nonprofit organizations.\n\nIn Girls Like Us, Lloyd reveals the dark, secretive world of her past in stunning cinematic detail. And, with great humanity, she lovingly shares the stories of the girls whose lives she has helpedÂ—small victories that have healed her wounds and made her whole. Revelatory, authentic, and brave, Girls Like Us is an unforgettable memoir. ","torrent":{"xt":"urn:btih:8176e231c86f62523ea62364eae74b12cef90953","amp;dn":"Girls+Like+Us+-+Rachel+Lloyd.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8176e231c86f62523ea62364eae74b12cef90953","infoHashBuffer":{"type":"Buffer","data":[129,118,226,49,200,111,98,82,62,166,35,100,234,231,75,18,206,249,9,83]},"announce":[],"urlList":[]}}