{"title":"[TabooHandJobs / Clips4Sale] Maya Hills (I will do what your wif","uid":13567769,"size":210641708,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:81d3ccbe28764b8057c021a646ae6c72fc7117f1&amp;dn=%5BTabooHandJobs+%2F+Clips4Sale%5D+Maya+Hills+%28I+will+do+what+your+wif&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1455645627,"description":"[TabooHandJobs / Clips4Sale] Maya Hills (I will do what your wife doesnt) 720p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kCv\r\n \nhttp://imgsnaps.com/image/kC0\r\n\r\nSultry daughter-in-law takes care of her husband's father's cock while Mom is out shopping!\r\n\r\nThanks for sitting here with me a minute. I mainly want to tell you how much I appreciate you letting us stay here, your son and I. We never thought we would be in this predicament of him losing his job first and then our house. He has a new job now and is working extra hard to get us enough money to move out on our own. I really, like really appreciate you and mom letting us stay here while we get our feet back on the ground. I've been thinking of how to possibly repay you for your generosity and what I came up with is I can do the things for you that your wife doesn't do. From being here I gather you two don't have the most exciting sex life and when you do copulate, its over rather quickly. It doesn't sound like your cock really gets the attention it's deserving and desiring. I can help you with that. I would love to give you a hand job. Hand jobs are so great because you are the one being focused on. You don't have to do anything, no pressure to perform, just lay there and let me take care of you. Oh, and in case you are wondering, I did NOT ok this idea with your son, my husband. This is all my fantasy and desire to please you.\r\n\r\nDid you know sometimes I see you in the house and I get turned on by the way you look at me then I grab your son and run to the bedroom so we can fuck? You didn't know I have these feelings for you did you? This seems like the perfect excuse to get close to you and justify it so I won't feel guilty about having my father in laws dick in my hand, and liking it. Do you like what I am doing for you? Does it make you nervous your wife could walk in the house any minute and catch us? What do you think about maybe fucking me one day. How weird would it be if you made me pregnant and I wouldn't know if it was you or your son who planted his seed deep in me? We'll just go with a hand job for now. Let me make you feel so good with my soft warm hands. Do you like how I spit on your dick for lube? I'm sure my prudish mother in law doesn't do that does she? Let me show you my pretty pink pussy that I am going to give you sometime. Stick your dick in between my tight ass cheeks, yea, rub it in between my ass cheeks. Look how swollen my pussy is for you, it's wet inside to. Are you ready to cum for me daddy? Do you like it when I call you daddy? Lots of guys like that, including your son. This dirty talk turns you on doesn't it daddy? Come on, give me your hot sticky load...I'm jacking you off faster and faster. Ahh, yes, I know you have more in your balls for me. I'm milking every last drop from that dick. Maybe if you manage to keep this a secret tonight, I will let you fuck my ass tomorrow. I want this nice big dick of yours in my ass. I know your wife doesn't let you fuck her ass. Think about what just happened between us all night tonight while you lay next to your frigid wife. Now let's get cleaned up before your wife and my husband get home and this family gets really fucked!","torrent":{"xt":"urn:btih:81d3ccbe28764b8057c021a646ae6c72fc7117f1","amp;dn":"%5BTabooHandJobs+%2F+Clips4Sale%5D+Maya+Hills+%28I+will+do+what+your+wif","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81d3ccbe28764b8057c021a646ae6c72fc7117f1","infoHashBuffer":{"type":"Buffer","data":[129,211,204,190,40,118,75,128,87,192,33,166,70,174,108,114,252,113,23,241]},"announce":[],"urlList":[]}}