{"title":"Stossel.2014.03.13.[War on Women].Fox Business.CF.avi","uid":9771033,"size":354699130,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:81ebc9de90afbe675e7f37c785545d43fdfe5cba&amp;dn=Stossel.2014.03.13.%5BWar+on+Women%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1394950808,"description":"----------\n\nSTOSSEL - [War on Women?] - Fox Business Network\n2014, March 13, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nGENDER INEQUALITY?: Liberals brag that Obamacare &quot;fixed&quot; health insurance: Women no longer pay more than men. Fox News Contributor Jehmu Greene asks me sarcastically, &quot;Do you want to live in a country where you charge women more than men?&quot; But actually, I do. Women go to the doctor more than men. They incur higher medical expenses. Insurance should reflect real costs! Greene debates Heather Higgins of the Independent Women's Voice.\n\nPAY GAP: President Obama says that women make only 77 cents for every dollar men make, even though he knows the 77 cent statistic misleads. Amy Holmes of The Blaze explains why the 77 gap isn't real.\n\nFEMINISTS' WAR: Naomi Schaefer Riley of the New York Post says the real war on women is waged by feminists who assume women are just as eager to have casual sex as men.\n\nLEAN IN: Jane Hight McMurry, author of &quot;Navigating the Lipstick Jungle,&quot; and Suzanne Venker, author of &quot;The War on Men,&quot; debate whether women can &quot;have it all.&quot;\n\nWAR AGAINST BOYS: Fifty-seven percent of bachelor's degrees and 60 percent of master's now go to women. Christina Hoff Sommers, author of &quot;The War Against Boys,&quot; says women are not victims - boys are now second-class citizens in classrooms.\n\nMY TAKE: When I had kids, I tried to eliminate sexism. In my daughter's books I changed every &quot;he&quot; to &quot;she,&quot; and I wouldn't give my son toy guns. But it didn't matter. My son still played war, and my daughter dressed up. Men and women are different, and we should celebrate that rather than claim women are victims. Equality means equal opportunity, not equal everything. Difference is good. ","torrent":{"xt":"urn:btih:81ebc9de90afbe675e7f37c785545d43fdfe5cba","amp;dn":"Stossel.2014.03.13.%5BWar+on+Women%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81ebc9de90afbe675e7f37c785545d43fdfe5cba","infoHashBuffer":{"type":"Buffer","data":[129,235,201,222,144,175,190,103,94,127,55,199,133,84,93,67,253,254,92,186]},"announce":[],"urlList":[]}}