{"title":"En.Busca.De.La.Felicidad[DVDRip][Spanish]","uid":4192780,"size":1447328374,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:821040aab96c75f713e35a67c8869827f7002d9a&amp;dn=En.Busca.De.La.Felicidad%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mois20","files":4,"time":1211049649,"description":"Chris Gardner (Will Smith) es un padre de familia que lucha por sobrevivir. A pesar de sus valientes intentos para mantener a la familia a flote, la madre (Thandie Newton) de su hijo de cinco aÃƒÂ±os Christopher (Jaden Christopher Syre Smith), comienza a derrumbarse a causa de la tensiÃƒÂ³n constante de la presiÃƒÂ³n econÃƒÂ³mica; incapaz de soportarlo, en contra de sus sentimientos, decide marcharse. Chris, convertido ahora en padre soltero, tenazmente continÃƒÂºa buscando un trabajo mejor pagado empleando todas las tÃƒÂ¡cticas comerciales que conoce. Consigue unas prÃƒÂ¡cticas en una prestigiosa compaÃƒÂ±ÃƒÂ­a y, a pesar de no percibir ningÃƒÂºn salario, acepta con la esperanza de finalizar el plan de estudios con un trabajo y un futuro prometedor. Sin colchÃƒÂ³n econÃƒÂ³mico alguno, pronto echan a Chris y a su hijo del piso en el que viven, y se ven obligados a vivir en centros de acogida, estaciones de autobÃƒÂºs, cuartos de baÃƒÂ±o o allÃƒÂ¡ donde encuentren refugio para pasar la noche. A pesar de sus preocupaciones, Chris continÃƒÂºa cumpliendo sus obligaciones como padre y se muestra cariÃƒÂ±oso y comprensivo, empleando el afecto y la confianza que su hijo ha depositado en ÃƒÂ©l como incentivo para superar los obstÃƒÂ¡culos a los que se enfrenta.","torrent":{"xt":"urn:btih:821040aab96c75f713e35a67c8869827f7002d9a","amp;dn":"En.Busca.De.La.Felicidad%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"821040aab96c75f713e35a67c8869827f7002d9a","infoHashBuffer":{"type":"Buffer","data":[130,16,64,170,185,108,117,247,19,227,90,103,200,134,152,39,247,0,45,154]},"announce":[],"urlList":[]}}