{"title":"Moral Machines: Teaching Robots Right from Wrong","uid":4859913,"size":2759371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82441a6358df48987f52e1d3bac33a33fd94767e&amp;dn=Moral+Machines%3A+Teaching+Robots+Right+from+Wrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1240225277,"description":"&quot;Computers are already approving financial transactions, controlling electrical supplies, and driving trains. Soon, service robots will be taking care of the elderly in their homes, and military robots will have their own targeting and firing protocols. Colin Allen and Wendell Wallach argue that as robots take on more and more responsibility, they must be programmed with moral decision-making abilities, for our own safety. Taking a fast paced tour through the latest thinking about philosophical ethics and artificial intelligence, the authors argue that even if full moral agency for machines is a long way off, it is already necessary to start building a kind of functional morality, in which artificial moral agents have some basic ethical sensitivity. But the standard ethical theories don't seem adequate, and more socially engaged and engaging robots will be needed. As the authors show, the quest to build machines that are capable of telling right from wrong has begun. Moral Machines is the first book to examine the challenge of building artificial moral agents, probing deeply into the nature of human decision making and ethics.\n\nAbout the Authors:\nColin Allen is a Professor of History &amp; Philosophy of Science and of Cognitive Science at Indiana University.\nWendell Wallach is a consultant and writer and is affiliated with Yale University's\nInterdisciplinary Center for Bioethics.\n\nHardcover: 288 pages\nPublisher: Oxford University Press (November 19, 2008)\nLanguage: English&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:82441a6358df48987f52e1d3bac33a33fd94767e","amp;dn":"Moral+Machines%3A+Teaching+Robots+Right+from+Wrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82441a6358df48987f52e1d3bac33a33fd94767e","infoHashBuffer":{"type":"Buffer","data":[130,68,26,99,88,223,72,152,127,82,225,211,186,195,58,51,253,148,118,126]},"announce":[],"urlList":[]}}