{"title":"Mindfulness-based Cognitive Therapy for Dummies","uid":14518538,"size":34490573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82e076b16be31e9dbeb0a79b69f72322ea94463a&amp;dn=Mindfulness-based+Cognitive+Therapy+for+Dummies&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":10,"time":1462355341,"description":"=======================================\r\nTitle:\tMindfulness-Based Cognitive Therapy For Dummies\r\n=======================================\r\nAuthor:\tPatrizia Collard\r\n=======================================\r\nYear:\t2013\r\n=======================================\r\nLanguage:\tEnglish\r\n=======================================\r\nFile type:\tPDF + MP3\r\n=======================================\r\nPages:\t376\r\n=======================================\r\nISBN:\t1118519469 / 978-1118519462\r\n=======================================\r\nDescription:\r\n---------------------------------------\r\nStay in the present and build a happier future\r\n\r\nMindfulness-Based Cognitive Therapy For Dummies takes you through the eight-week MBCT course, using the principles of mindfulness to complement established CBT techniques. You'll discover how using MBCT can help lower your risk of relapsing into depression and reduce the risk of other mental health disorders including anxiety, stress, and low self-esteem.\r\n\r\n* Provides a solid foundation for positive mental health\r\n* The downloadable audio files contain guided meditations, a core feature of the MBCT program\r\n* MBCT works as an excellent supplement to therapy and may reduce the need for medication\r\n\r\nIf you suffer from depression, anxiety, insomnia, or a host of other mental health disorders, let Mindfulness-Based Cognitive Therapy For Dummies keep you in the present and build a happier future.\r\n=======================================\r\nBack cover:\r\n---------------------------------------\r\nBreak the mental chains that keep you stuck in the past and start living a fuller, happier life\r\n\r\nIf you suffer from depression you know how it feels to be dragged down by past hurts, regrets and disappointments. In this book you’ll learn an amazingly simple, yet highly effective, approach to breaking free of past woes (and future worries) and beating negative ways of thinking.\r\n\r\nTherapist Dr Patrizia Collard takes you on an eight-week journey of self-discovery, arming you with powerful tools for warding off future depression and related problems, such as anxiety, addiction and low self-esteem.\r\n\r\n    Make room for peace of mind – learn to prepare a physical (and mental) space conducive to meditation practice\r\n    Take a good look at what’s hurting you – find the courage to confront your demons, face-to-face, rather than pushing them away\r\n    Break those mental chains – become aware of the background noise and static that’s distracting you from clarity and purpose\r\n    Pay attention to the here and now – master mindfulness\r\n    techniques for living in the present moment, rather than fixating on the past or worrying about what the future may bring\r\n    Expand your focus – apply what you learn to beating an array of specific problems from addiction to depression, including eating disorders, pain, anxiety and more\r\n\r\nAudio download includes\r\n\r\nSeven guided meditations, including the sitting with difficult thoughts meditation and mindful breathing meditation Step-by-step advice to prepare yourself for effective meditation\r\n=======================================\r\n\r\nPlease buy this book to support the author if you like it: \nhttp://www.bookdepository.com/Mindfulness-Based-Cognitive-Therapy-For-Dummies-Dr-Patrizi-Collard/9781118519462","torrent":{"xt":"urn:btih:82e076b16be31e9dbeb0a79b69f72322ea94463a","amp;dn":"Mindfulness-based+Cognitive+Therapy+for+Dummies","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e076b16be31e9dbeb0a79b69f72322ea94463a","infoHashBuffer":{"type":"Buffer","data":[130,224,118,177,107,227,30,157,190,176,167,155,105,247,35,34,234,148,70,58]},"announce":[],"urlList":[]}}