{"title":"Alasdair MacIntyre - moral philosopher (15 books)","uid":8890629,"size":53363209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8337c46fc17bd279bb2cb6e1be7ae0f4b7ccaff6&amp;dn=Alasdair+MacIntyre+-+moral+philosopher+%2815+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1378575531,"description":"15 books by or about Alasdair MacIntyre. Most are pdf files, and they vary widely in quality.\n\n\n1. After Virtue: A Study in Moral Theory 3e (pdf, epub, mobi formats; the pdf is a reprocessed scan; quality is generally very good; epub and mobi files seem to be from a retail source)\n\n2. Dependent Rational Animals: Why Human Beings Need the Virtues (pdf format; mediocre quality; low-res images, possibly generated from screenshots, make this one impossible to improve, but it's more or less readable)\n\n3. First Principles, Final Ends, and Contemporary Philosophical Issues (Aquinas Lecture) (pdf format; conversion from html)\n\n4. God, Philosophy, Universities: A Selective History of the Catholic Philosophical Tradition (pdf format; high quality, seems to be from a retail source)\n\n5. Marxism &amp; Christianity (epub format; conversion from an awkward html format; may not be easily convertible to mobi, so I didn't try)\n\n6. A Short History of Ethics 2e (pdf, epub, mobi formats; all formats appear to be high quality, possibly from retail sources)\n\n7.Three Rival Versions of Moral Inquiry: Encyclopedia, Genealogy, and Tradition (pdf, chm formats; the pdf is a reprocessed scan; quality is mediocre to poor; I did what I could to improve it, but the result is still only so-so; the chm is a conversion from html)\n\n8. The Unconscious: A Conceptual Analysis (pdf format; high quality, apparently from a retail source)\n\n9. Whose Justice? Which Rationality? (pdf format; reprocessed scan; the original was very heavily warped, but this new version came out surprisingly well; still some mild warping and other distortion, but quality is generally pretty good)\n\n10. The MacIntyre Reader (Kelvin Knight, ed.) (pdf format; good scan processed with clearscan; excellent quality)\n\n11. Selected Essays, vol. 1: The Tasks of Philosophy (pdf format; high quality, seems to be a retail source)\n\n12. Selected Essays, vol. 2: Ethics and Politics (pdf format; high quality, seems to be a retail source)\n\nabout:\n\n13. Tradition in the Ethics of Alasdair MacIntyre (Christopher Stephen Lutz) (pdf format; good scan processed with clearscan; excellent quality)\n\n14. Alasdair MacIntyre: Critic of Modernity (Peter McMylor) (pdf format; high quality, retail source)\n\n15. Contemporary Philosophy in Focus: Alasdair MacIntyre (Mark C. Murphy) (pdf format; high quality, retail source)\n\n----------------------------\n\nabout Alasdair MacIntyre (excerpts from wikipedia):\n\nAlasdair Chalmers MacIntyre (born 1929) is a Scottish philosopher primarily known for his contribution to moral and political philosophy but known also for his work in history of philosophy and theology. \n\nMacIntyre's approach to moral philosophy has a number of complex strains that inform it. Although his project is largely characterized by an attempt to revive an Aristotelian conception of moral philosophy as sustained by the virtues, he nevertheless describes his own account of this attempt as a &quot;peculiarly modern understanding&quot; of the task.\n\nMacIntyre is a key figure in the recent surge of interest in virtue ethics, which identifies the central question of morality as having to do with the habits and knowledge concerning how to live a good life. His approach seeks to demonstrate that good judgment emanates from good character. Being a good person is not about seeking to follow formal rules. In elaborating this approach, MacIntyre understands himself to be reworking the Aristotelian idea of an ethical teleology.\n\nMacIntyre emphasizes the importance of moral goods defined in respect to a community engaged in a 'practice' - which he calls 'internal goods' or 'goods of excellence' - rather than focusing on practice-independent obligation of a moral agent (deontological ethics) or the consequences of a particular act (utilitarianism)\n\nMacIntyre converted to Roman Catholicism in the early 1980s, and now does his work against the background of what he calls an &quot;Augustinian Thomist approach to moral philosophy.&quot; In an interview with Prospect Magazine, MacIntyre explains that his conversion to Catholicism occurred in his fifties as a &quot;result of being convinced of Thomism while attempting to disabuse his students of its authenticity.&quot; Also, in his book Whose Justice, Which Rationality? there is a section towards the end that is perhaps autobiographical when he explains how one is chosen by a tradition and may reflect his own conversion to Roman Catholicism.","torrent":{"xt":"urn:btih:8337c46fc17bd279bb2cb6e1be7ae0f4b7ccaff6","amp;dn":"Alasdair+MacIntyre+-+moral+philosopher+%2815+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8337c46fc17bd279bb2cb6e1be7ae0f4b7ccaff6","infoHashBuffer":{"type":"Buffer","data":[131,55,196,111,193,123,210,121,187,44,182,225,190,122,224,244,183,204,175,246]},"announce":[],"urlList":[]}}