{"title":"Home To Blessing Series - Lauraine Snelling","uid":10082835,"size":2326939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8387943872482fde4452a7c303e257c5e2be604a&amp;dn=Home+To+Blessing+Series+-+Lauraine+Snelling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1399041990,"description":"[b][i][color=darkviolet]Home To Blessing Series[/color][/i][/b] \n \n[img]http://s20.postimg.org/kgl8bi15p/Home_To_Blessing_Cover.jpg[/img]\n \n[b][i][color=red]A Measure of Mercy[/color][/i][/b]\n \n[i][color=green]Eighteen year old Astrid Bjorklund has always dreamed of becoming a doctor. She had intended to study medicine in Chicago or Grand Forks, but when a disaster wiped out a major portion of her family's income, Astrid stayed home instead, receiving handson training from Dr. Elizabeth. Joshua Landsverk left Blessing two years ago, but he's never forgotten Astrid. Returning to town, he seeks to court her. Astrid is attracted to him, and when the opportunity unexpectedly opens for her to go to Chicago for medical training, she finds it difficult to leave. Love blossoms through their letters, but upon arriving back home, she makes a heartbreaking discovery. Will she have to give up love to pursue her dream?[/color][/i]\n \n[b][i][color=red]No Distance Too Far[/color][/i][/b]\n \n[i][color=green]Astrid Bjorklund wants to use her medical training to serve God and feels that He might be leading her in the direction of missionary work. Smarting from a misunderstanding with Joshua Landsverk, the young man she thought she loved, she heads east to a missionary training school, hoping to eventually use her skills in some remote outpost in Africa.When she is called home unexpectedly to help in a family medical emergency, Astrid learns of a deadly measles outbreak on the nearby Indian reservation. She immediately senses the Spirit tugging her to help the Indians and wonders if her &quot;mission field&quot; is not so far away as she had imagined. But if she follows God's call, will love pass her by?[/color][/i]\n \n[b][i][color=red]A Heart For Home[/color][/i][/b]\n \n[i][color=green]Astrid Bjorklund is on the Red Bud Indian Reservation in South Dakota trying to stop the horrific epidemic that is ravaging the tribe. The elders are suspicious of her, but when they see some of their people beginning to recover, they allow Astrid to continue caring for the sick and to train others to help. She is overwhelmed by this need so close to home and wonders if this is the mission field God has planned for her. Joshua Landsverk wants to repair his broken relationship with Astrid, but he is opposed to her present work and refuses to tell her why. When he encounters unexpected adversity, a surprising act of kindness brings healing to the grievous wrong inflicted years ago. Will it be enough to bring Joshua and Astrid together again?[/color][/i]","torrent":{"xt":"urn:btih:8387943872482fde4452a7c303e257c5e2be604a","amp;dn":"Home+To+Blessing+Series+-+Lauraine+Snelling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8387943872482fde4452a7c303e257c5e2be604a","infoHashBuffer":{"type":"Buffer","data":[131,135,148,56,114,72,47,222,68,82,167,195,3,226,87,197,226,190,96,74]},"announce":[],"urlList":[]}}