{"title":"After Liberalism (2001) by Paul Edward Gottfried","uid":10132474,"size":1452776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83b50163e138bf28fe4b7adbed3bcf3aeb31bc8f&amp;dn=After+Liberalism+%282001%29+by+Paul+Edward+Gottfried&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1399901522,"description":"After Liberalism - Mass Democracy in the Managerial State (2001) by Paul Edward Gottfried.pdf\n\nIn this trenchant challenge to social engineering, Paul Gottfried analyzes a patricide: the slaying of nineteenth-century liberalism by the managerial state. Many people, of course, realize that liberalism no longer connotes distributed powers and bourgeois moral standards, the need to protect civil society from an encroaching state, or the virtues of vigorous self-government. Many also know that today's &quot;liberals&quot; have far different goals from those of their predecessors, aiming as they do largely to combat prejudice, to provide social services and welfare benefits, and to defend expressive and &quot;lifestyle&quot; freedoms. Paul Gottfried does more than analyze these historical facts, however. He builds on them to show why it matters that the managerial state has replaced traditional liberalism: the new regimes of social engineers, he maintains, are elitists, and their rule is consensual only in the sense that it is unopposed by any widespread organized opposition.\n\nThroughout the western world, increasingly uprooted populations unthinkingly accept centralized controls in exchange for a variety of entitlements. In their frightening passivity, Gottfried locates the quandary for traditionalist and populist adversaries of the welfare state. How can opponents of administrative elites show the public that those who provide, however ineptly, for their material needs are the enemies of democratic self-rule and of independent decision making in family life? If we do not wake up, Gottfried warns, the political debate may soon be over, despite sporadic and ideologically confused populist rumblings in both Europe and the United States.\n\n200 pages\nSeries: New Forum Books\nPublisher: Princeton University Press (September 1, 2001)\nLanguage: English\nISBN-10: 0691089825\nISBN-13: 978-0691089829","torrent":{"xt":"urn:btih:83b50163e138bf28fe4b7adbed3bcf3aeb31bc8f","amp;dn":"After+Liberalism+%282001%29+by+Paul+Edward+Gottfried","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83b50163e138bf28fe4b7adbed3bcf3aeb31bc8f","infoHashBuffer":{"type":"Buffer","data":[131,181,1,99,225,56,191,40,254,75,122,219,237,59,207,58,235,49,188,143]},"announce":[],"urlList":[]}}