{"title":"John Patton - 31 Albums - Jazz Organ","uid":10525937,"size":3014565881,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:845b61bb1c97bae6289e9ffe4c629bec311c79b7&amp;dn=John+Patton+-+31+Albums+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1405040777,"description":"John Patton - 31 Albums - Jazz Organ\n\nJohn Patton, often known as Big John Patton, was one of Blue Note's busiest soul-jazz organists during the golden age of the Hammond B-3. Between 1963 and 1970 Patton cooked up around a dozen albums' worth of material as a leader and sat in with a dizzying procession of skilled improvisers. Patton also enjoyed a long overdue comeback during the '90s.\n\n\nList of included albums with Patton as leader or sideman in cronological order:\n\n1962 Lou Donaldson - The Natural Soul\n1963 Lou Donaldson - Good Gracious\n1963 Grant Green - Blues For Lou\n1963 John Patton - Along Came John (included in the Mosaic Select compilation)\n1963 Johnny Griffin &amp; Matthew Gee - Soul Groove\n1963 Grant Green - Am I Blue\n1963 Harold Vick - Steppin' Out\n1963 Lou Donaldson - A Man With A Horn\n1963 John Patton - Blue John\n1963 Lou Donaldson - Signifyin'\n1963 Don Wilkerson - Shoutin'\n1963 Red Holloway - The Burner\n1964 Lou Donaldson - Possum Head\n1964 John Patton - The Way I Feel (included in the Mosaic Select compilation)\n1965 Grassella Oliphant - The Grass Is Greener\n1965 John Patton - Oh Baby (included in the Mosaic Select compilation)\n1965 John Patton - Let 'Em Roll\n1966 George Braith - Laughing Soul\n1966 John Patton - Got A Good Thing Goin'\n1966 Clifford Jordan - Soul Fountain\n1967 Grant Green - Iron City\n1968 John Patton - That Certain Feeling (included in the Mosaic Select compilation)\n1968 John Patton - Boogaloo\n1968 John Patton - Understanding (included in the Mosaic Select compilation)\n1969 John Patton - Accent On The Blues\n1970 John Patton - Memphis To New York Spirit\n1977 Johnny Lytle - Everything Must Change\n1983 John Patton - Soul Connection\n1988 Jimmy Ponder - Jump\n1993 John Patton - Blue Planet Man\n1994 John Patton - Minor Swing\n\n2003 Mosaic Select 6 - Compilation of five John Patton albums\n\n----------\n\nThis collection is in MP3-format.\n\nThe quality of these rips varies, from high quality CD rips to lower quality LP rips.\n\nAll songs are tagged by the book.\n\nIn addition you will also find a thesis covering John Patton by Javier Gonzalez.\n\n----------\n\nJohn Patton was one of the major figures in the funky, blues rooted jazz style known as soul jazz. The Hammond organ was the instrument at the centre of that development, and Patton's relaxed, bluesy, lightly grooving style made a contribution to the genre.\n\nHe was born on the Missouri side of Kansas City, then a major jazz centre, and taught himself to play piano. He followed his brother to Washington in the early 1950s, and began playing in the area, initially as a pianist. His became interested in the Hammond organ while working with rhythm and blues singer Lloyd Price, and set up his own Hammond-led trio in 1959.\n\nHe moved to New York and began working with alto saxophonist Lou Donaldson and guitarist Grant Green, and made his recording debut for Blue Note with the saxophonist in 1962. He was a member of Donaldson's band until 1964, then linked up with Grant Green for a time, and also worked with Johnny Griffin, Harold Vick and Clifford Jordan, among others.\n\nHe led his own band from 1963 until 1969, and recorded numerous albums in a soul jazz vein for the Blue Note label, which remain the most characteristic examples of his work. The arrival of more contemporary forms of electronic keyboards and the rise of jazz-rock fusion eclipsed both the Hammond and soul jazz in the 1970s, but Patton continued to perform, although he recorded only one album as a leader in the two decades from 1970.\n\nThe revival of interest in the instrument in the 1980s saw a renewed interest in his work.\n\nBorn: July 12, 1935 in Kansas City, Missouri\nDied: March 19, 2002 in Montclair, New Jersey\n\n----------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n----------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n","torrent":{"xt":"urn:btih:845b61bb1c97bae6289e9ffe4c629bec311c79b7","amp;dn":"John+Patton+-+31+Albums+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"845b61bb1c97bae6289e9ffe4c629bec311c79b7","infoHashBuffer":{"type":"Buffer","data":[132,91,97,187,28,151,186,230,40,158,159,254,76,98,155,236,49,28,121,183]},"announce":[],"urlList":[]}}