{"title":"Final Fantasy XII: International Zodiac Job System v0.22 English","uid":11866131,"size":4182384640,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:854b4599c93bb46ee68b771e623f39a0b7a17165&amp;dn=Final+Fantasy+XII%3A+International+Zodiac+Job+System+v0.22+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"mercs215","files":1,"time":1430357197,"description":"Major Gameplay Changes:\n\nTurbo button: Press L1 and the game starts skipping frames, emulator-style, to go faster. \n\nSummons and Guests: Directly controllable, and able to be the party leader. You can even change guest's gambits, or order your summons to use their finisher immediately rather than wait for the right conditions. Guests also level up with you.\n\nZodiac Job System: Instead of having one giant license board with every single equip and skill on it, it's divided up into 12 smaller boards each representing an FF job and a zodiac sign. This way, nobody in you party can do everything at once and it actually matters who you use again. Another thing is that now there are a lot of &quot;island&quot; spaces on the license boards, and quickenings and espers make bridges to those spaces. That way, it also actually matters who gets espers.\n\nNew Quickening Bar: Instead of having quickenings and summons drain your entire MP bar, they now have their own separate limit break bar. Since they don't affect MP anymore now you get way better MP growth to make up for it.\n\nShops: Some items were shuffled around in when you can buy them, and I think in general stuff is available earlier now. Some spells and techs you can't buy in shops now though; they come from certain treasure chests. Any chest with a spell or a tech is guaranteed to appear and to have the skill. You can also buy every single gambit as soon as you clear Barheim; this especially helps mage classes with the elemental gambits.\n\nEquipment: A lot of weapons and accessories had their abilities changed. Most weapons were tweaked for job balance, while most accessories were given at least two functions. For example the diamond armlet now makes you immune to lightning besides changing chests. Even the primary functions are more useful now though since not every class gets every augment. There were also new ultimate weapons added for most of the weapon types, found in various places. \n\nNo Damage Limit: The damage limit was removed on everything. \n\nTreasure Chests: Now respawn when you go one screen away, instead of three. With the turbo button this makes farming for stuff from chests way, way easier.\n\nTrial Mode: An endurance test of 100 fights in a row, with no shops for restocking. Beating it unlocks Weak Mode.\n\nWeak Mode and Strong Mode: Weak Mode starts a new game you never gain experience from anything ever, so it's an enforced low-level challenge. Strong Mode is unlocked after beating the final boss. It starts a new game where everyone starts out at level 90","torrent":{"xt":"urn:btih:854b4599c93bb46ee68b771e623f39a0b7a17165","amp;dn":"Final+Fantasy+XII%3A+International+Zodiac+Job+System+v0.22+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854b4599c93bb46ee68b771e623f39a0b7a17165","infoHashBuffer":{"type":"Buffer","data":[133,75,69,153,201,59,180,110,230,139,119,30,98,63,57,160,183,161,113,101]},"announce":[],"urlList":[]}}