{"title":"CBTnuggets - On The Job Training Series - End User Security","uid":4477208,"size":134709944,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:85730f4445bddc4caaa46055d2ca2dbd9750cf42&amp;dn=CBTnuggets+-+On+The+Job+Training+Series+-+End+User+Security&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Ozone-T","files":18,"time":1225398333,"description":"The weakest point in security is people. Your security can be &quot;technically perfect,&quot; but a single user can leave your whole network open to attack, just by writing their password on a sticky note and leaving it stuck to the bottom of their keyboard. The media covers story after story about blunders like this that cause companies to lose both reputation and money while customers and employees risk identity theft.\n\nEven with all the news coverage events like this get, many users don&amp;#039;t pay much attention to keeping their computers secure. That&amp;#039;s why it&amp;#039;s up to security professionals, management, and IT staff like you to take responsibility for training end-users on security.\n\nThe simple way to train end-users on security practices -\n\nThe CBT Nuggets End-User Security training videos are an easy way to train end-users on security practices they can apply right away. Video lessons hold students&amp;#039; attention and make learning easy. The videos allow students to train at your company&amp;#039;s convenience, not when an outside trainer or busy IT security staff member is available. Lessons can even be rewatched as needed, to refresh a student&amp;#039;s knowledge at no additional cost to the company. And James Conrad, our expert instructor, has a style that is fun, interesting, and easy to learn from, while still giving complete instruction.\n\nHow will users learn to protect their computer?\n\nThe End-User Security On The Job Training Series covers a lot of ground:\n\n * Software Threats: Your company&amp;#039;s employees learn about the well-known nasties: Viruses, Worms, Trojans, Adware, and Spyware. First students find out what these are and how they can harm computers and entire networks. Then, students learn simple ways to protect computers against these threats. They are also reminded to work with IT staff so that any protection they want to add to their computer doesn&amp;#039;t conflict with the company&amp;#039;s current security practices.\n * E-mail Scams, Phishing, and Secure Passwords: Employees learn ways to recognize and avoid e-mail scams and attempts to &quot;phish&quot; confidential personal and company information from them. The training also covers ways to create stronger, more secure passwords so a password can&amp;#039;t be guessed, and so it&amp;#039;s difficult to discover using hacking tools and other automated methods.\n * Wireless Networks and File Sharing: In addition, the training covers basic wireless security considerations for end-users, so they know whether or not it&amp;#039;s safe to use their company laptop or PDA at their favorite public wireless hot-spot, or even their home network. The training also covers file sharing, to show users how information becomes widely available when it is stored and shared on a company network. Plus, they learn how storing vital information in these files can be dangerous.\n * Physical Security: Last but not least, users learn about one of the most neglected areas in computer security - physical security. They are taught about the danger of leaving laptops and other portable equipment in their car or in areas where theft is a high-risk. The training covers how to physically protect computer equipment from unauthorized access. Plus, students also learn how malicious people use social engineering to gain access to systems they are not authorized to view, how employees can recognize this, and what steps can be taken to protect against it.\n\nIT pros may come with basic security competency, but end-users often don&amp;#039;t. Each of these security topics is covered in detail in these short, topic-focused videos. Employees can watch each video as necessary to develop and maintain a baseline of computer security awareness and skills.\n\nWhat can training my end-users on security protect against?\n\nNot training end-users on basic security practices leaves a company&amp;#039;s systems vulnerable to attack, exploit, and data theft.\n\nBy training end-users, your company can save the vast amount of time and money it costs to mitigate and recover from an attack. It saves reputations and jobs. It also prevents IT Security professionals against headache after headache of dealing with viruses, adware, and other problems. And by protecting against identity theft, training end-users in security can save customers and employees from the pain of rebuilding their lives after personal and financial information was stolen.\n\nThis training will save your company more money than any other training program CBT Nuggets offers. That&amp;#039;s how important it is.\n\n\nPrerequisites\n\nAny employee who works on or around computers can benefit from this training. To get the most from it, knowledge of basic computer use such as 1 year experience using computers or watching How Do I Use This STINKING Thing?! is recommended.\n\n\nOn The Job Training Series: End-User Security contains these videos:\n\n- Brief Intro\n- Viruses\n- Worms and Trojans\n- Adware and Spyware\n- Combatting Viruses, Adware/Spyware\n- Email Part 1 - Threats and Prevention\n- Email Part 2 - Scams and Inappropriate Uses\n- Phishing Examples\n- Phishing Symptoms and Response\n- Wireless Overview and Vulnerabilies\n- Wireless Security\n- Sharing: Workgroups\n- Sharing: Domains\n- Physical Security: Protecting laptops, handhelds, thumbdrives\n- Social Engineering\n- Good Password Choices\n- Firewall\n- Security Updates (Windows Update)","torrent":{"xt":"urn:btih:85730f4445bddc4caaa46055d2ca2dbd9750cf42","amp;dn":"CBTnuggets+-+On+The+Job+Training+Series+-+End+User+Security","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85730f4445bddc4caaa46055d2ca2dbd9750cf42","infoHashBuffer":{"type":"Buffer","data":[133,115,15,68,69,189,220,76,170,164,96,85,210,202,45,189,151,80,207,66]},"announce":[],"urlList":[]}}