{"title":"Secret.Britain-S03--BBC-2016-w.subs-468p","uid":14546704,"size":2652501018,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:857f7e068f503eec51ccd3fe0cdc2ea79e562105&amp;dn=Secret.Britain-S03--BBC-2016-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uggauga","files":8,"time":1462587704,"description":"\nSecret Britain - Series 3\r\n\r\nExploring the hidden corners of the UK in search of the best the countryside has to offer.\r\n\r\nBBC (2016) - 4 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b05nxcj3\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nThe Lakes - Episode 1 of 4\r\nWe live in a country with some of the most diverse and beautiful landscapes in the world. It is easy to think of Britain as a crowded place, but with more than sixty million acres to explore there is still plenty of the UK for us to discover and enjoy.\r\nIn this episode of the series that promises to reveal hidden stories and undiscovered parts of the country, Ellie Harrison, Chris Hollins and Denise Lewis explore the Lake District.\r\nParachuting in - quite literally - Ellie Harrison gets a unique perspective on England's most popular national park, and she is also let in on the secret of an ancient and long-forgotten part of the Cumbrian landscape.\r\nMeanwhile, Denise Lewis gets to the bottom of the Lakes' dark and illicit past, and Chris Hollins is coaxed up a sheer cliff face by one of the world's best climbers - and rewarded with a spectacular view that only a handful of people ever get to see.\r\n\r\nKent - Episode 2 of 4\r\nEllie Harrison, Chris Hollins and Denise Lewis explore Kent.\r\n23 million people arrive in the UK via Kent every year - most of them on their way somewhere else. Local boy Chris sees his home county through new eyes. He experiences a change of heart about the strange bleak beauty of the North Kent marshes when he discovers the secrets of its past.\r\nDenise abseils off the white cliffs of Dover in search of a rare plant Kentish peasants risked their lives to harvest 500 years ago, and Ellie takes to the sea on a mission to get access to Kent's furthest outpost.\r\n\r\nDevon - Episode 3 of 4\r\nEllie Harrison, Chris Hollins and Denise Lewis explore Devon.\r\nOn a journey from an abandoned island on the south coast to the county's most hidden and remote surf spots in the north, Ellie Harrison follows in Drake's footsteps, seeking out Devon's best-kept secrets.\r\nChris Hollins relives an ancient and long-forgotten purification ritual on Dartmoor, and Denise Lewis uncovers the secret history of the county's most reluctant visitors.\r\n\r\nNorthern Ireland - Episode 4 of 4\r\nEllie Harrison, Chris Hollins and Denise Lewis explore Northern Ireland. As one of the least touristy places in the UK, the province is brimming with secrets.\r\nOlympic gold medallist Denise Lewis is chastised for a lack of focus when she competes in an unusual and unique local competition. Chris Hollins goes in search of a witch's lair on the top of a mysterious mountain. And Ellie Harrison uncovers the secret history of an army training base that has been closed to the public for over a century","torrent":{"xt":"urn:btih:857f7e068f503eec51ccd3fe0cdc2ea79e562105","amp;dn":"Secret.Britain-S03--BBC-2016-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857f7e068f503eec51ccd3fe0cdc2ea79e562105","infoHashBuffer":{"type":"Buffer","data":[133,127,126,6,143,80,62,236,81,204,211,254,12,220,46,167,158,86,33,5]},"announce":[],"urlList":[]}}