{"title":"Godus Beta v2.2","uid":10938641,"size":269497974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:85c9b8fc97426a02d16fefc07f2d4851889674fa&amp;dn=Godus+Beta+v2.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Lamasu","files":-1,"time":1409474702,"description":"Have you ever wanted to play god? In GODUS, you can sculpt every inch of a beautiful world that you look down upon, where your population of Followers will settle and multiply. As you rule over your living, breathing society, a civilization will blossom across your land and offer you their belief. The more Followers that believe in you, the more powerful you will become. It is as simple to play as it is spectacular to behold. Come and lead an incredible journey - this delightful, charming world is waiting for you to make it your own.\nGodus is designed by Peter Molyneux and is the spiritual successor to his earlier creation, Populous.\n\nv2.2 changelog (14.08.2014):\n\nNew stuff:\n- New Gift: Flag - allows you to put a flagpole in your world to increase happiness and look cool. (more flags to come!)\n- New Gift: School of Fish - Fish can now be placed in the sea.\n- New Card: Statue of Belief Collection - added, enables you to store some belief when you're not there to pick it up.\n- New Card: Tree Buff - The tree buff upgrade card further increases the amount of belief produced by\n- abodes in the vicinity of trees.\n- New Card: Super Follower Boost - Boost your followers even more, making them work harder and longer.\n\nFixes:\n- Stopped campfires being created on top of gem seams and granite\n- Fix for rock colours being wrong in some situations\n- Fix for part of the fountain tutorial not appearing.\n- Destination button in events now only appears if there is at least one event to pick from.\n- Happiness and gift balancing\n- Fixed some tooltip locations\n- Reduced Astari Fire damage, to fix bug with them being too easy to kill\n- Tree of joy springs up out of the floor rather than being dropped\n- Gems only rewarded after all followers have climbed pit of doom steps\n- Fix to prevent temples ending up in the water whilst sculpting\n- Tweaks to happiness for homeless followers\n- During leashing tutorial leashes, will only be accepted if they end on the layer of the temple itself or the one under it.\n- Removing rotation snap back\n- Balance file changes\n- Settlements with courtyards now allow followers to go back home\n- Minor colour tweaks to trees and beautify\n- Fixes to Mac audio when sacrificing followers\n- New splash screen text\n- Revised colours for trees on various landscapes\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://store.steampowered.com/app/232810&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/232810&lt;/a&gt;","torrent":{"xt":"urn:btih:85c9b8fc97426a02d16fefc07f2d4851889674fa","amp;dn":"Godus+Beta+v2.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85c9b8fc97426a02d16fefc07f2d4851889674fa","infoHashBuffer":{"type":"Buffer","data":[133,201,184,252,151,66,106,2,209,111,239,192,127,45,72,81,136,150,116,250]},"announce":[],"urlList":[]}}