{"title":"Jeff Wayne - The War Of The Worlds (1978) 2005 SACD-DFF","uid":11161853,"size":1609721890,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86580be3be0e5b8cd97a84b61c1a169373770ee9&amp;dn=Jeff+Wayne+-+The+War+Of+The+Worlds+%281978%29+2005+SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"hal4000","files":-1,"time":1412561498,"description":"Released 40 years after Orson Welles' infamous radio version of the H.G. Wells tale, Jeff Wayne's musical version of War of the Worlds straddles old-style radio drama and contemporary orchestrated narratives by Rick Wakeman and David Bedford. And while it lacks the sophisticated arrangements of, say, Journey to the Centre of the Earth, it does boast an impressively odd cast -- this may be the only time that a member of Thin Lizzy worked with Richard Burton, and the presence of Julie Covington and the Moody Blues' Justin Hayward in very attractive singing roles attest to its pop/rock aspirations. It's Burton's sonorous tones that sustain this work; his frequent solo narrations are eminently listenable, whereas sections featuring dialogue with other characters often come off as a bit stilted. The music is competent studio rock, and &quot;Horsell Common and the Heat Ray&quot; does strike just the right balance between Burton's narration and an accompaniment built around a buzzsaw guitar riff. Overall, it's pleasant as a period piece, and still a fine way to introduce younger listeners to Wells' classic tale. (And if you can find it in a vinyl, it comes with a nicely produced narrative booklet with gloriously lurid illustrations by Geoff Taylor.) The album was actually appealing on too many fronts for its own good in many ways -- the Justin Hayward-sung ballad &quot;Forever Autumn,&quot; extracted from a much longer piece on the double-LP -- showed some signs of appealing to AM radio listeners and climbed to the Top 40 based on airplay alone, but by the time Columbia Records in America (missing this boat entirely) got copies of the single into stores so that people could actually buy the record, the song had dropped back down; in the meantime, the record became a favorite of discos and dance clubs in New York and elsewhere, where its extended, highly rhythmic, synthesizer-driven sections delighted deejays and audiences, and Columbia missed another bet by not releasing an instrumental-only assembly of those long passages. (In New York, for years after it went out of print on vinyl, the album was sought after by club deejays eager to spin it).\n\n2.0 Stereo files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2005 Hybrid SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:86580be3be0e5b8cd97a84b61c1a169373770ee9","amp;dn":"Jeff+Wayne+-+The+War+Of+The+Worlds+%281978%29+2005+SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86580be3be0e5b8cd97a84b61c1a169373770ee9","infoHashBuffer":{"type":"Buffer","data":[134,88,11,227,190,14,91,140,217,122,132,182,28,26,22,147,115,119,14,233]},"announce":[],"urlList":[]}}