{"title":"Led Zeppelin - How The West Was Won","uid":4406008,"size":218682669,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86af7f9fb2cff60f3bc20f08f0ad20ea0a40d73d&amp;dn=Led+Zeppelin+-+How+The+West+Was+Won&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"taritilion","files":24,"time":1221950859,"description":"[MP3 - 192 Kbps - Hard Rock]Led Zeppelin - How The West Was Won\n\nTitolo : How The West Was Won\nArtista : Led Zeppelin\nEtichetta : Atlantic Records\nNumero Dischi : 3\nData : 2003 (da registrazioni live del 1972)\nGenere : Hard Rock e Metal\n\nIl triplo live contiene pezzi registrati dal vivo a Los Angeles, durante due concerti nel Giugno del 1972. Gli Zeppelin erano allora preceduti dalla fama conquistata con i loro primi quattro dischi, che li avevano imposti sulla scena e li avrebbero resi un punto di riferimento imprescindibile per tutti i musicisti rock degli anni '70.\nDa quelle perfomances sono state quindi tratte circa 2 ore e mezza di musica che catturano in pieno l'essenza di una band rivoluzionaria e con un modo peculiare di fare musica. L'immediatezza che contraddistingue gli Zeppelin fin dal primo disco, l'energia sprigionata dal suono e dalle ritmiche della band accompagnate dalla voce appassionata di Plant, emergono prepotentemente dal vivo forse meglio che nei dischi in studio, grazie anche alla possibilitÃƒÆ’Ã‚Â  da Page e Bonzo di prodursi in improvvisazioni mozzafiato alla chitarra e alla batteria.\nGli Zeppelin toccano in questo live tutti i loro registri: dal blues accelerato di &quot;Black Dog&quot; all'hard rock di &quot;Immigrant Song&quot;, dalle distorsioni inquietanti di &quot;Dazed and Confused&quot; alle delicate armonie acustiche di &quot;Going to California&quot; e al folk di &quot;Bron-Yr-Aur&quot;, fino all'immortale &quot;Stairway to Heaven&quot;.\n\nProbabilmente non ÃƒÆ’Ã‚Â¨ un caso che Page abbia scelto, tra il materiale presente negli archivi, proprio delle registrazioni affettuate in California. Agli inizi della loro carriera gli Zeppelin erano stati poco aprezzati in Inghilterra (soprattutto dalla critica) e molto di piÃƒÆ’Ã‚Â¹ oltreoceano. Emblematica era stata infatti la scelta, in proposito, di firmare il contratto con la Atlantic Records, un nome storico per quanto riguarda la scena musicale Californiana degli anni '60 affermatasi a Woodstock (la Atlantic pubblicava ad esempio gli allora celeberrimi CSNY, un'eco dei quali si puÃƒÆ’Ã‚Â² sentire nelle canzoni acustiche degi Zeppelin; molti poi intendono &quot;Going to California&quot; come dedicata a Joni Mitchell o agli hippies in generale). Un ritorno alla patria ideale, il &quot;West conquistato&quot;? D'altronde, se le influenze musicali sono americane nei suoni acustici di certi gruppi californiani (come giÃƒÆ’Ã‚Â  detto) e nel costante riferimento al blues (che aveva giÃƒÆ’Ã‚Â  avuto fortuna in Inghilterra, reinterpetato anche liberamente da una schiera di musicisti tra cui spiccano John Mayall, Eric Clapton e appunto Jimmy Page), molti testi e molte ballate degli Zeppelin sono schiettamente Inglesi, come ben testimoniano i pezzi del loro terzo disco.\nLe esibizioni qui documentate catturano gli Zeppelin nel loro momento migliore, alla vigilia del nuovo corso che verrÃƒÆ’Ã‚Â  intrapreso con i dischi successivi. Pienamente coscienti e ormai padroni dello stile innovativo ed energetico mostrato nei primi due dischi, capaci di battere altre strade con uno stile unico e di rielaborare i canoni della musica rock come mostrato nei due dischi seguenti, la band propone tutto questo dal vivo conferendo ai pezzi un impatto ancora maggiore.\nHo preferito usare l'mp3 anzichÃƒÆ’Ã‚Â¨ il flac per non rendere la release troppo ingombrante (sono 3 cd). D'altronde si tratta di registrazioni live: il valore di questo disco sta nello spirito con cui ÃƒÆ’Ã‚Â¨ suonato, nell'atmosfera che rievoca, non tanto nella qualitÃƒÆ’Ã‚Â  del suono.\n\nTRACCE\nCD 1\n      1. LA Drone (00:14)\n      2. Immigrant Song (03:42)\n      3. Heartbreaker (07:25)\n      4. Black Dog (05:41)\n      5. Over the hills and far away (05:08)\n      6. Since I've been loving you (08:02)\n      7. Stairway to Heaven (09:38)\n      8. Going to California (05:37)\n      9. That's the Way (05:54)\n      10.Bron-Yr-Aur Stomp (04:55)\n\nCD 2\n\n      1. Dazed and confused (25:25)\n      2. What is and what should never be (04:41)\n      3. Dancing days (03:42)\n      4. Moby Dick (19:20)\n\nCD 3\n\n      1. Whole lotta love (23:08)\n      2. Rock and roll (03:56)\n      3. The ocean (04:21)\n      4. Bring it on home (09:30)\n","torrent":{"xt":"urn:btih:86af7f9fb2cff60f3bc20f08f0ad20ea0a40d73d","amp;dn":"Led+Zeppelin+-+How+The+West+Was+Won","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86af7f9fb2cff60f3bc20f08f0ad20ea0a40d73d","infoHashBuffer":{"type":"Buffer","data":[134,175,127,159,178,207,246,15,59,194,15,8,240,173,32,234,10,64,215,61]},"announce":[],"urlList":[]}}