{"title":"El Puente de Alcantara - Frank Baer [Epub][Spanish]","uid":6949651,"size":1047325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86be2eaf45fa53f3cee5a2c33a09cbb738986de1&amp;dn=El+Puente+de+Alcantara+-+Frank+Baer+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"virana","files":-1,"time":1326361622,"description":"El Puente de AlcÃƒÂ¡ntara - Frank Baer [Epub]\n\nNovela Historica\n\n\nDespuÃƒÂ©s del largo y merecido parÃƒÂ©ntesis navideÃƒÂ±o regresa el autor a la actividad. A peticiÃƒÂ³n de un lector de este blog, que me pedÃƒÂ­a que le recomendara una novela histÃƒÂ³rica ambientada en la Europa medieval, voy a hablarles de una verdadera joya literaria. Sin dudarlo ni un instante me ha venido a la cabeza El Puente de AlcÃƒÂ¡ntara, del alemÃƒÂ¡n Frank Bauer. Se trata de una del as mejores novelas histÃƒÂ³ricas que he tenido el placer de leer. La historia se desarrolla en la EspaÃƒÂ±a del siglo XI, caracterizada por la presencia de distintos reinos de Taifas surgidos tras el colapso del califato de CÃƒÂ³rdoba y su interacciÃƒÂ³n con los distintos reinos cristianos del norte. Tres personajes; un poeta ÃƒÂ¡rabe, un mÃƒÂ©dico judÃƒÂ­o y un joven escudero crisitano verÃƒÂ¡n inextricablemente unidas sus vidas entre los avatares de una ÃƒÂ©poca convulsa.\n\nEl libro narra magistralmente un periodo apasionante de la historia espaÃƒÂ±ola. Un tiempo de guerras y consolidaciÃƒÂ³n de los reinos cristianos y de incipiente declive de la potencia musulmana en la penÃƒÂ­nsula. A travÃƒÂ©s de distitnos escenarios que van de la toma de MonzÃƒÂ³n por los crisitianos al palacio de Al-Mutamid de Sevilla, los protagonistas se verÃƒÂ¡n inmersos en las intrigas y guerras del momento. Pese a todo, una amistad sincera surgirÃƒÂ¡ entre tres hombres de culturas diferentes. En sus pÃƒÂ¡ginas no falta el amor, el sexo, la polÃƒÂ­tica y la guerra, todo ello magistralmente descrito por Bauer.\n\nEl Puente de AlcÃƒÂ¡ntara es un libro denso pero ÃƒÂ¡gil, acadÃƒÂ©micamente intachable a la par que ameno. Creo que no exagero cuando digo que estamos ante una de las mejores novelas histÃƒÂ³ricas escritas en la actualidad. No en vano el autor (filÃƒÂ³logo de formaciÃƒÂ³n) declara haber pasado mÃƒÂ¡s de cinco aÃƒÂ±osdocumentÃƒÂ¡ndose para escribirla. \n","torrent":{"xt":"urn:btih:86be2eaf45fa53f3cee5a2c33a09cbb738986de1","amp;dn":"El+Puente+de+Alcantara+-+Frank+Baer+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86be2eaf45fa53f3cee5a2c33a09cbb738986de1","infoHashBuffer":{"type":"Buffer","data":[134,190,46,175,69,250,83,243,206,229,162,195,58,9,203,183,56,152,109,225]},"announce":[],"urlList":[]}}