{"title":"Night Passage (1957) DVD5 - Western - James Stewart, Audie Murph","uid":10513901,"size":4688676864,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:873ae2a912227745f8e071e2a0fdcb704a243261&amp;dn=Night+Passage+%281957%29+DVD5+-+Western+-+James+Stewart%2C+Audie+Murph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SaM","files":24,"time":1404881558,"description":"Night Passage (1957) DVD5 - Western - James Stewart, Audie Murphy [DDR]\n\n    CAST:-\n    James Stewart as Grant McLaine\n    Audie Murphy as The Utica Kid\n    Dan Duryea as Whitey Harbin\n    Dianne Foster as Charlotte Drew\n    Elaine Stewart as Verna Kimball\n    Brandon deWilde as Joey Adams\n    Jay C. Flippen as Ben Kimball\n    Herbert Anderson as Will Renner\n    Robert J. Wilke as Concho\n    Hugh Beaumont as Jeff Kurth\n    Jack Elam as Shotgun\n    Tommy Cook as Howdy Sladen\n    Paul Fix as Clarence Feeney\n    Olive Carey as Miss Vittles\n    James Flavin as Tim Riley\n\nDirected by James Neilson\nProduced by Aaron Rosenberg\nMusic by Dimitri Tiomkin\nRunning time 90 minutes\n\nPRODUCTION NOTES:\nThis film is reminiscent of the popular western collaborations between Stewart and director Anthony Mann. This is largely because the project was slated to be their sixth collaboration. Mann backed out of the project before production due to other obligations and a disagreement over the casting of Audie Murphy. Aaron Rosenberg, who produced many of the Stewart-Mann collaborations, stayed on as producer with new director James Neilson.\n\nDimitri Tiomkin scored the film, and co-wrote the songs &quot;Follow the River&quot; and &quot;You Can't Get Far Without a Railroad&quot; with Ned Washington, which were performed by James Stewart himself. The film also offered Stewart the rare opportunity to play the accordion, an instrument he had played since childhood. However, his accordion playing was rerecorded by a professional during post-production. The film was the first to utilize the Technirama process by Technicolor. This process helped make the blue skies crisper and brighten the autumn footage photographed by cinematographer William H. Daniels. The railroad scenes were filmed at the Durango &amp; Silverton Narrow Gauge Railroad in Durango, Colorado, using Denver &amp; Rio Grande Western Railroad K-28 Class steam locomotive #476 which still operates in excursion service today. Though not as memorable as other Stewart-Mann films, Night Passage was a commercial success upon its release and has become a staple of cable television.\n\nSYNOPSIS:- Night Passage (1957)\nOn the way to meet his former boss, railroad tycoon Ben Kimball (Jay C. Flippen), Grant McLaine (Stewart) rescues a young boy, Joey Adams (Brandon deWilde), from Concho (Robert J. Wilke). Ben informs Grant that his payroll has been robbed several times already by a gang led by Whitey Harbin (Dan Duryea) and the Utica Kid (Murphy). If Ben's workers don't get paid soon, they will all leave. Grant accepts the job of taking $10,000 to them by train.\n\nWhen the train is held up again, Grant hides the money in a shoebox carried by Joey. The ploy works, but the young boy turns out to be friends with the Utica Kid, who takes him along with him. When the robbers cannot find the money, they take Ben's wife Verna (Elaine Stewart) to hold for ransom. Concho, a member of the gang, knocks out Grant for revenge, and the train leaves without him.\n\nWhen Grant wakes up, he trails the gang to a ghost town. He boldly asks to join up, revealing that he is the Kid's older brother [interestingly, the Kid's given name is Lee]. Utica is suspicious of his heretofore honest sibling, so Whitey (who dislikes the Kid) accepts him. Concho tries to shoot Grant unexpectedly, but Grant is faster to the draw. Afterwards, he tells the Kid where the money is, in an attempt to reform his brother. It doesn't work. The Kid gives Grant ten minutes to leave before he tells the gang, but Grant calls his bluff.\n\nThen, railroad employee Will Renner (Herbert Anderson) shows up to collect his share of the loot. He had been Whitey's informer. He recognizes Grant (by the song he sings and plays on his accordion) as the man assigned to deliver the payroll, and a gunfight ensues. Grant, Verna and Charlotte &quot;Charlie&quot; Drew (Dianne Foster), the Kid's girlfriend, are pinned down in a building. Grant sends Verna to safety in a tram, but Charlie refuses to leave. Meanwhile, the Kid is planning to quietly leave with Joey and the money.\n\nHowever, Joey rushes to Grant's side, and the Kid reluctantly joins forces with his brother. They kill all the gang members except Whitey. When Whitey sneaks up and shoots at Grant, the Kid steps in and takes the bullet, and Grant kills Whitey.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 90 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 90 mins","torrent":{"xt":"urn:btih:873ae2a912227745f8e071e2a0fdcb704a243261","amp;dn":"Night+Passage+%281957%29+DVD5+-+Western+-+James+Stewart%2C+Audie+Murph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"873ae2a912227745f8e071e2a0fdcb704a243261","infoHashBuffer":{"type":"Buffer","data":[135,58,226,169,18,34,119,69,248,224,113,226,160,253,203,112,74,36,50,97]},"announce":[],"urlList":[]}}