{"title":"CBC Doc Zone - Malls R US (2009) [WS-PDTV]~Ekolb","uid":5066517,"size":366119294,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87efd5fc0ee78428d6b030b985934df3d581d477&amp;dn=CBC+Doc+Zone+-+Malls+R+US+%282009%29+%5BWS-PDTV%5D%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ekolb","files":3,"time":1251039000,"description":"Malls R US\nPremiering: Thursday August 20, 2009 at 8 pm on CBC-TV\n\nWhat do Al Gore, the Tower of Babel, science fiction, gothic cathedrals, artichokes and roller coasters have in common? All come together in Malls R US, a feature documentary with a multiplex of critical reflections and revelations on one of North America's most popular suburban institutions - the enclosed shopping center. \n\nMixing nostalgia, architectural ambition, pop culture and politics, Malls R US travels from North America, the mall's origins, to some of its newer hosts - Poland, Japan, India and Dubai. Along the way, the film meets Dead Mall activists mourning the loss of their crumbling hangouts, Sci-Fi guru Ray Bradbury extolling the virtues of getting lost in a mall, a popular mass uprising against malls by shopkeepers in India, and a church gathering contemplating the sacredness of shopping centers. \n\nSome of the world's most renowned contemporary retail architects and developers explain how malls are the medium through which the 21st century will rebirth decaying cities, inspire monument building, unite mankind, and even help the planet grow green. We'll see Mother Earth - pushed over to make way for the mall - reconfigured in air-conditioned splendor, through babbling fountains, evergreen trees, and glass ceilings. Religious, environmental and labour critics gaze past security cameras onto the shrinking public space, to ask whether community can ever be born out of food courts and superstores.\n\nWalking among shoppers and workers of many tongues and cultures, Malls R US wonders, &quot;is there only one true language at the mall - the one where money talks?&quot; Ironic, sobering and visually stunning, this surprising documentary offers a trip to the mall like no other. \n\nAIR, the celebrated French band (The Virgin Suicides, Lost in Translation) has created the stirring music for the film. Malls R US is an Instinct Films/Point du jour film in co-production with CBC, Tele-Quebec, Canal Plus, SBS, Rogers Documentary Fund and RTBF.\n\nFormat            : AVI\nLength            : 349 MiB for 43mn 43s 968ms\nCodec             : XviD\nSource            : PDTV\n\nVideo #0          : MPEG-4 Visual at 973 Kbps\nAspect            : 576 x 336 (1.714) at 29.970 fps\n\nAudio #0          : MPEG Audio at 130 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:87efd5fc0ee78428d6b030b985934df3d581d477","amp;dn":"CBC+Doc+Zone+-+Malls+R+US+%282009%29+%5BWS-PDTV%5D%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87efd5fc0ee78428d6b030b985934df3d581d477","infoHashBuffer":{"type":"Buffer","data":[135,239,213,252,14,231,132,40,214,176,48,185,133,147,77,243,213,129,212,119]},"announce":[],"urlList":[]}}