{"title":"PointerFocus v1.8","uid":15732505,"size":1125448,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8816ab23bba91972bc2d39281ba15c47dd2a7903&amp;dn=PointerFocus+v1.8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LxByte","files":1,"time":1472803412,"description":"PointerFocus v1.8\r\n\r\nChange log:\r\n\r\nAdded: Supports Mouse Gestures to toggle spotlight, pen and magnifier functions\r\nAdded: Supports presentation pointer mode when using Pen function\r\nFixed: some small bugs\r\n\r\nPointerFocus is a handy Windows application designed for presenters, trainers and teachers who want to highlight their mouse pointer. The application offers some easy-to-use functions such as highlight cursor, mouse spotlight, keystroke visualization, magnifier and on-screen annotation.\r\nWith the help of PointerFocus you can keep your audience focus on the area of interest and make your demonstration more understandable.\r\n\r\nPointerFocus Features:\r\nHighlight mouse pointer with a colored circle, and when you click the mouse button the ring animation can show your mouse click actions to your audience.\tHighlight mouse pointer\r\nKeystroke visualization can show your audience which shortcuts you have just pressed. This feature can help you make your demonstration more understandable.\tKeystroke visualisation\r\nMouse Spotlight - when you choose this tool, it will dim the screen and put a &quot;spotlight&quot; around your mouse pointer. This can focus your audience's attention to the area of interest.\tMouse Spotlight\r\nOn-Screen Annotation Pen - when you choose this tool, you can use your mouse pointer annotate any part of the screen with customized color and pen width.\tOn-Screen Annotation Pen\r\nScreen Magnifier - when you choose this tool, you can show your audience details of any part on the screen.\tScreen Magnifier\r\nAndroid Remote Control - You can use Android App to remote control mouse actions and PointerFocus functions\r\n\r\nOfficial Website: http://www.pointerfocus.com/","torrent":{"xt":"urn:btih:8816ab23bba91972bc2d39281ba15c47dd2a7903","amp;dn":"PointerFocus+v1.8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8816ab23bba91972bc2d39281ba15c47dd2a7903","infoHashBuffer":{"type":"Buffer","data":[136,22,171,35,187,169,25,114,188,45,57,40,27,161,92,71,221,42,121,3]},"announce":[],"urlList":[]}}