{"title":"Miklos Rozsa: Concertos - McDuffie, Harrell, ASO, Levi (2000)","uid":14775817,"size":404553147,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:88dc711c9cff9af66c9f97b47aa8433a263c2e30&amp;dn=Miklos+Rozsa%3A+Concertos+-+McDuffie%2C+Harrell%2C+ASO%2C+Levi+%282000%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Scheheraz","files":24,"time":1464953109,"description":"MIKLÓS RÓZSA (1907-1995)\r\nConcerto for Violin and Orchestra\r\nConcerto for Cello and Orchestra\r\nTheme and Variations for Violin, Cello and Orchestra\r\n\r\nGramophone [5/2000]:\r\nBudapest-born Miklós Rózsa (1907-95) made his name scoring big-screen epics. Here's a welcome new collection - superbly performed and recorded - featuring three of his finest works for the concert hall\r\n&quot;This is the third version to have come my way in the last few years of the dashingly eloquent Cello Concerto that Miklós Rózsa completed in 1968 for Janos Starker, and I can report straight away that it's also the strongest. Not only is Telarc's engineering incomparably more vivid and realistic than that of its predecessors, the actual performance is the most irreproachably stylish and urgently impassioned of the bunch. Lynn Harrell brings all his commanding presence, customary swagger and cast-iron technique to Rozsa's strikingly idiomatic solo writing. Add to the mix a polished and enthusiastic response from the Atlanta Symphony under Yoel Levi's eagle-eyed direction, and the results are exhilarating.\r\nWritten in 1953-54 for Jascha Heifetz, the irresistibly colourful and sublimely lyrical Violin Concerto remains perhaps the most popular of all Rózsa's 'serious' compositions. Of course, Heifetz's inimitable 1956 recording surely enshrines one of the most treasurable specimens of his jaw-dropping virtuosity. None the less, this newcomer possesses many sterling strengths of its own. Robert McDuffie makes a dauntingly accurate, sweet-toned soloist, producing the most radiant sonorities in the ravishing, Kodaly-esque slow movement, while Levi and his Atlanta band once again prove model partners.\r\nLast but not least, McDuffie joins forces with Harrell for the engaging and eventful Tema con variazioni which originally began life as the centrepiece of the Op 29 Sinfonia concertante Rózsa penned in 1958 for Heifetz and cellist Gregor Piatigorsky. Again, the performance is utterly sympathetic and stands up perfectly well to that legendary 1963 Heifetz/Piatigorsky collaboration. All in all, a hugely rewarding triptych.&quot; --Andrew Achenbach\r\n\r\nConcerto for Violin and Orchestra, Op. 24 (1956)\r\n1. I. Allegro non troppo ma passionato [12:38]\r\n2. II. Lento cantabile [9:39]\r\n3. III. Allegro vivace [8:37]\r\nConcerto for Cello and Orchestra, Op. 32 (1968)\r\n4. I. Moderato [11:36]\r\n5. II. Lento con grande espressione [8:49]\r\n6. III. Allegro vivo [7:53]\r\n7. Theme and Variations for Violin, Cello and Orchestra, Op. 29a (1958) [12:08]\r\nTotal Playing Time: 71:48\r\n\r\nRobert McDuffie, violin\r\nLynn Harrell, cello\r\nAtlanta Symphony Orchestra\r\nYoel Levi\r\n\r\nRecorded in Symphony Hall, Woodruff Arts Center, Atlanta, Georgia, March 7-8, 1999\r\nRecording Producers: Elaine Martone, Thomas C. Moore\r\nExecutive Producer: Robert Woods\r\nTechnical Assistant: James Yates\r\nEditor: Thomas C. Moore\r\nAssistant Producer: Fyodor Cherniaysky\r\nRecording Engineer: Michael Bishop\r\nArt Director: Anilda Carrasquillo\r\n© 2000 TELARC\r\nTELARC CD-80518","torrent":{"xt":"urn:btih:88dc711c9cff9af66c9f97b47aa8433a263c2e30","amp;dn":"Miklos+Rozsa%3A+Concertos+-+McDuffie%2C+Harrell%2C+ASO%2C+Levi+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88dc711c9cff9af66c9f97b47aa8433a263c2e30","infoHashBuffer":{"type":"Buffer","data":[136,220,113,28,156,255,154,246,108,159,151,180,122,168,67,58,38,60,46,48]},"announce":[],"urlList":[]}}