{"title":"This Is the Zodiac Speaking -  Into the Mind of a Serial Killer.","uid":10168837,"size":65084070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89ddeac10d2c12ba8b1a74c271d3371a794fb1f6&amp;dn=This+Is+the+Zodiac+Speaking+-++Into+the+Mind+of+a+Serial+Killer.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1400382092,"description":"California was thrown into a paralysis of fear in 1969, distraught over the unsolved murders of the Zodiac killer. The Zodiac became the most elusive and frustrating adversary ever encountered by the law enforcement community in the San Francisco Bay Area. A series of letters, allegedly written by the murderer himself and published in local newspapers, only added to the mystery and panic. Over 30 years after he exploded onto the headlines of the San Francisco Chronicle, the Zodiac serial killer remains an enigma that is unparalleled in the history of crime in America, and the case remains unsolved. Violence expert Michael Kelleher and psychologist David Van Nuys attempt to provide a glimpse into the mind of this mysterious murderer.\n\nKelleher and Van Nuys reconstruct the crime scenes, delve into the records, and psychoanalyze the Zodiac's letters to newspapers and the law enforcement agencies. The facts of the case and the fragmentary glimpses of the Zodiac's psychodynamics that came through his letters forced the authors, reluctantly, to draw a conclusion that is sure to be controversial-namely, that the Zodiac suffered from multiple personality disorder. They also debunk many popular legends and myths about the case, laying out the limited facts that we do have on the notorious Zodiac.\n\n\nPDF 62MB\n\n\n\n","torrent":{"xt":"urn:btih:89ddeac10d2c12ba8b1a74c271d3371a794fb1f6","amp;dn":"This+Is+the+Zodiac+Speaking+-++Into+the+Mind+of+a+Serial+Killer.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89ddeac10d2c12ba8b1a74c271d3371a794fb1f6","infoHashBuffer":{"type":"Buffer","data":[137,221,234,193,13,44,18,186,139,26,116,194,113,211,55,26,121,79,177,246]},"announce":[],"urlList":[]}}