{"title":"Project Eden","uid":7503382,"size":643116481,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a22890ffb5bfc349c97b8132221e0020afc175f&amp;dn=Project+Eden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"esharoth","files":-1,"time":1344091042,"description":"Released: 8th October 2001\nDeveloper: Core Design\nPublisher: Eidos Interactive\nDescription:\nEarth's population has grown, and because of this, humongous skyscrapers have been erected. The rich and average live in these skyscrapers, while the poor, deranged, and criminals live at the very bottom, in the scummy area. The only time people go do down there is to do foundation maintenance. Recently, a team of engineers has gone missing at the Real Meat Factory, and the Urban Protection Agency (UPA) team is sent in.\n\nProject Eden is a 3D shooter with an emphasis on puzzle-solving. The player takes control of four UPA agents: Carter Dorlan, Andre Herderman, Minoko Molensky, and Amber Torrelson. Each of the protagonists has his or her own special ability, which must be frequently used to solve puzzles and advance in the game. Carter can interview suspects and open locked doors; Andre uses a special Omnitool to repair broken equipment or machinery; Minoko can hack into computer terminals, accessing information and controlling cannons, robots, tanks, and other machines; Amber can shoot pulse laser bolts and missiles, and is unaffected by hazards such as flames, poison gas, electricity, or cold temperatures. Problem solving in the game often involves cooperation between characters. Shooting can be done from either first or third-person perspective. The game also contains a multiplayer mode, allowing up to four players in a cooperative or deathmatch game.\n\nBonus content: manual.\n\nHow to play:\n1) Burn PROJECTEDEN.iso to a disc or mount it on a virtual drive;\n2) Run Setup.exe and install the game (choose the Custom setup type and tick every component);\n3) Run ProjectEdenPatch.exe to update the game;\n4) Extract Crack.zip archive to where you installed the game (overwrite original executable);\n5) Play the game without the disc.\n\n! Notice\nTested and working fine on Windows 7 x64.\n\nIf you like the game, SUPPORT the producers and BUY it!","torrent":{"xt":"urn:btih:8a22890ffb5bfc349c97b8132221e0020afc175f","amp;dn":"Project+Eden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a22890ffb5bfc349c97b8132221e0020afc175f","infoHashBuffer":{"type":"Buffer","data":[138,34,137,15,251,91,252,52,156,151,184,19,34,33,224,2,10,252,23,95]},"announce":[],"urlList":[]}}