{"title":"The Complete Guide to Vitamins, Herbs, and Supplements","uid":7855890,"size":2207092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a37c0f8370d422b0115ac7657bd277665664040&amp;dn=The+Complete+Guide+to+Vitamins%2C+Herbs%2C+and+Supplements&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353715608,"description":"The Complete Guide to Vitamins, Herbs, and Supplements: The Holistic Path to Good Health by Winifred Conkling, David Y. Wong\nAvon | 2005 | ISBN: 0060760664 | English | 336 pages | EPUB \n\n\nFind essential information on hundreds of vitamins, herbs, and supplements --\n\nWhat will VITAMIN E help cure and how much should I take?\n\nVitamin E can help prevent heart disease and treat acne. Adults should take 100 to 400 IU of natural vitamin E daily.\n\nFind vitamin, herb, and supplement treatments for hundreds of conditions!\n\nExperiencing migraines? See MAGNESIUM:\n\nThere is considerable evidence that low magnesium levels trigger both migraine and tension headaches. Take 250 to 400 milligrams three times daily.\n\nLearn about possible interactions with your prescription drugs!\n\nTaking ST. JOHN'S WORT for depression?\n\nIt may interfere with amphetamines, diet pills, nasal decongestants, or allergy medications, causing nausea or high blood pressure.\n\nHere is your comprehensive, portable, one-step guide to all over-thecounter vitamins, herbs, and supplements currently available -- an easy-to-use alphabetical listing that includes valuable information on the most effective forms of each supplement, the nutrient's food source and proper dosage, as well as signs of deficiency, safe use, and possible side effects.","torrent":{"xt":"urn:btih:8a37c0f8370d422b0115ac7657bd277665664040","amp;dn":"The+Complete+Guide+to+Vitamins%2C+Herbs%2C+and+Supplements","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a37c0f8370d422b0115ac7657bd277665664040","infoHashBuffer":{"type":"Buffer","data":[138,55,192,248,55,13,66,43,1,21,172,118,87,189,39,118,101,102,64,64]},"announce":[],"urlList":[]}}