{"title":"Exhale: Core Fusion Body Sculpt","uid":8825580,"size":378911174,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8ace8901dadaafb9db66976d06c8ee010eed9170&amp;dn=Exhale%3A+Core+Fusion+Body+Sculpt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"acer47x","files":-1,"time":1376839866,"description":"Year : 2008 \nCountry : USA \nGenre : Fitness and aerobics \nDuration : 50 minutes \n\nDescription : &quot;Lose the jiggle Without the Gym&quot; - Marie Claire A quarter of A million people have Transformed Their Bodies at the exclusive Exhale Spa - now you can Get These Same results at Home. Build A strong core, Develop washboard abs, Improve Posture, and create A Tighter, Firmer physique with Core Fusion Body Sculpt. This total-body program employs exercises that tone and sculpt your deepest, hard-to-reach muscles so it's more efficient and effective than traditional strength training. You'll use your Own Weight body as resistance and Small Hand Weights to really Challenge and Build your muscles. Segmented into Five focused workouts of just 10 minutes each, these exercises target the whole body, from arms and shoulders to glutes, hips, thighs , and abs. The Unique Core Fusion system Will Strengthen your body, quiet your Mind, and Improve your overall well-Being while redefining your physique from head to Toe. Creators Core Fusion Fred DeVito and Elisabeth Halfpapp have over 50 years' combined experience teaching Pilates, yoga, dance, and Tai Chi, disciplines that inform the Body Sculpt workout. They are founding team members of Exhale, a leading mind / body spa with locations around the country. \n\nVideo : 688x384 (1.79:1) 23.976 fps XviD MPEG-4 674 kbps avg 0.11 bit / pixel \nAudio : 48 kHz MPEG Layer February 3 ch 128.00 kbps avg \nLanguage : English. ","torrent":{"xt":"urn:btih:8ace8901dadaafb9db66976d06c8ee010eed9170","amp;dn":"Exhale%3A+Core+Fusion+Body+Sculpt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ace8901dadaafb9db66976d06c8ee010eed9170","infoHashBuffer":{"type":"Buffer","data":[138,206,137,1,218,218,175,185,219,102,151,109,6,200,238,1,14,237,145,112]},"announce":[],"urlList":[]}}