{"title":"The Ultimate Fantazia Collection [320kbps]","uid":11674647,"size":4511565333,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8b786f0b8c3f8663006a367883b2167aea2befe8&amp;dn=The+Ultimate+Fantazia+Collection+%5B320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RodneyYouPlonker","files":398,"time":1422806858,"description":"Presenting The Ultimate Fantazia Collection. This is a collection of classic house mixes from different DJs. There are some amazing tunes here. I have included the Club Classics series 1 to 3 plus the new Club Classics that was released in 2006. Also there's the House collection series and also The Fourth Dimension.\n\nI have carefully ripped and tagged them as best as possible. Also I've included album artwork which I have tagged into each MP3. The MP3s are @ 320kbps/CBR/44.1Khz and are all matching. This was quite a hard torrent to make, I did attempt to make this a few years ago and I put it on Pirate Bay but there was a problem with the mixing and it didn't sound right but I have finally managed to do it all again. They mix perfect now and I've checked them all so they're just like they should be.\n\nYou'll find that these Fantazia collections are hard to get hold of these days, they don't really sell them in record shops anymore so it's good to release this as a torrent.\n\nI used to buy these myself back in the mid nineties. You won't find this anywhere else apart from here. I've had been a fan of the Fantazia stuff for years now as it is great music.\n\nPlease help me to seed this, I hope that lots of people can all grab it. If you download then please give some back as these are quality tunes and they're quite rare now.\n\n\nTotal number of tracks = 385\n\nTotal data size = 4.19 GB\n\nFormat = MP3, 320kbps CBR/44.1Khz\n\nEncoded by LAME3.98\n\nTotal playing time = 1 day, 6 hours, 50 minutes and 23 seconds","torrent":{"xt":"urn:btih:8b786f0b8c3f8663006a367883b2167aea2befe8","amp;dn":"The+Ultimate+Fantazia+Collection+%5B320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b786f0b8c3f8663006a367883b2167aea2befe8","infoHashBuffer":{"type":"Buffer","data":[139,120,111,11,140,63,134,99,0,106,54,120,131,178,22,122,234,43,239,232]},"announce":[],"urlList":[]}}