{"title":"Latest in Clinical Nutrition 2011","uid":6553351,"size":539867026,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c9d540d74d54d43e6d3de39981979dbaddf0d19&amp;dn=Latest+in+Clinical+Nutrition+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mgreger","files":4,"time":1311185412,"description":"Michael Greger, MD, (http://www.DrGreger.org) has scoured the world\\'s scholarly literature on clinical nutrition and developed this brand-new talk of the latest in cutting-edge research.  Focusing on studies published just over the last year in peer-reviewed scientific nutrition journals,  Dr. Greger offers practical advice on how best to feed ourselves and our families to prevent, treat, and even reverse chronic disease In an engaging interactive quiz show format. All older videos now available free at NutritionFacts.org (currently in Beta test mode but feel free to take a sneak peek)\n \nA founding member of the American College of Lifestyle Medicine, Michael Greger, MD, is a physician, author, and internationally recognized speaker on nutrition, food safety, and public health issues.  He has lectured at the Conference on World Affairs, the International Bird Flu Summit, the National Institutes of Health, testified before Congress, and was invited as an expert witness in the defense of Oprah Winfrey in the infamous \\&quot;meat defamation\\&quot; trial. He is a graduate of Cornell University School of Agriculture and Tufts University School of Medicine. Currently Dr. Greger serves as the Director of Public Health and Animal Agriculture at The Humane Society of the United States.","torrent":{"xt":"urn:btih:8c9d540d74d54d43e6d3de39981979dbaddf0d19","amp;dn":"Latest+in+Clinical+Nutrition+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c9d540d74d54d43e6d3de39981979dbaddf0d19","infoHashBuffer":{"type":"Buffer","data":[140,157,84,13,116,213,77,67,230,211,222,57,152,25,121,219,173,223,13,25]},"announce":[],"urlList":[]}}