{"title":"Mycenaeans","uid":11737614,"size":5696909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8da72b0d1a735e99a6a888f7d15fdfc5c7cfd2df&amp;dn=Mycenaeans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425619469,"description":"The Mycenaean World belonged to the legendary heroes who conquered Troy and stand at the heart of Greek identity. This new book brings their culture and society to life with wit and elegance. Since the discovery of the remains of the civilization of Mycenae in the 1870s, knowledge of these Bronze Age Greeks has increased dramatically. This text is a major new contribution to our understanding of this crucial period. Stepping into the place of the collapsed civilization of Minoan Crete and the Peloponnese (the subject of Castleden's earlier bestselling study, Minoans), the Mycenaeans dominated mainland Greece and the Greek islands from about 1600-1250 BC. Their exploits became the subject of the legends that were immortalized by Homer. In lively prose informed by the latest research, this vivid study delivers the fundamentals of Mycenaean civilization, its hierarchy, economy, religion and arts. Controversially, Castleden interprets the well-known palaces of Mycenae, Tiryns, Pylos and elsewhere as temples. Their sea empire and their relations with other peoples of the Bronze Age world, including the Hittites, the Egyptians and the Trojans, receive full attention. In addition the causes of the end of their civilization are discussed. The book is an indispensable starting point for the study of the Greek Bronze Age. Full bibliography and copious illustrations support this comprehensive interpretation of a civilization whose legend still lives on","torrent":{"xt":"urn:btih:8da72b0d1a735e99a6a888f7d15fdfc5c7cfd2df","amp;dn":"Mycenaeans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da72b0d1a735e99a6a888f7d15fdfc5c7cfd2df","infoHashBuffer":{"type":"Buffer","data":[141,167,43,13,26,115,94,153,166,168,136,247,209,95,223,197,199,207,210,223]},"announce":[],"urlList":[]}}