{"title":"Il.Cosmo.Sul.Como.2008.iTALiAN.DVDRip.XviD-Republic[volpebianca]","uid":4839416,"size":733935616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f79fa8a3886a83733fcf2c492460c61a311659a&amp;dn=Il.Cosmo.Sul.Como.2008.iTALiAN.DVDRip.XviD-Republic%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Volpebianca","files":1,"time":1239448949,"description":":::Scheda del film:::\nTitolo: Il cosmo sul comÃƒÂ²\nTitolo originale: Il cosmo sul comÃƒÂ²\nNazionalitÃƒÂ : Italia\nAnno: 2008\nGenere: Commedia\nRegia: Marcello Cesena\nData di uscita: 19 Dicembre 2008 (cinema)\nCast: Aldo Baglio, Giovanni Storti, Giacomo Poretti, Raul Cremona, Angela Finocchiaro, Victoria Cabello, Sara D'amario, Isabella Ragonese, Silvana Fallisi\n\n:::Trama:::\n\nIl film si snoda in quattro episodi legati tra loro dai bizzarri insegnamenti di un maestro orientale - Tsu' Nam (Giovanni) - e dei suoi due discepoli (Aldo e Giacomo). Tsu'Nam elargisce continuamente pillole di improbabile saggezza e di solito preferisce farlo all'ombra di un ginko biloba, una massiccia e leggendaria pianta frondosa dai poteri ancestrali. Il metodo di insegnamento del maestro ÃƒÂ¨ arcaico, ma semplice ed efficace: far raggiungere &quot;l'illuminazione&quot; attraverso l'uso di un nodoso bambÃƒÂ¹. Aldo Giovanni e Giacomo, con le loro strambe avventure, diventano protagonisti di storie verosimili, alternandosi in una specie di giostra su cui girano curiosi esemplari della variopinta &quot;specie umana&quot;. Una volta sono amici che condividono in modo stravagante il desiderio testardo di paternitÃƒÂ  di uno di loro, che si sottopone alle prove piÃƒÂ¹ grottesche pur di raggiungere il suo improbabile obiettivo; organizzano quindi la partenza per le vacanze estive in compagnia dei loro famigliari con i quali, tra equivoci e incomprensioni, scatenano situazioni impreviste. Sono inoltre protagonisti della vita naÃƒÂ¯f di un quartiere, che ruota intorno a una cadente chiesa di periferia e al suo parroco; infine diventano parte integrante dei ritratti di una pinacoteca che espone opere di celebri artisti e trasmigrano da un quadro all'altro. Aldo Giovanni e Giacomo, raccontando in chiave umoristica e surreale gli accadimenti del quotidiano, ancora una volta provano a dimostrare che il mondo ÃƒÂ¨ proprio lÃƒÂ¬ a portata di mano e... forse ÃƒÂ¨ proprio vero Il cosmo (ÃƒÂ©) sul comÃƒÂ².\n\nQualitÃƒÂ  audio e video ottimi.","torrent":{"xt":"urn:btih:8f79fa8a3886a83733fcf2c492460c61a311659a","amp;dn":"Il.Cosmo.Sul.Como.2008.iTALiAN.DVDRip.XviD-Republic%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f79fa8a3886a83733fcf2c492460c61a311659a","infoHashBuffer":{"type":"Buffer","data":[143,121,250,138,56,134,168,55,51,252,242,196,146,70,12,97,163,17,101,154]},"announce":[],"urlList":[]}}