{"title":"Concise Historical Atlas of World War Two - The Geography of Con","uid":10957815,"size":5710735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fafb50b22d4a14dff2824a8471d19b35de36d35&amp;dn=Concise+Historical+Atlas+of+World+War+Two+-+The+Geography+of+Con&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"interuniversal","files":-1,"time":1409696248,"description":"         Concise Historical Atlas of World War Two - The Geography of Conflict\n\n                                 Author:Ronald Story\n\n                         Publisher:Oxford University Press\n\n                                 Published:May 4th 2006\n\n                                 ISBN:9780195182200\n\n                                    Format:pdf\n\n                                  No of Pages:116\n\nWorld War Two was a war of rapid and far-reaching conquest and movement, and a good sense of world geography is essential to grasping its magnitude and sweep. The Concise Historical Atlas of World War Two: The Geography of Conflict consists of 50 full-color maps that vividly convey not only the key military battles and campaigns but also the cultural and political geography of the war. Each map covers a significant phase of World War Two and is accompanied by an adjacent page of explanatory text that clarifies the shifting frontiers and populations of the region represented. These descriptions explain features of the conflict in question, describe changes in circumstances and the movements of battles, contextualize the events, and suggest longer-term consequences of campaigns. Offering a vivid summary of the war over space and time, this unique, full-color atlas covers all theatres of the war. It is ideal for courses on World War Two, American and European history in the twentieth century, U.S. political and military history, and world history. It is also a fascinating resource for anyone interested in the sprawling landscape of the Second World War.\n","torrent":{"xt":"urn:btih:8fafb50b22d4a14dff2824a8471d19b35de36d35","amp;dn":"Concise+Historical+Atlas+of+World+War+Two+-+The+Geography+of+Con","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fafb50b22d4a14dff2824a8471d19b35de36d35","infoHashBuffer":{"type":"Buffer","data":[143,175,181,11,34,212,161,77,255,40,36,168,71,29,25,179,93,227,109,53]},"announce":[],"urlList":[]}}