{"title":"This Sceptred Isle   (The History of Britain - BBC 1999 - Comple","uid":8634627,"size":2838395663,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:90091669980b6c3e65e43c470678266ddc07b72c&amp;dn=This+Sceptred+Isle+++%28The+History+of+Britain+-+BBC+1999+-+Comple&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Robin1966","files":314,"time":1372718589,"description":"This Sceptred Isle was created as a series of short 12-14 minute radio programmes by the BBC for transmission daily on Radio 4 from 1996 about the history of the lands and peoples of the British Isles. The producer was Pete Atkin.\n\nStarting in 55 BC with the arrival of Julius Caesar and initially concluding in 1901 with the death of Queen Victoria, the series was read by Anna Massey and included extracts from the book A History of the English-speaking Peoples written by Sir Winston Churchill, interwoven into Christopher Lee's main account of the history. The extracts were read by Paul Eddington and Peter Jeffrey.\n\nThe series was very successful, being broadcast twice each day in the morning and late at night, and in 1999 the BBC extended the programme to cover the Twentieth Century; picking up from where the first series had finished to the end of the millennium. This new series was a total of 15.25 hours long and although it used the same narrator, the quotations were read by Robert Powell. The first episode of this new series was broadcast on August 30 1999 and the final episode on December 31 1999.\n\nIn 2001 another shorter series entitled This Sceptred Isle: Dynasties was produced. This told the stories of the powerful and influential families of Britain's history, including the Godwins, the Despensers and the Churchills. The series consisted of 10 episodes and was again narrated by Anna Massey.\n\nOver the course of several months in 2005 and 2006 This Sceptred Isle: Empire a 90-part history of the British Empire was broadcast on Radio 4. Each part was approximately 15 minutes long. The narrator was Juliet Stevenson and the cast of readers of various historical documents--including poems, songs, personal letters, and first-hand accounts--included Jack Davenport, Joss Ackland, Christopher Eccleston, and Anna Massey among others.\n\nThe programme's title is a quotation from act 2 scene 1 of Shakespeare's King Richard II: &quot;This royal throne of kings, this scepter'd isle, This earth of majesty, this seat of Mars ... This blessed plot, this earth, this realm, this England&quot;.\n\n\n\nThe files contained in this torrent have been obtained from numerous sources over a number years and the bit rate and quality of episodes does vary. I have not listened to it completely (there's a lot of it) and so I cannot guarantee that every episode is correctly titled or plays without error. But I have not come across any duff tracks myself.\n\nThis torrent comprises of :\n\nThis Sceptred Isle - 55BC - 1901; (radio version) The Original Series: 40 episodes each around 45 minutes. Approx 29 hours of audio (~64kbps).\n\nThis Sceptred Isle - The Twentieth Century:  (CD version ) 15 episodes. Each an hour long episodes. Approx 15 hours of audio (~32kbps).\n\nThis Sceptred Isle - Empire: (radio version) 90 episodes each approx 13:30 mins in length. Approx 20 hours of audio (~128kbps).\n\n\nThis Sceptred Isle - Dynasties : (Radio version)  10 episodes each about 13:30 mins long. Approx 2 hours of audio (~128kbps).\n\nThis Sceptred Isle - Dynasties (CD) : (CD version)  10 CDs divided into tracks of a few minutes long. Same subject matter as the radio version but completely rewritten with much more detail. Approx 10 hours of audio (~96kbps).\n\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:90091669980b6c3e65e43c470678266ddc07b72c","amp;dn":"This+Sceptred+Isle+++%28The+History+of+Britain+-+BBC+1999+-+Comple","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90091669980b6c3e65e43c470678266ddc07b72c","infoHashBuffer":{"type":"Buffer","data":[144,9,22,105,152,11,108,62,101,228,60,71,6,120,38,109,220,7,183,44]},"announce":[],"urlList":[]}}