{"title":"The Castles of Henry VIII","uid":11851247,"size":37946904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90adb127f2c894a84dd986624bb126b3cdbe956a&amp;dn=The+Castles+of+Henry+VIII&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1430100746,"description":"In the last years of his reign Henry VIII needed a radically modern system of defense to protect England and its newly Protestant Church. Anticipating a foreign onslaught from Catholic Europe after his split from Rome, Henry energetically began the construction of more than 20 stone forts to protect England's major ports and estuaries, whilst modernizing existing fortresses from Hull to Milford Haven. The majority of this was paid for with his new-found fortune plundered from the monasteries, allowing Henry to employ a strong workforce well supplied with materials.\n\nAided by excellent full-color illustrations and a range of photographs and diagrams, Peter Harrington explores the departure from artillery-vulnerable medieval castle designs to the low, sturdy stone fortresses inspired by European ideas. He explains the scientific care taken to select sites for these castles, and the transition from medieval to modern in this final surge of English castle construction. With many of these fortifications still standing today, this is an ideal book for fortification enthusiasts and tourists alike","torrent":{"xt":"urn:btih:90adb127f2c894a84dd986624bb126b3cdbe956a","amp;dn":"The+Castles+of+Henry+VIII","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90adb127f2c894a84dd986624bb126b3cdbe956a","infoHashBuffer":{"type":"Buffer","data":[144,173,177,39,242,200,148,168,77,217,134,98,75,177,38,179,205,190,149,106]},"announce":[],"urlList":[]}}