{"title":"Illinois Jacquet - 1978 - God Bless My Solo FLAC","uid":9413099,"size":414291760,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90b12326b5d3c337603d739218cf60566e2e8d86&amp;dn=Illinois+Jacquet+-+1978+-+God+Bless+My+Solo+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1388357995,"description":"Illinois Jacquet - 1978 - God Bless My Solo\n\nOne of the great tenors, Illinois Jacquet's 1942 &quot;Flying Home&quot; solo is considered the first R&amp;B sax solo, and spawned a full generation of younger tenors (including Joe Houston and Big Jay McNeely) who built their careers from his style, and practically from that one song.\nJacquet, whose older brother Russell (1917-1990) was a trumpeter who sometimes played in his bands, grew up in Houston, and his tough tone and emotional sound defined the Texas tenor school. After playing locally, he moved to Los Angeles where, in 1941, he played with Floyd Ray. He was the star of Lionel Hampton's 1942 big band (&quot;Flying Home&quot; became a signature song for Jacquet, Hampton, and even Illinois Jacquet' successor Arnett Cobb), and also was with Cab Calloway (1943-1944) and well featured with Count Basie (1945-1946). Jacquet's playing at the first Jazz at the Philharmonic concert (1944) included a screaming solo on &quot;Blues&quot; that found him biting on his reed to achieve high-register effects; the crowd went wild. He repeated the idea during his appearance in the 1944 film short Jammin' the Blues. In 1945, Jacquet put together his own band, and both his recordings and live performances were quite exciting. He appeared with JATP on several tours in the 1950s, recorded steadily, and never really lost his popularity. In the 1960s, he sometimes doubled on bassoon (usually for a slow number such as &quot;'Round Midnight&quot;) and it was an effective contrast to his stomping tenor. In the late '80s, Jacquet started leading an exciting part-time big band that only recorded one album, an Atlantic date from 1988. Through the years, Illinois Jacquet (whose occasional features on alto are quite influenced by Charlie Parker) has recorded as a leader for such labels as Apollo, Savoy, Aladdin, RCA, Verve, Mercury, Roulette, Epic, Argo, Prestige, Black Lion, Black &amp; Blue, JRC, and Atlantic. Illinois Jacquet died on July 22, 2004. (AllMusic)\n\nTrack list:\n01 - Jean-Marie's Den (take 1)\n02 - You Left Me All Alone (take 4)\n03 - From Broussard (take 3)\n04 - God Bless My Solo\n05 - Lean Baby (take 2)\n06 - Jean-Marie's Den (take 3)\n07 - Things Ain't What They Used to Be\n08 - From Broussard (take 2)\n09 - You Left Me All Alone (take 2)\n10 - Lean Baby (take 1)\n11 - Jean-Marie's Den (take 6)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:90b12326b5d3c337603d739218cf60566e2e8d86","amp;dn":"Illinois+Jacquet+-+1978+-+God+Bless+My+Solo+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90b12326b5d3c337603d739218cf60566e2e8d86","infoHashBuffer":{"type":"Buffer","data":[144,177,35,38,181,211,195,55,96,61,115,146,24,207,96,86,110,46,141,134]},"announce":[],"urlList":[]}}