{"title":"Grand Theft Auto 3 (Clean CD RIP)","uid":6148096,"size":465746272,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9122d3d6c4798b614d8649c1b45b27138c251c93&amp;dn=Grand+Theft+Auto+3+%28Clean+CD+RIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"61stylo","files":2,"time":1296767596,"description":"GRAND THEFT AUTO III\n\nWelcome to Liberty City , where the only dirty word is hope.\n\nYou've been betrayed and left for dead. Now you're taking revenge, unless the city gets you first. Mob bosses need a favor, crooked cops need help and street gangs want you dead. You'll have to rob, steal and kill just to stay out of serious trouble. Anything can happen out here.\n\nFeaturing a fully 3-D living city, a combination of narrative driven and non-linear gameplay and a completely open environment, Grand Theft Auto III represents a huge leap forward in interactive entertainment. For the first time, players are put at the heart of their very own gangster movie, and let loose in a fully-realised 3 dimensional city, in which anything can happen and probably will.\n\nWith a cast of hundreds, 50 plus vehicles, ranging from sports cars to ice cream trucks and from boats to buses, 3 hours of music, including opera, reggae, house, drum and bass, pop and disco, a huge array of street ready weapons and some of the seediest characters in video game history, Grand Theft Auto 3 is a sprawling epic which will show you that sometimes, crime can pay and sometimes it can pay you back.\n\n","torrent":{"xt":"urn:btih:9122d3d6c4798b614d8649c1b45b27138c251c93","amp;dn":"Grand+Theft+Auto+3+%28Clean+CD+RIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9122d3d6c4798b614d8649c1b45b27138c251c93","infoHashBuffer":{"type":"Buffer","data":[145,34,211,214,196,121,139,97,77,134,73,193,180,91,39,19,140,37,28,147]},"announce":[],"urlList":[]}}