{"title":"League of Denial: The NFL, Concussions and the - Audiobook MP3","uid":10363146,"size":423920264,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:91526bb00cbd3328ea51fb788ed7fbe581748043&amp;dn=League+of+Denial%3A+The+NFL%2C+Concussions+and+the+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1402839726,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nLeague of Denial: The NFL, Concussions and the Battle for Truth\n\nWritten by: Mark Fainaru-Wada, Steve Fainaru\nNarrated by: David H. Lawrence XVII\nLength: 14 hrs and 46 mins\nFormat: Unabridged\nRelease Date:10-08-13\nPublisher: Random House Audio\nProgram Type: Audiobook\n\n&quot;Professional football players do not sustain frequent repetitive blows to the brain on a regular basis.&quot;\n\nSo concluded the National Football League in a December 2005 scientific paper on concussions in America's most popular sport. That judgment, implausible even to a casual fan, also contradicted the opinion of a growing cadre of neuroscientists who worked in vain to convince the NFL that it was facing a deadly new scourge: A chronic brain disease that was driving an alarming number of players - including some of the all-time greats - to madness.\n\nLeague of Denial reveals how the NFL, over a period of nearly two decades, sought to cover up and deny mounting evidence of the connection between football and brain damage.\n\nComprehensively, and for the first time, award-winning ESPN investigative reporters Mark Fainaru-Wada and Steve Fainaru tell the story of a public health crisis that emerged from the playing fields of our 21st century pastime. Everyone knew that football is violent and dangerous. But what the players who built the NFL into a $10 billion industry didn't know - and what the league sought to shield from them - is that no amount of padding could protect the human brain from the force generated by modern football; that the very essence of the game could be exposing these players to brain damage.\n\nIn a fast-paced narrative that moves between the NFL trenches, America's research labs and the boardrooms where the NFL went to war against science, League of Denial examines how the league used its power and resources to attack independent scientists and elevate its own flawed research - a campaign with echoes of Big Tobacco's fight to deny the connection between smoking and lung cancer. It chronicles the tragic fates of players like Hall of Fame Pittsburgh Steelers center Mike Webster, who was so disturbed at the time of his death he fantasized about shooting NFL executives; and former Chargers great Junior Seau, whose diseased brain became the target of an unseemly scientific battle between researchers and the NFL. Based on exclusive interviews, previously undisclosed documents and private emails, this is the story of what the NFL knew and when it knew it - questions at the heart of crisis that threatens football, from the highest levels all the way down to Pop Warner. ","torrent":{"xt":"urn:btih:91526bb00cbd3328ea51fb788ed7fbe581748043","amp;dn":"League+of+Denial%3A+The+NFL%2C+Concussions+and+the+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91526bb00cbd3328ea51fb788ed7fbe581748043","infoHashBuffer":{"type":"Buffer","data":[145,82,107,176,12,189,51,40,234,81,251,120,142,215,251,229,129,116,128,67]},"announce":[],"urlList":[]}}