{"title":"The Anthony Cumia Show 2015-04-22 Kevin Pollak Doug Stanhope","uid":11838960,"size":276149748,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:921796dd9c949fe45989d4d0b5d3e1e7ee8e00bd&amp;dn=The+Anthony+Cumia+Show+2015-04-22+Kevin+Pollak+Doug+Stanhope+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mothergoose58","files":2,"time":1429807242,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Kevin Pollak, Doug Stanhope\n\nEpisode 150 - Anthony is joined by Kevin Pollak via Skype to chat about his movie &quot;Misery Loves Comedy&quot;, the cameos in the film, stand-up feeling like a drug, embracing the bomb, enjoying your friends bomb, getting a handle on your misery, and the ultimate message of his movie. Ant then talks about Arnold Schwarzenegger and his waxy face on Opie and Jimmy this morning, we hear from a few callers, go through some fast-food news involving a McDonalds's employee &quot;tampering&quot; with food, a shooting over bacon, and a war of words at Burger King. We see a video of a convenient store's ignored tussle, a drunken bikini wearing granny, Bill Nye celebrating Earth Day with Obama, Anthony talks about the hypocrisy of climate change believers, tells us his beef with the earth, we learn Doug Stanhope's beef with climate change, and Ant tells us his thoughts on fracking. We watch a &quot;harrowing&quot; CNN video, a nosy neighbor recording a woman recording the cops, have some drone chat, some Ginsu knife chat, hear about the documentary Dear Zachary, see a picture of the Boston bomber flipping the ol' bird, we're treated to &quot;The Prancing Elites Project&quot;, and in celebrity news, we (barely) see a picture of Bruce Jenner. Doug Stanhope calls in to discuss his Voice of America video, climate change, third world countries having babies, the insincerity of supporters, and Doug reminds us to spay and neuter your people. We go through a few Stanhope Yelp reviews, talk about Amy Schumer's career blowing up, school districts calling for early interventions on violence, the uprise of &quot;caught on video&quot; school fights, and Ant addresses what he feels the problem is with it all.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:921796dd9c949fe45989d4d0b5d3e1e7ee8e00bd","amp;dn":"The+Anthony+Cumia+Show+2015-04-22+Kevin+Pollak+Doug+Stanhope+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921796dd9c949fe45989d4d0b5d3e1e7ee8e00bd","infoHashBuffer":{"type":"Buffer","data":[146,23,150,221,156,148,159,228,89,137,212,208,181,211,225,231,238,142,0,189]},"announce":[],"urlList":[]}}