{"title":"GetRight_Pro_Portable_6.3e_En-Fr.zip","uid":4503811,"size":5571387,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9260baf3d6572b49c6fee5f7be9b8c075dcbcdcf&amp;dn=GetRight_Pro_Portable_6.3e_En-Fr.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1226512491,"description":"\nPortable GetRight Professional v6.3e\nGetRight is a Download Manager program to help you download files from the Internet. GetRight works with your web browser to help you download files from the internet. GetRight improves your file downloading with resuming of broken downloads, easy error recovery, download acceleration, and many other features to give you faster, easier, and more flexible downloads. GetRight can Accelerate (Segment) a download and get different pieces of it from different servers at the same time, which can increase your download speed dramatically.\n\nYou can use GetRight to schedule your downloads for later; it can dial your modem at the set time, download the files you want, then hang up or even shut down your computer when done. GetRight has several features to get you faster downloads; it can use Mirror searching to find other places where a file may be downloaded--then switch between all the download sites transparently to ensure that you use the best one. And many more features-to many to list here! GetRight contains absolutely no extra advertising add-ons or advertising systems!GetRight will not (and never has) send us any personal information about you or your computer without your knowledge.\n\n\n\nFeatures:\n\nGetRightÃ‚Â® Pro Features :\n* Downloading Files\n* Scheduling\n* Dial/Hangup Modem\n* History of your Downloads\n* Uploading Files\n* History of your Uploads\n* File Synchronizing (Up &amp; Down)\n* Browse FTP/Web Servers\n* More commands in GetRight Browser- Upload/Rename/Delete files, Upload/Rename/Create/Delete folders\n* Scripting Language - add uploads and downloads, dial your modem, etc. Allows scripting of all major features in GetRight Pro\n* &quot;Client/Server&quot; mode - have one computer on your network do all downloads\n* Global Speed Limit Controls for Total Speed of All Files\n* Speed Limit Controls for Individual Files\n* Use Scripts to Set the Speed Limit - create any sort of fancy Limit schedules you desire\n* Automatic MD5 file verification when download is done\n* Act as a Proxy Server - let programs that auto-update or download data (such as virus scanner updates) take advantage of GetRight&amp;#039;s resuming, dialing, etc.\n* BitTorrent Downloads - download files using the BitTorrent protocol.\n* Web Access - control GetRight running on your computer from anywhere\n\nMajor Changes in GetRight Pro 6 :\n- Added support for BitTorrent downloads.\n- Added Podcast Downloader to automate downloading files in a RSS feed.\n- Added ability to pick a playlist (from iTunes or Windows Media Player) so when a download is completed, it&amp;#039;s automatically added to the playlist. This is part of the Podcast Downloader too, so it can automatically put files from a podcast source into the playlist you choose.\n- Totally redone graphics and logos.\n- Added support for FTPS downloads (both explicit ftps:// and implicit on port 990).\n- Added support for MD5 and SHA1 checksums to verify files.\n- Added a Language configuration item, to make it easy to use translations.\n- Added File Compare to the download status history mode, so can compare the size/date for a file you downloaded to the current file on the server.\n- Lots and lots of changes, fixes, and improvements.\n- Works on all versions of Windows: Vista, XP, 2000, NT, ME, 98, &amp; 95\n\n\nScanned with Kaspersky - Clean\n\nFor more proper up&amp;#039;s\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/mcfilthynasty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/mcfilthynasty&lt;/a&gt;\n\nEnjoy\n","torrent":{"xt":"urn:btih:9260baf3d6572b49c6fee5f7be9b8c075dcbcdcf","amp;dn":"GetRight_Pro_Portable_6.3e_En-Fr.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9260baf3d6572b49c6fee5f7be9b8c075dcbcdcf","infoHashBuffer":{"type":"Buffer","data":[146,96,186,243,214,87,43,73,198,254,229,247,190,155,140,7,93,203,205,207]},"announce":[],"urlList":[]}}