{"title":"Quincy Jones - The Dude [FLAC]","uid":4372244,"size":263836780,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:926d72d76c02ae72cf795e5b6335d34af1b29c3e&amp;dn=Quincy+Jones+-+The+Dude+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"downup","files":9,"time":1220222813,"description":"Review\tby Richard S. Ginell\n\nNow running his own Qwest label and a thousand other things, Quincy Jones still owed one more album to A&amp;M -- and he gave them a blockbuster, one that reached number ten, yielded three hit pop singles and made a star out of soul balladeer James Ingram. &quot;Ai No Corrida,&quot; and the leadoff track, is the Quincy Jones hit method par excellence -- great pacing, superb sound, a catchy tune, a hot Ernie Watts tenor sax solo and you can dance to it, too. Stevie Wonder's irresistible synthesizer hooks lift his &quot;Betcha Wouldn't Hurt Me,&quot; and Q and omnipresent composer Rod Temperton are far-seeing enough on the title track to anticipate the rise of rap. But where does all of this pop wizardry, soon to assume mythic dimensions on Michael Jackson's Thriller, leave the jazz listener? Yes, Quincy has thought of you too, however briefly, on Ivan Lins' wistful &quot;Velas,&quot; where perennial house jazzer Toots Thielemans eloquently returns, taping his part in Belgium. Obviously, though, the main purpose here is to make hit pop singles, and The Dude does a pretty good job of that.\n\nRip has been made by Sound Juicer version 2.22.0.\nEncoding has been executed by FLAC version 1.2.1.\n","torrent":{"xt":"urn:btih:926d72d76c02ae72cf795e5b6335d34af1b29c3e","amp;dn":"Quincy+Jones+-+The+Dude+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"926d72d76c02ae72cf795e5b6335d34af1b29c3e","infoHashBuffer":{"type":"Buffer","data":[146,109,114,215,108,2,174,114,207,121,94,91,99,53,211,74,241,178,156,62]},"announce":[],"urlList":[]}}