{"title":"The Brady Girls Get Married &amp; The Brady Brides (Brady Bunch)","uid":10352880,"size":7157887338,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:92d33c64413b2701470a09095671112f6161625d&amp;dn=The+Brady+Girls+Get+Married+%26amp%3B+The+Brady+Brides+%28Brady+Bunch%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":6,"uploader":"Tripower57","files":8,"time":1402697214,"description":"It took me forever to track these down, I ended-up having to buy them from a bootlegger... now they are yours for free.\n\n\n\nThe Brady Girls Get Married / The Brady Brides\n\nA TV reunion movie called The Brady Girls Get Married was produced in 1981. TV Guide indicated the movie would be shown in one evening, but at the last minute NBC divided it into half-hour segments and showed one part a week for three weeks, and the fourth week debuted a spin-off sitcom, titled The Brady Brides. The reunion movie featured the entire original cast; this would prove to be the only time the entire cast worked together on a single project following the cancellation of the original series. The movie's opening credits featured the season one &quot;Grid&quot; and theme song, with the addition of the &quot;Brady Girls Get Married&quot; title.[28] The movie shows what the characters had been doing since the original series ended: Mike is still an architect, Carol is a real estate agent, Marcia is a fashion designer, Jan is also an architect, Greg is a doctor, Peter is in the Air Force, Bobby and Cindy are in college, and Alice has married Sam. Eventually they all reunite to see Marcia and Jan both marry in a double wedding.\n\nThe Brady Brides series features Maureen McCormick (Marcia) and Eve Plumb (Jan) in regular roles. The series begins with Marcia, Jan, and their new husbands buying a house and living together. The clashes between Jan's uptight husband, Phillip Covington III (a college professor in science who is several years older than Jan, played by Ron Kuhlman), and Marcia's slovenly husband, Wally Logan (a fun-loving salesman for a large toy company, played by Jerry Houser), were the pivot on which many of the stories were based, not unlike The Odd Couple. Ten episodes were aired before the sitcom was cancelled. This was the only Brady show in sitcom form to be filmed in front of a live studio audience. Bob Eubanks guest-starred as himself in an episode where the two couples appear on The Newlywed Game.\n\n","torrent":{"xt":"urn:btih:92d33c64413b2701470a09095671112f6161625d","amp;dn":"The+Brady+Girls+Get+Married+%26amp%3B+The+Brady+Brides+%28Brady+Bunch%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d33c64413b2701470a09095671112f6161625d","infoHashBuffer":{"type":"Buffer","data":[146,211,60,100,65,59,39,1,71,10,9,9,86,113,17,47,97,97,98,93]},"announce":[],"urlList":[]}}