{"title":"Winds of Salem - A Witches of East End Novel - Melissa de La Cru","uid":8962553,"size":582278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92fb639f2b3d2d09d58922f0c80c93be6412c8f9&amp;dn=Winds+of+Salem+-+A+Witches+of+East+End+Novel+-+Melissa+de+La+Cru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1380146809,"description":"Modern-day witch Freya Beauchamp is cast back in time to 1692 amongst the Salem Witch Trials by an enemy spell, as her present-day family attempts to reopen the passages of time to bring her home.\nSOON TO BE A LIFETIME TELEVISION SERIES!\nFreya Beauchamp is trapped in 1692, in Salem of all places, with no recollection of her past. A powerful enemy spell has sent her spiraling away so that she is separated by centuries from her mother, Joanna, and sister, Ingrid. This is not good news for a twenty-first-century witch. Not to mention the immediate threat she faces from the wealthy and influential Putnam family. When little Annie Putnam is one of the first to make accusations of witchcraft, her landowner father jumps at the opportunity to consolidate his power and expand his holdings in Puritan Salem Town. If Freya is caught using magic, she will be forced to relive the witch trials, and this time, even her immortality is in question.\n\nMeanwhile, twenty-first-century North Hampton has its own snares. Joanna and Norm consult the Oracle for advice, and Freddie and his pixie allies search for a missing totem that could reopen the passages of time and help bring his sister home. When Ingrid bumps into an old flame, she finds that her new love for Detective Matt Noble is in doubt.\n\nMoving between past and present, Winds of Salem's dizzying plot twists and page-turning suspense is sure to bewitch fans old and new.","torrent":{"xt":"urn:btih:92fb639f2b3d2d09d58922f0c80c93be6412c8f9","amp;dn":"Winds+of+Salem+-+A+Witches+of+East+End+Novel+-+Melissa+de+La+Cru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92fb639f2b3d2d09d58922f0c80c93be6412c8f9","infoHashBuffer":{"type":"Buffer","data":[146,251,99,159,43,61,45,9,213,137,34,240,200,12,147,190,100,18,200,249]},"announce":[],"urlList":[]}}