{"title":"The Answer - New Horizon (2013) [FLAC]","uid":8988182,"size":374026371,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:934c5e46660836592bc9c5489248e587494d5ee1&amp;dn=The+Answer+-+New+Horizon+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1380727835,"description":"\n  The Answer - New Horizon (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Hard Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 New Horizon\n  02 Leave With Nothin' \n  03 Spectacular \n  04 Speak Now \n  05 Somebody Else \n  06 Concrete \n  07 Call Yourself a Friend \n  08 Baby Kill Me \n  09 Burn You Down \n  10 Scream a Louder Love \n\n  Bonus\n\n  11 Road Less Travelled \n  12 Feel The Fear \n  13 Real As It Gets \n\n\n  Blues-influenced hard rock band the Answer first came together in 2000 when guitarist Paul Mahon, then 18 years old and living in Northern Ireland, decided to put together a group with the help of a friend, bassist Micky Waters. Waters was already a veteran of the Belfast club circuit, having played in several cover bands, and Mahon had been given a crash course in the nuts and bolts of the music business by his father, who played trumpet in a long-running Irish show band. Mahon recruited James Heatley to play drums, Cormac Neeson signed on as lead singer, and the Answer were born. After several months of rehearsing and writing material, the Answer started playing live gigs in 2001, and in 2002 they landed a prestigious gig as the opening act at Ireland's Witness Festival. In 2005, the Answer signed a record deal with the U.K. branch of Albert Productions, and in June 2006 their first album, Rise, arrived in shops. Rise earned enthusiastic reviews in Kerrang! and Classic Rock and chalked up respectable sales in the U.K., while becoming a legitimate hit in Japan. After sharing bills with everyone from Deep Purple and Paul Rodgers to the Rolling Stones and the Who, the Answer reissued Rise in 2007 with a bonus disc including a handful of tracks the group had issued as download-only singles; a second full-length album was slated for subsequent release.\n\n  In 2008 they continued their busy schedule with shows at the Isle Wight Festival and opening for influential Australian rock outfit AC/DC on the European leg of their Black Ice world tour. Between the two they managed to retreat to L.A. and worked on sessions for their sophomore release, Everyday Demons, which came in 2009. They ended the year with a headline tour in the U.K., before they began work on their third album in early 2010. The following year the four-piece released a DVD of their live performances on tour with AC/DC titled 412 Days of Rock 'n' Roll, and swiftly followed it up with the studio album Revival. Their fourth record, New Horizon, was slated for release in 2013.","torrent":{"xt":"urn:btih:934c5e46660836592bc9c5489248e587494d5ee1","amp;dn":"The+Answer+-+New+Horizon+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"934c5e46660836592bc9c5489248e587494d5ee1","infoHashBuffer":{"type":"Buffer","data":[147,76,94,70,102,8,54,89,43,201,197,72,146,72,229,135,73,77,94,225]},"announce":[],"urlList":[]}}