{"title":"Fred Claus(2007)DVDRip.AC3(ENG)-DROCK","uid":6320147,"size":733128262,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9377b68d2127e058fb5a445789025668ec00640d&amp;dn=Fred+Claus%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1302921763,"description":"Santa's black-sheep brother gets a much-needed shot at redemption in this holiday comedy reuniting actor Vince Vaughn and director David Dobkin (Clay Pigeons, Wedding Crashers). It's not easy being the brother of a benevolent and beloved saint, and no one knows that better than Fred Claus (Vaughn). After struggling for years to live up to the example set by his younger sibling Nicholas (Paul Giamatti), Fred has finally given up. These days Fred is working as a repo man taken to stealing the items he repossesses, and his shady tactics have just landed him in jail. While Mrs. Claus vehemently insists that Fred fend for himself, Nicholas refuses to sit idly by as his brother rots in jail and agrees to set bail if Fred will repay the debt by coming to the North Pole and help make toys for the upcoming Christmas season. But Fred isn't nearly as productive as your average elf, and he's got quite an attitude to boot. With Christmas fast approaching and Fred threatening to sideline Nicholas' entire finely tuned operation, the brother that always struggled to get out from under his sibling's substantial shadow finds out just how far the patience of a saint can be pushed before jolly old Santa reaches his breaking point. \n\nRipped with Handbrake.\n\nLength: 1 Hour 55 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:9377b68d2127e058fb5a445789025668ec00640d","amp;dn":"Fred+Claus%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9377b68d2127e058fb5a445789025668ec00640d","infoHashBuffer":{"type":"Buffer","data":[147,119,182,141,33,39,224,88,251,90,68,87,137,2,86,104,236,0,100,13]},"announce":[],"urlList":[]}}