{"title":"Provenance- How a Con Man and a Forger Rewrote the History of Mo","uid":11588869,"size":2749619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93ba1a10e830a002de8c073a6d648303d285d929&amp;dn=Provenance-+How+a+Con+Man+and+a+Forger+Rewrote+the+History+of+Mo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1417206230,"description":"A tautly paced investigation of one the 20th century's most audacious art frauds, which generated hundreds of forgeries-many of them still hanging in prominent museums and private collections today\n\nProvenance is the extraordinary narrative of one of the most far-reaching and elaborate deceptions in art history. Investigative reporters Laney Salisbury and Aly Sujo brilliantly recount the tale of a great con man and unforgettable villain, John Drewe, and his sometimes unwitting accomplices.\n\nChief among those was the struggling artist John Myatt, a vulnerable single father who was manipulated by Drewe into becoming a prolific art forger. Once Myatt had painted the pieces, the real fraud began. Drewe managed to infiltrate the archives of the upper echelons of the British art world in order to fake the provenance of Myatt's forged pieces, hoping to irrevocably legitimize the fakes while effectively rewriting art history.\n\nThe story stretches from London to Paris to New York, from tony Manhattan art galleries to the esteemed Giacometti and Dubuffet associations, to the archives at the Tate Gallery. This enormous swindle resulted in the introduction of at least two hundred forged paintings, some of them breathtakingly good and most of them selling for hundreds of thousands of dollars. Many of these fakes are still out in the world, considered genuine and hung prominently in private houses, large galleries, and prestigious museums. And the sacred archives, undermined by John Drewe, remain tainted to this day.\n\nProvenance reads like a well-plotted thriller, filled with unforgettable characters and told at a breakneck pace. But this is most certainly not fiction; Provenance is the meticulously researched and captivating account of one of the greatest cons in the history of art forgery","torrent":{"xt":"urn:btih:93ba1a10e830a002de8c073a6d648303d285d929","amp;dn":"Provenance-+How+a+Con+Man+and+a+Forger+Rewrote+the+History+of+Mo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ba1a10e830a002de8c073a6d648303d285d929","infoHashBuffer":{"type":"Buffer","data":[147,186,26,16,232,48,160,2,222,140,7,58,109,100,131,3,210,133,217,41]},"announce":[],"urlList":[]}}