{"title":"AUSTRALIAN MOVIE-Danny Deckchair (2003)","uid":10086894,"size":734726302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93fdcc35395b0178e82ea1d0953f8c9dcaa62fa7&amp;dn=AUSTRALIAN+MOVIE-Danny+Deckchair+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AussieGirl21","files":2,"time":1399075398,"description":"AUSTRALIAN MOVIE\n\nDanny Deckchair (2003)\n\nBased on a true story, the tale of a cement truck driver named Danny, whose long awaited vacation is cancelled thanks to his scheming girlfriend, Trudy. Danny escapes his grim life in suburban Australia and blasts into the skies in a chair tied with helium balloons. A mighty thunderstorm blows him clean off the map, and spits him out far away over the lush green town of Clarence. In this new town, he rockets into the world of Glenda, the town's only parking cop. While the media back home becomes obsessed with the story of his disappearance, Danny gets to reinvent himself in this new town, and in his great adventure, he discovers a true soulmate in Glenda. Fate catches up with him eventually, as Danny's true identity is revealed and Trudy--now a tabloid celebrity--comes to the idyllic town to claim Danny and drag him back to Sydney. Danny, however, is a changed man; he's discovered what it means to be happy and has found a new self-worth. Saying farewell to Trudy, Danny makes a dynamic re-entry to the town of Clarence--determined to win Glenda back again and embrace his newfound zest for life. \nDirected by  Jeff Balsmeyer. Starring  Rhys Ifans, Miranda Otto, Justine Clarke\n\nEnglish sub-title file included in torrent courtesy of AllSubs.org\n\nPlease seed","torrent":{"xt":"urn:btih:93fdcc35395b0178e82ea1d0953f8c9dcaa62fa7","amp;dn":"AUSTRALIAN+MOVIE-Danny+Deckchair+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93fdcc35395b0178e82ea1d0953f8c9dcaa62fa7","infoHashBuffer":{"type":"Buffer","data":[147,253,204,53,57,91,1,120,232,46,161,208,149,63,140,157,202,166,47,167]},"announce":[],"urlList":[]}}