{"title":"Processing: A Programming Handbook (incl. examples)","uid":5035001,"size":28808097,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9513d6525520c5328c04d85ae2bc1e81115e1fb3&amp;dn=Processing%3A+A+Programming+Handbook+%28incl.+examples%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"EdoDodo","files":-1,"time":1249076272,"description":"##### Official Book Description #####\n\nIt has been more than twenty years since desktop publishing reinvented design, and it's clear that there is a growing need for designers and artists to learn programming skills to fill the widening gap between their ideas and the capability of their purchased software.\n\nThis book is an introduction to the concepts of computer programming within the context of the visual arts. It offers a comprehensive reference and text for Processing (www.processing.org), an open-source programming language that can be used by students, artists, designers, architects, researchers, and anyone who wants to program images, animation, and interactivity.\n\nThe ideas in Processing have been tested in classrooms, workshops, and arts institutions, including UCLA, Carnegie Mellon, New York University, and Harvard University. Tutorial units make up the bulk of the book and introduce the syntax and concepts of software (including variables, functions, and object-oriented programming), cover such topics as photography and drawing in relation to software, and feature many short, prototypical example programs with related images and explanations.\n\nMore advanced professional projects from such domains as animation, performance, and typography are discussed in interviews with their creators. &quot;Extensions&quot; present concise introductions to further areas of investigation, including computer vision, sound, and electronics. Appendixes, references to other material, and a glossary contain additional technical details. Processing can be used by reading each unit in order, or by following each category from the beginning of the book to the end. The Processing software and all of the code presented can be downloaded and run for future exploration.\n\n\n\n##### Notes #####\n\nThis is an eBook version of Processing: A Programming Handbook, it is fully OCR'ed (meaning all of the text can be copied and searched), and the pages have been properly numbered to match those of the print edition. I have also included all of the examples in the book (I put them in a zip file instead of leaving them uncompressed like I usually do because they are a lot bigger).\n\nThis book is good for programmers and non-programmers alike who want to learn how to use Processing, a programming language based on Java aimed at making visual design easier.\n\nIf you are interested in Processing I have also uploaded another book on it, &quot;Visualizing Data&quot;, you can find it here:\nhttp://thepiratebay.se/torrent/5034808/\n\nPlease seed this as long as possible after downloading as my Internet connection is very slow and I will not be able to seed at very fast speeds.\n\nIf you liked my upload don't forget to say thank you :).","torrent":{"xt":"urn:btih:9513d6525520c5328c04d85ae2bc1e81115e1fb3","amp;dn":"Processing%3A+A+Programming+Handbook+%28incl.+examples%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9513d6525520c5328c04d85ae2bc1e81115e1fb3","infoHashBuffer":{"type":"Buffer","data":[149,19,214,82,85,32,197,50,140,4,216,90,226,188,30,129,17,94,31,179]},"announce":[],"urlList":[]}}