{"title":"Massive Attack - Blue Lines [24 bit FLAC] vinyl","uid":8113432,"size":939856719,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:951e8eafb37eb2d49b8abb4c7591dff40e3a59a2&amp;dn=Massive+Attack+-+Blue+Lines+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"24.96","files":-1,"time":1360242962,"description":"The first masterpiece of what was only termed trip-hop much later, Blue Lines filtered American hip-hop through the lens of British club culture, a stylish, nocturnal sense of scene that encompassed music from rare groove to dub to dance. The album balances dark, diva-led club jams along the lines of Soul II Soul with some of the best British rap (vocals and production) heard up to that point, occasionally on the same track. The opener &quot;Safe from Harm&quot; is the best example, with diva vocalist Shara Nelson trading off lines with the group's own monotone (yet effective) rapping. Even more than hip-hop or dance, however, dub is the big touchstone on Blue Lines. Most of the productions aren't quite as earthy as you'd expect, but the influence is palpable in the atmospherics of the songs, like the faraway electric piano on &quot;One Love&quot; (with beautiful vocals from the near-legendary Horace Andy). One track, &quot;Five Man Army,&quot; makes the dub inspiration explicit, with a clattering percussion line, moderate reverb on the guitar and drums, and Andy's exquisite falsetto flitting over the chorus. Blue Lines isn't all darkness, either -- &quot;Be Thankful for What You've Got&quot; is quite close to the smooth soul tune conjured by its title, and &quot;Unfinished Sympathy&quot; -- the group's first classic production -- is a tremendously moving fusion of up-tempo hip-hop and dancefloor jam with slow-moving, syrupy strings. Flaunting both their range and their tremendously evocative productions, Massive Attack recorded one of the best dance albums of all time.","torrent":{"xt":"urn:btih:951e8eafb37eb2d49b8abb4c7591dff40e3a59a2","amp;dn":"Massive+Attack+-+Blue+Lines+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"951e8eafb37eb2d49b8abb4c7591dff40e3a59a2","infoHashBuffer":{"type":"Buffer","data":[149,30,142,175,179,126,178,212,155,138,187,76,117,145,223,244,14,58,89,162]},"announce":[],"urlList":[]}}