{"title":"Prisoners (2013)","uid":9858546,"size":1035295021,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:953615d064ec40baf4069e5c400d04820b53af11&amp;dn=Prisoners+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"leoamaro","files":2,"time":1396255084,"description":"Prisoners is a 2013 American thriller film directed by Denis Villeneuve. The film has an ensemble cast including Hugh Jackman, Jake Gyllenhaal, Viola Davis, Maria Bello, Terrence Howard, with Melissa Leo, and Paul Dano. The plot focuses on the abduction of two young girls in Pennsylvania and the search to find them. The film was nominated for an Academy Award for Best Cinematography.\n\nKeller Dover (Hugh Jackman) and his family attend a Thanksgiving dinner at the house of their neighbors, Franklin and Nancy Birch; that afternoon, both families' young daughters, Anna Dover and Joy Birch, go missing. A police hunt finds an RV which had been parked outside the house. Detective David Loki (Jake Gyllenhaal) tries to confront the driver, Alex Jones (Paul Dano), who attempts to escape and is arrested.\nLoki discovers a corpse in the basement of a local priest, who says he killed the man because in confession he claimed to be &quot;waging a war against God&quot; , had killed 16 children and planned to kill again.\nAlex Jones is found to be developmentally disabled, having the IQ of a ten-year-old. After hours of aggressive questioning, the police cannot link him to the missing girls and release him. Dover attacks Jones as he is released and Jones whispers to him &quot;They didn't cry until I left them.&quot; No one else hears these words. Dover abducts and imprisons Jones in an abandoned apartment building, where he tortures him for days without obtaining any further information.\nDuring a candlelight vigil for the girls, Loki sees a hooded man acting suspiciously. When Loki approaches the man, he runs away. Both girls' houses are broken into, apparently by the same man, whom Loki now considers a suspect. A clerk at a local store reports the man has been buying children's clothing in varied sizes. This suspect, Bob Taylor (David Dastmalchian), is arrested at his home, where the walls are covered in drawings of mazes. In a back room, Loki finds crates filled with maze books, live snakes, and bloodied children's clothing. The Birches and Dover positively identify some of the items of clothing as belonging to their daughters. Detained, Taylor confesses to the abduction, but before giving any more information, he seizes one of the officers' handguns and kills himself.\nDover continues to torture Jones, who says he is not Alex Jones, and that he escaped from a maze. Dover visits Jones's aunt, Holly (Melissa Leo), and brings up the topic of mazes, but Holly only says Jones does not talk much since an accident involving snakes when he was young. She tells him that she and her husband were religious until their son died of cancer at a young age.\nThe blood on the children's clothes is found to be pig's blood. The police conclude that Taylor was abducted as a child and had been play-acting recreations of abductions using a true-crime book that involves unsolvable mazes. He had stolen the children's clothing linked to the girls' disappearance during the break-ins, and Taylor had no involvement in the abductions.\nDays later, Joy Birch is found having escaped, but Anna is still missing. When Dover visits Joy in the hospital to ask for information, she mumbles &quot;You were there.&quot; Dover runs off, believing he now knows where his daughter is. Loki pursues him, expecting to find Dover at his apartment house. Alone he explores the building.\nDover had actually gone to Jones' house, realizing that Joy had overheard him there. At the Jones' house, Holly invites him in and pulls a gun on him, revealing that she alone was responsible for the recent abductions. She and her husband had abducted many other children as part of their own particular &quot;war on God&quot; for letting their young son Alex die of cancer. The man now known as Alex was the first child they abducted, followed later by Bob Taylor, and they were probably the only two whom they did not murder. Holly shoots and imprisons Dover in a pit under an old car in her yard. There he finds a whistle that belonged to his daughter.\nLoki goes to Holly's house to tell her that Jones has been found. There is no answer at the door but he hears someone inside and enters. He sees a photograph of Holly's husband wearing the maze pendant found on the body in the priest's basement, Loki draws his weapon and searches the house. Holly is bent over Anna's body on the floor of a back room, injecting something into her arm. Loki approaches her from behind and orders her to stand. She spins and shoots, wounding him, as he returns fire and kills her. Loki rushes Anna to the hospital, where she soon recovers. Jones is reunited with his real parents.\nOutside the Holly's house, a police team stops digging for the night. They tell Loki their work will take weeks because the ground is frozen and leave. Alone, Loki hears a faint whistle sound and listening carefully hears it a few more times, puzzled and hesitating, slowly turning in its direction toward a car a few yards from the house as the screen cuts to black.","torrent":{"xt":"urn:btih:953615d064ec40baf4069e5c400d04820b53af11","amp;dn":"Prisoners+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953615d064ec40baf4069e5c400d04820b53af11","infoHashBuffer":{"type":"Buffer","data":[149,54,21,208,100,236,64,186,244,6,158,92,64,13,4,130,11,83,175,17]},"announce":[],"urlList":[]}}