{"title":"Sexually Broken------ Casey Calvert  Darling  Matt Williams MP4","uid":8186627,"size":1503387732,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:962b1177d992b1232e60e17c6aed14dbe0750e38&amp;dn=Sexually+Broken%5C------+Casey+Calvert++Darling++Matt+Williams+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1361737814,"description":"Sexually BrokenAdorable Casey Calvert gets brutally fucked, bound and throated while Darling cums over and over!  Casey Calvert  Matt Williams MP4\n\n\nMP4 only.\n    \n \nToday we have an up and coming bondage legend, paired with a veteran of the bondage industry. Welcome Casey Calvert and Darling to Sexually Broken. Casey is cuter then a bag of kittens and as hot as the sun itself. She started out as a fetish model who made the transition to vanilla porn. Darling is a veteran of the bondage world but today you will see her like you rarely see her, getting skull fucked into subspace.\n\n Casey is bound and trapped in a cage looking on as we skull fuck Darling nice and slow. A vibrator is locked onto Darling's clit and she is cumming from the start, and never stops. We use Darling's mouth to get ready for Casey. Darling has been reduced to a glorified fluffer. Casey is the real target. \n\nAfter Darling's throat gets the cock hard as a rock, we pull cute little Casey out of the cage,toss her on the bed, and immediately jam the hard wet cock balls deep into her shaved pussy. A sweet moan of pleasure escapes our bound and helpless Casey. We find out real fast that sweet, innocent looking Casey is a power slut who loves cock and bondage. \n\nWe punish Casey with cock. We fuck her pussy until she cums, then fuck her throat until she flashes. We never give Casey a chance, she is helpless, tossed around like a sex puppet. From throat to pussy to throat, no chance for her to get on top, just used for her holes, an object for us to derive pleasure from. \n\nDarling, still bound to the bed, still cumming, tries to see what is happening, wishing it was her getting all the cock. We pull Casey over to look on while we deep throat Darling. Casey now knows the the cock can fit all the way down a throat as Darling's hungry mouth takes it all the way. \n\nWe then hoist Casey in to a Category 3 suspension. We tie Casey's and Darling's necks together and pull 'til the rope is taut. Darling is still cumming like a whore from her vibrator, so we pull one out for Casey and make her cum like a common slut. We leave both girls struggling for air and helpless wishing the cock would cum back to abuse them further...\n \n \nScreens     &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_22ccalvert3/SexuallyBroken-Casey-Calvert-Darling-Matt-Williams-Adorable-Casey-Calvert-gets-brutally-fucked-bound-and-throated-while-Darling-cums-over-and-over.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_22ccalvert3/SexuallyBroken-Casey-Calvert-Darling-Matt-Williams-Adorable-Casey-Calvert-gets-brutally-fucked-bound-and-throated-while-Darling-cums-over-and-over.php&lt;/a&gt;\n\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\t\t","torrent":{"xt":"urn:btih:962b1177d992b1232e60e17c6aed14dbe0750e38","amp;dn":"Sexually+Broken%5C------+Casey+Calvert++Darling++Matt+Williams+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962b1177d992b1232e60e17c6aed14dbe0750e38","infoHashBuffer":{"type":"Buffer","data":[150,43,17,119,217,146,177,35,46,96,225,124,106,237,20,219,224,117,14,56]},"announce":[],"urlList":[]}}