{"title":"Vangelis - Chariots Of Fire (Remaster-CD ISO) [RePoPo]","uid":4245261,"size":444267296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96d43488a19d1cdecff06d06102a38418c7f145a&amp;dn=Vangelis+-+Chariots+Of+Fire+%28Remaster-CD+ISO%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"repopo","files":3,"time":1213754002,"description":"his is the soundtrack to Hugh Hudson&amp;#039;s Oscar winning film with the same title. The true story is about two contrasting British athletes who compete in the Olympic games in 1924. The catchy main theme and the stylishly contrasting understated sport action won Vangelis the prestigious Academy Award (tm), better known as the Oscar, for &quot;Best original score&quot;. He was unable to attend the ceremony in Los Angeles, so the statue was accepted by the Academy on Vangelis&amp;#039; behalf.\nAlmost all the music on the album are rerecorded versions, compared to the music found in the movie. The main titles, for instance, sound much richer and more gratuitous on the album. Other themes, like &quot;Five Circles&quot;, were totally rearranged. The film version of that track was piano dominated and sounded and developed rather differently.\nVangelis was accused of plagiarising the main theme from another Greek composer named Stavros Logarides, but a judge wisely decided it was an original composition in favor of Vangelis, when the matter was taken to court.\nThe album contains one track (Jerusalem) that was neither written nor performed by Vangelis.\nMobile Fidelity has released an ULTRADISC II version of this album. This means a digitally remastered version pressed as a 24KT goldplated CD (for durability) released only in limited quantities. It is hard to find, by now, but only interesting for collectors, because the sound quality was debatably worse than the original CD pressing.\nDuring the Olympic Games of 2000 in Sydney, another remastered version of Chariots of Fire was released by Polydor in the UK. It had updated artwork by original designer Alwyn Clayden and contained rarely seen pictures in the booklet. The sound, remastered by Vangelis himself indeed improved slightly over both the original CD and the Ultradisc versions, sounding more clear and warm.\nFinally, in 2006 Universal released another version, again remastered by Vangelis, to commemorate the soundtrack&amp;#039;s 25th anniversary. Sound quality is comparable to the previous Vangelis remaster.","torrent":{"xt":"urn:btih:96d43488a19d1cdecff06d06102a38418c7f145a","amp;dn":"Vangelis+-+Chariots+Of+Fire+%28Remaster-CD+ISO%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96d43488a19d1cdecff06d06102a38418c7f145a","infoHashBuffer":{"type":"Buffer","data":[150,212,52,136,161,157,28,222,207,240,109,6,16,42,56,65,140,127,20,90]},"announce":[],"urlList":[]}}