{"title":"Fuminori Nakamura-The Gun","uid":14403346,"size":88969507,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:981be6c07c72115ec0adcebf98e9afe0bcab6725&amp;dn=Fuminori+Nakamura-The+Gun&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twocows","files":21,"time":1461388182,"description":"The Gun\r\nFuminori Nakamura\r\n\r\n   The award-winning debut novel by Japanese noir master Fuminori Nakamura, translated into English for the first time. From the moment university student Nishikawa spots the gun next to the dead man he's stumbled across on a nighttime walk, the world around him blurs. The gun--loaded with four bullets--brings an intoxicating sense of excitement to his life. But soon merely possessing the gun is not enough. He must shoot it. Fuminori Nakamura's presence in the US has been steadily increasing since Soho's first publication of The Thief. A young, exciting Japanese author who has won Japan's prestigious ÅŒe Prize (The Thief), Akutagawa Prize (The Boy in the Earth) and Shincho Literary Prize (A Gun). Nakamura's books always get great review coverage. Praise for Fuminori Nakamura &quot;This slim, icy, outstanding thriller, reminiscent of Muriel Spark and Patricia Highsmith, should establish Fuminori Nakamura as one of the most interesting Japanese crime novelists at work today.&quot; --USA Today &quot;The Thief brings to mind Highsmith, Mishima and Doestoevsky . . . A chilling existential thriller leaving readers in doubt without making them feel in any way cheated.&quot; --The Wall Street Journal, Best Book of the Year Selection &quot;Crime fiction that pushes past the bounds of genre, occupying its own nightmare realm . . . For Nakamura, like [SeichÅ] Matsumoto, guilt or innocence is not the issue; we are corrupted, complicit, just by living in society. The ties that bind, in other words, are rules beyond our making.&quot; --Los Angeles Times Fuminori Nakamura was born in 1977 and graduated from Fukushima University in 2000. He has won numerous prizes for his writing, including the ÅŒe Prize, Japan's largest literary award, and the prestigious Akutagawa Prize. The Thief, his first novel to be translated into English, was a finalist for the Los Angeles TimesBook Prize. He is the recipient of the David L. Goodis Award for Noir Fiction. He lives in Tokyo with his wife","torrent":{"xt":"urn:btih:981be6c07c72115ec0adcebf98e9afe0bcab6725","amp;dn":"Fuminori+Nakamura-The+Gun","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"981be6c07c72115ec0adcebf98e9afe0bcab6725","infoHashBuffer":{"type":"Buffer","data":[152,27,230,192,124,114,17,94,192,173,206,191,152,233,175,224,188,171,103,37]},"announce":[],"urlList":[]}}