{"title":"Terence McKenna - Alien Dreamtime","uid":3299071,"size":334071808,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:9851cc5350bc60688f2554fccabbe3874f0745bc&amp;dn=Terence+McKenna+-+Alien+Dreamtime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"wee-man","files":1,"time":1110179814,"description":"\nAlien Dreamtime was a multi media event recorded live on February 26th/27th 1993 at the Transmission theater, San Francisco, Ca.\n\nArchaic Revival\nAllright... tonight, for your edification and amusement... three raves, two interregnums. Visions by Rose X. Didgeredoo, Stephen Kent. And sound by Space Time. Words and ideas by Terence McKenna. Rap one: The Archaic Revival.\n\nHistory is ending, because the dominator culture has led the human species into a blind alley. And as the inevitable chaostrophe approaches, people look for metaphors and answers. Every time a culture gets into trouble, it casts itself back into the past looking for the last sane moment it ever knew. And the last sane moment we ever knew was on the plains of Africa, 15,000 years ago, rocked in cradle of the great horned mushroom goddess before history. Before standing armies, before slavery and property, before warfare and phonetic alphabets and monotheism. Before, before, before. And this is where the future is taking us. Because the secret faith of the 20th century is not modernism. The secret faith of the 20th century is nostalgia for the archaic, nostalgia for the Paleolithic, and that gives us body piercing, abstract expressionism, surrealism, jazz, rock and roll, and Catastrophe Theory. The 20th century mind is nostalgic for the paradise that once existed on the mushroom-dotted plains of Africa, where the plant-human symbiosis occurred that pulled us out of the animal body and into the tool-using, culture-making, imagination-exploring creature that we are.\n\n\nFilesize.....: 318 MB (or 326,242 KB or 33,071,808 bytes)\nRuntime......: 00:59:04 (53,155 fr)\nVideo Codec..: DivX 4 (OpenDivX)\nVideo Bitrate: 397 kb/s\nAudio Codec..: adpcm (0x0002) Microsoft Corporation\nAudio Bitrate: 355 kb/s (177/ch, stereo)\nFrame Size...: 320x240 (1.33:1) [=4:3]\n","torrent":{"xt":"urn:btih:9851cc5350bc60688f2554fccabbe3874f0745bc","amp;dn":"Terence+McKenna+-+Alien+Dreamtime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9851cc5350bc60688f2554fccabbe3874f0745bc","infoHashBuffer":{"type":"Buffer","data":[152,81,204,83,80,188,96,104,143,37,84,252,202,187,227,135,79,7,69,188]},"announce":[],"urlList":[]}}