{"title":"Train Simulator 2014 (Steam Edition)(Easy Run)(Working)","uid":8977406,"size":1991541886,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:996b27232eed9fb4b1416e5b9bf0869cae86eb01&amp;dn=Train+Simulator+2014+%28Steam+Edition%29%28Easy+Run%29%28Working%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"The_Duck1","files":-1,"time":1380478912,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nTrain Simulator 2014 delivers everything you love about trains with the exhilaration\nof speed, stunning graphics, a variety of trains, real-world routes and challenging\nassignments. Whether you love driving trains, creating new routes or just watching the\nlandscape fly by, your journey starts with TS2014.\n\nTS2014 includes three stunning routes for you to enjoy. Experience the super-modern\nLondon-Faversham High Speed route, featuring the stunning London St Pancras Station and\nsleek, streamlined Southeastern Class 395; alternatively, take charge of a Dash 9 at the\nhead of a heavy freight train across the mountainous Donner Pass or the streamlined\nICE 2 through beautiful German countryside from Hamburg to Hanover.\n\nDrive: Embark on a fun and rewarding career as a train driver.\n\nExplore: Drive a wide variety of trains on iconic routes around the world.\n\nCreate: Easily build and share fantastic routes, and download more created by other players.\n\nCollect: Build your dream collection with a host of additional routes and trains.\n\nTrain Simulator 2014: Your Journey Starts Here\n\n******************************\n* Key Features: \n******************************\n* 16 Stunningly accurate locomotives with realistic sounds, controls and physics including\nSoutheastern Class 395, Southern Pacific Dash 9 and DB ICE 2\n* 3 Fantastic real-world routes including London-Faversham High Speed, Donner Pass and\nHamburg-Hanover\n* EXCLUSIVE Steam edition includes an additional seven mile 'Sheerness Branch' line in\nKent (London-Faversham High Speed) and two extra locos (Class 466 and SD70M)\n* Drive with Xbox 360 controller, keyboard or mouse\n* Integrated Steam Workshop free mission download centre\n* Enhanced graphics and performance\n* New Career System to score your driving, win achievements and join the global leader board\n* Quick Drive menu system: drive what you like, where you like\n* Access the Engine Driver community site in-game\n\nInstallation instructions:\n1. Execute the Train Simulator 2014 (Steam Edition)(2-click run).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:996b27232eed9fb4b1416e5b9bf0869cae86eb01","amp;dn":"Train+Simulator+2014+%28Steam+Edition%29%28Easy+Run%29%28Working%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"996b27232eed9fb4b1416e5b9bf0869cae86eb01","infoHashBuffer":{"type":"Buffer","data":[153,107,39,35,46,237,159,180,177,65,110,91,155,240,134,156,174,134,235,1]},"announce":[],"urlList":[]}}