{"title":"Tom Clancy's Rainbow Six (Full PS1 Collection) (PSX PS1)","uid":6181624,"size":430974440,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9ab22b6a10d1e8b27b20b1b809cb1764916e1da0&amp;dn=Tom+Clancy%5C%27s+Rainbow+Six+%28Full+PS1+Collection%29+%28PSX+PS1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FuCtUpPuNk","files":9,"time":1297974706,"description":"Use an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on all of the following links (go to whichever according to the site you trust or like) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n------------------------------------\n------------------------------------\n------------------------------------\n\nGAMEPLAY\nRainbow Six is a tactical shooter, which focuses more on stealth and tactics than on sheer firepower. To add to the realism, all in-game characters, terrorists, hostages and Rainbow operatives, can be wounded or dispatched in just fractions of a second. Tools such as thicker body armor, automatic rifles, and grenades have little value before the player grows accustomed to the gameplay.\n\nBefore each mission is a planning stage, during which the player is given a briefing, and then chooses the operatives to be involved in the mission, their weapons, equipment and uniform/camouflage. In earlier games, the player pre-established orders and waypoints during this step. The planning stage determined elements such as the path the AI-controlled squads would follow during the mission, as well as where they will deploy devices such as flashbangs or door breaching charges.\n\nSuccessful missions often last just minutes, but may require dozens of repetitions and planning changes (many more for beginners). During gameplay, the player controls only one team member directly, and can see stats for that member and all units on the Heads-Up Display. Teams not under player control follow the orders given to them in the planning stage. The player can take control of any living operative at will, making them the leader.\n\nThe game forms a campaign that is a series of scenarios, with the plot being advanced in the mission briefing of each scenario. Any casualties that occur during a mission are permanent, so the deceased cannot be used in future missions. Consequently, many players replay missions that are technically successful merely to reduce the number of casualties.\n\nOnline multiplayer gaming was popular on the Mplayer.com and Zone.com services and for a time featured a thriving competitive clan based community with numerous independent ladder style leagues.\n\nUnlike the other versions, the PlayStation version actually showed the gun being held in the player's hands.\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;\n\n(Note not all my torrents are on demonoid so go to one of the other links)\n\n\n(Note not all my torrents are onso go to one of the other links)","torrent":{"xt":"urn:btih:9ab22b6a10d1e8b27b20b1b809cb1764916e1da0","amp;dn":"Tom+Clancy%5C%27s+Rainbow+Six+%28Full+PS1+Collection%29+%28PSX+PS1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ab22b6a10d1e8b27b20b1b809cb1764916e1da0","infoHashBuffer":{"type":"Buffer","data":[154,178,43,106,16,209,232,178,123,32,177,184,9,203,23,100,145,110,29,160]},"announce":[],"urlList":[]}}