{"title":"Kriya - An ERP study -event-related brain potentials","uid":4356870,"size":499869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b158b3d20077c1c1217a9d14772b348b9271722&amp;dn=Kriya+-+An+ERP+study+-event-related+brain+potentials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"welovesrisri","files":1,"time":1219450871,"description":"Abstract\n\nThe present study examined differences in the event-related brain potentials (ERPs) of 24 long term Sudarshan Kriya meditators and 24 control subjects without prior experience in meditation, in their response to an emotional evocative task. The International Affective Picture System (IAPS) was used to examine emotional processing in the brain. Subjects also completed the Positive and Negative Affect Schedule (PANAS). In the 200-400 ms time window, group differences were found at central and parietooccipital brain regions, independent of ERP response to stimulus valence. The meditators showed higher overall ERP amplitude in these regions compared to the controls. In the 400-600 ms time window meditators showed greater ERP response to neutral pictures at prefrontal brain regions, compared to controls. A negativity bias was found in both groups and both time windows. Correlations between subjectsÃƒÂ¢?? PANAS scores and ERP amplitudes were found. The meditation group showed correlations at left, middle and right brain areas, while the control group showed correlations at left and middle brain areas, but not right brain areas. The present findings indicate an effect of meditation on brain responses, but not on emotional processing.\n\nIntroduction\n\nMeditation and yoga originate from Eastern culture and have been passed on to the West, where an increasing number of people practice variants of these techniques. Some people use meditation and/or yoga as a method for reducing stress, anxiety or against symptoms of depression (Pilkington, Kirkwood, Rampes &amp; Richardson, 2005; Brown &amp; Gerbarg, 2005). In general, meditation can be divided into two types: mindfulness and concentrative. Mindfulness based meditation is allowing all your thoughts, feelings and sensations to arise while staying aware of yourself and your location (Cahn &amp; Polich, 2006). Recent research has found that mindfulness meditation is associated with an increase in psychological well-being and a decrease in stress and mood disturbance (Brown &amp; Ryan, 2003). An example of mindfulness based meditation is Zen meditation. Concentrative meditation forms include focusing on a specific mental or sensory activity, such as a repeating sound, a mental imagery or the breath. Yogic meditation is a form of concentrative meditation (Cahn &amp; Polich, 2006). There are also techniques that include both forms of meditation. One of these techniques is Transcendental Meditation (TM), where practitioners focus on a repeated mantra and also try to get into a state of thought-free awareness (Cahn &amp; Polich, 2006). Another technique that includes both mindfulness and concentrative aspects is Sudarshan Kriya (SK) yoga. In SK, yogic breathing, yoga postures and meditation are combined. SK consists of three preparatory stages where different types of inhaling and exhaling and chanting are practiced. After these breathing stages the SK cyclical breathing technique starts and is followed by meditation and rest (Brown &amp; Gerbarg, 2005). SK meditation, the technique studied in the present research, is comparable with TM, where practitioners are guided into a state of thought-free awareness.","torrent":{"xt":"urn:btih:9b158b3d20077c1c1217a9d14772b348b9271722","amp;dn":"Kriya+-+An+ERP+study+-event-related+brain+potentials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b158b3d20077c1c1217a9d14772b348b9271722","infoHashBuffer":{"type":"Buffer","data":[155,21,139,61,32,7,124,28,18,23,169,209,71,114,179,72,185,39,23,34]},"announce":[],"urlList":[]}}