{"title":"Traffic Albums","uid":4660714,"size":2157234260,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b2f21f49d86d22c6fcd5a5e1c92c09546a45748&amp;dn=Traffic+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1232383593,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nTraffic was an English rock band formed in 1967 by Steve Winwood, Jim Capaldi, Chris Wood and Dave Mason. They began as a psychedelic rock group influenced by The Beatles when releasing early pop singles, and diversified their sound through the use of instruments such as keyboards, reed instruments, and by incorporating jazz and improvisational techniques in their music. \nAfter disbanding in 1969 during which time Winwood joined Blind Faith, Traffic reunited in 1970 to release the critically acclaimed album John Barleycorn Must Die. The band's line-up varied from this point until they disbanded again in 1975, although a partial reunion took place in 1994. \nTraffic's singer and keyboardist Steve Winwood experienced success as a musician prior to joining Traffic, becoming the frontman of the Spencer Davis Group at age 15 in 1963 . The Spencer Davis Group released four Top Ten singles and three Top Ten albums in the United Kingdom, as well as two Top Ten singles in the United States.[1] Winwood left that group in April 1967, and formed Traffic with drummer Jim Capaldi, guitarist Dave Mason and multi-instrumentalist Chris Wood, after playing together as musicians at a club called The Elbow Room in Aston, Birmingham.[2] Soon afterwards, Traffic's four members went to a cottage in Aston Tirrold, Berkshire to write and rehearse new music. \nTraffic signed to Chris Blackwell's Island Records label (of which Steve Winwood's elder brother Muff Winwood later became an executive) and their debut single &quot;Paper Sun&quot; was a UK hit in mid-1967. The second single, Mason's psych-pop classic &quot;Hole in My Shoe&quot;, was an even bigger hit, and it became one of their best-known tracks, but it set the stage for increasing friction between Winwood and Mason, the group's principal songwriters. The band's third single &quot;Here We Go Round the Mulberry Bush&quot; was made for the soundtrack of the 1967 British feature film of the same name.[1] Their debut album was Mr. Fantasy which, like the singles, was a hit in the UK but not as big in the US or elsewhere, although it did reach #88 and stayed on the charts for 22 weeks in the US.\nMason rejoined the band for their second album, Traffic, released in 1968. The band began touring the US in late 1968, which led to the following year's release of Traffic's next album Last Exit, with one side recorded live. In 1968 Winwood, Wood and Mason also contributed to the sessions for the landmark Jimi Hendrix double-album Electric Ladyland.\nWinwood, Wood and Capaldi quarreled with and eventually voted Mason out from the group. The remaining three members wanted take the group in a different, but still eclectic, direction musically. They wanted a folk/blues rather than an earlier psychadelic/melacholic sound. It was a gamble they capitalized with later.\nWinwood formed Blind Faith with Eric Clapton, Ginger Baker and Ric Grech which lasted less than a year. The remaining members of Traffic began a project with Mick Weaver, the short-lived Mason, Capaldi, Wood, and Frog, which played a few live dates and recorded some BBC sessions, but broke up before releasing any formal recordings. After the split of Blind Faith in 1969, Winwood began working on a solo recording which eventually turned into another Traffic album (without Mason), John Barleycorn Must Die, their most successful album yet.\nTraffic went on to expand its lineup in 1971 adding Ric Grech on bass, drummer Jim Gordon of Derek and the Dominos and percussionist Rebop Kwaku Baah. The live album Welcome to the Canteen was released in September and marked the band's break with United Artists Records. It did not bear the &quot;Traffic&quot; name on the cover, but instead was credited to the band's individual members including Dave Mason, returning for his third and final spell with the band. Mason played two songs from his recent solo album, Alone Together, and the album ended with a cover of the Spencer Davis Group song, &quot;Gimme' Some Lovin'.&quot;\nFollowing the departure of Mason, Traffic released The Low Spark of High Heeled Boys (Nov. 1971), which was a Top 10 American album but did not chart in the UK; the LP is also notable for its striking die-cut cover. Once again, however, personnel problems wracked the band as Capaldi began a solo career and Grech and Gordon left the band. They were replaced by drummer Roger Hawkins and bassist David Hood, the rhythm section of the famed Muscle Shoals Sound Studio house band.\nThe new lineup toured America in early 1972 to promote the LP, and their concert at the Santa Monica Civic Auditorium on 21 February was recorded in multitrack audio and captured on colour videotape with multiple cameras. The 64-minute performance, which features a selection of Traffic classics in excellent stereo sound, is thought to be the only extended live footage of the group. It was evidently not broadcast on television at the time, but was later released on home video and has recently been reissued on DVD.\nFollowing Winwood's recovery from a long case of peritonitis, Traffic's sixth studio album Shoot Out at the Fantasy Factory, recorded in 1973, was another hit. When the Eagle Flies (1974) included bassist Rosko Gee. After this Traffic disbanded. Their breakup was followed by two compilations from United Artists (Heavy Traffic and More Heavy Traffic), both of which only drew from the first half of their output.\nRosko Gee and Rebop Kwaku Baah joined German band Can for their albums Saw Delight (1977), Out of Reach (1978) and Can (1979).\nCapaldi and Winwood reunited as Traffic in 1994 for a one-off tour, after a fan left a voice mail message at Bob Weir's (of the Grateful Dead) hotel in Chicago during the 1992 &quot;scaring the Children&quot; tour, and suggested it would be cool if Traffic toured with the (then Grateful) Dead. Traffic opened for The Grateful Dead during summer tour, and they recorded and released a CD of all-new material Far From Home, but it was made without Chris Wood, who had died in 1983 from alcohol-related causes. The flute/sax role on the tour was played by Randall Bramblett, who had never been a member of Traffic, but had worked extensively with Steve Winwood. The bass player for the tour was Rosko Gee. Michael McEvoy joined the line up playing keyboards, guitar and viola, and Walfredo Reyes Jr. played drums and percussion.\nTraffic was inducted into the Rock and Roll Hall of Fame on 15 March 2004.\nTentative plans for another Traffic project were cut short by Jim Capaldi's death at age 60 in January 2005, ending the songwriting partnership with Winwood that had fueled Traffic from its beginning.\nDear Mr Fantasy was a celebration for Jim Capaldi that took place at the Roundhouse in Camden Town, London on Sunday 21 January 2007. Guests include Steve Winwood, Paul Weller, Pete Townshend, and many more. Dear Mr Fantasy featured the music of Jim Capaldi and Traffic and all profits went to The Jubilee Action Street Children Appeal.\n\n","torrent":{"xt":"urn:btih:9b2f21f49d86d22c6fcd5a5e1c92c09546a45748","amp;dn":"Traffic+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b2f21f49d86d22c6fcd5a5e1c92c09546a45748","infoHashBuffer":{"type":"Buffer","data":[155,47,33,244,157,134,210,44,111,205,90,94,28,146,192,149,70,164,87,72]},"announce":[],"urlList":[]}}