{"title":"Anisotropic Nanomaterials - Preparation, Properties, and Applica","uid":15480600,"size":22689321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b4d19520e076a608e5738c89accfebba28d7c13&amp;dn=Anisotropic+Nanomaterials+-+Preparation%2C+Properties%2C+and+Applica&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470248872,"description":"Anisotropic Nanomaterials - Preparation, Properties, and Applications - Quan Li (Springer, 2015).pdf\r\n\r\nIn this book anisotropic one-dimensional and two-dimensional nanoscale building blocks and their assembly into fascinating and qualitatively new functional structures embracing both hard and soft components are explained. Contributions from leading experts regarding important aspects like synthesis, assembly, properties and applications of the above materials are compiled into a reference book. The anisotropy, i.e. the direction-dependent physical properties, of materials is fascinating and elegant and has sparked the quest for anisotropic materials with useful properties. With such a curiosity, material scientists have ventured into the realm of nanometer length scale and have explored the anisotropic nanoscale building blocks such as metallic and nonmetallic particles as well as organic molecular aggregates. It turns out that the anisotropic nanoscale building blocks, in addition to direction-dependent properties, exhibit dimension and morphology dependence of physical properties. Moreover, ordered arrays of anisotropic nanoscale building blocks furnish novel properties into the resulting system which would be entirely different from the properties of individual ones. Undoubtedly, these promising properties have qualified them as enabling building blocks of 21st century materials science, nanoscience and nanotechnology. Readers will find this book professionally valuable and intellectually stimulating in the rapidly emerging area of anisotropic nanomaterials","torrent":{"xt":"urn:btih:9b4d19520e076a608e5738c89accfebba28d7c13","amp;dn":"Anisotropic+Nanomaterials+-+Preparation%2C+Properties%2C+and+Applica","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4d19520e076a608e5738c89accfebba28d7c13","infoHashBuffer":{"type":"Buffer","data":[155,77,25,82,14,7,106,96,142,87,56,200,154,204,254,187,162,141,124,19]},"announce":[],"urlList":[]}}