{"title":"National Geographic - World's Most Dangerous Drug - Meth DVDrip","uid":3607572,"size":733097713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b706f954d44a6c0413b3628d5c800f603049bd7&amp;dn=National+Geographic+-+World%5C%27s+Most+Dangerous+Drug+-+Meth+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"grinreaper_CCE","files":2,"time":1170257814,"description":"POSTED October 09, 2006\n\nWorld&amp;#039;s Most Dangerous Drug\n\nLisa Ling\n\nMeth really is the mother of all drugs. It&amp;#039;s the cheapest, dirtiest and most powerful drug in existence today. It&amp;#039;s also the fastest spreading. Meth doesn&amp;#039;t kill its addicts immediately. The process is slow, during which it takes an extreme physical and psychological toll. Meth literally rots people&amp;#039;s bodies?teeth, face and insides. Frankly, I was appalled by how ugly it made frequent users.\nPhoto by David Ross Smith\n\nI explored the impact meth is having on societies in Portland, Omaha and Bangkok. The reasons people start using the drug differ from city to city.\n\nIn Portland, I was shocked to learn that 80 percent of that city&amp;#039;s prisons hold people on meth-related charges. Whether the charges are for drug dealing, identity theft or armed robbery, somehow they are connected to meth. Portland&amp;#039;s hospitals are overwhelmed by patients admitted for meth abuse. I&amp;#039;ve always considered Portland to be one of the most beautiful cities in the U.S., but meth&amp;#039;s impact on it has been tremendously ugly.\n\nBut there is hope. Addicts can recover. I had the privilege of meeting a man in Portland who is six months into recovery. His name is Kobe. Kobe was very good looking, smart and athletic when he got addicted. But meth nearly destroyed his life. I was amazed after I heard his story that he was even alive. The most poignant part of his story was that his parents, who are loving and middle class, told me what a relief it was to learn that he had been arrested and jailed ? because that meant they knew where he was and that he was alive.\n\nI also met a young woman in jail named Julie. She was a prime example of how meth deteriorates a person, inside and out. She was incredibly paranoid, even though she has been clean since her incarceration. I saw pictures of Julie before she became addicted to meth?she had been so attractive. It was truly heartbreaking to see what the drug had done to her. Her face was riddled with pockmarks from sores that had gotten infected and her teeth were totally rotted from years of grating and negligence.\n\nIn the United States, the drug has been rapidly traveling eastward. In Nebraska, meth has invaded suburban communities and is wreaking havoc on them. We tell a powerful story in the show about a young couple from Nebraska. You can hear their frantic phone calls to police and hear what people are actually like on meth, and it?s scary. They were two promising young individuals with no prior history of drug abuse, but on one frigid night, meth sealed their fate.\n\nNG Adventure Magazine\n\nIn Bangkok, meth or ?Yaba,? as it&amp;#039;s known there, actually helped the economy grow. Like much of Asia in the early 1990s, Thailand was booming. Foreign investment poured into the country, and a rapid building boom ensued. Skyscrapers were erected at record speed?the country couldn&amp;#039;t build them fast enough. The tens of thousands of construction workers who were building Bangkok needed something to keep them going at work. Enter Yaba. The drug allowed workers to stay awake for days on end. It became so popular that at one time it was estimated that one out of every five Thais had tried Yaba. It made the culture more productive?for a time, anyway.\n\nBut with increased worker productivity came the incredible paranoia that meth, more than any other drug, is known for. Paranoia fueled by meth use led to rampant crime. Hardly a day would go by that Thai news didn&amp;#039;t report that a Yaba user had cracked. Ordinary citizens were being held up at gunpoint, having their throats slit and being robbed.\nPhoto by David Ross Smith\n\nThe Thai government has declared an all-out war against Yaba users. Anyone accused of using the drug can be put to death. I spent time with some construction workers who continue to smoke Yaba, despite that fact that they can be killed if caught.\n\nWhat I learned is that meth deteriorates a person?s whole being, inside and out. On the outside, many people who were very good looking before their addiction to meth become riddled with pockmarks from picking at sores that become infected. Teeth rot from grating and negligence. On the inside, people become paranoid, detached, and apathetic. Families and friends alienate themselves from the addicts? crazy behavior. And meth use can become a life or death situation. These are the harsh and destructive risks of this drug. They?re terrifyingly real. And I hope people become aware of the steep consequences ? and stay far away from meth.\n\nSource: &lt;a href=&quot;\nhttp://blogs.nationalgeographic.com/channel/blog/2006/10/explorer_drug.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blogs.nationalgeographic.com/channel/blog/2006/10/explorer_drug.html&lt;/a&gt;\n\n-----------------\nTech specs (courtesy of SUPER) \n\nGeneral #0 \nFormat : AVI \nFormat/Info : Audio Video Interleave \nFormat/Family : RIFF \nFile size : 699 MiB \nPlayTime : 51mn 17s \nBit rate : 1900 Kbps \nWriting application : Nandub v1.0rc2 \nWriting library : Nandub build 1852/release \n\nVideo #0 \nCodec : XviD \nCodec/Family : MPEG-4 \nCodec/Info : XviD project \nCodec settings/BVOP : Yes \nCodec settings/QPel : No \nCodec settings/GMC : 0 \nCodec settings/Matrix : Default \nPlayTime : 51mn 17s \nBit rate : 1695 Kbps \nWidth : 640 pixels \nHeight : 352 pixels \nAspect ratio : 16/9 \nFrame rate : 29.970 fps \nResolution : 8 bits \nChroma : 4:2:0 \nInterlacement : Progressive \nBits/(Pixel*Frame) : 0.251 \nWriting library : XviD0034 \n\nAudio #0 \nCodec : AC3 \nPlayTime : 51mn 17s \nBit rate : 192 Kbps \nBit rate mode : CBR \nChannel(s) : 2 channels \nSampling rate : 48 KHz \n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:9b706f954d44a6c0413b3628d5c800f603049bd7","amp;dn":"National+Geographic+-+World%5C%27s+Most+Dangerous+Drug+-+Meth+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b706f954d44a6c0413b3628d5c800f603049bd7","infoHashBuffer":{"type":"Buffer","data":[155,112,111,149,77,68,166,192,65,59,54,40,213,200,0,246,3,4,155,215]},"announce":[],"urlList":[]}}