{"title":"[2009] Understanding Consciousness.pdf","uid":9493014,"size":2993727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b8c6ad1ffd0481c82152f2042e8dff8e70108d6&amp;dn=%5B2009%5D+Understanding+Consciousness.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"seering","files":1,"time":1390038233,"description":"Understanding Consciousness, 2nd Edition provides a unique survey and evaluation of consciousness studies, along with an original analysis of consciousness that combines scientific findings, philosophy and common sense. Building on the widely praised first edition, this new edition adds fresh research, and deepens the original analysis in a way that reflects some of the fundamental changes in the understanding of consciousness that have taken place over the last 10 years.\n\nThe book is divided into three parts; Part one surveys current theories of consciousness, evaluating their strengths and weaknesses. Part two reconstructs an understanding of consciousness from first principles, starting with its phenomenology, and leading to a closer examination of how conscious experience relates to the world described by physics and information processing in the brain. Finally, Part three deals with some of the fundamental issues such as what consciousness is and does, and how it fits into to the evolving universe. As the structure of the book moves from a basic overview of the field to a successively deeper analysis, it can be used both for those new to the subject and for more established researchers.\n\nUnderstanding Consciousness tells a story with a beginning, middle and end in a way that integrates the philosophy of consciousness with the science. Overall, the book provides a unique perspective on how to address the problems of consciousness and as such, will be of great interest to psychologists, philosophers, neuroscientists and other professionals concerned with mind/body relationships, and all who are interested in this subject.","torrent":{"xt":"urn:btih:9b8c6ad1ffd0481c82152f2042e8dff8e70108d6","amp;dn":"%5B2009%5D+Understanding+Consciousness.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b8c6ad1ffd0481c82152f2042e8dff8e70108d6","infoHashBuffer":{"type":"Buffer","data":[155,140,106,209,255,208,72,28,130,21,47,32,66,232,223,248,231,1,8,214]},"announce":[],"urlList":[]}}