{"title":"FullMetal Alchemist BrotherHood 1-64 (BDRip 1080p AC3)","uid":13572095,"size":47535382041,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9b922fb7c80f31147a2811a679797e1afb2aa085&amp;dn=FullMetal+Alchemist+BrotherHood+1-64+%28BDRip+1080p+AC3%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"anime4life.","files":64,"time":1455671197,"description":"Summary\r\nFullmetal Alchemist: Brotherhood closely follows the story line of the original manga, rather than the first television series which featured an original story line. Brothers Edward and Alphonse Elric are raised by their mother Trisha in the remote village of Resembool in the country of Amestris. Their father Hohenheim, a noted and very gifted alchemist, abandoned his family while the boys were still young, and while in Trisha's care they began to show an affinity for alchemy. However, when Trisha died of a lingering illness, they were cared for by their best friend Winry Rockbell and her grandmother Pinako. The boys traveled the world to advance their alchemic training under Izumi Curtis. Upon returning home, the two decide to try to bring their mother back to life with alchemy. However, human transmutation is a taboo, as it is impossible to do so properly. In the failed transmutation that results, Al's body is completely obliterated and Ed loses his left leg. In a last ditch attempt to keep his brother alive, Ed sacrifices his right arm to bring Al's soul back and houses it in a nearby suit of armor. After Edward receives automail prosthetics from Winry and Pinako, the brothers decide to burn their childhood home down (symbolizing their determination and decision of &quot;no turning back&quot;) and head to the capital city to become government sanctioned State Alchemists. After passing the exam, Edward is dubbed the &quot;Fullmetal Alchemist&quot; by the State Military, and the brothers begin their quest to discover the nature of the fabled Philosopher's Stone, under the direction of Colonel Roy Mustang. Along the way, they discover a deep government conspiracy to hide the true nature of the Philosopher's Stone that involves the homunculi, the alkahestrists of the neighboring nation of Xing, the scarred man from the war-torn nation of Ishval, and their own father's past.\r\n\r\nVideo\r\nVideo Source: Blu ray\r\nVideo Codec: H.264/AVC\r\nVideo Resolution: 1920x1080p HD (16:9\r\n\r\nAudio\r\nCodec: AC3\r\nTrack 1: English 5.1ch (AC3 640bit)\r\nTrack 2: Japanese Stereo (AC3 640bit)\r\n\r\nSubtitles\r\nEnglish\r\n\r\nExtras\r\nFullMetal Alchemist BrotherHood English Commentary (1,10,14,23,28,36,40,46,64)","torrent":{"xt":"urn:btih:9b922fb7c80f31147a2811a679797e1afb2aa085","amp;dn":"FullMetal+Alchemist+BrotherHood+1-64+%28BDRip+1080p+AC3%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b922fb7c80f31147a2811a679797e1afb2aa085","infoHashBuffer":{"type":"Buffer","data":[155,146,47,183,200,15,49,20,122,40,17,166,121,121,126,26,251,42,160,133]},"announce":[],"urlList":[]}}