{"title":"Equipe 84 - Auschwitz [TVRip - Mpeg - Ita Mp3] [TNTvillage]","uid":5210376,"size":38094852,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9c0370bcd0362c86a9469da5a236d4e8d1192f42&amp;dn=Equipe+84+-+Auschwitz+%5BTVRip+-+Mpeg+-+Ita+Mp3%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darayava","files":1,"time":1260564294,"description":"Equipe 84\n\nAuschwitz\n(1966)\n\nProbabilmente il piÃƒÂ¹ famoso gruppo beat italiano, e con una lunghissima carriera cominciata con un primo 45 giri nel 1964, l'Equipe 84 ha continuato a suonare fino alla metÃƒÂ  degli anni '70 avendo anche un breve periodo vagamente influenzato dalle sonoritÃƒÂ  progressive.\nIl quartetto modenese fu per i giovani italiani la risposta nostrana ai Beatles, e l'Equipe ebbe una lunga serie di singoli di successo tra il 1966 e il 1969 con alcuni classici come Io ho in mente te, Auschwitz, Bang bang, 29 settembre (uscita anche in versione inglese in USA e Inghilterra), Un angelo blu, Tutta mia la cittÃƒÂ .\n\nIl primo periodo di crisi arrivÃƒÂ² nel 1970 con l'abbandono di Franco Ceccarelli e l'arresto del batterista Alfio Cantarella per possesso di droga, quest'ultimo sostituito per un breve periodo e su un solo 45 giri dal batterista dei Rokes, Mike Shepstone; piÃƒÂ¹ tardi, con l'aiuto di un altro batterista esterno, Franz Di Cioccio (dei Quelli, poi Premiata Forneria Marconi), realizzarono quello che viene considerato il loro album piÃƒÂ¹ progressivo, Id.\n\nQuesto, il loro quarto album, ÃƒÂ¨ meno canzonettistico dei precedenti, e contiene 10 brani con arrangiamenti dinamici ed alcuni passaggi orchestrali. Non propriamente un album prog, il disco contiene comunque dei bei brani come Il re dei re e la lunga Un brutto sogno, ma per molti appassionati la caratteristica voce di Maurizio Vandelli ÃƒÂ¨ troppo legata al passato beat del gruppo per poterlo considerare un lavoro progressivo.\n\nCon Casa mia, nel 1971, l'Equipe 84 tornÃƒÂ² al tipico album di canzoni, ma la loro fase piÃƒÂ¹ creativa era chiaramente passata. Dr.Jekyll &amp; Mr.Hyde, del 1973 segna il passaggio alla Ariston, ed ÃƒÂ¨ un altro album di stampo pop, con l'unica eccezione dello strumentale jazzato Dr.Jekyll. \nL'ultimo album, Sacrificio del 1974, ha di nuovo dei buoni passaggi strumentali, anche se le influenze fondamentali sono sempre di pop melodico. Il gruppo ÃƒÂ¨ assistito qui dal batterista Paolo Siani della Nuova Idea.\nL'Equipe 84 ha continuato a suonare e registrare fino al 1977, uno degli ultimi concerti ÃƒÂ¨ compreso nel CD dal vivo pubblicato alla metÃƒÂ  degli anni '90.\n\nDopo la fine dell'Equipe 84 il cantante e leader Maurizio Vandelli ha provato a riformare il gruppo diverse volte fino alla morte, negli anni '90, del bassista Sogliani; Vandelli ha anche realizzato un paio di album come solista nel 1970 e nel 1974 lavorando anche come produttore, tra gli altri, per la Reale Accademia di Musica e Gianni D'Errico.\n\n\nSon morto con altri cento, son morto ch' ero bambino,\npassato per il camino e adesso sono nel vento e adesso sono nel vento....\n\nAd Auschwitz c'era la neve, il fumo saliva lento\nnel freddo giorno d' inverno e adesso sono nel vento, adesso sono nel vento...\n\nAd Auschwitz tante persone, ma un solo grande silenzio:\nÃƒÂ¨ strano non riesco ancora a sorridere qui nel vento, a sorridere qui nel vento...\n\nIo chiedo come puÃƒÂ² un uomo uccidere un suo fratello\neppure siamo a milioni in polvere qui nel vento, in polvere qui nel vento...\n\nAncora tuona il cannone, ancora non ÃƒÂ¨ contento\ndi sangue la belva umana e ancora ci porta il vento e ancora ci porta il vento...\n\nIo chiedo quando sarÃƒÂ  che l' uomo potrÃƒÂ  imparare\na vivere senza ammazzare e il vento si poserÃƒÂ  e il vento si poserÃƒÂ ...\n\nIo chiedo quando sarÃƒÂ  che l' uomo potrÃƒÂ  imparare\na vivere senza ammazzare e il vento si poserÃƒÂ  e il vento si poserÃƒÂ  e il vento si poserÃƒÂ ... \n\n\n\nNome File: Equipe 84 - Auschwitz (1966).mpg\nDimensione: 38,094,852 Bytes\nDurata: 3:38.400\n\nVideo Codec: MPEG-1\nVideo Bitrate: 1149 kb/s\nRisoluzione: 352x288\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.453 b/px\n\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224 kb/s\nFreq Audio: 44100 Hz\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:9c0370bcd0362c86a9469da5a236d4e8d1192f42","amp;dn":"Equipe+84+-+Auschwitz+%5BTVRip+-+Mpeg+-+Ita+Mp3%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c0370bcd0362c86a9469da5a236d4e8d1192f42","infoHashBuffer":{"type":"Buffer","data":[156,3,112,188,208,54,44,134,169,70,157,165,162,54,212,232,209,25,47,66]},"announce":[],"urlList":[]}}