{"title":"Building Minecraft Server Modifications By Cody M. Sommer","uid":9688597,"size":7472062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e2911150c5a4ba233ea13ca954b7cae8c648369&amp;dn=Building+Minecraft+Server+Modifications+By+Cody+M.+Sommer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lazypirate..","files":6,"time":1393821176,"description":"Building Minecraft Server Modifications By Cody M. Sommer\nEnglish | 2013 | 142 Pages | ISBN: 1849696004 | EPUB + PDF | 5 MB + 2 MB\n\nIf you have ever played Minecraft on a public server then the chances are that the server was powered by Bukkit. Bukkit plugins allow a server to be modified in more ways than you can imagine. Learning to program your own server mods will allow you to customize the game to your own liking.\nBuilding Minecraft Server Modifications is a complete guide that walks you through the creation of Minecraft server mods. From setting up a server, to testing your newly made plugins, this book teaches you everything you need to know. With the help of this book you can start practising for a career in software development or simply create something awesome to play with your friends.\n\nThis book walks you through installing your own Minecraft server for you and your friends. Once your server is running, it will aid you in modifying the game by programming Bukkit plugins. You will learn how to program simple plugin features such as player commands and permissions. You will also learn more complex features including listening for events, creating a configurable plugin, and utilizing the Bukkit scheduler. All of this will be accomplished while writing your own server mods.\n\nYou will become familiar with the most important aspects of the Bukkit API. Additional API features will become a breeze to learn after tackling these more complicated tasks.","torrent":{"xt":"urn:btih:9e2911150c5a4ba233ea13ca954b7cae8c648369","amp;dn":"Building+Minecraft+Server+Modifications+By+Cody+M.+Sommer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2911150c5a4ba233ea13ca954b7cae8c648369","infoHashBuffer":{"type":"Buffer","data":[158,41,17,21,12,90,75,162,51,234,19,202,149,75,124,174,140,100,131,105]},"announce":[],"urlList":[]}}