{"title":"Chessboard magic! 160 brilliant chess endings (Chernev)","uid":8740867,"size":5273959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e3c1350ce0dde94ee80cd9e42602eefe58ad114&amp;dn=Chessboard+magic%21+160+brilliant+chess+endings+%28Chernev%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1374783992,"description":"This book contains 160 remarkable endgame compositions, all of which illustrate in some way the great aesthetic pleasure chess offers to its devotees. Too often the collector of chess endings will allow only two considerations to affect his choice: the ingenuity displayed in the composition and the knowledge needed to solve it. But Mr. Chernev has added a third criterion: inherent beauty of solution. Thus his endgames illustrate symmetry, pleasing patterns of movements, unusual configurations and other examples of the visual appeal of chess. For example, in one situation five knights are needed to force mate; in another, White brings about a smothered mate in the center of the board; another shows White saving his skin by building up a column of quadrupled pawns; and a fourth problem shows White forcing stalemate although Black finishes up eight passed paws ahead!\n\nThese unusual situations will sharpen your imagination and increase your skill - but they are valuable most of all for the sheer delight they bestow. Although all the endings in this work are composed, many of them have the &quot;natural&quot; appearance of positions that might have occurred in over-the-board play. Mr. Chernev's endings can be worked through again and again with undiminished pleasure, owing to their tantalizing qualities. Many of these compositions have won first prize in Russian chess magazines, and are unavailable in this country. Among their composers are several of the foremost modern Russian chess authorities.","torrent":{"xt":"urn:btih:9e3c1350ce0dde94ee80cd9e42602eefe58ad114","amp;dn":"Chessboard+magic%21+160+brilliant+chess+endings+%28Chernev%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3c1350ce0dde94ee80cd9e42602eefe58ad114","infoHashBuffer":{"type":"Buffer","data":[158,60,19,80,206,13,222,148,238,128,205,158,66,96,46,239,229,138,209,20]},"announce":[],"urlList":[]}}