{"title":"Martin Luther (1953) DVDRip","uid":7941885,"size":1371982910,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9e59ddd8ef615b8bb50e76df357cf19050166ffe&amp;dn=Martin+Luther+%281953%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dietrichzumwald","files":1,"time":1356013003,"description":"Martin Luther (1953) DVDRip\n\nThis version is probably the most accurate in terms of little propaganda.\n\nIt portrays Martin Luther as a catholic monk who saw inconsistencies between the practice of the catholic church and the Scriptures of the Holy Bible.\n\nWhen he questioned this, he was ultimately excommunicated by the roam-an catholic church for heresy. He was forced into hiding in order to painstakingly translate the Bible into languages other than Latin which the common people could read and understand.\n\nWhile he was in hiding a violent revolt broke out under the priest who followed Martin Luther, which again forced him to resurface in order to guide the Holy Reformation back along the path of peace and back to the teachings of Jesus.\n\nAn amazing story, the other versions, Martin Luther (1974 Stacy Keach) and Luther (2003 Joseph Fiennes) according to the IMDB, which both attempt to portray Martin Luther as a butcher, responsible for the violent revolt through the division he caused within the ranks of the roam-an catholic church.\n\nSome of the of the most important moments in history are portrayed here.\n\nMartin Luther and the Reformation had fingered the holy roam-an church as the phalse church and the seat of antichrist, no small matter for the 1500's.\n\nBible believer or not, this will make you take notice of the small monk who dared to take on the all encompassing power of the evil roam-an catholic church and the papacy single-handedly, a deed which normally carried a sure sentence of death by a public burning at the stake for heresy.\n\nSince it is from 1953, it is in black &amp; white and film quality is not of today's standards. Definitely a watchable rip. Upscales nicely to 720p.\n\nDefinitely a real eye opener for anyone interested in the Reformation and the history of Christianity. If this does not make you realize the evil the world is faced with and has been faced with, I am not sure anything can, or will.\n\nGod Bless and enjoy!","torrent":{"xt":"urn:btih:9e59ddd8ef615b8bb50e76df357cf19050166ffe","amp;dn":"Martin+Luther+%281953%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e59ddd8ef615b8bb50e76df357cf19050166ffe","infoHashBuffer":{"type":"Buffer","data":[158,89,221,216,239,97,91,139,181,14,118,223,53,124,241,144,80,22,111,254]},"announce":[],"urlList":[]}}