{"title":"Direct Mail 4.2.6 [MAC OS X]","uid":13417992,"size":35476149,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a0bcead3a40391653cb876b4d6a8164d6c7fc134&amp;dn=Direct+Mail+4.2.6+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"iAlexander","files":1,"time":1454517685,"description":"MADE IN UKRAINE\r\n\r\nDirect Mail 4.2.6 – Create and send great looking email campaigns.\r\n\r\nDirect Mail is an easy-to-use, fully-featured email marketing app purpose-built for OS X. It lets you create and send great looking email campaigns.\r\nStart your newsletter by selecting from a gallery of professionally-designed templates, then customize to your heart’s content. Design Tests let you see how your email looks in a wide variety of email clients, including live mobile previews sent to your iPhone or iPad. You’ll love not having to hassle with a slow, clunky, web-based editor.\r\nWhen you’re ready to send, rely on Direct Mail’s built-in email service to deliver your message in a flash. Campaign reports show you a clear summary of opens, clicks, and more. Grow your mailing list by creating customizable subscribe forms and publish them to your website or\n\r\nWhat's new in version 4.2.6:\r\n- Fixed a bug that was preventing the Direct Mail logo from being correctly inserted into the footer of outgoing email campaigns. If you do not want this logo to appear in your email campaigns, you can turn it off in the Preferences window under the Messages tab.\r\n- When importing .tab files, the correct field and record separators are now chosen automatically\r\n- Improved support for importing and exporting HTML that includes Microsoft-style conditional comments\r\n- Fix a bug with the file content preview window when importing addresses from CSV files or Google Sheets\r\n- Improved the automatic CSS inliner to preserve custom style attributes set on the body element\r\n- MacBook Pros with discrete graphics cards now default using to power-saving integrated graphics instead\r\n- When creating a new Direct Mail account, the user is now given the option to automatically save their new password in the OS X Keychain\r\n- Added a user preference to disable the opening of the most recently used project\r\n- &quot;Automatic&quot; text encoding now yields better results\r\n- Fixed animation issues in the &quot;Map&quot; section of campaign reports\r\n- Fixed user interface issues in the design test window\r\n- Additional bug fixes and improvements\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:a0bcead3a40391653cb876b4d6a8164d6c7fc134","amp;dn":"Direct+Mail+4.2.6+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0bcead3a40391653cb876b4d6a8164d6c7fc134","infoHashBuffer":{"type":"Buffer","data":[160,188,234,211,164,3,145,101,60,184,118,180,214,168,22,77,108,127,193,52]},"announce":[],"urlList":[]}}