{"title":"After Her_ A Novel - Joyce Maynard.epub","uid":8883956,"size":784866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1534e8845da97775fa27e011c1a3b5891bda282&amp;dn=After+Her_+A+Novel+-+Joyce+Maynard.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1378404194,"description":"The New York Times bestselling author of Labor Day and The Good Daughters returns with a warm and haunting novel of sisterhood, adolescence, sacrifice, and suspense\n\n&quot;Maynard illuminates the human experience.&quot;-People magazine\n\nIt's the summer of 1979, and a dry, hot, northern California school vacation stretches ahead for Rachel and her younger sister Patty-the daughters a larger-than-life, irresistibly handsome and chronically unfaithful detective father who loves to make women happy, and the mother whose heart he broke.\n\nLeft to their own devices, the inseparable sisters spend their days studying record jackets, concocting elaborate fantasies about the life of the mysterious neighbor who moves in down the street, and playing dangerous games on the mountain that rises up behind their house.\n\nWhen young women start showing up dead on the mountain, the girls' father is charged with finding the man responsible, known as The Sunset Strangler. Seeing her father's life slowly unravel when he fails to stop the murders, Rachel embarks on her most dangerous game yet: setting herself up as bait to catch the killer, with consequences that will destroy her father's career and alter the lives of everyone she loves.\n\nIt is not until thirty years later that Rachel, who has never given up hope of vindicating her father, finally smokes out the killer, bringing her back to the territory of her childhood, and uncovering a long-buried family secret.\n\nAs with her novel, Labor Day, Maynard's newest work is part thriller, part love story, Loosely inspired by the Trailside Killer case that terrorized Marin County in the late seventies, her tale delves deep into the alternately thrilling and terrifying landscape of a young girl's first explorations of adult sexuality and the loss of innocence, the bond between sisters-and into a daughter's tender but damaged relationship with her father, and what it is to finally trust a man.\nGenre: Crime Thriller","torrent":{"xt":"urn:btih:a1534e8845da97775fa27e011c1a3b5891bda282","amp;dn":"After+Her_+A+Novel+-+Joyce+Maynard.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1534e8845da97775fa27e011c1a3b5891bda282","infoHashBuffer":{"type":"Buffer","data":[161,83,78,136,69,218,151,119,95,162,126,1,28,26,59,88,145,189,162,130]},"announce":[],"urlList":[]}}