{"title":"HTML5 Games_ Creating Fun With HTML5, CSS3, And WebGL (Wiley, No","uid":6990076,"size":1712043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a15fb664501e821841b9cdff0947939ebf3946fe&amp;dn=HTML5+Games_+Creating+Fun+With+HTML5%2C+CSS3%2C+And+WebGL+%28Wiley%2C+No&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Nich36","files":2,"time":1327671381,"description":"**Discover new opportunities for building 2D and 3D games with HTML5**\n\nThe newest iteration of HTML, HTML5 can be used with JavaScript, CSS3, and WebGL to create beautiful, unique, engaging games that can be played on the web or mobile devices like the iPad or Android phones. Gone are the days where games were only possible with plugin technologies such as Flash and this cutting-edge book shows you how to utilize the latest open web technologies to create a game from scratch using Canvas, HTML5 Audio, WebGL, and WebSockets. You'll discover how to build a framework on which you will create your HTML5 game. Then each successive chapter covers a new aspect of the game, including user input, sound, multiplayer functionality, 2D and 3D graphics, and more.\n\n* Aims directly at a new way to develop games for the web through the use of HTML5\n* Demonstrates how to make iOS and Android web apps\n* Explains how to capture player input; create 3D graphics; and incorporate textures, lighting, and sound\n* Guides you through the process of creating a game from scratch using Canvas, HTML5 Audio, WebGL, and WebSockets\n\nBy the end of this invaluable book, you will have created a fully functional game that can be played in any compatible browser or on any mobile device that supports HTML5.\n","torrent":{"xt":"urn:btih:a15fb664501e821841b9cdff0947939ebf3946fe","amp;dn":"HTML5+Games_+Creating+Fun+With+HTML5%2C+CSS3%2C+And+WebGL+%28Wiley%2C+No","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a15fb664501e821841b9cdff0947939ebf3946fe","infoHashBuffer":{"type":"Buffer","data":[161,95,182,100,80,30,130,24,65,185,205,255,9,71,147,158,191,57,70,254]},"announce":[],"urlList":[]}}