{"title":"Jill Paton Walsh - Knowledge of Angels (pdf)","uid":8196628,"size":2442052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a165f304425f64e728e77680a8ef6fbb1fe037fc&amp;dn=Jill+Paton+Walsh+-+Knowledge+of+Angels+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361927009,"description":"Jill Paton Walsh - Knowledge of Angels (Bantam, 1994). 268 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nBeautifully written philosophical mystery.\n\nA fable-like tale, set in the Middle Ages, that focuses on two outcasts, an atheist prince and a wolf child confined to a nunnery, who become pawns in a theological controversy. Booker Prize nominee.\n\n\nFrom Publishers Weekly\n\nIn the Middle Ages, a cardinal on a remote Mediterranean island tries to determine whether the appearance of a criminal and a girl raised by wolves are acts of angels in this novel, shortlisted for the Booker Prize.\n\nFrom School Library Journal\n\nYA-A gripping, grim morality tale that's hard to put down and even harder to forget. It is set during a time of religious fervor on a Mediterranean island peopled with a wide variety of well-developed characters, including a lost prince, a child raised by wolves, and the priestly ruler. The island's proximity and ties to Rome are evident in the lives of the townspeople, clerics, nuns, monks, and even the servants. Christianity in its narrowest guise predominates, and the two islanders who are &quot;unknown,&quot; the wolf-child and the lost prince, are ultimately judged by these constricting standards. There are many likable characters, and there is much theological philosophy discussed in intriguing detail, mostly by a monk who contemplates what angels know and how they know it. There is also, however, a captivating plot. Be aware that this is far different from the spate of angel &quot;stuff&quot; that is out today, a darker but more encompassing description of &quot;the knowledge of angels.&quot; Although the ending is slightly disappointing, getting there is a compelling and thought-provoking journey, and well worth the trip.","torrent":{"xt":"urn:btih:a165f304425f64e728e77680a8ef6fbb1fe037fc","amp;dn":"Jill+Paton+Walsh+-+Knowledge+of+Angels+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a165f304425f64e728e77680a8ef6fbb1fe037fc","infoHashBuffer":{"type":"Buffer","data":[161,101,243,4,66,95,100,231,40,231,118,128,168,239,111,187,31,224,55,252]},"announce":[],"urlList":[]}}