{"title":"The Duhks - Migrations [2006] [EAC,log,cue. FLAC]","uid":8987922,"size":279466441,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a172ff4b8a5b7886d9bb77cbebf0aa7d153492cb&amp;dn=The+Duhks+-+Migrations+%5B2006%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1380719061,"description":"Artist: The Duhks\nRelease: Migrations\nReleased: 2006\nLabel: Sugar Hill\nCatalog#: SHCD 4014\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: CAN\nStyle: Americana\n\n1. Ol' Cook Pot (Shawn Byrne/Chuck McCarthy)\n2. Mountains o' Things (Tracy Chapman)\n3. Heaven's My Home (Ruby Amanfu/Katie Herzig)\n4. The Fox and the Bee (Tania Elizabith/Jordan McConnell; Tania Elizabeth; Traditional arr. The Duhks)\n5. Down to the River (Keith Frank (words by Leonard Podolak); Jeb Puryear)\n6. Who Will Take My Place? (Dan Frechette)\n7. Moses Don't Get Lost (Traditional arr. The Duhks; Words by Tim O'Bryen)\n8. Three Fishers (Public Domain arr. The Duhks)\n9. Domino Party! (Leonard Podolak; Tania Elizabeth; Leonard Podolak; Leonard Podolak)\n10. Out of the Rain (Jessee Havey)\n11. Turtle Dove (Traditional arr. The Duhks)\n\nThe Duhks kick off 2006's Migration with the spunky, jazzed up &quot;(Mama Gonna Bargain with The) Ol' Cook Pot.&quot; The song sounds like something the Manhattan Transfer might have recorded had it been a jug band, and captures an easygoing, good-time vibe. This easygoing, good-time vibe, in fact, says a lot about the band. Like Nickel Creek, The Duhks are young and hip, they play and sing well and seem intent on crossing older folk stylings with new ones. One imagines the music -- if a category is needed -- might be called neo-neo-folk, or cool folk by hip young folks. Unlike Nickel Creek, The Duhks are less about innovation than finding the right sound. That sound circles around singer Jessica Havey's buoyant, breathy (with a touch of soul) lead vocals. The production has a professional sheen to it, and Migration, no matter how much the group shuffles the acoustic arrangements, has a similar upscale sound. Because of this approach, The Duhks often remind one more of professional performers than propagators of roots music. On their version of Tracy Chapman's &quot;Mountains O' Things,&quot; for instance, the song is simply too pretty to call much attention to the anti-materialism of the lyric. In this sense, The Duhks remind one of folk-pop groups like the Waifs, turning the pathos of an old spiritual like &quot;Turtle Dove&quot; into a happy folk song. Migration, then, is an exuberant contemporary folk album that will remind listeners of folk's happier side.","torrent":{"xt":"urn:btih:a172ff4b8a5b7886d9bb77cbebf0aa7d153492cb","amp;dn":"The+Duhks+-+Migrations+%5B2006%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a172ff4b8a5b7886d9bb77cbebf0aa7d153492cb","infoHashBuffer":{"type":"Buffer","data":[161,114,255,75,138,91,120,134,217,187,119,203,235,240,170,125,21,52,146,203]},"announce":[],"urlList":[]}}