{"title":"Lester Young - 2009 - Memory Friends &amp; Sons FLAC","uid":8657676,"size":656751926,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1fe42b404228d049004fbdf0ce299330b611199&amp;dn=Lester+Young+-+2009+-+Memory+Friends+%26amp%3B+Sons+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1373244712,"description":"Lester Young - 2009 - Memory: Friends &amp; Sons\n\nLester Young was one of the true jazz giants, a tenor saxophonist who came up with a completely different conception in which to play his horn, floating over bar lines with a light tone rather than adopting Coleman Hawkins' then-dominant forceful approach. A non-conformist, Young (nicknamed &quot;Pres&quot; by Billie Holiday) had the ironic experience in the 1950s of hearing many young tenors try to sound exactly like him.\nAlthough he spent his earliest days near New Orleans, Lester Young lived in Minneapolis by 1920, playing in a legendary family band. He studied violin, trumpet, and drums, starting on alto at age 13. Because he refused to tour in the South, Young left home in 1927 and instead toured with Art Bronson's Bostonians, switching to tenor. He was back with the family band in 1929 and then freelanced for a few years, playing with Walter Page's Blue Devils (1930), Eddie Barefield in 1931, back with the Blue Devils during 1932-1933, and Bennie Moten and King Oliver (both 1933). He was with Count Basie for the first time in 1934 but left to replace Coleman Hawkins with Fletcher Henderson. Unfortunately, it was expected that Young would try to emulate Hawk, and his laid-back sound angered Henderson's sidemen, resulting in Pres not lasting long. After a tour with Andy Kirk and a few brief jobs, Lester Young was back with Basie in 1936, just in time to star with the band as they headed East. Young made history during his years with Basie, not only participating on Count's record dates but starring with Billie Holiday and Teddy Wilson on a series of classic small-group sessions. In addition, on his rare recordings on clarinet with Basie and the Kansas City Six, Young displayed a very original cool sound that almost sounded like altoist Paul Desmond in the 1950s. After leaving Count in 1940, Young's career became a bit aimless, not capitalizing on his fame in the jazz world. He co-led a low-profile band with his brother, drummer Lee Young, in Los Angeles until re-joining Basie in December 1943. Young had a happy nine months back with the band, recorded a memorable quartet session with bassist Slam Stewart, and starred in the short film Jammin' the Blues before he was drafted. His experiences dealing with racism in the military were horrifying, affecting his mental state of mind for the remainder of his life.\nAlthough many critics have written that Lester Young never sounded as good after getting out of the military, despite erratic health he actually was at his prime in the mid- to late-'40s. He toured (and was well paid by Norman Granz) with Jazz at the Philharmonic on and off through the '40s and '50s, made a wonderful series of recordings for Aladdin, and worked steadily as a single. Young also adopted his style well to bebop (which he had helped pave the way for in the 1930s). But mentally he was suffering, building a wall between himself and the outside world, and inventing his own colorful vocabulary. Although many of his recordings in the 1950s were excellent (showing a greater emotional depth than in his earlier days), Young was bothered by the fact that some of his white imitators were making much more money than he was. He drank huge amounts of liquor and nearly stopped eating, with predictable results. 1956's Jazz Giants album found him in peak form as did a well documented engagement in Washington, D.C., with a quartet and a last reunion with Count Basie at the 1957 Newport Jazz Festival. But, for the 1957 telecast The Sound of Jazz, Young mostly played sitting down (although he stole the show with an emotional one-chorus blues solo played to Billie Holiday). After becoming ill in Paris in early 1959, Lester Young came home and essentially drank himself to death. Many decades after his death, Pres is still considered (along with Coleman Hawkins and John Coltrane) one of the three most important tenor saxophonists of all time.\n\nTrack list:\nCD 1\n01 - Shoe Shine Boy\n02 - Oh ! Lady Be Good\n03 - Billie Holiday and Lester Young - This Year's Kisses\n04 - Billie Holiday and Lester Young - Mean To Me\n05 - Count Basie - Every Tub\n06 - Count Basie - Swingin' The Blues\n07 - Count Basie - Jumpin' at the Woodside\n08 - Them There Eyes\n09 - Taxi War Dance\n10 - Count Basie - Lester Leaps In\n11 - I Can't Get Started\n12 - Sometimes I'm Happy\n13 - These Foolish Things\n14 - D. B. Blues\n15 - I Cover the Waterfront\n16 - Jumpin' With Symphony Sid\n17 - I'm Confessin\n18 - Ad Lib Blues\n19 - Louise\n20 - Billie Holiday with the Mal Waldron all stars - Fine and Mellow\nCD 2\n01 - Woody Herman - Four brothers\n02 - Miles Davis - Move\n03 - Wardell Gray - Dexter Gordon - Move aka Jazz on Sunset\n04 - Paul Quinichette - Crossfire\n05 - Stan Getz Quintet - Crazy Rhythm\n06 - Dave Brubeck Quartet - Audrey\n07 - Al Cohn &amp; Bill Perkins &amp; Richie Kamuca - Blue Skies\n08 - Henri Renaud Al Cohn - You Stepped Out Of A Dream\n09 - Lee Konitz and Warne Marsh - There Will Never Be Another You\n10 - Warne Marsh - Smog Eyes\n11 - Art Pepper - You Go To My Head\n12 - Bill Perkins - Let Me See\n13 - Zoot Sims - I Understand\n14 - Al Cohn Quintet featuring Zoot Sims - Just You, Just Me\n15 - Bud Shank &amp; Bob Cooper - Dinah\n16 - Lee Konitz - Soddy and Bowl\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:a1fe42b404228d049004fbdf0ce299330b611199","amp;dn":"Lester+Young+-+2009+-+Memory+Friends+%26amp%3B+Sons+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1fe42b404228d049004fbdf0ce299330b611199","infoHashBuffer":{"type":"Buffer","data":[161,254,66,180,4,34,141,4,144,4,251,223,12,226,153,51,11,97,17,153]},"announce":[],"urlList":[]}}