{"title":"The Go Find - [2014] - Brand New Love","uid":9679624,"size":83882862,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a221f9f2b9d7b5b5e24751ac5379b129900b9ed2&amp;dn=The+Go+Find+-+%5B2014%5D+-+Brand+New+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RiPPlNKiTTlN","files":-1,"time":1393639493,"description":"iTunes edition / untouched (M4A format) 10/10 audio quality\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \nReleased:  07 Feb 2014\n\n\n\nThe Go Find's Dieter Sermeus had his formula figured out when he started the band in 2004. Namely, take sad, sweet pop songs, add electronics, shake gently, and serve warm. It's served them well, especially on 2011's excellent album Everybody Knows It's Gonna Happen Only Not Tonight, where his songwriting took a big jump and he started crafting really affecting melodies that lingered in the listener's mind long after the album was done. He's done something similar on the band's fourth album, 2014's Brand New Love, only this time he adds some classic synth pop touches and a healthy dose of smooth soft rock textures into the mix. As to the former, the record is made up of washes of vintage keys, bubbling rhythm sequences, and warm pads that surround Sermeus' tender vocals with a smooth embrace. The soft rock influence comes out in tracks like &quot;The Lobby&quot; and &quot;Japan,&quot; where the song structures and arrangements seem like they are on loan from Toto or Steely Dan, and Sermeus' smooth-as-glass croon floats through the mix like ice cubes in a cocktail. The small upgrade in sound proves to be a nice lateral move that keeps the album from sounding exactly like part two of Everybody Knows, but also doesn't jump so far ahead that it leaves behind the many pleasures of that album. There are even some very nice surprises like &quot;On the Rebound,&quot; which features a lovely female vocal and some melancholy pedal steel guitar keening in the distance, and the almost disco-ish pulse of one of the record's most immediate songs, &quot;Jungle Heart.&quot; Adding up the new sounds, the slight left turns, and the emotional power of the sneakily catchy modern pop songs that make up the bulk of the album, it's easy to come to the conclusion that Brand New Love is the Go Find's finest album. Considering how good the first three were, that's saying something. \n\n\n\n\n1   Jungle Heart            4:16\n\n2   The Lobby               3:45\n\n3   We Run                  3:20\n\n4   Your Heart              3:55\n\n5   We Promised Together    3:27\n\n6   Summer Boys             4:10\n\n7   Japan                   4:40\n\n8   On the Rebound          3:25\n\n9   The Message             3:02\n\n10  The River               4:04\n\n\n\n\nGenres: Indie Rock, Music, Alternative, Rock\nReleased: Feb 07, 2014\n2014 Morr Music\n","torrent":{"xt":"urn:btih:a221f9f2b9d7b5b5e24751ac5379b129900b9ed2","amp;dn":"The+Go+Find+-+%5B2014%5D+-+Brand+New+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a221f9f2b9d7b5b5e24751ac5379b129900b9ed2","infoHashBuffer":{"type":"Buffer","data":[162,33,249,242,185,215,181,181,226,71,81,172,83,121,177,41,144,11,158,210]},"announce":[],"urlList":[]}}