{"title":"The Anthony Cumia Show 2015-03-10 MP4 MP3 combo","uid":11747601,"size":283027346,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a3169ecb931cc3ecd6f055aa3bcf1e181242031c&amp;dn=The+Anthony+Cumia+Show+2015-03-10+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mothergoose58","files":2,"time":1426090706,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 124: Frankie Valli, oops, Anthony Cumia starts Tuesday discussing Hillary Clinton's press conference regarding her e-mail use, a few callers give their feedback on anything but Hillary Clinton, we get a fun fact from &quot;Planet of the Apes&quot;, Ant professes his love for downloading on-line games from &quot;Steam&quot;, and then shows us a couple of extremely questionable games he came across. We take a look at the latest fallout due to the University of Oklahoma &quot;racist chant&quot;, see the former &quot;house mother&quot; from Sigma Alpha Epsilon, test out the new staff cameras (we hope you're happy people!), Ant questions where all of this &quot;offensive&quot; speech can possibly be headed and when it will end, and callers inquire about both Artie Lange and Joe DeRosa. We watch a heated race relations clip from Hannity, hear about a &quot;mob attack&quot; at Chuck E. Cheese, see an ABC investigation video on violence at Chuck E. Cheese, KtC recaps an episode of Scandal and comes to the conclusion that the producers of the show as well as ABC are total pieces of shit, Rat fucks up, we learn that border officials in Quebec can force you to give up your phone password, and Ant shows us a couple of photos from his phone.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:a3169ecb931cc3ecd6f055aa3bcf1e181242031c","amp;dn":"The+Anthony+Cumia+Show+2015-03-10+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3169ecb931cc3ecd6f055aa3bcf1e181242031c","infoHashBuffer":{"type":"Buffer","data":[163,22,158,203,147,28,195,236,214,240,85,170,59,207,30,24,18,66,3,28]},"announce":[],"urlList":[]}}