{"title":"Traitors  Gate","uid":8157964,"size":2471048748,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a3c40c3cdbb999325769b6563c71d238578826b1&amp;dn=Traitors++Gate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"esharoth","files":-1,"time":1361196045,"description":"Title: Traitors Gate\nGenre: adventure / puzzle-solving / 1st-person\nReleased: 18th May 2000\nDeveloper: Daydream Software\nPublisher: DreamCatcher Interactive\nDescription:\nThe Pentagon suspects that one of its directors is planning to steal the world famous British Crown Jewels using classified information and secret blueprints. As Special Agent Raven, you must infiltrate the heavily guarded Tower of London to locate and replace the Jewels with exact replicas. These specially created replicas have been fitted with sophisticated tracking systems that will lead the CIA to the defected director and his accomplices when the heist occurs. To succeed, you will need to out-fox the highly trained security guards and multi-million dollar surveillance system protecting the Jewels.\n\nTraitors Gate boasts more than 100 puzzles and 100 hours of gameplay, featuring cinematic views with 360 degree movement. Players can follow more than 1200 different paths in their quest, through an exact recreation of the Tower of London environemnt and security systems. More than 100 objects and tools can be used throughout the game to avoid or disable security cameras, alarm systems and motion and heat detectors.\n\nHow to play:\n1) Burn disc image TG1.iso or mount it on a virtual drive;\n2) Run Install.exe and install the game (after the installation is complete the installer will attempt to run the setup for QuickTime 3, which will fail on 64-bit versions of Windows; you can ignore the errors that appear if setup fails, otherwise if you're using a 32-bit version of Windows simply cancel setup);\n3) Play the game with the disc inserted (you will have to swap discs during gameplay; also read notice below).\n\n! Notice\nI was able to play the game on Windows 7 x64 using QuickTime Alternative (it should also work on Windows XP, Vista and 8). I have included the installer for QuickTime Alternative, run QuickTime_Alternative_322.exe to install it (uninstall other versions of QuickTime first). You can also use QuickTime 4, but newer versions won't work.","torrent":{"xt":"urn:btih:a3c40c3cdbb999325769b6563c71d238578826b1","amp;dn":"Traitors++Gate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3c40c3cdbb999325769b6563c71d238578826b1","infoHashBuffer":{"type":"Buffer","data":[163,196,12,60,219,185,153,50,87,105,182,86,60,113,210,56,87,136,38,177]},"announce":[],"urlList":[]}}