{"title":"Jan A. M. Snoek - Initiating Women in Freemasonry [2012][A]","uid":10317299,"size":11958284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a49ad72a2e61129f9b368f5f43b06e88cf8c00d0&amp;dn=Jan+A.+M.+Snoek+-+Initiating+Women+in+Freemasonry+%5B2012%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1402265649,"description":"Description\nProduct Details\nBook Title: Initiating Women in Freemasonry (Aries Book Series: Texts and Studies in Western Esotericism)\t\nBook Author: Jan A. M. Snoek\nSeries: Aries Book Series: Texts and Studies in Western Esotericism (Book 13)\nHardcover: 518 pages\nPublisher: BRILL (January 1, 2012)\nLanguage: English\nISBN-10: 9004210792\nISBN-13: 978-9004210790\n\n===================================================================================\nBook Description\nPublication Date: January 1, 2012 | ISBN-10: 9004210792 | ISBN-13: 978-9004210790\nFreemasonry is generally regarded a male phenomenon. Yet, both before 1723 and since 1744, women were initiated as well. This book is about the rituals, used for the initiation of women in the Adoption Lodges, since the middle of the 18th century. It describes their contents, roots and creation before reviewing and conceptualising their development in the past three centuries. It analyses the different families of rituals within the Adoption Rite, and gives an overview of specific developments, showing how the rituals were adapted to their changing contexts. Apart from its relevance for the history of Freemasonry in general and the Adoption Rite in particular, the book also writes a hitherto unknown chapter of womens history. Of particular interest for the history of feminism is the chapter about the 20th century, which could only be written now that the documents concerning it, which had been moved to Moscow in 1945, had been returned in 2000.\n\n===================================================================================\nReview\nWith his new book, Initiating Women in Freemasonry: The Adoption Rite, the author, gallantly, has thrown a gauntlet into the scholarly arena. - Ruben Gurevich - St, Catharines, Ontario.\n\n===================================================================================\nAbout the Author\nDr. Jan Snoek, Ph.D. (1987) in the Sciences of Religions, University of Leiden (The Netherlands), is attached to the Institute for the Sciences of Religions at the University of Heidelberg (Germany), and published widely about the development of masonic rituals. With Jens Kreinath and Michael Stausberg he published Theorizing Rituals (two volumes), Brill 2006 &amp; 2007, and with Alexandra Heidle Women's Agency and Rituals in Mixed and Female Masonic Orders, Brill 2008.\n===================================================================================","torrent":{"xt":"urn:btih:a49ad72a2e61129f9b368f5f43b06e88cf8c00d0","amp;dn":"Jan+A.+M.+Snoek+-+Initiating+Women+in+Freemasonry+%5B2012%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49ad72a2e61129f9b368f5f43b06e88cf8c00d0","infoHashBuffer":{"type":"Buffer","data":[164,154,215,42,46,97,18,159,155,54,143,95,67,176,110,136,207,140,0,208]},"announce":[],"urlList":[]}}