{"title":"Todd Snider - The Devil You Know [2006][EAC/FLAC]","uid":11731693,"size":257471417,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4a5e4e20e7dd8900d157844e04e1d973373817f&amp;dn=Todd+Snider+-+The+Devil+You+Know+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":14,"time":1425411012,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: New Door Records #AAB000666302\nCountry: USA\nYear: August 8, 2006\nGenre: americana\nFormat:CD\n\nIf Tomorrow Never Comes (02:55)\nLooking for a Job (03:46)\nJust Like Old Times (04:37)\nCarla (02:47)\nYou Got Away With It (03:45)\nThe Highland Street Incident (03:07)\nThin Wild Mercury (03:36)\nThe Devil You Know (04:54)\nUnbreakable (02:52)\nAll That Matters (03:22)\nHappy New Year (03:52)\n\nUniversal Music's New Door Records subsidiary has the unusual if not unprecedented assignment of giving artists second chances at major label contracts. It seeks out people who once recorded for labels now controlled by Universal and re-signs them. Singer/songwriter Todd Snider had a three-record tenure with Margaritaville Records, Jimmy Buffett's vanity imprint with MCA, which later merged with PolyGram to form Universal. Snider then went to John Prine's indie label, Oh Boy Records. Universal signaled its renewed interest in Snider in 2005 when its Hip-O reissue subsidiary released That Was Me: The Best of Todd Snider 1994-1998, and now New Door has brought him back into the fold. Snider is certainly a man in need of second chances, in both personal and career terms, and his talent suggests he's also deserving of another look. Throughout his career, he has been a charter member of popular music's club of endearing screwups, tracing back to Hank Williams and beyond, artists whose talent could not be untangled from their tendency toward bad behavior. He remains unrepentant on The Devil You Know, playing alternately in Rolling Stones-like rock &amp; roll arrangements and hard country acoustic styles. The characters in his songs, many of them first-person narrators, are charming ne'er-do-wells, starting with the one in the Chuck Berry-style rocker &quot;If Tomorrow Never Comes&quot; who snarls, &quot;If tomorrow never comes, I don't give a damn.&quot; (No, this isn't a cover of the super-sensitive Garth Brooks song of the same title.) From there, the &quot;I&quot; characters spar with their bosses, their old friends, and their girlfriends, never too far away from another drink and another trip down the road. Snider is acutely aware that other performers have been down that road before. In &quot;Thin Wild Mercury&quot; (a title Dylanologists will recognize as Bob Dylan's description of the sound he was looking for when he made Blonde on Blonde), Snider eulogizes Phil Ochs, recalling a reported dispute between Ochs and Dylan. It's no surprise that his sympathies lie with Ochs, who self-destructed, rather than Dylan, who went on to a long career. Addressing an equally dissolute friend of his in &quot;Just Like Old Times,&quot; Snider sings admiringly, &quot;Your goal was always the same as mine/You didn't want to throw a fishin' line in that old mainstream.&quot; And that brings back the question of what Snider is doing on a major label again. But then, if they offered, why not? And perhaps the answer is found in the album title. Certainly, he hasn't done any compromising for commercialism on this disc, other than perhaps to spend a little more money in the studio. The executives at New Door, for their part, may feel that they have Ryan Adams' long lost older brother on their hands. And they may be right","torrent":{"xt":"urn:btih:a4a5e4e20e7dd8900d157844e04e1d973373817f","amp;dn":"Todd+Snider+-+The+Devil+You+Know+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a5e4e20e7dd8900d157844e04e1d973373817f","infoHashBuffer":{"type":"Buffer","data":[164,165,228,226,14,125,216,144,13,21,120,68,224,78,29,151,51,115,129,127]},"announce":[],"urlList":[]}}