{"title":"The Chipmunks-Greatest Christmas Hits 320cbr","uid":9343493,"size":91332930,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4c4712287ebd03891f4a1ea85a05efa2e61e305&amp;dn=The+Chipmunks-Greatest+Christmas+Hits+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386983848,"description":"Source: 1999 CD 17 Tracks\n-\nThe Chipmunks-Greatest Christmas Hits 320cbr (Big Papi) 1999 \n-\n-\n\nBy Lawrance M. Bernabo HALL OF FAMEVINE VOICE\nIt is certainly good to know that after all these many years Alvin still wants a hula-hoop for Christmas. Granted, listening to the Chipmunks sing ANYTHING is something of an acquired taste. I still listen to the Chipmunks cover the early hits of the Beatles, but there is also something to be said for putting on this CD of the &quot;Chipmunks' Greatest Christmas Hits&quot; during the holidays, especially this year when the semester is ending the weekend before Christmas. When the final days of shopping and everything get more and more frantic, listening to these songs can puts things back in perspective. After all, the Chipmunks are simply normal recordings speeded up (in the &quot;old days,&quot; with reel to reel tapes you could make your own &quot;Chipmunk&quot; recordings). So, if you do not find this sort of music the equivalent of fingernails on a blackboard, you can certainly find some infectious holiday tunes here. Of course there is &quot;The Chipmunk Song (Christmas Don't Be Late),&quot; Alvin and the boys struggle to make it all the way through &quot;The Twelve Days of Christmas,&quot; and Rudolph makes a guest appearance on &quot;Rudolph, the Red-Nosed Reindeer.&quot; For that matter, David Seville does a nice job on a poignant version of &quot;Have Yourself a Merry Little Christmas.&quot; You will not find Christmas hymns in this collection, because even the Chipmunks knew were to draw the line. With 17 tracks this is a great album for kids, or for those who remember these songs from when they were kids, which puts &quot;Chipmunks Greatest Christmas Hits&quot; squarely in the realm of the nostalgic, right where it belongs.","torrent":{"xt":"urn:btih:a4c4712287ebd03891f4a1ea85a05efa2e61e305","amp;dn":"The+Chipmunks-Greatest+Christmas+Hits+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4c4712287ebd03891f4a1ea85a05efa2e61e305","infoHashBuffer":{"type":"Buffer","data":[164,196,113,34,135,235,208,56,145,244,161,234,133,160,94,250,46,97,227,5]},"announce":[],"urlList":[]}}