{"title":"Girls' Night Out (Bad Boys #4) - Susan Arden","uid":11012080,"size":4085811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4c9dacf82ad89e1eb5c414636cbab2f586d8bb3&amp;dn=Girls%27+Night+Out+%28Bad+Boys+%234%29+-+Susan+Arden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DethHolly","files":6,"time":1410379333,"description":"GIRLS' NIGHT OUT Hold on to your hats 'cause the hotties from Evermore Ranch are on their way to the big city for the weekend. When Dallas Devils' tight end, Brett Gold's fiancee left him a year ago, he swore off getting involved with spoiled little rich girls. Brett became the ultimate bad boy on and off the field to escape his personal life shot to hell. Only a fool would tangle with the little sister of the McLemore brothers. So far, all men with a lick of sense have left Cory McLemore alone. But now Cory is back from college and ready to party. This cowgirl crafts the perfect getaway to Dallas for a girls' night out never suspecting the man she bumped into at the airport is about to become the missing link in her quest for a wild adventure. Cory soon finds out that Brett is harder to walk away from a second time when she discovers the man beneath the bad boy persona is far different than she ever imagined. One night with Cory has Brett scrambling. This NFL baller meets up with her family and it'll take more than fast hands and fancy footwork to score points with a group of hardcore McLemore. With seconds left on the clock, Brett isn't about to let this Texas spitfire get away. Evermore Ranch cuties and a whole lot of HAWT McLemore men are rounded up for this a Girls' Night Out (Book 4) in the Bad Boys series.\n\n- - -\n\nFormats: EPUB, MOBI, AZW3, PDF\nASIN#: B00HUCDVY8\nISBN#: 1494937751\nISBN13#: 9781494937751\nPublished: January 7th, 2014\nLanguage: English","torrent":{"xt":"urn:btih:a4c9dacf82ad89e1eb5c414636cbab2f586d8bb3","amp;dn":"Girls%27+Night+Out+%28Bad+Boys+%234%29+-+Susan+Arden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4c9dacf82ad89e1eb5c414636cbab2f586d8bb3","infoHashBuffer":{"type":"Buffer","data":[164,201,218,207,130,173,137,225,235,92,65,70,54,203,171,47,88,109,139,179]},"announce":[],"urlList":[]}}