{"title":"Luther Allison - Live In Chicago(1999)Mp3[CR-Bt]","uid":4652817,"size":316129493,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a574e4df3e129a14e1f0536f2e1aa63014c48bab&amp;dn=Luther+Allison+-+Live+In+Chicago%281999%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CR-Bt","files":19,"time":1232067432,"description":"Nato a Mayflower, Arkansas, il 17/08/39, cresciuto in una numerosa famiglia, Luther si appassiona molto presto alla musica, cominciando a cantare nel Gospel Group di famiglia che alla fine degli anni quaranta girerÃƒÂ  per tutti gli stati del sud. Nel 1952 si stabilisce a Chicago e qui impara a suonare la chitarra e ad accostarsi al Blues.\nE' da quel momento che Luther Allison diventa amico di quasi tutti i musicisti che animano la scena del West Side. Suona con Jimmy Dawkins, Fredd King e in particolare con Magic Sam, in seguito ci saranno le sessions in California con Shakey Jake, Sunnyland Slim e Johnnny Shines.\nIl vero decollo di Luther si puÃƒÂ² far risalire all'epoca della sua prima partecipazione al festival di Ann Arbor, nel Michigan, nel 1970, dove davanti a un pubblico estasiato arriva a misurarsi con i &quot;grandi&quot; del blues: Muddy Waters, Howlin' Wolf, Otis Rush. Da quel momento, diviene famoso, inciderÃƒÂ  un mitico album per la Delmark, intitolato &quot;Love me Mama&quot;. Luther Allison si puÃƒÂ² considerare fra i creatori del nuovo West Side Sound, sviluppa i tratti distintivi di un suono che lo vede solista veemente e sofferto, ma sempre lucido, dotato di notevoli capacitÃƒÂ  vocali.\nConvinto che il blues sia una musica universale che era stata, ma che non era piÃƒÂ¹ esclusivamente l'espressione della comunitÃƒÂ  di colore, Luther si circonda, nella seconda parte della sua carriera, di musicisti bianchi e si stabilisce addirittura in Francia negli anni ottanta. Rientrato a Chicago, incide due ottimi album per la Alligator. Luther Allison rimane a tutt'oggi uno dei personaggi piÃƒÂ¹ importanti del blues, un musicista che assolutamente va tanto ascoltato quanto visto suonare. \n","torrent":{"xt":"urn:btih:a574e4df3e129a14e1f0536f2e1aa63014c48bab","amp;dn":"Luther+Allison+-+Live+In+Chicago%281999%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a574e4df3e129a14e1f0536f2e1aa63014c48bab","infoHashBuffer":{"type":"Buffer","data":[165,116,228,223,62,18,154,20,225,240,83,111,46,26,166,48,20,196,139,171]},"announce":[],"urlList":[]}}