{"title":"Twilight Of The Ice Nymphs - Guy Maddin - 1997","uid":7351319,"size":734230528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5ba663ad5c3e3526b2dd3d90622c6c86b004fbf&amp;dn=Twilight+Of+The+Ice+Nymphs+-+Guy+Maddin+-+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"HurnBollywoodHurn","files":1,"time":1339610344,"description":"Peter Glahn is released after years of incarceration as a political prisoner and is now returning to his homeland, the mythical Mandragora where the sun never sets. On board the ship home, he meets the mysterious Juliana Kossel who vanishes after stealing his heart. Once he arrives on the island, he goes to the family ostrich farm run by his sister Amelia. He finds Amelia living with a farmhand named Cain Ball who fears that Peter's return will endanger the agreement he made with Amelia that will see him inherit the farm. Amelia has since fallen for the vain Dr. Isaac Solti who controls the island and has a hold on both Zephyr Eccles, the widow of a local fisherman, and Juliana, Peter's dream girl from the ship. Solti's true obsession is a recently discovered statue of Venus that possesses strange powers. All the characters meet at Solti's lab where the sexual tensions erupt. (From IMDB)\n\nNOT MY RIP\n\nLanguage : English\n\n***************************************************\n\n    Freakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n        The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n        If you have films that fit this description feel free to share them and participate in our community. All you need to do is include this tag in your upload and join us at the forum to announce your release.\n\n       &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n        'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:a5ba663ad5c3e3526b2dd3d90622c6c86b004fbf","amp;dn":"Twilight+Of+The+Ice+Nymphs+-+Guy+Maddin+-+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5ba663ad5c3e3526b2dd3d90622c6c86b004fbf","infoHashBuffer":{"type":"Buffer","data":[165,186,102,58,213,195,227,82,107,45,211,217,6,34,198,200,107,0,79,191]},"announce":[],"urlList":[]}}