{"title":"Roger Teichmann - Nature, Reason, and the Good Life. Ethics for ","uid":11213303,"size":1994708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a688c0b42d201e52e452c36745940531cf2264b6&amp;dn=Roger+Teichmann+-+Nature%2C+Reason%2C+and+the+Good+Life.+Ethics+for+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1413296830,"description":"Description\nProduct Details\nBook Title: Nature, Reason, and the Good Life: Ethics for Human Beings\t\nBook Author: Roger Teichmann (Author)\nHardcover: 224 pages\nPublisher: Oxford University Press (August 15, 2011)\nLanguage: English\nISBN-10: 019960617X\nISBN-13: 978-0199606177\n\nBook Description\nPublication Date: August 15, 2011\nAt the centre of our ethical thought stands the human being. Facts about human nature determine the shape of ethical concepts in a variety of ways, and our pre-rational animal nature forms the basis of notions to do with rationality, virtue, and happiness, among other things. Nature, Reason, and the Good Life examines these themes while also arguing for the critical importance of language: only by attending to the social and empirical character of actual language use can we make headway with a number of problems in ethics. Thus what counts as a good or bad reason for action depends on the purposes of human enquiry, as embodied in the question 'Why?' -- it does not depend, for example, on some abstract and higher Rationality connected with 'the point of of view of the cosmos'. Furthermore, considerations in philosophy of language and in philosophy of mind together show how emotions, desires, and pleasure -- all crucial for ethics -- turn out not to be inner states carrying a sort of subjective authority, above or below criticism or justification, and this fact helps undermine various forms of subjectivism and individualism to be found both in philosophy and in the wider culture. Starting from an examination of foundational issues, the book covers a range of topics, including animals, agency, enjoyment, the good life, contemplation, death, and the importance of philosophy. En route, there are critiques of a number of prevalent trends of thought, such as utilitarianism, anti-speciesism, relativism, scientism and even 'ism'-ism.\n\nReview\n&quot;This is a fascinating book full of fruitful ideas from someone with diverse academic interests.&quot;--CHOICE\n\nAbout the Author\nRoger Teichmann has written on a wide range of philosophical topics, from the philosophy of time to ethics. His work on the philosophy of Elizabeth Anscombe is noteworthy: he is the author of a number of articles, a Festschrift, Logic, Cause and Action, and the monograph, The Philosophy of Elizabeth Anscombe","torrent":{"xt":"urn:btih:a688c0b42d201e52e452c36745940531cf2264b6","amp;dn":"Roger+Teichmann+-+Nature%2C+Reason%2C+and+the+Good+Life.+Ethics+for+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a688c0b42d201e52e452c36745940531cf2264b6","infoHashBuffer":{"type":"Buffer","data":[166,136,192,180,45,32,30,82,228,82,195,103,69,148,5,49,207,34,100,182]},"announce":[],"urlList":[]}}