{"title":"AUSTRALIA - Songs of the Aborigines and Music of Papua, New Guin","uid":4715796,"size":107537527,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a6bd51292f68a7dcc1403661e18995b3491d9c2e&amp;dn=AUSTRALIA+-+Songs+of+the+Aborigines+and+Music+of+Papua%2C+New+Guin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":41,"time":1234271647,"description":"S t a r i n a r T o r r e n t s - M u s i c O f O u r A n c e s t o r s \n         Shamanic, Tribal, Ritual, Sacred and Indigenous Music\n\nAustralia - Songs of the Aborigines and Music of Papua, New Guinea (1963)\n\n\ncollector: Wolfgang Laade\noriginally released on LP as Lyrichord LLST-73318\nrecorded: 1963\npossibly out of print\n\n\nField recordings by Wolfgang Laade, Professor of Ethnomusicology at the\nUniversity of Zurich, sponsored by the Australian Institute of Aboriginal\nStudies. \n\nAustralia is a collection of thirty-six songs, twenty-nine of them Australian\nand the last seven from Papua New Guinea. The music is arranged in blocks,\nwith all twenty-two of the tracks from the Cape York Peninsula gummed together\nin a single droning chunk, followed by the livelier, noisier Elcho Island\nsection and then a varied sampling of Papua New Guineans. This is sound\npractice if you are an ethnomusicologist, but to a casual listener it cries\nout for some editorial interference. \n\nLeaven Cape York with Elcho Island. Set those feathery, hesitant Cape voices\nbouncing against the didjeridu and clap-sticks of the Djadbangari Dance Song\n(track 23). Follow the shy tobacco-tin drumming of the Women's Wungka Dance\nSong with track twenty-five's bold animal impersonations. Scatter the Papua\nNew Guinean songs through the rest. And please stop spelling Papua New Guinea\nwith a comma. It looks odd. \n\nHere's a problem though: before you mixed the songs together you would first\nhave to change the sound quality of Wolfgang Laade's field recordings to match\nthe cleaner tones of the tracks from the Institute. The Cape York recordings\nare particularly muddy, and even the superior pieces from Elcho would sit badly\nnext to, say, the Explorer series that Nonesuch is currently re-releasing.\nOne comes away with the impression that Lyrichord wanted simply to fill a disc\nand snatched up whatever they could find without being too discriminating.\nThis is bourne out by the notes inside the CD cover, which look as if they\nhave been copied, unchanged, from two different sources with two different\nstyles of prose.\n\nAustralia: Songs of the Aborigines and Traditional Music of Papua, New Guinea\nhas its moments, and the last section is a handy, quick overview of a variety\nof Papuan traditional music from the Daru area in the south, but, taken\nas a whole, the compilation is interesting rather than enjoyable, \n\npay attention to:\n23 - Djadbangari Dance Song 'East Wind' \n24 - Karidyeri Dance Song\n25 - Didjeridu Solo a Trial And a Crying Child \n26 - Didjeridu Solo a Big Truck on the Mission\n27 - Bunggul Dance Song 'Seagull'\n28-29 - Bunggul Dance Song 'Spider'\n\nThere's Wiryi on yirdaki, considered to be best yirdaki player on Elcho Island at the time.\n\nQuality: 256Kbps + cover\n\n\nEARTHMUSIC.WORDPRESS","torrent":{"xt":"urn:btih:a6bd51292f68a7dcc1403661e18995b3491d9c2e","amp;dn":"AUSTRALIA+-+Songs+of+the+Aborigines+and+Music+of+Papua%2C+New+Guin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6bd51292f68a7dcc1403661e18995b3491d9c2e","infoHashBuffer":{"type":"Buffer","data":[166,189,81,41,47,104,167,220,193,64,54,97,225,137,149,179,73,29,156,46]},"announce":[],"urlList":[]}}