{"title":"Sense.And.Sensibility.1995.x264.AC3+aac.Audios.En.It.Spa.15.Subs","uid":7276537,"size":1923125136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a708d20968f4e282c7f525650e77c97d89a2b298&amp;dn=Sense.And.Sensibility.1995.x264.AC3%2Baac.Audios.En.It.Spa.15.Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Iznogoud9","files":-1,"time":1337300059,"description":"Multimedia Container Format: MKV (matroska)\nFile Size: 1,79 GB (1 878 006 KB) \nResolution: 720x400 (1,78:1)\nVideo Codec: x264 (1200 kbps)\nAudio Codecs: AC3 (5.0 channels - 448 kbps), aac (2 channels, 128 kbps)\nAudio Languages: English (AC3), Italian (Italiano, aac), Spanish (Espanol, aac)\nFrame Rate: 25,00 fps\nSource: DVD9 (PAL)\n\nInternal Subtitles: English, Italian (Italiano), Spanish (Espanol), Dutch (Nederlands), Czech (Cesky), Danish (Dansk), Finnish (Suomi),  Greek (EAAHNIKA), Hebrew (Ivrit), Hungarian (Magyar), Icelandic (Islenska), Norwegian (Norsk), Polish (Polski), Portuguese (Portugues)Swedish (Svenska)\n\nSubtitle Format: VobSub\n\nRunning Time: 02:10:41\n\n*****  SENSE AND SENSIBILITY (1995) *****\n\nNote: The film won an Oscar in 1996: Best Writing, Screenplay Based on Material Previously Produced or Published - Emma Thompson \nIMDb link:  &lt;a href=&quot; http://www.imdb.com/title/tt0114388/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0114388/&lt;/a&gt;\nIMDb User Rating: 7.7/10 from 41,855 users\n\nDirected by: Ang Lee\nWritten by: Jane Austen (novel), Emma Thompson (screenplay) \nStars: Emma Thompson, Kate Winslet, Hugh Grant, Alan Rickman\n\nPLOT SUMMARY:\n\nDeftly setting the stage in late 18th-century rural England, pic briskly delineates the suddenly reduced circumstances of widow Dashwood (Gemma Jones) and her three lovely daughters after the death of her husband. By law, the vast estate in which they live must pass to the deceased's son by a previous marriage , who moves in with his snobbish wife, Fanny, and leaves the female brood to make do on a measly 500 pounds per year.\n\nEldest daughter Elinor (Emma Thompson) is the sensible one, a bright, if emotionally stunted, woman widely regarded as an incipient spinster. Middle daughter Marianne (Kate Winslet), in her late teens, is quite the opposite, a reckless romantic who can't abide her sister's restrained propriety. Little sister Margaret (Emile Francois) is an 11-year-old tomboy who spends most of her time in her treehouse avoiding the adults.\n\nThey are finally provided with a suitable, if cramped, cottage by a cousin, but not before they meet Fanny's shyly charming brother, Edward (Hugh Grant), who establishes a strong rapport with Elinor. But just as it appears that he may propose, Edward is dispatched by Fanny to London, leaving Elinor utterly in the dark about their future.\n\nSetting up in their new abode, the women are reliant for their social lives on the boisterous, conspiratorial Sir John Middleton (Robert Hardy) and his mother-in-law, Mrs. Jennings (the irrepressible Elizabeth Spriggs). The wealthy, brooding, middle-aged Col. Brandon (Alan Rickman) comes to call, but Marianne finds her romantic dreams come to life in the person of the dashing John Willoughby (Greg Wise), who, in highest melodramatic style, appears on horseback to rescue the injured girl in the heath and literally sweeps her off her feet.\n\nSCREENS:\n  &lt;a href=&quot;\nhttp://image.bayimg.com/laoebaadk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/laoebaadk.jpg&lt;/a&gt;  &lt;a href=&quot;\nhttp://image.bayimg.com/laoecaadk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/laoecaadk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/laoedaadk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/laoedaadk.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a708d20968f4e282c7f525650e77c97d89a2b298","amp;dn":"Sense.And.Sensibility.1995.x264.AC3%2Baac.Audios.En.It.Spa.15.Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a708d20968f4e282c7f525650e77c97d89a2b298","infoHashBuffer":{"type":"Buffer","data":[167,8,210,9,104,244,226,130,199,245,37,101,14,119,201,125,137,162,178,152]},"announce":[],"urlList":[]}}