{"title":"Shredded (Extreme Risk #1) by Tracy Wolff.epub","uid":9568263,"size":1032793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7ccb493a61de6b0144ebdd7353e9b4499a96173&amp;dn=Shredded+%28Extreme+Risk+%231%29+by+Tracy+Wolff.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bluanjel","files":1,"time":1391564031,"description":"In this intense and exhilarating New Adult series debut, a hotshot snowboarder and a vulnerable rebel with a cause try to let go of the pastÂ—and find a future in each other.\n\n Twenty-one-year-old professional snowboarder Z Michaels is the bad boy of Park City, Utah. HeÂ’s always had his pick of any girl in townÂ—and on the competition circuit. But underneath his cool exterior is a young man in turmoil, trying to take the edge off tragedy by overindulging in sex and shredding the slopes. In fact, ZÂ’s reckless behavior is a thinly veiled attempt to blunt his emotional suffering with physical pain.\n\n Ophelia Richardson isnÂ’t like any girl Z has ever met. Though sheÂ’s from New Orleans high society, sheÂ’s no Southern belleÂ—and sheÂ’s not shy about being miserable in frozen, godforsaken Park City. But laying low is her only option after her ex, a rich boy who couldnÂ’t take no for an answer, nearly killed her in a jealous rage. Following that terrifying encounter, the last thing Ophelia needs is a boyfriendÂ—especially one as rich and arrogant as Z. But Ophelia soon discovers that he isnÂ’t what he seems. If anything, Z may be even more damaged than she is.\n\n Tormented by their pasts and feeling alone in the world, Z and Ophelia find a connection unlike any theyÂ’ve ever known. But with Ophelia hiding the details of her life in Louisiana and ZÂ’s death wish reaching terrifying new heights, their relationship seems to be going downhill before it even beginsÂ—unless they can find the strength in each other to trust, grow, and love again.","torrent":{"xt":"urn:btih:a7ccb493a61de6b0144ebdd7353e9b4499a96173","amp;dn":"Shredded+%28Extreme+Risk+%231%29+by+Tracy+Wolff.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7ccb493a61de6b0144ebdd7353e9b4499a96173","infoHashBuffer":{"type":"Buffer","data":[167,204,180,147,166,29,230,176,20,78,189,215,53,62,155,68,153,169,97,115]},"announce":[],"urlList":[]}}