{"title":"Crochet Stitch","uid":4367609,"size":1298164,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a841b04a376a8bd777da162db137d5e045580862&amp;dn=Crochet+Stitch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"crochgal","files":1,"time":1219968262,"description":"Crochet Stitch\n\nHi,\n\nI came across this awesome crochet stitch ebook today! If you're a crazy crocheter like me you'll love it! :)\n\nHere is the description from the site:\n\n&quot;Here's what its about&quot;\n\nIt covers advanced crochet stitches and their application in common projects. Now, you've probably mastered the basic stitches and techniques of crochet, you're probably ready to try something a bit more sophisticated. Your creativity is the only limit to what you can do with exciting and fun advanced crochet stitchery.\n\nThe fundamental stitches in crochet are often accented with fancier, sometimes more complicated stitches such as the apple seed stitch or popcorn stitch. There's also completely different styles of crocheting, such as filet or Irish Lace style.\n\nAs they say, variety is the spice of life. This holds true for variety in the crochet world as well. The fun part of crochet is the diversity and creativity that crocheters can employ using various stitches. Well cover some of the most desirable advanced stitches and styles, plus one long lost vintage stitch, in this 11 page report.\n\n\nHere are the stitches we will be covering:\n- Tunisian Crochet\n- Filet Crochet\n- Picot Edge\n- Apple Seed Stitch\n\n\n\n\nIf you don't know how to download a torrent, you can also get it direct from the website here:\n\n\nwww.breakthroughcrochet.com/bbmb1/share\n\n\n\n","torrent":{"xt":"urn:btih:a841b04a376a8bd777da162db137d5e045580862","amp;dn":"Crochet+Stitch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a841b04a376a8bd777da162db137d5e045580862","infoHashBuffer":{"type":"Buffer","data":[168,65,176,74,55,106,139,215,119,218,22,45,177,55,213,224,69,88,8,98]},"announce":[],"urlList":[]}}