{"title":"Richard Laymon - Come out tonight unabridged 64kbs mp3 rkl","uid":4677139,"size":373344726,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a84aa47b3c2296ef604f54be6e569b9c808c73e3&amp;dn=Richard+Laymon+-+Come+out+tonight+unabridged+64kbs+mp3+rkl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"audiobookman","files":15,"time":1232939500,"description":"From Publishers Weekly\nThere's not a crime novelist around who writes cleaner prose than LaymonAand few who can jack up the tension the way he does. Yet despite his popularity overseas and a minor resurgence here (Bite, Forecasts, May 24), his readership has of late been limited in the States. This new novel, his first since The Midnight Tour, probably won't change that. Laymon likes to grasp readers by the neck with expert wordsmithery, then haul them into a diabolical situation. Here, foxy substitute teacher Sherry Gates goes searching for her boyfriend, who's late returning from a condom-run to a local L.A. market, and gets snatched by a homicidal, sex-crazed teen, Toby Bones. Many readers will find that too much of what ensues focuses, graphically, on Toby's violations of Sherry (and others), including rape, child molestation, slashings, beatings, shootings, a beheading and fratricidal murder by electric drill. Laymon's outrageousness is part of his appeal, but in his best books it's leavened by a gratifyingly sardonic sense of humor. That wickedness flashes at times here, as does a surprising tenderness: the series of scenes in which a naked Sherry is aided by two horny teen boys combines both qualities in a dashing display of emotionally complex writing. Once again, Laymon offers unexpected, well-rounded characters blown about in a narrative that moves like the wind. But the many scenes of sadistic torture cross the line from terror to lurid cruelty and will curdle the enjoyment of all but the most dedicated Laymon fans.\nCopyright 1999 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Kirkus Reviews\nThe master of stomach-churning porno-violence (Quake, 1995, etc.) returns, unredeemed and of no social value whatsoever. Laymon fans must always be telling themselves, I'm sick. Im very sick. I must be absolutely worthless to be enjoying this, but, as the authors numerous villainous psychopaths would undoubtedly say, Kill em all! Let God sort em out! This time, the Santa Ana winds are blowing fire toward L.A., and tubby, teenaged Toby Bones, who with his brother murdered his wealthy parents, is on the loose. Teacher Sherry Gates and her boyfriend Duane are just about to make love when his condom falls to pieces. He'll be right back, Duane says, heading for the nearby convenience store for some fresh booties. He never comes back. After a while, Sherry goes looking for him and eventually is kidnaped by Toby, a student from a recent class. He beats and tries to rape her, then decides they need a bed. Sherry escapes, gets a stranger named Jim to help her get back to Duane's place. They find Duane in bed, his skull crushed, then Toby offs Jim with two butcher knives into his back, jumps a woman in Duane's hallway and knifes her in the back, then re-abducts Sherry for some real fun. And that's just for tasty openers as Laymon's novel slides in slime toward a big sweet hell of pain and orgasm.\n\n\nenjoy, and seed to you bleed\naudiobookman","torrent":{"xt":"urn:btih:a84aa47b3c2296ef604f54be6e569b9c808c73e3","amp;dn":"Richard+Laymon+-+Come+out+tonight+unabridged+64kbs+mp3+rkl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a84aa47b3c2296ef604f54be6e569b9c808c73e3","infoHashBuffer":{"type":"Buffer","data":[168,74,164,123,60,34,150,239,96,79,84,190,110,86,155,156,128,140,115,227]},"announce":[],"urlList":[]}}