{"title":"13th Floor Elevators-Bull Of The Woods(1968)(2004 Charly Rem.)[E","uid":4830989,"size":357923001,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a878e2508693705e2c59a10715c9294e9ad2ba87&amp;dn=13th+Floor+Elevators-Bull+Of+The+Woods%281968%29%282004+Charly+Rem.%29%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thewall68","files":35,"time":1239127536,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\nDigitally remastered edition of the legendary first psychedelic band's fourth album. Includes ten bonus tracks, featuring four outtakes from the &quot;Bull Of The Woods&quot; sessions, a sublime acoustic reading of &quot;Splash 1&quot; and material from their live ...    Full Descriptionalbum.\n\n13th Floor Elevators includes: Roky Erickson, Stacy Sutherland, Tommy Hall.\n\n13th Floor Elevators: Roky Erickson (vocals).\n\nEngineers: Hank Poole, Jim Duff, Fred Carroll.\n\n\n\n\nBull of the Woods was the 13th Floor Elevators' last album on which they worked as a group, and despite the near absence of Roky Erickson (his appearance here marked by a mere four out of eleven songs), it is a remarkable album for its moody, dreamy, fuzzed-out psychedelic sound.\n\nIt featured not only the 1967 lineup of Roky Erickson, Stacy Sutherland, Tommy Hall, Danny Thomas, and Dan Galindo, but also Ronnie Leatherman (brought in to fill in a few tracks on bass). It is an album that was largely in part the effort of guitarist Stacy Sutherland, carrying the weight of the song writing credits (five tracks, co-writing a further four with Tommy Hall), and swinging his guitar through multiple uses of delay that dissolve and scatter within the free-wheeling looseness of this album. At one time it was an incomplete album tentatively titled, The Beauty And The Beast. It was released after the group's demise by its record label International Artists late in 1968. May the Circle Remain Unbroken is noted for being one of the most haunting songs ever produced in rock. It is like an elegy for the group, and the ending of an era. The song Street Song has an energy and vitality which was ahead of its time, and gives an intimation of a direction rock might have taken if the commercial forces of corporate marketability, and strict radio guidelines had not become overwhelming as the 70's loomed. Granted the group's open advocacy of the psychedelic experience and use of such terms as 'windowpane' in this song would tend to limit radio airplay. Still, as digitally remastered versions of this and other 13th Floor Elevators albums have become available, there is an ongoing reintroduction of their music to a new generation, and artists such as R.E.M. and U2 have cited them as an influence along with many bands on the L. A. and Austin Texas music scenes.\n\n[Wiki]\n\nThis is the Elevator's swan song, recorded under incredibly difficult circumstances. Their second album failed to land a hit single, as the first one did.PSychedlia was perhaps, on the wane, which this band with irretrievably tied to, which is fair.\nOf course, the obvious circumstance of Roky Erickson's breakdown and hospitalization were the primary reason for the band's demise, but the chemistry had been upset for some time. Electric Jug-ist Tommy Hall had been the main lyricist and LSD as revolutionary tool advocate. The rest of the band were becoming more into hard escapist drugs and grew tired of Hall's philosophy.\nTaking the needle and the mantle was the late lead guitarist Stacy Sutherland, truly an unsung guitar hero if I ever heard one. His playing is just enough country and Syd, not sounding overly slick,and a bit of laid-back Jerry Garcia. His lyrics a more accessable bridge abutting conventional songwriting and Hall's metaphors for the psychedelic journey to self-enlightenment. Sutherland is more grounded, down to earth, dirty and dead-end. Despite his dark nature, band members regard him affectionately.\n\nGreat Stuff \n\n[Amazon user]\n\n\n\n\n1.\tLivin' On\n2.\tBarnyard Blues\n3.\tTil Then\n4.\tNever Another\n5.\tRose and the Thorn\n6.\tDown by the River\n7.\tScarlet and Gold\n8.\tStreet Song\n9.\tDear Dr. Doom\n10.\tWith You\n11.\tMay the Circle Remain Unbroken\n\nBonus Tracks\n\n12.\tFire in My Bones\n13.\tWait For My Love\n14.\tSplash 1\n15.\tRight Track Now\n16.\tBefore You Accuse Me\n17.\tYou Gotta Take That Girl\n18.\tI'm Gonna Love You Too\n19.\tEverybody Loves Someone to Love\n20.\tYou Can't Hurt Me Anymore\n21.\tOriginal Radio Spot For Bull of the Woods Album\n\n\n\n","torrent":{"xt":"urn:btih:a878e2508693705e2c59a10715c9294e9ad2ba87","amp;dn":"13th+Floor+Elevators-Bull+Of+The+Woods%281968%29%282004+Charly+Rem.%29%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a878e2508693705e2c59a10715c9294e9ad2ba87","infoHashBuffer":{"type":"Buffer","data":[168,120,226,80,134,147,112,94,44,89,161,7,21,201,41,78,154,210,186,135]},"announce":[],"urlList":[]}}