{"title":"[Raymond L. Weil]Galactic Empire Wars Emergence (azw, epub, lrf,","uid":11105771,"size":2671786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a89a4232d84bd8e31c0a3bd0cebc1651c524e6ac&amp;dn=%5BRaymond+L.+Weil%5DGalactic+Empire+Wars+Emergence+%28azw%2C+epub%2C+lrf%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":5,"time":1411724859,"description":"Book Description\nPublication Date: September 3, 2014\n\nUSA Today Best Selling Author                                   \n\nAliens have destroyed the Earth. They left behind eighteen million survivors who will never forget what has been done to their world. They turn to Mason Randle, who will do everything in his power to see that the Human race survives.\n\nEarth can no longer support life. The Moon, Mars, and the asteroids now provide safe havens for the stunned survivors. They find a protector in Major Wade Nelson. A dedicated marine who is willing to take the fight to the enemy.\n\nMarken is a Kivean. He is part of an alien race that helped Major Nelson and the other kidnapped military personnel escape from the Kleese. Because of his actions, his home world is now in jeopardy. Can a daring rescue mission save his people from the vengeful Kleese Empire?\n\nThe Kleese. A galaxy spanning empire that sees the Humans as a nuisance that must be eliminated once and for all. They will send their war fleet to annihilate the remaining Humans.\n\nHow can eighteen million survivors bring down an Empire that controls thousands of worlds and is totally merciless? Find out in Galactic Empire Wars: Emergence the second book in this new military science fiction series.\n\n\nPublisher: Raymond L. Weil Publications LLC; 1 edition (September 3, 2014)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00NAK331U\n\nMore About the Author\nBiography\nUSA Today Best Selling Author\n\nI live in Clinton Oklahoma with my wife of 40 years and our cat. I attended college at SWOSU in Weatherford Oklahoma, majoring in Math with minors in Creative Writing and History.\n\nMy hobbies include watching soccer, reading, camping, and of course writing. I coached youth soccer for twelve years before moving on and becoming a high school soccer coach for thirteen more. I also enjoy playing with my five grandchildren. I also have a very vivid imagination, which sometimes worries my friends. They never know what I am going to say or what I am going to do.\n\nI am an avid reader and have a science fiction / fantasy collection of over two thousand paperbacks. I want future generations to know the experience of reading a good book as I have over the last forty years. ","torrent":{"xt":"urn:btih:a89a4232d84bd8e31c0a3bd0cebc1651c524e6ac","amp;dn":"%5BRaymond+L.+Weil%5DGalactic+Empire+Wars+Emergence+%28azw%2C+epub%2C+lrf%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89a4232d84bd8e31c0a3bd0cebc1651c524e6ac","infoHashBuffer":{"type":"Buffer","data":[168,154,66,50,216,75,216,227,28,10,59,208,206,188,22,81,197,36,230,172]},"announce":[],"urlList":[]}}