{"title":"IPv6 Essentials Second Edition","uid":9152765,"size":5040898,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a8d170a8f294e908b7f11d55419e55a6b657e320&amp;dn=IPv6+Essentials+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cabrao","files":-1,"time":1383725146,"description":"IPv6 Essentials, Second Edition provides a succinct, in-depth tour of all the new features and functions in IPv6. It guides you through everything you need to know to get started, including how to configure IPv6 on hosts and routers and which applications currently support IPv6. The new IPv6 protocols offers extended address space, scalability, improved support for security, real-time traffic support, and auto-configuration so that even a novice user can connect a machine to the Internet. Aimed at system and network administrators, engineers, network designers, and IT managers, this book will help you understand, plan for, design, and integrate IPv6 into your current IPv4 infrastructure.\n\nBeginning with a short history of IPv6, author Silvia Hagen provides an overview of new functionality and discusses why we need IPv6. Hagen also shares exhaustive discussions of the new IPv6 header format and Extension Headers, IPv6 address and ICMPv6 message format, Security, QoS, Mobility and, last but not least, offers a Quick Start Guide for different operating systems. IPv6 Essentials, Second Edition also covers:\n\nIn-depth technical guide to IPv6\nMechanisms and Case Studies that show how to integrate IPv6 into your network without interruption of IPv4 services\nRouting protocols and upper layer protocols\nSecurity in IPv6: concepts and requirements. Includes the IPSEC framework and security elements available for authentication and encryption\nQuality of Service: covers the elements available for QoS in IPv6 and how they can be implemented\nDetailed discussion of DHCPv6 and Mobile IPv6\nDiscussion of migration cost and business case\nGetting started on different operating systems: Sun Solaris, Linux, BSD, Windows XP, and Cisco routers\nWhether you're ready to start implementing IPv6 today or are planning your strategy for the future, IPv6 Essentials, Second Edition will provide the solid foundation you need to get started.","torrent":{"xt":"urn:btih:a8d170a8f294e908b7f11d55419e55a6b657e320","amp;dn":"IPv6+Essentials+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d170a8f294e908b7f11d55419e55a6b657e320","infoHashBuffer":{"type":"Buffer","data":[168,209,112,168,242,148,233,8,183,241,29,85,65,158,85,166,182,87,227,32]},"announce":[],"urlList":[]}}