{"title":"Elastica - Elastica [1995]","uid":9697814,"size":290465747,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a8e74d6e881d8a57dd4317be17f0b3c26783ae4e&amp;dn=Elastica+-+Elastica+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1393960193,"description":"Review by Stephen Thomas Erlewine\nElastica's debut album may cop a riff here and there from Wire or the Stranglers, yet no more than Led Zeppelin did with Willie Dixon or the Beach Boys with Chuck Berry. The key is context. Elastica can make the rigid artiness of Wire into a rocking, sexy single with more hooks than anything on Pink Flag (&quot;Connection&quot;) or rework the Stranglers' &quot;No More Heroes&quot; into a more universal anthem that loses none of its punkiness (&quot;Waking Up&quot;). But what makes Elastica such an intoxicating record is not only the way the 16 songs speed by in 40 minutes, but that they're nearly all classics. The riffs are angular like early Adam &amp; the Ants, the melodies tease like Blondie, and the entire band is as tough as the Clash, yet they never seem anything less than contemporary. Justine Frischmann's detached sexuality adds an extra edge to her brief, spiky songs -- &quot;Stutter&quot; roars about a boyfriend's impotence, &quot;Car Song&quot; makes sex in a car actually sound sexy, &quot;Line Up&quot; slags off groupies, and &quot;Vaseline&quot; speaks for itself. Even if the occasional riff sounds like an old wave group, the simple fact is that hardly any new wave band made records this consistently rocking and melodic. (4.5/5)","torrent":{"xt":"urn:btih:a8e74d6e881d8a57dd4317be17f0b3c26783ae4e","amp;dn":"Elastica+-+Elastica+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8e74d6e881d8a57dd4317be17f0b3c26783ae4e","infoHashBuffer":{"type":"Buffer","data":[168,231,77,110,136,29,138,87,221,67,23,190,23,240,179,194,103,131,174,78]},"announce":[],"urlList":[]}}