{"title":"The 99 Most Essential Christmas Masterpieces[mp3]","uid":6897670,"size":605023480,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a902562a3857a41d9c653431ac3490da9a737961&amp;dn=The+99+Most+Essential+Christmas+Masterpieces%5Bmp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Black1000","files":-1,"time":1324266675,"description":"The 99 Most Essential Christmas Masterpieces\n\n01. A Christmas Festival Overture - SWR Symphony Orchestra\n02. O Come, O Come Emmanuel - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n03. Angels We Have Heard on High - Oxford St. Peter's Choir\n04. Motet in D Major for Choir and Orchestra, K. 618: Ave Verum Corpus - Berlin Mozart Choir\n05. Panis Angelicus - Musica Antiqua New York\n06. Christmas Medley: In notte placida - Tu scendi dalle stelle - O Tannenbaum - Splende una stella - Adeste fideles - Jingle bells - Silent Night - White Christmas - CafÃƒÂ© Concerto 16:30 $0.89\n07. Lo, How a Rose E'er Blooming - Amor Artis Chamber Choir\n08. We Wish You A Merry Christmas - Oxford St. Peter's Choir\n09. The Nutcracker Suite, Op. 71a: I. Overture: Allegro giusto - Bonn Classical Philharmonic and Heribert Beissel\n10. The Nutcracker Suite, Op. 71a: II. Scene: Allegro non troppo - Decorating and Lighting up the Christmas Tree - Bonn Classical Philharmonic and Heribert Beissel\nP11. The Nutcracker Suite, Op. 71a: III. March: Tempo di marcia viva - Bonn Classical Philharmonic and Heribert Beissel\n12. The Nutcracker Suite, Op. 71a: V. Scene: Andante - Drosselmeyer's Gifts - Bonn Classical Philharmonic and Heribert Beissel\n13. The Nutcracker Suite, Op. 71a: IX. Scene: Andante - In the Christmas Tree - Bonn Classical Philharmonic and Heribert Beissel\n14. The Nutcracker Suite, Op. 71a: X. Scene and Waltz of the Snowflakes: Tempo di valse, ma con moto - Bonn Classical Philharmonic and Heribert Beissel\n15. The Nutcracker Suite, Op. 71a: XI. Scene: Andante - The Magic Castle on Candy Mountain - Bonn Classical Philharmonic and Heribert Beissel\n16. The Nutcracker Suite, Op. 71a: XII. Scene: Andante con moto - Clara and Prince Charming - Bonn Classical Philharmonic and Heribert Beissel\n17. The Nutcracker Suite, Op. 71a: Xiiia. Character Dances - Chocolate (Spanish Dance): Allegro Brillant - Bonn Classical Philharmonic and Heribert Beissel\n18. The Nutcracker Suite, Op. 71a: Xiiib. Character Dances - Coffee (Arabic Dance): Commodo - Bonn Classical Philharmonic and Heribert Beissel\n19. The Nutcracker Suite, Op. 71a: Xiiic. Character Dances - Tea (Chinese Dance): Allegro Moderato - Bonn Classical Philharmonic and Heribert Beissel\n20. The Nutcracker Suite, Op. 71a: Xiiid. Character Dances - Trepak (Russian Dance): Tempo Di Trepak, Molto Vivace - Bonn Classical Philharmonic and Heribert Beissel\n21. The Nutcracker Suite, Op. 71a: Xiiid. Character Dances - Dance Of The Reed Pipes: Andantino - Bonn Classical Philharmonic and Heribert Beissel\n22. The Nutcracker Suite, Op. 71a: Xiiid. Character Dances - Polchinelle (The Clown): Allegro Giocoso - Bonn Classical Philharmonic and Heribert Beissel\n23. The Nutcracker Suite, Op. 71a: XIV. Waltz of the Flowers: Tempo di valse - Bonn Classical Philharmonic and Heribert Beissel\n24. The Nutcracker Suite, Op. 71a: XVc. Pas de deux - Variation II: Dance of the Sugar-Plum Fairy - Bonn Classical Philharmonic and Heribert Beissel\n25. The Nutcracker Suite, Op. 71a: XVd. Pas de deux - Coda: Vivace assai - Bonn Classical Philharmonic and Heribert Beissel\n26. The Nutcracker Suite, Op. 71a: XVI. Final Waltz and Apotheosis: Tempo di valse - Bonn Classical Philharmonic and Heribert Beissel\n27. Coventry Carol: Lully, Lullay Thou Little Tiny Child - Oxford St. Peter's Choir\n28. Ave Maria (after J.S. Bach) - Hermann Prey\n29. Choral Prelude in E-Flat Major, BWV 645, &quot;Wachet auf, ruft uns die Stimme&quot; Jurgis Grinkiavichius $0.89\n30. Oh Come, All Ye Faithful (Adeste Fideles) - Oxford St. Peter's Choir\n31. Chorale from Cantata, BWV 147, &quot;Herz und Mund und Tat und Leben&quot;: Jesu bleibet meine Freude (Jesu, Joy of Man's Desiring) - Ama Deus Ensemble &amp; Valentin Radu\n32. In the Bleak Midwinter - London Regency Choir\n33. Suite No. 3 in D Major for Orchestra, BWV 1068: II. Air - Ama Deus Ensemble\nPl34. I Saw Three Ships - Oxford St. Peter's Choir\n35. The Four Seasons (Le quattro stagioni), Op. 8 - Violin Concerto No. 4 in F Minor, RV 297, &quot;Winter&quot; (L'inverno): II. Largo - Emmy Verhey, Camerata Antonio Lucio and Alun Francis\n36. God Rest Ye Merry Gentlemen - Oxford St. Peter's Choir\n37. Ellen's Chants, D. 839, Op. 56: III. Ave Maria - Musica Antiqua New York\n38. L'Enfance du Christ, Part II: L'adieu des bergers (The Shepherds' Farewell) - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n39. Sancta Maria, Mater Dei (Graduale), for Choir and Orchestra, K. 273 - Vienna Volksoper Orchestra\n40. O Little Town of Bethlehem - Oxford St. Peter's Choir\n41. Christmas Oratorio, BWV 248: Sinfonia in G Major, &quot;And There Where Shepherds&quot; - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n42. Christmas Oratorio, BWV 248: Chorale No. 35, &quot;Seid Froh Dieweil, DaÃƒÅ¸ euer Heil&quot; - Prima Choir\n43. Christmas Oratorio, BWV 248: Break Forth - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n44. Christmas Oratorio, BWV 248: Chorale No. 64 in D Major: Nun seid ihr wohl gerochen - Basel Brass Quintet\n45. Christmas Oratorio, BWV 248: Chorale No. 46 - Beim Glanz All' Finsternis verzehrt - Prima Choir\n46. Christmas Oratorio, BWV 248: Jesus, Shepherd My Beginning - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n47. The Seasons, Op. 37a: XII. December: Christmas - Michael Ponti\n48. Chorale for Organ, BWV 650: &quot;Kommst du nun, Jesu von himmel her unter&quot; - Armand Belien\n49. Silent Night - Oxford St. Peter's Choir\n50. Cantata BWV 208, &quot;Was mir behagt, ist nur die muntre Jagd!&quot;: IX. SchÃƒÂ¤fe kÃƒÂ¶nnen sicher weiden (Sheep may safely graze) - Musica Antiqua New York &amp; Mary Jane Newman\n51. Brandenburg Concerto No. 3 in G Major, BWV 1048: I. Allegro - WÃƒÂ¼rttemberg Chamber Orchestra Heilbronn\n52. Brandenburg Concerto No. 3 in G Major, BWV 1048: II. Adagio - WÃƒÂ¼rttemberg Chamber Orchestra Heilbronn\n53. Brandenburg Concerto No. 3 in G Major, BWV 1048: III. Allegro - WÃƒÂ¼rttemberg Chamber Orchestra Heilbronn\n54. Children's Album, Op. 39: II. A Winter Morning - Michael Ponti\n55. Hark! The Herald Angels Sing - London Regency Choir\n56. Magnificat, BWV 243: I. Magnificat - Ama Deus Ensemble &amp; Valentin Radu\n57. Magnificat, BWV 243: II. Ex exsultavit - Ama Deus Ensemble $0.89\n58. Magnificat, BWV 243: III. Quia respexit - IV. Omnes generationes - Ama Deus Ensemble\n59. Magnificat, BWV 243: XII. Sicut erat in principio - Ama Deus Ensemble\n60. Canon in D Major - Musica Antiqua New York\n61. In Dulci Jubilo - Oxford St. Peter's Choir\n62. Children's Corner, L 113: IV. The Snow is Dancing - Peter Schmalfuss\n63. Concerto Grosso No. 8 in G Minor, Op. 6, &quot;Christmas Concerto&quot;: I. Vivace - Grave: Arcate, sostenuto e come sta - Moscow Conservatory Chamber Orchestra and Gennady Tcherkasov\n64. Concerto Grosso No. 8 in G Minor, Op. 6, &quot;Christmas Concerto&quot;: II. Allegro - Moscow Conservatory Chamber Orchestra and Gennady Tcherkasov\n65. Concerto Grosso No. 8 in G Minor, Op. 6, &quot;Christmas Concerto&quot;: III. Adagio - Allegro - Adagio - Moscow Conservatory Chamber Orchestra and Gennady Tcherkasov\n66. Concerto Grosso No. 8 in G Minor, Op. 6, &quot;Christmas Concerto&quot;: IV. Vivace - - Moscow Conservatory Chamber Orchestra and Gennady Tcherkasov\n67. Concerto Grosso No. 8 in G Minor, Op. 6, &quot;Christmas Concerto&quot;: V. Allegro (attacca) Moscow Conservatory Chamber Orchestra and Gennady Tcherkasov\n68. Concerto Grosso No. 8 in G Minor, Op. 6, &quot;Christmas Concerto&quot;: VI. (attacca) Largo: Pastorale ad libitum - Moscow Conservatory Chamber Orchestra and Gennady Tcherkasov\n69. See, Amid The Winter's Snow (Hymn For Christmas Day) - St Paul's Cathedral Choir\n70. What Child Is This - Oxford St. Peter's Choir\n71. The Messiah, HWV 56: Every valley shall be exalted - Ama Deus Ensemble\n72. The Messiah, HWV 56: For unto us a child is born - Ama Deus Ensemble\n73. The Messiah, HWV 56: Rejoice greatly - Ama Deus Ensemble\n74. The Messiah, HWV 56: Hallelujah Chorus - Atlanta Symphony Orchestra\n75. It Came Upon the Midnight Clear - Oxford St. Peter's Choir\n76. Litaniae de Beata Maria Virgine (Lauretanae), K. 109: IV. Regina angelorum - - Collegium Aureum\n77. While Shepherd's Watched - Oxford St. Peter's Choir\n78. Concerto Grosso in C Major, Op. 3/12, &quot;Christmas Concerto&quot;: I. Largo-WÃƒÂ¼rttemberg Chamber Orchestra Heilbronn\n79. Concerto Grosso in C Major, Op. 3/12, &quot;Christmas Concerto&quot;: II. Largo -WÃƒÂ¼rttemberg Chamber Orchestra Heilbronn\n80. Concerto Grosso in C Major, Op. 3/12, &quot;Christmas Concerto&quot;: III. Allegro - WÃƒÂ¼rttemberg Chamber Orchestra Heilbronn\n81. We Three Kings - Oxford St. Peter's Choir\n82. Chorals for Organ, BWV 714 - 740: &quot;Liebster Jesu, wir sind hier&quot; - Susanne Doll\n83. Jolly Old St. Nicholas - Oxford St. Peter's Choir\n84. Bist Du Bei Mir (from Anna Magdalena's Notebook) - Mary Jane Newman and Clavin Wiersma\n85. St. Matthew Passion, BWV 244: Ich will Dir mein Herze schenken - Vienna Academy Chorus &amp; Vienna Chamber Orchestra\n86. I Heard the Bells On Christmas Day - Oxford St. Peter's Choir\n87. Mass in B Minor, BWV 232: Credo (Symbolum Nicenum): Et resurrexit - Tbilisi Symphony Orchestra, Simi Studio Choir And Jansug Kakhidze\n88. Mass in B Minor, BWV 232: Aria - &quot;Quoniam Tu Solus&quot; - Basel Brass Quintet\n89. Mass in B Minor, BWV 232: Dona nobis pacem - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n90. Ding Dong Merrily On High - Oxford St. Peter's Choir\n91. Christmas Medley: Jesu, Joy Of Man's Desiring - O Tannenbaum - Christ is born in Bethlehem - Hark! The Herald Angels Sing - Little Drummer Boy - Panis Angelicus - The Mantovani Orchestra\n92. Gloria in D Major, RV 589: I. Gloria in excelsis - Atlanta Symphony Chorus, Atlanta Symphony Orchestra and Robert Shaw\n93. Coronation Mass in C Major, K. 317: V. Benedictus - Salzburg Mozarteum Orchestra\n94. Joy To The World - Regency Youth Choir\n95. Harmonia Pastoralis - Christmas Mass in F Major: I. Kyrie - Musica Bohemica\n96. Deck the Halls - Oxford St. Peter's Choir\n97. Adeste Fidelis - Atlanta Symphony Orchestra\n98. O Holy Night (Cantique De NoÃƒÂ«l) - 101 Strings Orchestra\n99. Amen - Oxford St. Peter's Choir","torrent":{"xt":"urn:btih:a902562a3857a41d9c653431ac3490da9a737961","amp;dn":"The+99+Most+Essential+Christmas+Masterpieces%5Bmp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a902562a3857a41d9c653431ac3490da9a737961","infoHashBuffer":{"type":"Buffer","data":[169,2,86,42,56,87,164,29,156,101,52,49,172,52,144,218,154,115,121,97]},"announce":[],"urlList":[]}}