{"title":"Elvis Vs JXL - A Little Less Conversation","uid":4618774,"size":61109752,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a97451fb64cac571f69580c85e5ea644c96a546a&amp;dn=Elvis+Vs+JXL+-+A+Little+Less+Conversation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Blindpew","files":-1,"time":1230944939,"description":"Video Promo\n720x404\nxvid - TV Rip\n\nIn 2002, A Little Less Conversation was remixed by Junkie XL for the NIKE Football World Cup advertising campaign and went on to become a Number 1 hit in over 20 countries. At about the same time, a compilation of Presley's U.S. Number 1 chart hits, entitled ELV1S 30 #1 Hits, was being prepared for release. &quot;A Little Less Conversation&quot; (Remix Version) was quickly added as the album's 31st track just before its release in October 2002.\nThe remixed song was used by Nike as the background music to a series of TV commercials directed by Terry Gilliam music produced by Ad Bradley featuring international football stars in conjunction with the 2002 FIFA World Cup. It was also used on Konami's European adaptation of their flagship dancing simulation VG Dance Dance Revolution, on the soundtrack of Dancing Stage MegaMix.\n&quot;A Little Less Conversation&quot; has also been used in the soundtracks of several films, including the 2001 remake of Ocean's Eleven, Bruce Almighty (2003), Next (with Nicolas Cage) Shark Tale (2004) Jackass Number Two (2006) and Ocean's 13 (2007). It also appears in the trailer for the computer-animated film Bolt starring the voices of John Travolta and Miley Cyrus. It was also the theme song for the television show Las Vegas, starring James Caan.\nThere was a little upset caused when the record company deleted the title while it was still at number 1 in the UK. Although it was not admitted, this was to give Gareth Gates's single Anyone of Us (Stupid Mistake) a chance of getting to number one (as both songs were under the same label). The song did indeed take over as the UK number 1. In just a couple of weeks, the JXL remix of &quot;A Little Less Conversation&quot; had fallen totally out of the charts because it was no longer available for purchase.\nThe JXL remix of &quot;A Little Less Conversation&quot; was however re-released as part of the Elvis Presley limited edition re-release series of all his UK number one singles, three years afterwards and it got to number 3. As this was part of a limited edition, it was deleted fairly quickly once more.\nThe music video is notable for featuring various people dancing in little booths with the views constantly alternating between different ones. Elvis Presely himself only appears for a few seconds, on a security guards TV screen while he is sitting down with his legs up on the table, while drinking coffee and eating a doughnut.\n\nLyrics:\nA little less conversation, a little more action please\nAll this aggravation ain't satisfactioning me\nA little more bite and a little less bark\nA little less fight and a little more spark\nClose your mouth and open up your heart and baby satisfy me\nSatisfy me baby\n\nBaby close your eyes and listen to the music\nDrifting through a summer breeze\nIt's a groovy night and I can show you how to use it\nCome along with me and put your mind at ease\n\nA little less conversation, a little more action please\nAll this aggravation ain't satisfactioning me\nA little more bite and a little less bark\nA little less fight and a little more spark\nClose your mouth and open up your heart and baby satisfy me\n\nSatisfy me baby\nCome on baby I'm tired of talking\nGrab your coat and let's start walking\nCome on, come on\nCome on, come on\nCome on, come on\nDon't procrastinate, don't articulate\nGirl it's getting late, gettin' upset waitin' around\nA little less conversation, a little more action please\nAll this aggravation ain't satisfactioning me\nA little more bite and a little less bark\nA little less fight and a little more spark\nClose your mouth and open up your heart and baby satisfy me\nSatisfy me baby\n","torrent":{"xt":"urn:btih:a97451fb64cac571f69580c85e5ea644c96a546a","amp;dn":"Elvis+Vs+JXL+-+A+Little+Less+Conversation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a97451fb64cac571f69580c85e5ea644c96a546a","infoHashBuffer":{"type":"Buffer","data":[169,116,81,251,100,202,197,113,246,149,128,200,94,94,166,68,201,106,84,106]},"announce":[],"urlList":[]}}