{"title":"Samuree v1-v3 (Complete) (Requested)","uid":8346603,"size":246468792,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a9c8acf5f240deabd1849523630952f0b23594ce&amp;dn=Samuree+v1-v3+%28Complete%29+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackcanary","files":-1,"time":1365222219,"description":"English | CBR | 15 Issues\n\nSamuree v1 #1-9 (1987-1991)\nPublisher:  Continuity Comics\nPublication Date:  May 1987 - January 1991\n\nSamuree #1\nTerrorists have taken hostages in the Museum of Natural History. The Revengers are on their way, but so is another. Her name is Samuree.\n\nSamuree #2\nWhy would anyone kidnap the world renown special effects make-up artist, Tom Savini? Samuree would know, but in revealing why she'd have to reveal her own hidden secrets.\n\nSamuree #3\nStill more of Samuree's terrible past is revealed as she and the Revengers pursue the terrorists.\n\nSamuree #4\nThe enemy are indeed zombies and what is the truth of Samuree? The modern world is completely new to her and though she may not understand most of it, she may understand more than some.\n\nSamuree #5\nThe conclusion of our first story as Samuree finds the hostages, and one hostage in particular. The person who made her what she is today.\n\nSamuree #6\nSamuree, with her new friends, the Revengers, go to the middle East where a power-mad prophet holds a U.S. ambassador and his daughter hostage. This prophet Zoroaster kills innocents in the name of good.\n\nSamuree #7\nZoroaster's defeat leads to a bigger trouble. The evil archman possesses the body of an innocent girl. Samuree must now battle against the powers of a God.\n\nSamuree #8\nJerri-Anne, Samuree's best friend, leads her to put a stop to the drug dealing going on in their neighborhood.\n\nSamuree #9\nJerri-Anne is attacked at her home by a man who is more than he seems, and he is looking for Samuree.\n\n\nSamuree v2 #1-4 (1993-1994)\nPublisher:  Continunity Comics\nPublication Date:  May 1993 - January 1994\n\nSamuree #1\nRise of Magic; Ariman brings the dead to life as Demon gather.\n\nSamuree #2\nRise of Magic; Vanaya tries to bring Ariman to earth with a human sacrifice. Samuree must battle demons to stop Vanaya.\n\nSamuree #3\nRise of Magic; Vanaya fails to bring Ariman to Earth and pays for that failure with her life.\n\nSamuree #4\nRise of Magic; Ariman's demons continue to plague Samuree.\n\n\nSamuree v3 #1-2 (1995)\nPublisher:  Valiant Comics' Windjammer\nPublication Date:  October - November 1995\n\nSamuree #1\nSamuree goes back to High School and gets entangles in a Samurai struggle for power.\n\nSamuree #2\nSamuree is stuck in the middle of an ancient Japanese struggle.\n\nThanks goes to Broomhandle Mauser and the other scanners for this release.","torrent":{"xt":"urn:btih:a9c8acf5f240deabd1849523630952f0b23594ce","amp;dn":"Samuree+v1-v3+%28Complete%29+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c8acf5f240deabd1849523630952f0b23594ce","infoHashBuffer":{"type":"Buffer","data":[169,200,172,245,242,64,222,171,209,132,149,35,99,9,82,240,178,53,148,206]},"announce":[],"urlList":[]}}