{"title":"Adolescents - Adolescents (+ Rikk Agnew)@320","uid":4233212,"size":206292019,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9d1d9f12e4428906a5172ed4c2f5138852ac6db&amp;dn=Adolescents+-+Adolescents+%28%2B+Rikk+Agnew%29%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"alekow1","files":37,"time":1213166756,"description":"\nThis CD Contains The Adolescents LP And Welcome To Reality 7&quot; From The Famous LA HC-Punks Adolescents and The All By Myself LP From Rikk Agnew.\n\n\n\nAdolescents - Adolescents (1981)\n\n\nSocial Distortion tends to be the band which gets venerated these days as the flagbearers of Orange County punk, while Agent Orange gets its own credit for amping up the surf sound for the slampit generation, but in terms of what could be called classic OC hardcore -- brattish, young, sneering and energetic -- it&amp;#039;s all about this brilliant album, jam-packed with songs that to this day are constantly covered or cited by other acts worldwide. That the original lineup of the Adolescents itself spawned at least four separate future bands, if not more, further demonstrates that something good was going down, thanks to five kids who really were adolescents or had just barely gotten past that stage. The Descendents were the obvious role models for nearly everything on the album, if anybody -- same general sense of catchy bash and crash while voicing incipient youth-of-the-&amp;#039;80s angst -- but the Adolescents were just that little bit more aggressive and pissed, tempering goofiness, especially from Tony Cadena&amp;#039;s sneering vocals, with an at times barely concealed outrage at being stuck in Orange County&amp;#039;s cradle of right-wing conservatism. Songs like &quot;L.A. Girl&quot; may be more semi-typical misogyny and scenester-trashing than anything else, but &quot;Who is Who&quot; and the slow start, then fast rip of &quot;Kids of the Black Hole&quot; snarl at mocking peers, police attacks, wrecked households and more besides with fierceness. The musicians do a fair job throughout -- brothers Rikk and Frank Agnew are more than fine on guitar, while bassist Steve Soto and drummer Casey Royer keep everything chugging along nicely. Then, of course, there&amp;#039;s &quot;Amoeba&quot; -- a sharp, intelligent lyric equating adolescence with being stuck as a science experiment and vowing to break out from that trap with an instantly catchy gang-shout chorus, resulting in one of the all-time great rock anthems. (The CD reissue adds not only the Welcome to Reality EP but also Rikk Agnew&amp;#039;s solo debut, All by Myself.)\n\n\nTony Cadena: Vocals \nFrank Agnew: Guitar \nCasey Royer: Drums \nSteve Soto: Bass \nRikk Agnew: Guitar\n\n\n01. I Hate Children                                              \n02. Who Is Who                                                   \n03. Wrecking Crew                                                \n04. L.A. Girl                                                    \n05. Self Destruct                                                \n06. Kids Of The Black Hole                                       \n07. No Way                                                       \n08. Amoeba                                                       \n09. Word Attack                                                  \n10. Rip It Up                                                    \n11. Democracy                                                    \n12. No Friends                                                   \n13. Creatures  \n\n\n\n\nWelcome to Reality EP (1980)\n\n\nAfter Rikk Agnew left to pursue a solo career and contribute to another classic debut album, L.A. death-rock legends Christian Death&amp;#039;s Only Theatre of Pain, the rest of the band recruited drummer Royer&amp;#039;s roommate Steve Roberts on guitar and released this EP the year after the group&amp;#039;s debut. The title track is a fairly indifferent fear-of-the-bomb rant, while &quot;Losing Battle&quot; and &quot;Things Start Moving&quot; have the same general pace of the band&amp;#039;s best early songs, though not the same immediate memorability (even if the latter has an attractive, slightly droning guitar opening). It&amp;#039;s a bit of a nothing way of bowing out, which the fivesome did shortly thereafter, at least for the first time around.\n\n\nTony Cadena: Vocals \nFrank Agnew: Guitar \nCasey Royer: Drums \nSteve Soto: Bass \nSteve Roberts: Guitar\n\n\n14. Welcome To Reality                                           \n15. Losing Battle                                                \n16. Things Start Moving\n\n\n\n\nRikk Agnew - All by Myself (1982)\n\n\n\nSnarkily titled after Eric Carmen&amp;#039;s &amp;#039;70s solo hit but thankfully not featuring a cover of that song, Agnew&amp;#039;s solo debut actually lives up to its title completely, as he plays every instrument on the record, creating a great one-man band sound (with the help of Adolescents producer Thom Wilson) as a result. Possessed of a good mid-range punk voice -- no sneering or bellowing, not really singing but not just talking over the songs either -- he creates the same basic rush he brought to his early stints in the Adolescents and the faster Christian Death songs he worked on, but with a slightly poppier bent at points that perfectly balances sass and strength, while not being afraid to experiment from time to time either (as the lengthy album closer &quot;Section 8&quot; shows). &quot;Everyday,&quot; the one track Agnew cowrote with someone else (his brother and fellow Adolescents veteran Frank), is a great example of this, with its gentler pace, tight arrangement that lets some space into the playing, and Agnew&amp;#039;s actual singing, which succeeds in a slightly winsome way. The leadoff track is yet another Orange County punk classic from Agnew&amp;#039;s pen, &quot;OC Life,&quot; specifically naming some particularly crap cities worthy of contempt, and from there he&amp;#039;s off relentlessly detailing some particularly screwed up lives and problems with a withering eye. More than most who have worked in punk, Agnew can capture a careful empathy when at his best, backed up with memorable music to boot (the fragile keyboard arrangement that fills out the sound on the remarkable character study &quot;10&quot; is particularly lovely touch). &quot;Surfside&quot; sneaks in a surf riff (but of course!) into its otherwise trebly and tense look back at a destructive, unsettled past, a smart way of combining nostalgia with a questioning bent, another fine moment on a generally fine record.\n\n\nRikk Agnew: Vocals, Keyboards, Guitar, Bass, Drums\n\n\n17. O.C. Life                                                    \n18. 10                                                           \n19. Yur 2 Late                                                   \n20. Everyday                                                     \n21. One Shot                                                     \n22. Falling Out                                                  \n23. Surfside                                                     \n24. It&amp;#039;s Doing Something                                         \n25. Fast                                                         \n26. Section 8\n\n\n\nLabel: Frontier Records\nReleased: 1990\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:a9d1d9f12e4428906a5172ed4c2f5138852ac6db","amp;dn":"Adolescents+-+Adolescents+%28%2B+Rikk+Agnew%29%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d1d9f12e4428906a5172ed4c2f5138852ac6db","infoHashBuffer":{"type":"Buffer","data":[169,209,217,241,46,68,40,144,106,81,114,237,76,47,81,56,133,42,198,219]},"announce":[],"urlList":[]}}