{"title":"4 Rare 80s Albums [Part 39] Post-Punk Dark Wave","uid":4621296,"size":225839758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aa4b7fbaba968ea2123c2cfb69e51a4ca688bd2a&amp;dn=4+Rare+80s+Albums+%5BPart+39%5D+Post-Punk+Dark+Wave&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"80zforever","files":-1,"time":1231041062,"description":"A few of my recent listens and all on my all time favorite list. Enjoy and seed. keep this great music alive and available to the others as well. By the way I will get to your requests too. Many of what you're requesting are not on my HD.\n\n\n*17 Pygmies - Captured in Ice [1985]\n\nThis is state of the art for 1985 college radio---totally obscure but one listen will invoke a &quot;Killer Song, dude---Who are these guys&quot;.\n\n\n\n*Cuddly Toys - Trials And Crosses [1981]\n\nI really love cuddly Toys. They made one of the best albums of all time; Trials and Crosses. What we have are some quite wonderful songs from a great band who should have been big and I mean BIG.\n\n\n\n*Gardening by Moonlight - Methods in the Madness [1983]\n\nRich, pure and astonishingly subtle, Gardening by Moonlight's first album offers layer upon layer of magical invention. Crescendos of percussive symmetry form a backdrop for cleverly twisting atmospheric tangents that elevate GBM to the status of Thomas Leer and bands like Shriekback and The Cocteau Twins. John Johnson on drums and vocals is the musical dice man who traces the revolving, percussive patterns for Duncan Bridgemans pumping synth to decorate.\n\n\n\n*I'm So Hollow - Emotion / Sound / Motion [1981]\n\nI'm so Hollow were a quartet from Sheffield, that used traditional rock instrumentation, as well as tapes and treatments to present a tormented form of new wave, blurred between catchy melodies, anguished rhythms/vocals and frozen atmosphere.\n\nSubtle variations characterize the most interesting songs. Check &quot;Unbroken Line&quot;, (based on a slow-motion piano pattern &amp; horror synth effects), &quot;Touch&quot; (set upon a line of feedback, robotic beat &amp; warm vocal harmonies), &quot;Emotion/Sound/Motion&quot; (whose first part is a moody synthscape, while the second part explodes to a suspenseful rhythm groove).\n","torrent":{"xt":"urn:btih:aa4b7fbaba968ea2123c2cfb69e51a4ca688bd2a","amp;dn":"4+Rare+80s+Albums+%5BPart+39%5D+Post-Punk+Dark+Wave","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa4b7fbaba968ea2123c2cfb69e51a4ca688bd2a","infoHashBuffer":{"type":"Buffer","data":[170,75,127,186,186,150,142,162,18,60,44,251,105,229,26,76,166,136,189,42]},"announce":[],"urlList":[]}}