{"title":"Rulers of Russia: Jewish Bolshevism - Rev. Denis Fahey","uid":4628731,"size":4851056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa7e593d26ae8fcae1a2b362a06a5df63666ecd5&amp;dn=Rulers+of+Russia%3A+Jewish+Bolshevism+-+Rev.+Denis+Fahey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1231309590,"description":"The Rulers of Russia_ by Rev. Denis Fahey, an Irish Catholic priest, is about the Jewish government of Russia imposed by the Bolshevik takeover of Russia after the overthrow of Nicholas II. It was originally published during the Second World War as a supplement to Fahey's main book concerning the conflict between the Roman Catholic Church and Judaism, _The Mystical Body of Christ_. Ever since Christ's Crucifixion, explains Fahey, the &quot;supernatural order&quot; of Christ has been opposed by the &quot;natural order&quot; deriving from the race/religion of the Jews and various offshoot cults such as the Freemasons. The Jews are in a conspiracy to overthrow the Mass and the authority of the Church in all areas of the world. The reasons for this conflict is because the Jews rejected Christ as the supernatural Messias and seek of their own will the &quot;natural&quot; Messias, who will place the world under the power of international Jewry. Various anti-Christian campaigns have been launched to further this plan. International finance and liberal, capitalist democracies and republics are controlled from above, which are apparently opposed by radical, communist and socialist revolutionaries from below. The trick is Jews and the demonic force behind them control both sides of this conflict.\n\nThis book is rather unique because it is anti-Nazi as well as anti-Jewish. Fahey divides the powers of the world into two categories: the &quot;Judeo-Masonic&quot; democracies (including the Soviet Union) that have their economies under the thumb of Jewish bankers versus the reactionary fascist nations of Germany, Italy and Japan. These fascist countries were free from Judeo-Masonic control of their economies, and Nazism in Germany was militantly anti-Jewish. What is unusual about German National Socialism is it followed the same &quot;naturalistic&quot; principle, which is behind Jewish world power. Nazism seeks to supplant the Christian view of the world with the deification of the Aryan race. Furthermore, mention is made of the secret occult lodges that sought to emulate the heretical Knights Templar and that formed the Nazi movement based on the 19th century German Idealist philosophers. Although Hitler made statements in public that the Third Reich was not persecuting Christians, in particular Catholics, Fahey quotes high ranking Church officials who attest to the Nazi deception of Christians. Fahey remarks that the Third Reich and Herr Hitler are doomed in the face of overwhelming hostility from the combined might of Jewish finance which has the arsenal of Great Britain, the United States and the Soviet Union at its disposal. The only countries for whom Fahey has much sympathy are Francisco Franco's Spain and Poland's Catholic nationalism, which resisted both Nazi and Soviet encroachments, despite Poland's being a pawn of the Britain and France to stir up trouble with Germany. The conclusion to this pamphlet is a traditional Catholic take on democracy. The current &quot;Judeo-Masonic&quot; democracy in America is illegitimate because it does not rest on God for its ultimate authority, but instead refers to the &quot;common will&quot; of the people as if it was infallible. Regrettably, no mention is made of Orthodox Christianity itself inside Russia in the face of Bolshevik persecution. \n\n(description from Amazon.com)","torrent":{"xt":"urn:btih:aa7e593d26ae8fcae1a2b362a06a5df63666ecd5","amp;dn":"Rulers+of+Russia%3A+Jewish+Bolshevism+-+Rev.+Denis+Fahey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa7e593d26ae8fcae1a2b362a06a5df63666ecd5","infoHashBuffer":{"type":"Buffer","data":[170,126,89,61,38,174,143,202,225,162,179,98,160,106,93,246,54,102,236,213]},"announce":[],"urlList":[]}}