{"title":"The Witcher Adventure Game (v2.7.0.24) [GOG]","uid":15277069,"size":597829032,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aac3bbda041c0d0212335cf19fe60a7f91368993&amp;dn=The+Witcher+Adventure+Game+%28v2.7.0.24%29+%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ojusko","files":1,"time":1468312754,"description":"Patch 1.2.5 (06 July 2016) \r\n\r\n- upgraded Unity to version 4.7.1 \r\n- upgrade middleware UI, Audio \r\n- added Steam friends* invite function \r\n- removed &quot;The Witcher Battle Arena&quot; from the &quot;More Games&quot; section \r\n\r\n* Obviously not your Steam friend, but you could invite people that are on your GOG friend list.\r\n\r\nGenre: Adventure - Turn-based - Fantasy\r\nWorks on: Windows (XP, Vista, 7, 8, 10) and Mac OS X (10.7.0+)\r\nLanguages: Audio and text: English, polski\r\nFeatures: single-player - multi-player - co-op - achievements\r\nReleased: November 27, 2014\r\nSize: 570.2 MB\r\nCompany: Can Explode / CD PROJEKT RED\r\n\r\nAbout: \r\nThe Witcher Adventure Game is a digital adaptation of CD PROJEKT RED’s board game set in the brutal, dark fantasy universe of monster slayer Geralt of Rivia. Embark on a journey across the beautifully rendered world of The Witcher and complete a variety of quests: hunt for deadly beasts, solve ancient mysteries, and take part in complex political intrigues. Make choices and face their brutal consequences in a world begging to be explored!\r\n\r\nThe Witcher Adventure Game allows players to take the role of four distinct characters known from the books and video games: Geralt of Rivia, monster slayer; Triss Merigold, cunning sorceress; Yarpen Zigrin, dwarven warrior; and Dandelion, roguish bard. Each character has unique skills and multiple ways of overcoming obstacles - the choice is yours: do you fight your way to victory, call on your charm or try your hand at diplomacy?\r\n\r\nExplore a land of mystery and spin your own, unique tale each time you play. The Witcher Adventure Game is based on the rich universe created by internationally renowned novelist Andrzej Sapkowski. Whether you’re a long time fan or this is your first contact with the universe, The Witcher Adventure Game will pull you in with its deep backstory and high replayability.\r\n\r\nArt design taken straight from the critically acclaimed Witcher series of video games.\r\nPlay vs. AI and vs. your friends (online multiplayer and hot seat).\r\nClear, simple rules and intuitive mechanics.\r\n4 unique heroes with different skills and approaches to problem solving.\r\nAchievement and leaderboard support.\r\nThe digital edition contains over 288 cards and 30 monsters.\r\n\r\nMinimum system requirements - Windows: Windows XP SP3 / Vista / 7 / 8 / 10Processor: 2.0 GHz Dual Core Processor Memory: 1 GB RAMGraphics: Integrated Graphics (512MB) Hard Drive: 500 MB available space Additional Notes: Unsupported video chipsets: Intel HD Graphics 3000, Intel GMA X3100, Intel GMA 950","torrent":{"xt":"urn:btih:aac3bbda041c0d0212335cf19fe60a7f91368993","amp;dn":"The+Witcher+Adventure+Game+%28v2.7.0.24%29+%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac3bbda041c0d0212335cf19fe60a7f91368993","infoHashBuffer":{"type":"Buffer","data":[170,195,187,218,4,28,13,2,18,51,92,241,159,230,10,127,145,54,137,147]},"announce":[],"urlList":[]}}