{"title":"War Games A History of War on Paper.pdf","uid":10067222,"size":2762826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aac761c6c8fa962c90fca01170c7f9d5587f6b95&amp;dn=War+Games+A+History+of+War+on+Paper.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1398804536,"description":"War Games: A History of War on Paper by Philipp von Hilgers and Ross Benjamin\nEnglish | 2012 | ISBN: 0262016974 | ISBN-13: 9780262016971 | 240 pages | PDF | 2,6 MB\n\nFor centuries, both mathematical and military thinkers have used game-like scenarios to test their visions of mastering a complex world through symbolic operations. By the end of World War I, mathematical and military discourse in Germany simultaneously discovered the game as a productive concept.\n\nMathematics and military strategy converged in World War II when mathematicians designed fields of operation. In this book, Philipp von Hilgers examines the theory and practice of war games through history, from the medieval game boards, captured on parchment, to the paper map exercises of the Third Reich. Von Hilgers considers how and why war games came to exist: why mathematical and military thinkers created simulations of one of the most unpredictable human activities on earth. Von Hilgers begins with the medieval rythmomachia, or Battle of Numbers, then reconstructs the ideas about war and games in the baroque period. He investigates the role of George Leopold von Reiswitz's tactical war game in nineteenth-century Prussia and describes the artifact itself: a game board--topped table with drawers for game implements. He explains Clausewitz's emphasis on the &quot;fog of war&quot; and the accompanying element of incalculability, examines the contributions of such thinkers as Clausewitz, Leibniz, Wittgenstein, and von Neumann, and investigates the war games of the German military between the two World Wars. Baudrillard declared this to be the age of simulacra; war games stand contrariwise as simulations that have not been subsumed in absolute virtuality.","torrent":{"xt":"urn:btih:aac761c6c8fa962c90fca01170c7f9d5587f6b95","amp;dn":"War+Games+A+History+of+War+on+Paper.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac761c6c8fa962c90fca01170c7f9d5587f6b95","infoHashBuffer":{"type":"Buffer","data":[170,199,97,198,200,250,150,44,144,252,160,17,112,199,249,213,88,127,107,149]},"announce":[],"urlList":[]}}