{"title":"Dave Douglas - 2013 - Time Travel FLAC","uid":9166324,"size":367985347,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab40855b44e299d17bdec8c35d217988f636b283&amp;dn=Dave+Douglas+-+2013+-+Time+Travel+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1383990040,"description":"Dave Douglas - 2013 - Time Travel\n\nWorking with the same quintet that delivered his 2012 album Be Still, trumpeter Dave Douglas returns to a more straight-ahead, if no less adventurous, jazz style with 2013's Time Travel. Once again joining Douglas here are his bandmates saxophonist Jon Irabagon, pianist Matt Mitchell, bassist Linda Oh, and drummer Rudy Royston. Absent is vocalist Aoife O'Donovan, who was the focal point of Be Still's hymn, folk song, and ballads approach. Here, Douglas is interested in a more angular post-bop sound that, while still evincing a modern creative vibe, fits more squarely into the jazz tradition than Be Still. Which isn't to say this album is staid by any means. On the contrary, Douglas has penned a handful of harmonically challenging pieces that mix the knotty, rambunctious angularity of Thelonious Monk with the expansive impressionist modalism of '60s Miles Davis. The album also brings to mind the similarly inclined '80s work of Wynton Marsalis, like 1985's Black Codes (From the Underground) and 1986's J Mood. Cuts like the swinging midtempo opener &quot;Bridge to Nowhere&quot; and the ruminative, fractured title track showcase Douglas' group-oriented aesthetic that makes room for both extended solo improvisations and some layered, call-and-response interplay between the bandmembers. This group vibe is carried throughout the album on such tracks as the introspective ballad &quot;Law of Historical Memory&quot; and the roiling, hard-driving ode to Douglas' home state of New Jersey, &quot;Garden State.&quot; Fans of Douglas' more country and folk song leanings will also be happy to find that he still digs his hands into the proverbial dirt with the bluesy Americana of &quot;Beware of Doug&quot; and the lullaby-sounding &quot;Little Feet.&quot; While Douglas has made his mark delving into various genre-crossing projects that often skirt the edges of hardcore improvisatory jazz, with Time Travel he has found just as much room to explore within a world of jazz possibilities. (AllMusic)\n\nTrack list:\n01. Bridge To Nowhere\n02. Time Travel\n03. Law Of Historical Memory\n04. Beware Of Doug\n05. Little Feet\n06. Garden State\n07. The Pigeon And The Pie\n\nPersonnel:\nDave Douglas: trumpet\nJon Irabagon: tenor saxophone\nMatt Mitchell: piano\nLinda Oh: bass\nRudy Royston: drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:ab40855b44e299d17bdec8c35d217988f636b283","amp;dn":"Dave+Douglas+-+2013+-+Time+Travel+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab40855b44e299d17bdec8c35d217988f636b283","infoHashBuffer":{"type":"Buffer","data":[171,64,133,91,68,226,153,209,123,222,200,195,93,33,121,136,246,54,178,131]},"announce":[],"urlList":[]}}