{"title":"Le Trio Joubran - Randana[FLAC - LOSSLESS]","uid":4804603,"size":191935838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab867cd3b58d1ac5888c5223a9eb1e71001cd5a5&amp;dn=Le+Trio+Joubran+-+Randana%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"99AM","files":6,"time":1238115498,"description":"Flac files\nReleased in 2005\n\n\nTrack listing:\n01. Hawas\n02. Misage\n03. Shagaf\n04. Safar\n05. Ahwak (Live In Ramallah)\n\n\n\nThe brothers Joubran, native Palestinians, unite in this trio to play music inspired by improvisation but based in the music of their heritage. The title Randana is a combination word meaning resonance and humming. All siblings play the oud; they jam in a fashion that suggests their shared spirited brotherhood and utilize acute listening, an easily heard dynamic balance, a certain amount of showmanship, and a clear virtuosity. Each piece is internally defined by humanistic qualities and a love for life. In light of the continuing Palestinian-Israeli dispute that affects the world in general, this is a music based on hope, peace, and all the proper values of living and working together. There are four studio tracks, the most varied being the opener, &quot;Hawas.&quot; You hear melodic unison playing; tempos ranging from mid- to upbeat; back-and-forth counterpoint; and a playful concept filled with passion, emotion, and a little mystery. &quot;Misage&quot; is purely sensual with a slowed late-night imagery of exotic dancers, while the balladic &quot;Shangaf&quot; is more of a spirit song based on a hide-and-seek theme. The most powerful and lengthy piece (18 minutes), &quot;Safar&quot; expresses a patient virtue with several solo segments, reflecting repast, recourse, and perseverance. It has parts of phrases that are sped up, slowed, but not stretched out -- more like teasing. The finale, recorded live in concert, is the spacious and free love song &quot;Ahwak,&quot; played by the ouds with lyrics. As world music and ethnic fusion, here's a group unique from them all, quite talented and set apart from other oud leaders who utilize a band with a rhythm section.\n\n(Review by Michael G. Nastos from AMG)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:ab867cd3b58d1ac5888c5223a9eb1e71001cd5a5","amp;dn":"Le+Trio+Joubran+-+Randana%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab867cd3b58d1ac5888c5223a9eb1e71001cd5a5","infoHashBuffer":{"type":"Buffer","data":[171,134,124,211,181,141,26,197,136,140,82,35,169,235,30,113,0,28,213,165]},"announce":[],"urlList":[]}}