{"title":"New Doctor Who - Season 03 (2007) - 13 HD Episodes + 4 SD Specia","uid":10683127,"size":16006698064,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:aba91a487a7954da31fa17e7addd81bd6fd02bb9&amp;dn=New+Doctor+Who+-+Season+03+%282007%29+-+13+HD+Episodes+%2B+4+SD+Specia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"bnaron","files":-1,"time":1407054903,"description":"The New Doctor Who - Season 03 - (2007)\n\nThe third season of British science fiction program Doctor Who was preceded by the 2006 Christmas special 'The Runaway Bride' (Look in 2006 folder for that episode). Following the special, a regular series of thirteen episodes was broadcast, starting with 'Smith and Jones' on 31 March 2007. In addition, a 13-part animated serial (equivalent to one regular episode) was produced and broadcast as part of Totally Doctor Who.\n\nThe series stars David Tennant as the tenth incarnation of the Doctor, an alien Time Lord who travels through time and space in his TARDIS, which appears to be a British police box on the outside. In the Christmas special he is joined by Catherine Tate as Donna Noble. The series also introduces Freema Agyeman as the Doctor's new companion Martha Jones, who leaves at the end of the series due to her unrequited love for him. John Barrowman also reprises his role as Captain Jack Harkness in the final three episodes which serve as the finale. The season is connected by a loose story arc consisting of the recurring phrase 'Mr. Saxon', which ultimately is revealed to be the return of the Doctor's enemy Time Lord the Master, first played by Derek Jacobi before regenerating into John Simm.\n\n\nTotal Episodes: 13\nTotal Specials:  4\n\n\n2007-04-01 - Smith and Jones (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Earth/Moon\nDate: 2008\nEnemies: Judoon, Plasmavore, Slabs \n\nTrainee doctor Martha Jones has her hands full balancing her medical studies with placating her demanding family. So the last thing she needs is to find that the hospital where she works has been transported to the moon, where it's invaded by an overbearing alien police force. There she encounters a patient called John Smith, who seems curiously at ease with the situation.\n\n\n2007-04-07 - The Shakespeare Code (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Earth\nDate: 1599\nEnemies: Carrionites\n\nMartha takes her first trip in the Tardis, all the way back to Elizabethan England. She and the Doctor hear of a series of bizarre deaths and discover that playwright William Shakespeare is being controlled by dangerous witch-like creatures. It seems the time-traveling duo must defeat ancient forces to prevent history from being rewritten.\n\n\n2007-04-14 - Gridlock (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: New Earth\nDate: The year 5,000,000,053\nEnemies: Macra\n\nThe Doctor takes Martha to New Earth, in the far future, only to find that an entire city has become a deadly trap.\n\n\n2007-04-21 - Daleks in Manhattan (1) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: New York\nDate: 1930s\nEnemies: Daleks (Cult of Skaro), Pig Slaves\n\nThe Doctor investigates disappearances in New York at the height of the depression in the 1930s. Nefarious Pig Men linger in the sewers and the Daleks prepare an audacious plan at the top of the Empire State Building.\n\n\n2007-04-28 - Evolution of the Daleks (2) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: New York\nDate: 1930s\nEnemies: Daleks (Cult of Skaro), Pig Slaves\n\nThe newly-created Dalek-human hybrid, and the other three members of the Cult of Skaro launch an attack on Hooverville, along with their Pig Slaves. The Doctor, Martha, and Frank manage to escape, but discover that the Daleks' plan involving the Empire State Building.\n\n\n2007-05-05 - The Lazarus Experiment (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: London\nDate: 2008\nEnemy: Professor Lazarus\n\nIt looks as though Martha's odyssey is coming to an end when the Doctor drops her home, even landing the Tardis inside her lounge. But then a TV news report tickles the insatiable curiosity of our gallivanting Gallifreyan, and they're off again. So we're treated to the unusual sight of the Doc in a DJ as he escorts a glammed-up Martha to the launch of a scientific breakthrough: an eternal youth machine created by an elderly professor, Richard Lazarus. As with all weird science, the side effects are severe, but this is a very extreme case (and no, it's not suitable for tots). Doctor Who continues its game of spot the homage. Tonight's story is an enjoyable synthesis of She, The Fly and The Quatermass Experiment - even down to the final battle in a London cathedral. But despite some charming interplay between the two leads and an excellent turn from Mark Gatiss as the young and old professor, The Lazarus Experiment is a pretty conventional runaround, though the nightmarish Identikit creature is superbly realised and dedicated Whovians can look out for a &quot;reverse the polarity&quot; reference.\n\n\n2007-05-19 - 42 (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: SS Pentallian \nDate: The 42nd century\nEnemies: Ashton\n\nIn a far-flung galaxy, saboteurs are at work, and crew members are being possessed. The TARDIS crew find themselves in the 42nd century on a spaceship, SS Pentallian, slowly being pulled into a sun, and must find a way to survive.\n\n\n2007-05-26 - Human Nature (1) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: A boys' boarding school \nDate: 1913 \nEnemies: The Family of Blood\n\nEngland, 1913. A schoolteacher called John Smith dreams of adventures in time and space. The Doctor, along with Martha, heads to a boarding school, but what he finds is far from ordinary.\n\n\n2007-06-02 - The Family of Blood (2) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: A boys' boarding school \nDate: 1913 \nEnemies: The Family of Blood \nEngland, 1913. A schoolteacher called John Smith dreams of adventures in time and space. The Doctor, along with Martha, heads to a boarding school, but what he finds is far from ordinary. (Conclusion)\n\n\n2007-06-09 - Blink (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Hull, London, England\nDate: 2007\nEnemies: The Weeping Angels\n\nSuggestion is a powerful weapon. The Doctor is lost in time and within the walls of an old, abandoned house, murder is afoot and the Weeping Angels await. A young woman called Sally visits a dilapidated house, and is led down a terrifying time-torn path.\n\n\n2007-06-16 - Utopia (1) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Malcassairo\nDate: The Year 100 Trillion\nEnemies: Futurekind, The Master\n\nAfter being brought back to life in The Parting of the Ways, Captain Jack Harkness was just left on the Gamestation by the Doctor and Rose. In this episode, Captain Jack Harkness storms back into the Doctor's life, and the TARDIS is thrown to the end of the universe itself.\n\n\n2007-06-23 - The Sound of Drums (2) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: London\nDate: 2008\nEnemies: The Master, The Toclafane\n\nHarry Saxon becomes Prime Minister and his reign of terror begins, but that's only the start of his ambitions, as he announces mankind's first contact with an alien race, the Toclafane. An audacious plan spanning the whole of time and space begins to close around the Earth, in the penultimate episode of Russell T Davies's Doctor Who.\n\n\n2007-06-30 - Last of the Time Lords (3) (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Earth, The Valiant\nDate: 2008, 2009\nEnemies: The Toclafane, The Master\n\nOne year has passed since the events of &quot;The Sound of Drums.&quot; The Earth has been conquered and its population enslaved, the Doctor is the Master's prisoner, and the warships of a new Time Lord Empire rise from the ashes. The fate of the world is in Martha Jones' hands.\n\n\n2007 Specials \n\n\n2007-05-28 - Special - (Music) - A Celebration Concert\n\nA musical odyssey through time and space with highlights and background footage from the Doctor Who - A Celebration concert at the Wales Millennium Centre in November 2006. Hosted by David Tennant, artists include the BBC National Orchestra and Chorus of Wales under the baton of Ben Foster, Oods, Daleks and Cybermen. The programme has insights into the musical soundtrack from composer Murray Gold, Doctor Who head writer Russell T Davies and executive producer Julie Gardner.\n\n\n2007-06-30 - Special - (Animated) - The Infinite Quest (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: The Infinite, Boukon, Volag-Noc, Myarr, Pheros\nDate: 40th Century\nEnemies: Baltazar\n\nThe Tenth Doctor and Martha Jones set off on an adventure through space to find the data-chips to unlock The Infinite, a huge spaceship that can grant people their heart's desire. However, the evil Baltazar is also searching for the ship.\n\n\n2007-11-16 - Special - (Children in Need 2007) - Time Crash (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: TARDIS\nDate: none\nEnemies: None\n\nAfter Martha says goodbye to the Doctor and leaves, he is surprised to find a problem with the TARDIS. Suddenly, a man materializes - the Fifth Doctor. But why's he here, and what's happened to the TARDIS?\n\n\n2007-12-25 - Special - (Christmas 2007) - Voyage of the Damned (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: The Titanic Cruise Liner, Earth\nDate: Christmas 2008\nEnemies: The Hosts, Max Capricorn\n\nAt the end of Last of the Time Lords, a ship crashes through the side of the TARDIS, mid-flight, and a life ring bearing the name 'Titanic' is thrown towards the Doctor. What on Earth is going on?\n","torrent":{"xt":"urn:btih:aba91a487a7954da31fa17e7addd81bd6fd02bb9","amp;dn":"New+Doctor+Who+-+Season+03+%282007%29+-+13+HD+Episodes+%2B+4+SD+Specia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba91a487a7954da31fa17e7addd81bd6fd02bb9","infoHashBuffer":{"type":"Buffer","data":[171,169,26,72,122,121,84,218,49,250,23,231,173,221,129,189,111,208,43,185]},"announce":[],"urlList":[]}}