{"title":"CBC Massey Lectures, 1981 - 1990","uid":6941955,"size":1654410674,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:abab260596580b536f4acb5d1f2475f41c33b05f&amp;dn=CBC+Massey+Lectures%2C+1981+-+1990&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Temptation","files":55,"time":1326076755,"description":"[b]CBC Massey Lectures, 1981 - 1990[/b]\n\nThe CBC has commissioned the annual Massey Lectures since 1961. They were unveiled in late February by the vice-president and general manager of English networks at the Canadian Broadcasting Corporation (CBC), H.G. Walker. &quot;Each year,&quot; he said in the press release announcing the series, &quot;the CBC will invite a noted scholar to undertake study or original research in his field and present the results in a series of half-hour radio broadcasts.&quot; He continued, saying that he hoped the lectures would &quot;make significant contributions to public awareness and understanding and... further development of the art of broadcasting.&quot;\n\nThe lectures were named for Vincent Massey, who had recently completed a seven-year term as Governor General of Canada. Today, the CBC Massey Lectures are the product of a collaboration of three partners -- CBC Radio, the House of Anansi Press, and Massey College in the University of Toronto. For most of their history, the Massey Lectures were recorded within the austere confines of a radio studio in Toronto. But since 2002, they have been delivered each fall before large audiences on university campuses in cities across Canada. The lectures are broadcast each November on CBC Radio One, are streamed worldwide on the internet and are available as podcasts and audio CDs.\n\n\n[b]Lecturers/Topics:[/b]\n\n1981 - Willy Brandt, Dangers and Options: The Matter of World Survival\n1982 - Robert Jay Lifton, Indefensible Weapons\n1983 - Eric Kierans, Globalism and the Nation State\n1984 - Carlos Fuentes, Latin America: At War with the Past\n1985 - Doris Lessing, Prisons We Choose to Live Inside\n1986 - Harry J. Boyle, Growing up with Canada [missing]\n1987 - Gregory Baum, Compassion and Solidarity: The Church for Others\n1988 - Noam Chomsky, Necessary Illusions: Thought Control in Democratic Societies\n1989 - Ursula Franklin, The Real World of Technology\n1990 - Richard Lewontin, Biology as Ideology: The Doctrine of DNA\n\nPlease note that the 1986 lecture is missing from this series. CBC has not made it available in the current archives and it appears to never have been published in book or CD form.\n\n\n[b]Uploader's notes:[/b]\n\nThese lecture podcasts have been pulled together from various sources, including CBC's web archive, streamed audio, library CDs and MP3s from other sites. Audio quality is 64K-128K MP3, depending on source.\n\n-- Epyx, 11 Dec 2011\n\n\n*** Note: All credit to original uploader [b]Epyx @ Demonoid[/b].  I'm just cross-posting the torrent here ***\n","torrent":{"xt":"urn:btih:abab260596580b536f4acb5d1f2475f41c33b05f","amp;dn":"CBC+Massey+Lectures%2C+1981+-+1990","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abab260596580b536f4acb5d1f2475f41c33b05f","infoHashBuffer":{"type":"Buffer","data":[171,171,38,5,150,88,11,83,111,74,203,93,31,36,117,244,28,51,176,95]},"announce":[],"urlList":[]}}