{"title":"Silje Nergaard - Darkness Out Of Blue 2007","uid":6998284,"size":393090826,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac46d1d90d10bb8718bcd3cfc098402c7894e7b5&amp;dn=Silje+Nergaard+-+Darkness+Out+Of+Blue+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1327965359,"description":"Norwegian singer &amp; songwriter Silje Nergaard is Norways best sold jazz artist ever on the official sales chart in Norway. She has released more than 12 albums. From the age of 16 she established herself as one of Norways strongest songwriters, and her first hit single Tell Me Where YouÃ‚Â´re going, made it to no. 1 in Japan, and great success in Norway and the UK amongst other countries. Silje's album At First light, is by far still the most sold norwegian Jazz album ever entering the official sales chart in Norway at no 1 in its first week at the start of the millenium. Silje has recorded and performed songs with Al Jarreau, Pat Metheny, Toots Thielemann, Morten Harket of A-ha and many more. Silje is touring all over the world with her trio or band. The album A Thousand True Stories, that she recored with the Metropole Ochestra of Holland in 2008 and was a great success in both Europe and Asia and received a Grammy Nomination in the US for best arrangements by legendary Vince Mendoza. In Spring of 2012 Silje will release her new album Unclouded, based on recordings with her two great guitarists Hallgrim Bratberg and HÃƒÂ¥var Bendiksen. For Unclouded, Silje has also invited the great american guitarist John Scofield to contribute along with Jojje Wadenius, Knut Reiersrud, and Nils Petter MolvÃƒÂ¦r amongst others. Silje is one of few Norwegian artists to have been commercially released all around the globe, on most continents and major music markets including Japan, Brazil, Germany, the U.S., and the United Kingdom. (wikipedia)\n\n- - -\n\nSilje Nergaard - Darkness out of blue 2007\n(Oslo  Universal/EmArcy)\n\n 1. Paper boats \n 2. Darkness out of blue \n 3. The diner \n 4. Wastelands \n 5. When Judy falls \n 6. The beachcomber \n 7. What might have been \n 8. Aren't you cured yet \n 9. Who goes there \n10. Before you called me yours \n11. How are you gonna' deal with it \n12. Let me be troubled\n","torrent":{"xt":"urn:btih:ac46d1d90d10bb8718bcd3cfc098402c7894e7b5","amp;dn":"Silje+Nergaard+-+Darkness+Out+Of+Blue+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac46d1d90d10bb8718bcd3cfc098402c7894e7b5","infoHashBuffer":{"type":"Buffer","data":[172,70,209,217,13,16,187,135,24,188,211,207,192,152,64,44,120,148,231,181]},"announce":[],"urlList":[]}}