{"title":"Stephen W. Bennett - A Federation Forged in Fire (Koban Series #","uid":13009135,"size":622644397,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac4ff6351b5063414e5d2172b34e1ab7c046ef4f&amp;dn=Stephen+W.+Bennett+-+A+Federation+Forged+in+Fire+%28Koban+Series+%23&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":2,"time":1450239960,"description":"Stephen W. Bennett - A Federation Forged in Fire (Koban Series #5)\r\n\r\n\r\n\r\nThis is Book 5 of the popular and highly rated Koban Series.\r\n\r\nWhen the enemy discovers their hidden home, Mirikami is forced to lead 117 Kobani ships in a desperate attack against 3,000 Krall ships and uncounted warriors. Armed with a 22,000-year-old computer virus, and sheer courage, they must disable every enemy ship and weapon. The last time this tactic was tried against them, the Krall eradicated the entire Olt’kitapi civilization.\r\n\r\nThat’s just one foe the Kobani face. The PU president rejects diplomatic recognition of the new Galactic Federation, and diplomat Mirikami is ordered arrested for genetic crimes and for provoking Krall attacks on Hub worlds. To reveal the president’s duplicity in a secret deal with the Krall leader, he accepts a life or death challenge fight with an old enemy, right on the capitol steps, with news cameras rolling.\r\n\r\nThen, proving the galaxy remains a dangerous place, the huge Thandol Empire, a former Olt’kitapi enemy, forcefully announces that its elephantine rulers intend to annex the Orion Spur. That happens to be where both the Kobani led Galactic Federation, and Human Space reside. Naturally, the Kobani decline the Empire’s violently phrased demands, doing it in their typically harsh and forceful manner.\r\n\r\nIn leading up to that confrontation, the Kobani learn the basis of the Empire’s claim to Federation Space, and it predates the Krall conquests. The prior owners may have a claim. The Empire’s initial punitive reaction to Kobani rejection reveals they have a pain causing nerve weapon, used for crowd control in the Empire. This mild sounding weapon proves to be devastating to those with organic superconducting nerves. Life on Koban could be wiped out by a riot control ship.\r\n\r\n\r\n\r\nRead by Eric Michael Summerer\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nLength: 21 hrs and 37 mins\r\nSeries: Koban, Book 5\r\nUnabridged Audiobook\r\nRelease Date:12-11-15\r\nPublisher: STEPHEN W BENNETT","torrent":{"xt":"urn:btih:ac4ff6351b5063414e5d2172b34e1ab7c046ef4f","amp;dn":"Stephen+W.+Bennett+-+A+Federation+Forged+in+Fire+%28Koban+Series+%23","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac4ff6351b5063414e5d2172b34e1ab7c046ef4f","infoHashBuffer":{"type":"Buffer","data":[172,79,246,53,27,80,99,65,78,93,33,114,179,78,26,183,192,70,239,79]},"announce":[],"urlList":[]}}