{"title":"Pusha T - My Name Is My Name (2013) [FLAC]","uid":9023480,"size":323673912,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac781a956aa29db7ef0298675bb6ecfc698da11d&amp;dn=Pusha+T+-+My+Name+Is+My+Name+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1381319511,"description":"\n  Pusha T - My Name Is My Name (2013) [FLAC]\n\n  Genre: Hip-Hop\n  Style: Hardcore Rap, Gangsta Rap\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 King Push\n  02 Numbers On The Board\n  03 Sweet Serenade (Feat. Chris Brown)\n  04 Hold On (Feat. Rick Ross)\n  05 Suicide (Feat. Ab-Liva)\n  06 40 Acres (Feat. The-Dream)\n  07 No Regrets (Feat. Young Jeezy &amp; Kevin Cossom)\n  08 Let Me Love You (Feat. Kelly Rowland)\n  09 Who I Am (Feat. 2 Chainz &amp; Big Sean)\n  10 Nosetalgia (Feat. Kendrick Lamar)\n  11 Pain (Feat. Future)\n  12 S.N.I.T.C.H. (Feat. Pharrell)\n\n  Pusha T's slow crawl to a debut solo album included the killer mixtape Fear of God II: Let Us Pray, which sure seemed official, being released by Kanye West's G.O.O.D. Music with major-label distribution. It stretched the definition of a mixtape fairly far, but West and his team are masters at using smoke and mirrors, as My Name Is My Name is a combination of right place and right time with the results being hot enough to burn up any rulebook. Here, the former Clipse member takes that crew's uncompromising stance into the post-Yeezus and post-Death Grips age with a claustrophobic and tight effort that roars. If ever an album could slap a listener, it's this one or Yeezus, but the big difference is that Pusha is pavement while West is penthouse. With this one, the streets keep rocking with cool and connectable moments, from an album title inspired by the television series The Wire to the idea of inviting Kelly Rowland over for the playful come-on &quot;Let Me Love You&quot; (Pusha offers &quot;I know you think I'm the one, but who doesn't?,&quot; a flirty moment that would have never seemed possible while in Clipse). \n  \n  The Rowland cut neatly fits into an album that arcs up to its most approachable moment, because even when Big Sean and 2 Chainz show up on &quot;Who I Am,&quot; the guaranteed 2013 hitmakers are thrown into an industrial hip-hop grinder, a challenging moment balanced by a simplistic hook right out of the Busta Rhymes playbook. &quot;Sweet Serenade&quot; is aptly titled, although even Chris Brown and Swizz Beatz can't pull Pusha from the edge, while &quot;40 Acres&quot; with the-Dream lives up to its guest's name as elegant and ethereal production meets the rapper at his most poignant (&quot;Born to mothers who couldn't deal with us/Left by fathers who wouldn't build with us&quot;). &quot;S.N.I.T.C.H.&quot; with Pharrell brings some light Neptunes soul into this ominous universe, &quot;Suicide&quot; is a raw Clipse flashback mashing with stuttering electro trap music, and &quot;Hold On&quot; with Rick Ross tastes like well-aged port as an uncredited Kanye brings the sweetness with background singing while the downtrodden lyrics offer the bitter and give the song some serious body. With Pusha's pen at full force and his performance a proper combination of cold and tense, the album is as if Clipse's Hell Hath No Fury were atom-smashed into something more artful and unstable. My Name Is My Name is a remarkable and vital solo debut","torrent":{"xt":"urn:btih:ac781a956aa29db7ef0298675bb6ecfc698da11d","amp;dn":"Pusha+T+-+My+Name+Is+My+Name+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac781a956aa29db7ef0298675bb6ecfc698da11d","infoHashBuffer":{"type":"Buffer","data":[172,120,26,149,106,162,157,183,239,2,152,103,91,182,236,252,105,141,161,29]},"announce":[],"urlList":[]}}