{"title":"The Soul Travelers-Illuminati &amp; Occult documentary","uid":6076927,"size":1914621032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac8600d8895bfc2aa3b9bac4f20f3a2c11767847&amp;dn=The+Soul+Travelers-Illuminati+%26+Occult+documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"goingetheric","files":1,"time":1293914345,"description":" &lt;a href=&quot;http://www.hollywoodinsiders.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.hollywoodinsiders.net&lt;/a&gt;\n\nMichael Wynn's &quot;The Soul Travelers&quot; [5hours, 1.8GB AVI] reveals the truth about mythology, the spirit world, magic, Satanism, and the Illuminati. This documentary reviews repeating themes in mythology and tales of ancient man. Then the video discusses the details of the spirit world, chakras, demons, and angels. It continues by delving into the details of magic, the occult, and Satanic Illuminati symbolism. The Soul Travelers is surely among the most revealing documentaries on the subject of magic and the occult, as it takes a revisionist look at the symbols of secret societies like the Freemasons. It concludes by examining the characters like Satan, Jesus, Babylon, and more from the perspective of the occult.\n*Feel free to repost The Soul Travelers wherever you wish\n-\ndocumentary illuminati satanic secret society mythology video conspiracy nwo satanism black magic gods freemasonry world government new freemasonic symbols messages subliminal control order freemason members exposed disney 911 trade center globalism obama rituals alex jones barack york aliens ufo antichrist devil economic dollar collapse vampire magick ritual 2012 mayan calander david icke reptilian shapeshifter 666 mark beast bank cia movies music television nsa federal reserve patriot act fema camp bilderberg aleister crowley vatican israel catholic church jesuit zionism zionist nuclear bush wtc wtc7 jeff rense tsarion witchcraft tyranny martial lawamerica iraq iran war ghost paranormal false flag loose change terrorstorm terrorist attack internet2 tampa florida alan watt washington jordan mawell cooper haarp chicago mythological religion bible stories folklore story flood ancient spirit demon vampires demons egypt giza pyramids great aztec fallen angel satan jinn islam muslim nephilim giants genesis alien grey holy guardian abyss evil astral chakra life force energy etheric body history map michael wynn telepathy mind reading communication telepathic maya calender transformation initiation work revealed occult man sabbat baphomet gog magog babylon whore greek egyptian hindu indian talisman dajjal revelation end","torrent":{"xt":"urn:btih:ac8600d8895bfc2aa3b9bac4f20f3a2c11767847","amp;dn":"The+Soul+Travelers-Illuminati+%26+Occult+documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8600d8895bfc2aa3b9bac4f20f3a2c11767847","infoHashBuffer":{"type":"Buffer","data":[172,134,0,216,137,91,252,42,163,185,186,196,242,15,58,44,17,118,120,71]},"announce":[],"urlList":[]}}