{"title":"Gay - CMNM - 57 - Ben","uid":7159535,"size":471564210,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ad0f40d139c9383d3757074a56bab7b873c6cd8b&amp;dn=Gay+-+CMNM+-+57+-+Ben&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"mGlottalstop","files":-1,"time":1333566377,"description":"Ben\n24 years old\n5ft 6 (1.68m)\n\nIt's a laid-back afternoon at the rugby club and the lads are feeling light-headed and mischievous after several pints. New teammate Ben desperately wants to fit in and will do anything to be accepted by his older more experienced new buddies. It's a good thing all that beer has broken down his inhibitions because it's initiation time. Laughing and being passed from man to man young sporty Ben's clothes are yanked off. He's made to undergo several humiliating stunts leaving his face red and his bum hole sore. But after it all he knows he'll finally be a fully fledged member of this club.\n\n~~\n\nPART ONE - STRIPPED\n\nThe chanting jocular rugby guys have it in for their new teammate making Ben go through the initiation that every club member has experienced. Accustomed to being naked around each other in locker room showers he's made to get closer to his teammates than ever before. With his pendulous uncut dick and big heavy balls getting tugged it's a struggle for good-natured Ben to complete his challenge of clambering over his clothed club brothers. It's a good thing he took a long shower before coming for a drink because the guys get a long whiff of his tight sporty arsehole while teasing his cock till it goes stiff.\n\n257MB, 15 minutes 35 seconds.\n\n~~\n\nPART TWO - VIOLATED\n\nStripped down naked Ben is getting hazed in the middle of the rugby club. Lubbing up his tight arsehole with spit he's fingered rigorously causing him to grow a throbbing erection. Pinned naked between the three older clothed dominant men he's totally overwhelmed by the men groping and teasing him till he's dripping with precum and desperate to ejaculate. Ben can't be considered a full member of this team until he's received a whiskey bottle up his arse.\n\n67.3MB, 4 minutes 57 seconds.\n\n~~\n\nPART THREE - WANKED\n\nBen is taking his hazing like a real sport. Spread naked with a bottle up his arse he can't control his throbbing hard penis leaking precum. The confident clothed men take total control of his body leaving him speechless and desperate to empty his aching full balls. The overwhelmed boy had no clue what he was in for when he signed up for this team, but this treatment is now going to be a daily ritual performed before and after practice.\n\n124MB, 7 minutes 6 seconds.\n\n~~\n\nOne of my favourites from CMNM, you can see how much he's enjoying himself!\nJoey x\t\t","torrent":{"xt":"urn:btih:ad0f40d139c9383d3757074a56bab7b873c6cd8b","amp;dn":"Gay+-+CMNM+-+57+-+Ben","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0f40d139c9383d3757074a56bab7b873c6cd8b","infoHashBuffer":{"type":"Buffer","data":[173,15,64,209,57,201,56,61,55,87,7,74,86,186,183,184,115,198,205,139]},"announce":[],"urlList":[]}}