{"title":"Castle Clash Hack 1.1","uid":10326790,"size":1113600,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ad7a1d4b23f46fa294e5347d3837f0ce27e21b4b&amp;dn=Castle+Clash+Hack+1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"filavore","files":1,"time":1402366463,"description":"Castle Clash is a very popular game and it soon was made available to iOS devices.This game has a lot to offer and probable a contender for the game of the year. Many players look for Castle Clash Hack since it is time consuming and a little bit expensive to buy the in game app purchases with you own money specially if you are just a student. This is the reason that smart developers and programmers gather around and came up with a tool that will surely save your time and money , but will also enhace your gaming time while easily dominating your opponents in the game for pleasure. Do you want to have a lot of gems,gold and mana in the game that will let you to dominate your enemies, defeat them in battles and conquer them? Will be posibble with the New Castle Clash Hack version which can now be used and downloaded specially for your Iphone,Ipad and android devices. If you use this hack tool is as easy as point and click or tap on your screen because it's easy to acces. You will have a lot of good adventure in this game since you will battling online player so better start downloading and using Castle Clash Hack at your own comfort.\n\n\n","torrent":{"xt":"urn:btih:ad7a1d4b23f46fa294e5347d3837f0ce27e21b4b","amp;dn":"Castle+Clash+Hack+1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad7a1d4b23f46fa294e5347d3837f0ce27e21b4b","infoHashBuffer":{"type":"Buffer","data":[173,122,29,75,35,244,111,162,148,229,52,125,56,55,240,206,39,226,27,75]},"announce":[],"urlList":[]}}