{"title":"Metal Slug Series [ Attractive143 ]","uid":11875084,"size":241485891,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae07caafb5157ba3ae1d052a8cffb3973b9eb71f&amp;dn=Metal+Slug+Series+%5B+Attractive143+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Attractive.Larka","files":1,"time":1430523358,"description":"A 3D sequel to Metal Slug released to commemorate the series's 10th anniversary.\n\nIn this new MS, the evil General Morden has developed an alliance with the ruthless Oguma corporation, which only means that his armada stands to become the most powerful force on the planet. Rebel soldiers Marco, Tarma, Eri and Fio are not about to let that happen however, and they set forth to put a stop to Morden's war machine by blowing it all up before he has a chance to use it, and all while keeping in tone with the cartoony humor the series is known for.\n\nIn the game you control your selected character from a 3rd-person perspective as you run through each stage demolishing everything in your path and rescuing P.O.W.s in classic Metal Slug fashion. You start out with a basic handgun and a small life-bar, but power-ups found in each level allow you to whip out machineguns, flame-throwers, rocket launchers and more advanced weapons. You can also take command of the many Slug vehicles found in each stage, which increase your firepower and allow you to fly and travel to otherwise hard to reach areas.\n\nThe game features cutscenes between levels that advance the story, and also includes a customizable stats for each character that can be upgraded depending on the rating you get on each level (thus allowing you to upgrade your speed, health or auto-aiming speed among other features","torrent":{"xt":"urn:btih:ae07caafb5157ba3ae1d052a8cffb3973b9eb71f","amp;dn":"Metal+Slug+Series+%5B+Attractive143+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae07caafb5157ba3ae1d052a8cffb3973b9eb71f","infoHashBuffer":{"type":"Buffer","data":[174,7,202,175,181,21,123,163,174,29,5,42,140,255,179,151,59,158,183,31]},"announce":[],"urlList":[]}}