{"title":"B.B. King - Live In Japan (1999)Mp3[CR-Bt]","uid":4668945,"size":120879559,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ae549c2f8a3668dbeac867e350b073a65fb106fe&amp;dn=B.B.+King+-+Live+In+Japan+%281999%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CR-Bt","files":13,"time":1232662880,"description":"Riley B. King, nasce a Itta Bena Mississipi, il 16 settembre del 1925. In uno dei suoi assidui concertiNasce in una situazione tipica dello sviluppo della musica blues, cioÃƒÂ¨ una famiglia povera, che lavora nelle piantagioni del sud. Lui inizia a cantare in chiesa, ed a quindici anni giÃƒÂ  suona la chitarra in un gruppo gospel. Si trasferisce a Memphis per fare il militare, e li trova suo cugino &quot;Bukka White&quot; noto bluesman. Dopo un pÃƒÂ² farÃƒÂ  il DJ in una radio, facendosi chiamare &quot;Riley King, the blues boy from beale street&quot;, ma presto il nome si accorcierÃƒÂ  in B.B. King. Lui ÃƒÂ¨ molto legato alla sua chitarra &quot;Lucille&quot; si chiama cosi perchÃƒÂ¨ nel 1945 in un locale dove suonava, c'erano degli uomini che si picchiavano, per una donna di nome Lucille, finÃƒÂ¬ che diedero fuoco al Lucillelocale e scapparono tutti. Lui perÃƒÂ² si accorse di aver lasciato dentro la chiatarra, andÃƒÂ² a prenderla tra le fiamme, e da quel giorno decise di chiamarla &quot;Lucille&quot;, che tutt'oggi risplende fra le sua mani. Tra il 1951 ed il 1968, the king crea una serie di album che si piazzano al top delle classifiche rhithm&amp;blues, era un instancabile concertista, andava da un capo all'altro d'america con la sua band suonando tutti i giorni. Lui ÃƒÂ¨ stato il precursore naturale di nomi come: James Brown, Otis Redding, ma anche Rod Stewart ed Eric Clapton. RiuscÃƒÂ¬ a portare il blues vero, afroamericano, all'interno del rock, creando atmosfere nuove ed esaltanti. Il rhithm'n'blues, si puÃƒÂ² considerare una sua creazione. Il blues ritmico, il blues ballabile. Non facendo altro che aprire i suoi orizzonti ed incoraggiare nuovi personaggi come: i &quot;rolling stones&quot; che devono molto a musicisti come &quot;Muddy Waters&quot;, contemporaneo di B.B. king. Moltissimi i suoi duetti, tra cui quelli con Eric Clapton e gli U2. Tra le sue canzoni piÃƒÂ¹ belle ci sono sicuramente &quot;Guess who&quot; &quot;The thrill is gone&quot; &quot;Help the poor&quot; &quot;Watch yourself&quot;, solo per dirne alcune. Il blues gli deve molto, ma anche il rock.\n\n","torrent":{"xt":"urn:btih:ae549c2f8a3668dbeac867e350b073a65fb106fe","amp;dn":"B.B.+King+-+Live+In+Japan+%281999%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae549c2f8a3668dbeac867e350b073a65fb106fe","infoHashBuffer":{"type":"Buffer","data":[174,84,156,47,138,54,104,219,234,200,103,227,80,176,115,166,95,177,6,254]},"announce":[],"urlList":[]}}