{"title":"NFS_MW_V13.ISO","uid":7641597,"size":2308931584,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae8930bace10a09692949f09d4108e70d33bbf10&amp;dn=NFS_MW_V13.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mihai_calin96","files":1,"time":1347794777,"description":"Need For Speed - Most Wanted Black (Relentless Edition)\n\nWake up to the smell of burnt asphalt as the thrill of illicit street racing permeates the air. \nFrom the makers of the hit Need for Speed: Underground series, Need for Speed: Most Wanted Black \nEdition challenges players to become the most notorious and elusive street racer.\n\nThis collector's edition features exclusive cars, races and specially-tuned rides, as well as a \nbonus DVD with behind-the-scenes footage of model/actress, Josie Maran, concept art, exclusive \nvideos and much more.\n\nCombining illicit street racing and tuner customization with the intensity of strategic police \npursuit that surpasses any Hollywood-style chase scene, Need for Speed: Most Wanted Black Edition \nis on every gamer's &quot;must-have&quot; list. Out-race rivals, evade cops and exploit hundreds of miles \nof open road as gamers make their way up the Blacklist.\n\nTo become the most wanted racer, players must build up their street cred and Rap Sheet with gripping, \nwhite knuckle, head-to-head races with the top drivers on the streets, as well as pull daring, \nevasive moves to out-run and out-fox the cops that patrol the open road. Players can manage their \nheat or utilize a number of strategic tactics to keep the cops off their tails as they leave their \nrivals behind to suck their exhaust fumes.\n\nNeed for Speed: Most Wanted Black Edition also features a variety of the hottest cars that range \nfrom tuners to super cars. You can customize your ride to race against any class of vehicles. \nCombining the thrill of open-world street racing and customization with the intensity of strategic \npolice pursuits, Need for Speed: Most Wanted Black Edition is the next release in the hit racing \nseries that challenges players to become the most notorious and elusive street racer.\n\nRequirements\n====================\n\nMinimum system requirements\n \nIntel Pentium 4 (or equivalent) CPU running at 1.4GHz or higher \n256MB RAM\n32MB DirectX 9.0c compatible video card (Geforce2 MX or higher) \nDirectX compatible sound card\n3 GB of HD space\n8X DVD-ROM\n\nThe following major D3D chipsets are supported: ATI Radeon 7500, 8500, 9xxx series, Xpress 200, \nX300, X600, X700, X800 series, NVIDIA GeForce 2 (GTS, MX, Ultra/Ti), GeForce 3 (Ti), GeForce 4 \n(MX, Ti), GeForce FX series, GeForce 6200, 6600, 6800, 7800, Intel 950/i915g, S3 GammaChrome S18 Pro.\n\nInstructions\n====================\n\nMount or burn the ISO and let it run.  No key, crack, or keygen needed.  The install is fully\nautomated and will place the game in your Program Files directory and put shortcuts to the game\nand trainers on your desktop.\n\nCredit to the creator (Relentless I assume).\n\nFile Size = 2.14 GB","torrent":{"xt":"urn:btih:ae8930bace10a09692949f09d4108e70d33bbf10","amp;dn":"NFS_MW_V13.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae8930bace10a09692949f09d4108e70d33bbf10","infoHashBuffer":{"type":"Buffer","data":[174,137,48,186,206,16,160,150,146,148,159,9,212,16,142,112,211,59,191,16]},"announce":[],"urlList":[]}}