{"title":"Knit One, Embellish Too: Hats Mittens and Scarves with a Twist","uid":9398544,"size":106223704,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aecae677c23ec3eb8275b2a7ddf653b6655a9729&amp;dn=Knit+One%2C+Embellish+Too%3A+Hats+Mittens+and+Scarves+with+a+Twist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1388026094,"description":"Cozy knits with an artful twist. Customizing your handknits is easier than you think! Knit One, Embellish Too includes easy-to-follow patterns for more than 35 warm and comfy scarves, hats and mittens, and shows you how to make them your own with decorative yarn stitching and other simple embellishments. Whether you're an enthusiastic beginner or a seasoned pro, you'll be surprised at how easy it is to transform your knitted accessories into one-of-a-kind works of art. Pick up your knitting needles and: Create quick, easy projects from a minimal amount of yarn. Plus, learn how to choose the best yarn for your project, or even recycle old sweaters into unique yarns for knitting. Explore fun ways to personalize your work with artful stitching and the addition of buttons, appliquï¿½s and other unique embellishments. If you're looking for a bigger challenge, helpful guides show you how to try your hand at choosing and combining colors and finding the perfect fit. Learn all the basics of knitting and embellishing in a comprehensive techniques section right up front, complete with clear illustrations and instructions. Knit something new and embellish it, too: Open up a world of creative yarns, vibrant colors and inspired embellishments for your knitted accessories.","torrent":{"xt":"urn:btih:aecae677c23ec3eb8275b2a7ddf653b6655a9729","amp;dn":"Knit+One%2C+Embellish+Too%3A+Hats+Mittens+and+Scarves+with+a+Twist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aecae677c23ec3eb8275b2a7ddf653b6655a9729","infoHashBuffer":{"type":"Buffer","data":[174,202,230,119,194,62,195,235,130,117,178,167,221,246,83,182,101,90,151,41]},"announce":[],"urlList":[]}}