{"title":"Dawkins An Appetite for Wonder: The Making of a Scientist 2013","uid":8968178,"size":10984846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aee5b4f3e3ef3516ad7ef2101f4b055ef466bdf7&amp;dn=Dawkins+An+Appetite+for+Wonder%3A+The+Making+of+a+Scientist+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"bookzilla","files":1,"time":1380281131,"description":"2013 epub\n\nWith the 2006 publication of The God Delusion, the name Richard Dawkins became a byword for ruthless skepticism and &quot;brilliant, impassioned, articulate, impolite&quot; debate (San Francisco Chronicle). his first memoir offers a more personal view.\n\n His first book, The Selfish Gene, caused a seismic shift in the study of biology by proffering the gene-centered view of evolution. It was also in this book that Dawkins coined the term meme, a unit of cultural evolution, which has itself become a mainstay in contemporary culture.\n\n In An Appetite for Wonder, Richard Dawkins shares a rare view into his early life, his intellectual awakening at Oxford, and his path to writing The Selfish Gene. He paints a vivid picture of his idyllic childhood in colonial Africa, peppered with sketches of his colorful ancestors, charming parents, and the peculiarities of colonial life right after World War II. At boarding school, despite a near-religious encounter with an Elvis record, he began his career as a skeptic by refusing to kneel for prayer in chapel. Despite some inspired teaching throughout primary and secondary school, it was only when he got to Oxford that his intellectual curiosity took full flight.\n\n Arriving at Oxford in 1959, when undergraduates &quot;left Elvis behind&quot; for Bach or the Modern Jazz Quartet, Dawkins began to study zoology and was introduced to some of the university's legendary mentors as well as its tutorial system. It's to this unique educational system that Dawkins credits his awakening, as it invited young people to become scholars by encouraging them to pose rigorous questions and scour the library for the latest research rather than textbook &quot;teaching to&quot; any kind of test. His career as a fellow and lecturer at Oxford took an unexpected turn when, in 1973, a serious strike in Britain caused prolonged electricity cuts, and he was forced to pause his computer-based research. Provoked by the then widespread misunderstanding of natural selection known as &quot;group selection&quot; and inspired by the work of William Hamilton, Robert Trivers, and John Maynard Smith, he began to write a book he called, jokingly, &quot;my bestseller.&quot; It was, of course, The Selfish Gene.\n\n Here, for the first time, is an intimate memoir of the childhood and intellectual development of the evolutionary biologist and world-famous atheist, and the story of how he came to write what is widely held to be one of the most important books of the twentieth century.","torrent":{"xt":"urn:btih:aee5b4f3e3ef3516ad7ef2101f4b055ef466bdf7","amp;dn":"Dawkins+An+Appetite+for+Wonder%3A+The+Making+of+a+Scientist+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee5b4f3e3ef3516ad7ef2101f4b055ef466bdf7","infoHashBuffer":{"type":"Buffer","data":[174,229,180,243,227,239,53,22,173,126,242,16,31,75,5,94,244,102,189,247]},"announce":[],"urlList":[]}}