{"title":"Superdrag - In the Valley of Dying Stars [2000]","uid":9690870,"size":358612436,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af4733297346495b165fa79c2cc42dcec7112b71&amp;dn=Superdrag+-+In+the+Valley+of+Dying+Stars+%5B2000%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GenXRock","files":-1,"time":1393861123,"description":"Review by Josh Modell\nSuperdrag's third proper album (there are a couple of singles compilations as well) begins with this lyric: &quot;I want rock and roll, but I don't want to deal with the hassle.&quot; Perhaps the line references the Knoxville, TN, band's major label roller coaster ride that began with a decent-sized radio hit (&quot;Sucked Out&quot;) and ended in the usual way: Trends changed, the band made a follow-up record that didn't sell as well, and then it was dropped by Elektra. Other than that lyric, though, nothing would indicate that any of the business end of the music business had affected the hooky power pop band. In the Valley of Dying Stars is a solid, terrific sounding album; the mix is great, the songs are great, and the guitars crunchingly complement singer John Davis' songs exactly as they should. The songs on Valley are among the best written by the band, from the typically rocking &quot;Keep It Close to Me&quot; to the more subtle &quot;The Warmth of a Tomb.&quot; While the band may never again attain the level of popularity it reached with Regretfully Yours, it should still inspire a legion of fans devoted to solid, hooky pop songs. (3/5)","torrent":{"xt":"urn:btih:af4733297346495b165fa79c2cc42dcec7112b71","amp;dn":"Superdrag+-+In+the+Valley+of+Dying+Stars+%5B2000%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4733297346495b165fa79c2cc42dcec7112b71","infoHashBuffer":{"type":"Buffer","data":[175,71,51,41,115,70,73,91,22,95,167,156,44,196,45,206,199,17,43,113]},"announce":[],"urlList":[]}}