{"title":"Corsairs: Return of Legend [2007|Rus|Akella]","uid":4216594,"size":4562703890,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:af8ceea2e450c281b06939a54606bb6e8ad12777&amp;dn=Corsairs%3A+Return+of+Legend+%5B2007%7CRus%7CAkella%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RoadTrain4eg","files":4,"time":1212373372,"description":"Razrabotchik: Seaward/Akella \nIzdatel&amp;#039;stvo: Akella \nZHanr: Naval / RPG / 3D / 3rd Person / Privateer/Trader \n\nOpisanie: (shhelknite, chtoby uvidet&amp;#039;)\nVymyshlennyj arhipelag iz igr &quot;Korsary&quot; i &quot;Piraty Karibskogo morja&quot; ustupil mesto real&amp;#039;nym ostrovam Karibskogo bassejna. Ispanskij Mjejn, Kuba, JEspan&amp;#039;ola (Gaiti), JAmajka - ot Beliza do Barbadosa i ot Porto Belo do Bermud prostiraetsja novaja karta igry, vkljuchaja takie privychnye chitatelju knig pro piratov goroda kak Karakas, Kartahenu, Marakajbo, Panamu, Gavanu, Tortugu i drugie (sootvetstvuet 3000h2000 kilometrovomu uchastku planety Zemlja). Geograficheskie izmenenija kosnulis&amp;#039; i suhoputnoj chasti igry - gigantskie prostranstva s dzhungljami, peshherami, katakombami, grotami, buhtami, indejskimi i piratskimi poselenijami. Na ostrovah i materike raspolozheny tridcat&amp;#039; gorodov i poselenij, prinadlezhashhih chetyrem nacijam (Anglii, Francii, Ispanii, Gollandii), indejcam i vol&amp;#039;nym piratam. Est&amp;#039; neobitaemye ostrova i dikie neosvoennye prostranstva. \n\nV igre razrabotan bol&amp;#039;shoj, zhivushhij nezavisimo ot igroka, mir, na kotoryj on mozhet vlijat&amp;#039; po svoemu usmotreniju. Naprimer, zolotoj karavan budet uhodit&amp;#039; v Evropu dva raza v god i v vole igroka perehvatit&amp;#039; ego ili uznat&amp;#039; iz sluhov, chto on blagopoluchno izbezhal napadenij. Strany mogut ssorit&amp;#039;sja, mirit&amp;#039;sja, napadat&amp;#039; i zahvatyvat&amp;#039; drug u druga kolonii. Zakljuchenie mira ili nachalo voennyh dejstvija mezhdu derzhavami nikak ne zavisit ot voli geroja, no on mozhet prinjat&amp;#039; v jetih sobytijah aktivnoe uchastie i sygrat&amp;#039; ne poslednjuju rol&amp;#039;, vybrav kar&amp;#039;eru odnoj iz storon. Vse sjuzhetnye personazhi - real&amp;#039;nye istoricheskie lichnosti toj jepohi, a kvesty postroeny na real&amp;#039;nyh sobytija, proishodjashhih v jeto vremja - Genri Morgan, Tomas Mjedifor, polkovnik Linch, Bertran d&amp;#039;Ozheron, Fransua Olone, Dzhekmen, Peter Stjevezant i mnogie drugie. Scenarij sostavlen tak, chto igraja za raznye storony igrok po suti stalkivaetsja sam s soboj iz proshloj igry, naprimer, v odnoj kar&amp;#039;ere nuzhno dostavit&amp;#039; vazhnoe gosudarstvennoe lico, izbezhav popytok ego perehvata, togda kak po kar&amp;#039;ere za druguju naciju nuzhno jetogo passazhira perehvatit&amp;#039;. Ili zashhitit&amp;#039; gorod ot napadenija po odnoj istorii, a po drugoj jetot gorod zahvatit&amp;#039;. Neskol&amp;#039;ko misticheskih kvestov zastavjat polomat&amp;#039; golovu iskushennogo igroka nad svoimi zagadkami i hitrospletenijami sjuzheta, a glavnoe, reshaemymi igrovymi zadachami. JAzyk skriptov Storm 2.5 byl special&amp;#039;no dorabotan dlja realizacii novyh vidov igrovyh zadanij i postroenija polnomasshtabnyh skriptovyh scen. \n\nKazhdoe zadanie v scenarnyh kvestovyh linejkah mozhet byt&amp;#039; resheno neskol&amp;#039;kimi sposobami, dazhe proval zadanija ne fatalen dlja igry, vse varianty razvitija obrabatyvajutsja i sjuzhet idet po svoemu puti, zavisjashhemu ot dejstvij igroka na protjazhenii vsej istorii. Ljubaja meloch&amp;#039; v nachale istorii mozhet otygrat&amp;#039; v konce sjuzheta neozhidannym povorotom sobytij. No i bez zhestkih ramok sjuzhetnyh istorij mir igry polon razlichnyh zadanij i sobytij - generatory kvestov kazhdyj raz budut podkidyvat&amp;#039; geroju neozhidannye povoroty, kazalos&amp;#039; by, tipovyh zadanij. Torgovec, k kotoromu nuzhno bylo dostavit&amp;#039; gruz, mozhet otmenit&amp;#039; sdelku i geroj ostanetsja s nosom, no zato zaimeet gruz v kachestve kompensacii trudov. Poisk dolzhnika, dostavka sundukov s zolotom, soprovozhdenie kupcov i passazhirov, zadanija gubernatorov, razlichnye sluhi v taverne, poisk kladov po kuskam karty - vse jeto ne ostavit vremeni na skuku i &quot;objazatel&amp;#039;nuju prokachku&quot; geroja. \n\nNovaja rolevaja sistema igry PIRATES, nazvana po pervym bukvam anglijskih naimenovanij harakteristik geroja - Power (Sila), Impression (Vosprijatie), Reaction (Reakcija), Authority (Liderstvo), Talent (Obuchaemost&amp;#039;), Endurance (Vynoslivost&amp;#039;), Success (Udacha). JEti harakteristiki vlijajut na skorost&amp;#039; razvitija 14 umenij personazha, kotorye deljatsja na lichnye (avtoritet, legkoe oruzhie, srednee oruzhie, tjazheloe oruzhie, pistolety, vezenie i skrytnost&amp;#039;) i korabel&amp;#039;nye (navigacija, metkost&amp;#039;, orudija, abordazh, zashhita, remont, torgovlja). \n\nPrivlekatel&amp;#039;na dlja igroka i vozmozhnost&amp;#039;ju zanjat&amp;#039;sja chestnoj torgovlej, tak kak v igre prorabotana jekonomicheskaja model&amp;#039; cenoobrazovanija, zatarivanija i deficita tovarov. Te, komu pretit torgovat&amp;#039;, mogut zanjat&amp;#039;sja piratstvom. Zahvatyvat&amp;#039; i grabit&amp;#039; nabitye gruzom kupecheskie korabli. Prodavat&amp;#039; nagrablennoe v druzheskih portah i sdavat&amp;#039; plennyh kapitanov vlastjam ili derzhat&amp;#039; ih v trjume svoego korablja periodicheski naveshhaja, ili kaznit&amp;#039; ih - vse v vole kapitana. CHem bol&amp;#039;she geroj sovershil grehov, tem bolee moshhnye ohotniki pustjatsja za nim v pogonju. \n\nIgra &quot;Korsary: Vozvrashhenie Legendy&quot;, daet igroku prakticheski neogranichennye vozmozhnosti stilja igry. Igra zahvatyvaet s samogo nachala i ne otpustit, poka igrok ne sdelaet kar&amp;#039;eru ot kapera do admirala ili ne zavladeete vsem arhipelagom. No dazhe togda zahochetsja nachat&amp;#039; snachala, chtoby isprobovat&amp;#039; novye puti razvitija, vozmozhno, obzavestis&amp;#039; zhenoj i svoim hozjajstvom na sushe, projti igru po drugomu puti. &quot;Korsary: Vozvrashhenie Legendy&quot; - jeto nastojashhij simuljator piratskoj zhizni konca semnadcatogo veka.","torrent":{"xt":"urn:btih:af8ceea2e450c281b06939a54606bb6e8ad12777","amp;dn":"Corsairs%3A+Return+of+Legend+%5B2007%7CRus%7CAkella%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af8ceea2e450c281b06939a54606bb6e8ad12777","infoHashBuffer":{"type":"Buffer","data":[175,140,238,162,228,80,194,129,176,105,57,165,70,6,187,110,138,209,39,119]},"announce":[],"urlList":[]}}