{"title":"DC Universe 52 Week 129 (darkhomr) [TPB]","uid":9617898,"size":425645648,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aff69d773dc4095138e877e475bb45253a4c3c23&amp;dn=DC+Universe+52+Week+129+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dadrkhomr","files":11,"time":1392441533,"description":"Welcome to the 2014 version of DC Universe 52.  Each week I will bring you the currrent weeks' comics fresh from the depths of your local comic shop.  This week is week 129 (February 12th) and includes 11 issues.  Join me on this journey, won't you?\n\nBefore uploading these, I am opening them with ComicRack, and made sure they all opened there. If there are problems please let me know. As usual, these are not my scans. Thanks to the original scanners and uppers. If you like what you got here, please purchase them in some form. If this torrent has no seeds please msg me privately. I will be glad to reup anything that has no seeds. It is my policy to not publish my weekly packs unless they are complete, but no later than Friday morning. If you have questions or requests, please message me privately. All descriptions are from DC and taken from Comiclist.\n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nStarhome Scanners (Scans and edits from the members of the Starhome group)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\nBreaking news:   Bleeding cool as well as April solicits confirm that there are six cancellations.  Gone in April are JLoA, Teen Titans, Stormwatch, Suicide Squad, Nightwing and Superman Unchained.  Replacing them will be Sinsetro, Aquaman and the Others, Batman Eternal, Secret Origins,and Justice League United.  Enjoy.\n\n\n\nBatgirl #28 (CBR 2/12/2014)\n\nIt's a hazardous reunion between Batgirl and the former Court of Owls assassin Strix as they face off against the lethal new threat known as Silver - the man who knows the secret of Gotham City's conspiracy of bats! \n\nBatman #28 (CBR 2/12/2014)\n\nZERO YEAR: DARK CITY reaches its conclusion! The final chapter of Zero Year is almost upon us, and we've saved the best for last! What corners of Batman's past will be revealed? And how will they impact his very near future? Find out here! \n\nConstantine #11 (CBR 2/12/2014)\n\nForever Evil: Blight - Part 12 of 18 Project Thaumaton revealed! The Crime Syndicate has twisted the world's greatest mystics into something horrible - is this the beginning of the end? Continues in this month's TRINITY OF SIN: PANDORA #8! \n\nForever Evil Rogues Rebellion #5 (of 6) (CBR 2/12/2014)\n\nThe Rogues against the might of The Royal Flush Gang! Guess who just got dealt a losing hand? Do the boys have any more tricks up their sleeves, or will this be the end of their run? \n\nGreen Lantern Corps #28 (CBR 2/12/2014)\n\nThe Green Lanterns are under siege from the secretive Durlans--so it's time to find the one Lantern who knows all of the Durlans' tricks! But how do you find a shapeshifter who could be anywhere in the universe? And when the Green Lanterns find out who their newest allies are, some of them might prefer no help at all! \n\nJustice League 3000 #3 (CBR 2/12/2014)\n\nThe Flash is defeated. Green Lantern is in the clutches of Locus, a psychotic teenaged girl with the powers of God. And Superman, Batman and Wonder Woman have been banished to a planet wide penal colony! \n\nJustice League of America #12 (CBR 2/12/2014)\n\nA devastating battle against Despero begins as Manhunter and Stargirl arrive in San Francisco to save Stargirl's family from Firestorm's fallout! \n\nNightwing #28 (CBR 2/12/2014)\n\nAll the sins of the past still haunt Nightwing. How can he make his peace with his old life if Gotham City won't leave him alone? \n\nSuicide Squad #28 (CBR 2/12/2014)\n\nThe Thinker unleashes OMAC on the Suicide Squad at the doors of Belle Reve! In this epic clash, not all will survive! \n\nSuperboy #28 (CBR 2/12/2014)\n\nSuperboy and his new team of unstable teen powerhouses must return to the present-day DC Universe to make sure Jon Lane Kent lives to see his plans come to fruition! \n\nSuperman Wonder Woman #5 (CBR 2/12/2014)\n\nFaora has joined Zod--and now, Earth must kneel before their combined might! Even Superman and Wonder Woman can't stop their plan for the Phantom Zone! \n\n","torrent":{"xt":"urn:btih:aff69d773dc4095138e877e475bb45253a4c3c23","amp;dn":"DC+Universe+52+Week+129+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff69d773dc4095138e877e475bb45253a4c3c23","infoHashBuffer":{"type":"Buffer","data":[175,246,157,119,61,196,9,81,56,232,119,228,117,187,69,37,58,76,60,35]},"announce":[],"urlList":[]}}