{"title":"International Handbook on Social Policy and the Environment (201","uid":10796561,"size":4259737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b01dfcfcf3fe3bbb27d43f60145e8ae79f04c5e3&amp;dn=International+Handbook+on+Social+Policy+and+the+Environment+%28201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1408299464,"description":"Book Description:\n\nThe International Handbook on Social Policy and the Environment reviews debates concerning poverty, inequalities, social distribution, social rights, taxation, healthcare, education, water and energy policies to examine the relevance and importance of climate change to social policies and welfare reform.\n\nEnvironmental change is central to the global social policy challenges of the twenty-first century. This comprehensive Handbook brings together leading experts from around the world to address the most important questions and issues we face. How should welfare states adapt to environmental change? To what extent are the ecological and social policy agendas compatible? Must we contemplate radical reforms to the principles and organisation of welfare services? Combining cutting-edge theory and data in an interdisciplinary approach, this Handbook both summarizes existing developments and suggests how debates and research must develop in the future.\n\nThis book will appeal to taught postgraduates, doctoral students and academics across the policy and social sciences. It will also be of interest to non-academic researchers, practitioners and environmental activists. With case studies drawn from many countries including Australia, Japan, Germany, Scandinavia, Canada, Latin America and the UK, the Handbook will provide an important resource for years to come.\n\n\nProduct Details:\n\nPDF: 496 pages\nPublisher: Edward Elgar Pub (August 29, 2014)\nLanguage: English\nISBN-10: 0857936123\nISBN-13: 978-0857936127\n\n\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:b01dfcfcf3fe3bbb27d43f60145e8ae79f04c5e3","amp;dn":"International+Handbook+on+Social+Policy+and+the+Environment+%28201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b01dfcfcf3fe3bbb27d43f60145e8ae79f04c5e3","infoHashBuffer":{"type":"Buffer","data":[176,29,252,252,243,254,59,187,39,212,63,96,20,94,138,231,159,4,197,227]},"announce":[],"urlList":[]}}