{"title":"The Intellectual Life of the Early Renaissance Artist (Art book)","uid":13227530,"size":61301453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0249c6356c10f2b8fb4383b47b76d8ce9feddce&amp;dn=The+Intellectual+Life+of+the+Early+Renaissance+Artist+%28Art+book%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":1,"time":1452889170,"description":"Francis Ames-Lewis, &quot;The Intellectual Life of the Early Renaissance Artist&quot;\r\nEnglish | 2000-05-20 | ISBN: 0300083041 | 304 pages | PDF | 58.4 mb\r\n\r\nAt the beginning of the fifteenth century, painters and sculptors were seldom regarded as more than artisans and craftsmen, but within little more than a hundred years they had risen to the status of &quot;artist&quot;. This book explores how early Renaissance artists gained recognition for the intellectual foundations of their activities and achieved artistic autonomy from enlightened patrons. A leading authority on Renaissance art, Francis Ames-Lewis traces the ways in which the social and intellectual concerns of painters and sculptors brought about the acceptance of their work as a liberal art, alongside other arts like poetry. He charts the development of the idea of the artist as a creative genius with a distinct identity and individuality. Ames-Lewis examines the various ways that Renaissance artists like Mantegna, Leonardo da Vinci, Raphael, and D|rer, as well as many other less well-known painters and sculptors, pressed for intellectual independence. By writing treatises, biographies, poetry, and other literary works, by seeking contacts with humanists and literary men, and by investigating the arts of the classical past, Renaissance artists honed their social graces and broadened their intellectual horizons. They also experienced a growing creative confidence and self-awareness that was expressed in novel self-portraits, works created solely to demonstrate pictorial skills, and monuments to commemorate themselves after death. This book brings together a wide range of textual and visual evidence to illuminate the changing attitudes toward artists and their work, and it provides many stimulating insights into Renaissance culture and art history","torrent":{"xt":"urn:btih:b0249c6356c10f2b8fb4383b47b76d8ce9feddce","amp;dn":"The+Intellectual+Life+of+the+Early+Renaissance+Artist+%28Art+book%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0249c6356c10f2b8fb4383b47b76d8ce9feddce","infoHashBuffer":{"type":"Buffer","data":[176,36,156,99,86,193,15,43,143,180,56,59,71,183,109,140,233,254,221,206]},"announce":[],"urlList":[]}}