{"title":"Morton Feldman - Triadic Memories [MP3/VBR/V0]","uid":3981836,"size":188316453,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b104ab1ee34981a2854d2bad3f8fd98e6c4b4db2&amp;dn=Morton+Feldman+-+Triadic+Memories+%5BMP3%2FVBR%2FV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"_i_","files":3,"time":1200595228,"description":"Release Date: 06/21/2005\nLabel:  Oehms   \nCatalog #: 510  \nSpars Code: DDD\nComposer:  Morton Feldman\nPerformer:  Sabine Liebner\n\nNumber of Discs: 2\nRecorded in: Stereo\nLength: 2 Hours 4 Mins.\n\n\n=======================================================\n\nFrom Classics Today:\n\nAmong his infamously protracted late works, Morton Feldman&amp;#039;s Triadic Memories does not time out to the Wagnerian lengths of For Philip Guston or String Quartet No. 2. Still, it is the composer&amp;#039;s longest--and paradoxically--most accessible solo piano work. It opens with long notes sustained in the piano&amp;#039;s extreme registers. Gradually the notes work their way toward the middle, eventually materializing into steady rhythmic patterns of carefully considered single notes and small chords. Later on you hear sparser, bell-like resonances mapped out to painstaking dynamic specifications, along with a phrase that appears to repeat over and over again but actually is subject to minute metric and dynamic variations, in typical late-Feldman fashion. Around the work&amp;#039;s halfway point Feldman&amp;#039;s spacious sound canvas grows darker with the introduction of murky bass-register chords and quicker note values. Sections that include ethereal arpeggios and extensive rumblings in the bass follow these, plus stark, slow-motion repeated chords that take their sweet time to change at exactly the right moments.\n\nIn a live concert situation, Feldman always expected listeners to dip in and out of the music, coming and going at will, and not to worry about listening with a linear beginning, middle, and end attitude. Yet the composer&amp;#039;s genius for keeping his pitches fresh and his delicate textures insidiously mobile makes it pleasurable to hear Triadic Memories unfold in real time. By taking every repeat option, Sabine Liebner&amp;#039;s extraordinary performance turns out to be the longest among the nine pianists who&amp;#039;ve recorded this work: 124 minutes compared to Marilyn Nonken&amp;#039;s 97 and, at the other extreme, Aki Takahashi&amp;#039;s 61. My first choice remains with Nonken in that the DVD surround-sound with no break in the music best replicates the experience of Triadic Memories in concert. However, the present Bavarian Radio production on two conventional audio CDs proves no less gorgeous in terms of warmth, resonance, and impact--all to the advantage of Liebner&amp;#039;s instinct for tone color, balancing of sonorities, and refined pedaling. Oehms Classics&amp;#039; bargain price further supports my highest recommendation.\n","torrent":{"xt":"urn:btih:b104ab1ee34981a2854d2bad3f8fd98e6c4b4db2","amp;dn":"Morton+Feldman+-+Triadic+Memories+%5BMP3%2FVBR%2FV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b104ab1ee34981a2854d2bad3f8fd98e6c4b4db2","infoHashBuffer":{"type":"Buffer","data":[177,4,171,30,227,73,129,162,133,77,43,173,63,143,217,142,108,75,77,178]},"announce":[],"urlList":[]}}