{"title":"Peter Case...The Case Files(2011)[FLAC]","uid":6503188,"size":281428127,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b14548a976ab8a4ec8f6950c1048cc1b18d32bb3&amp;dn=Peter+Case...The+Case+Files%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":16,"time":1309331105,"description":"[img]http://image.allmusic.com/00/amg/cov200/drp800/p807/p80789pjrzq.jpg[/img]\n[color=Red]The Case Files [2011]Alive Records / 0121-2[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 (Give Me) One More Mile \n2 Let's Turn This Thing Around \n3 Anything (Closing Credits) \n4 The End \n5 Good Times, Bad Times \n6 Milkcow Blues \n7 Kokomo Prayer Vigil \n8 The Ballad of the Minimum Wage \n9 Steel Strings (Demonstration) \n10 Trusted Friend \n11 Black Crow Blues \n12 Round Trip Stranger Blues \n\nPeter Case has been digging deep into his tape library in recent years, releasing fine archival albums from his bands the Plimsouls, the Nerves, and the Breakaways, and now The Case Files finds him offering up some rare and unreleased nuggets from his solo career, ranging from a demo version of &quot;Steel Strings&quot; from his 1986 solo debut to a Stones cover cut in 2009 with the same crew from his album Wig! Considering the odds-and-ends nature of this album, it's a pleasant surprise that The Case Files is so consistently strong, and coming after Case has jumped back into rock &amp; roll, it builds up a solid and enjoyable head of piss and vinegar, with a thread of articulate anger running through these songs, whether they're one-man acoustic numbers or exercises in full-on electric bash. Politics take center stage on several numbers, particularly &quot;Let's Turn This Thing Around,&quot; &quot;Kokomo Prayer Vigil,&quot; and &quot;Ballad of the Minimum Wage,&quot; as Case bemoans America's swing to the right and raises the roof on behalf of economic and social justice, and though most of the songs focus more on the personal, nearly every track sounds urgent and focused, as Case lets his passion fuel the material as well as the performances. Along with a stack of his own numbers, Case has also included some inspired covers, and he charges into Alejandro Escovedo's &quot;The End,&quot; Bob Dylan's &quot;Black Crow Blues,&quot; and Kokomo Arnold's &quot;Milkcow Blues&quot; with the same smarts and drive that he brings to his own stuff. Even though these tracks were either demo tapes, radio sessions, or stuff that didn't make the grade somewhere else, it's clear Peter Case has admirably high standards, and these 12 songs make for an entertaining and empowering album that delivers the goods with smarts and simple, sweaty force. The Case Files proves this man's cast-offs make for a better album than most acts' level-best efforts, and with any luck, he'll offer another look into his archives before long.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/06/24/peter-case/[/url]","torrent":{"xt":"urn:btih:b14548a976ab8a4ec8f6950c1048cc1b18d32bb3","amp;dn":"Peter+Case...The+Case+Files%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b14548a976ab8a4ec8f6950c1048cc1b18d32bb3","infoHashBuffer":{"type":"Buffer","data":[177,69,72,169,118,171,138,78,200,246,149,12,16,72,204,27,24,211,43,179]},"announce":[],"urlList":[]}}