{"title":"Bad Company - Bad Company (1974) [Vinyl-180g] [FLAC]","uid":6003199,"size":734551206,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2e06b80b50888c72ee9b03103c15f186d52d6cf&amp;dn=Bad+Company+-+Bad+Company+%281974%29+%5BVinyl-180g%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"insinuendo","files":16,"time":1291240411,"description":"Thanks to tubedoctor1971!\n\n\n\nCut from the original master tapes by Kevin Gray , this LP positively smokes!\n\n\nReview\n\nby Gautam Baksi\n\nBad Company's 1974 self-titled release stands as one of the most important and accomplished debut hard rock albums from the '70s. Though hardly visionary, it was one of the most successful steps in the continuing evolution of rock &amp; roll, riding on the coattails of achievement from artists like the Eagles and Crosby, Stills, Nash and Young. From the simple electric guitar lick on &quot;Can't Get Enough&quot; to the haunting bassline in &quot;Bad Company&quot; and the fast beats of &quot;Movin' On,&quot; Bad Company exemplified raw rock &amp; roll at its best. Erupting out of an experimental period created by the likes of Pink Floyd, Bad Company signified a return to more primal, stripped-down rock &amp; roll. Even while labelmates Led Zeppelin's Houses of the Holy and IV featured highly acclaimed, colorful album artwork, Bad Company's austere black and white record cover stood out in stark contrast. Six years later, AC/DC used the same idea on their smash Back in Black. Throughout the 35-minute album, Paul Rodgers' mesmerizing and gritty vocals hardly vary in tonal quality, offering a perfect complement to Mick Ralphs' blues-based guitar work. Several songs include three-chord verses offset by unembellished, distorted choruses, filled rich with Rodgers' cries. Bad Company is an essential addition to the rock &amp; roll library; clearly influential to '70s and '80s hard rock bands like Tom Petty, Lynyrd Skynyrd, and Boston.\n\n\n\nTrack Listing:\n\n1. Can't Get Enough\n2. Rock Steady\n3. Ready for Love\n4. Don't Let Me Down\n5. Bad Company\n6. Way I Choose\n7. Movin' On\n8. Seagull\n\n\nBiography\n\nby Jason Ankeny\n\nFormed in 1973, thehard rock outfit Bad Company was a supergroup comprised of ex-King Crimson bassist Boz Burrell, former Mott the Hoople guitarist Mick Ralphs, and singer Paul Rodgers and drummer Simon Kirke, both previous members of Free. Powered by Rodgers' muscular vocals and Ralphs' blues-based guitar work, Bad Company was the first group signed to Led Zeppelin's Swan Song vanity label. Bad Company's eponymous 1974 debut was an international hit, topping the U.S. album charts and scoring with the number one single &quot;Can't Get Enough of Your Love.&quot; \n\n\n\nSystem\nPro-Ject Xpression III\nCarbon Fiber Tonearm\nOrtofon 2M Blue (Cartridge)\nPro-Ject Speedbox\nBellari VP130 Preamp (1959 Mullard Long Plate Tube)\nTubedoctor Custom Cables\nM-Audio 192\n\nNo Equalization\nNo Noise Reduction\nNo Auto De-Click\nNo Dithering On 24 Bit\nNO Normalization\nNo DC Offset Correction\nRecorded @\n192kHz 64 bit float\nw/Steinberg WaveLab 6\n\n","torrent":{"xt":"urn:btih:b2e06b80b50888c72ee9b03103c15f186d52d6cf","amp;dn":"Bad+Company+-+Bad+Company+%281974%29+%5BVinyl-180g%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e06b80b50888c72ee9b03103c15f186d52d6cf","infoHashBuffer":{"type":"Buffer","data":[178,224,107,128,181,8,136,199,46,233,176,49,3,193,95,24,109,82,214,207]},"announce":[],"urlList":[]}}