{"title":"Sean McMeekin - The Berlin-Baghdad Express. The Ottoman Empire a","uid":10317070,"size":4640627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2f6c5344cc3a5b88aba4c9c436aa08a0b951877&amp;dn=Sean+McMeekin+-+The+Berlin-Baghdad+Express.+The+Ottoman+Empire+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1402260677,"description":"Description\nProduct Details\nBook Title: The Berlin-Baghdad Express: The Ottoman Empire and Germany's Bid for World Power\t\nBook Author: Sean McMeekin (Author)\nHardcover: 496 pages\nPublisher: Belknap Press; 1St Edition edition (August 9, 2010)\nLanguage: English\nISBN-10: 0674057392\nISBN-13: 978-0674057395\n\n===================================================================================\nBook Description\nPublication Date: August 9, 2010\n'Sean McMeekin has written a classic of First World War history ... This superb and original book is the reality behind Greenmantle' Norman Stone.\nThe Berlin-Baghdad Express explores one of the big, previously unresearched subjects of the First World War: the German bid for world power - and the destruction of the British Empire - through the harnessing of the Ottoman Empire.\nMcMeekin's book shows how incredibly high the stakes were in the Middle East - with the Germans in the tantalizing position of taking over the core of the British Empire via the extraordinary railway that would link Central Europe and the Persian Gulf. Germany sought the Ottoman Empire as an ally to create jihad against the British - whose Empire at the time was the largest Islamic power in the world.\nThe Berlin-Baghdad Express is a fascinating account of western interference in the Middle East and its lamentable results. It explains and brings to life a massive area of fighting, which in most other accounts is restricted to the disaster at Gallipoli and the British invasions of Iraq and Palestine.\n\n===================================================================================\nReviews\nIn this excellent, well-researched and fascinating book, Sean McMeekin has given us a welcome and stimulating perspective on a highly important but neglected part of the First World War. His account of the Turco-German war effort is a tale of high adventure, ambition and political chicanery with a cast of colourful, brave and sometimes ruthless characters. -- Lawrence James Literary Review\n\nAn exciting new book by a talented young historian -- Niall Ferguson Observer\n\nMcMeekin adds a wealth of documentation...[t]he result is a captivating new history of the Eastern Front in the first world war -- Eugene Rogan Financial Times\n\nMcMeekin has written an engaging history peopled with larger-than-life characters in exotic settings -- Eugene Rogan Financial Times\n\nMcMeekin has written a powerful, overdue book that for many will open up a whole new side to the first world war. -- George Walden Observer\n\nIn addition to bringing to life a fascinating episode in early 20th-century history, The Berlin-Baghdad Express contains several timely lessons and cautionary tales. Wall Street Journal Sean McMeekin's account possesses the large merit that it tells a story little known to Western readers, drawing extensively upon German sources. It depicts a splendid cast of characters heroic in their endeavors if absurd in their lack of accomplishments. -- Max Hastings New York Review of Books\n\n===================================================================================\nAbout the Author\nSean McMeekin has written two previous books, both published by Yale University Press: The Red Millionaire and History's Greatest Heist: The Looting of Russia by the Bolsheviks. He splits his time between the USA and Turkey.\n===================================================================================","torrent":{"xt":"urn:btih:b2f6c5344cc3a5b88aba4c9c436aa08a0b951877","amp;dn":"Sean+McMeekin+-+The+Berlin-Baghdad+Express.+The+Ottoman+Empire+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2f6c5344cc3a5b88aba4c9c436aa08a0b951877","infoHashBuffer":{"type":"Buffer","data":[178,246,197,52,76,195,165,184,138,186,76,156,67,106,160,138,11,149,24,119]},"announce":[],"urlList":[]}}