{"title":"Finding.Carter Complete Series01 All.episodes.ep01.ep12.x264.iam","uid":11130904,"size":2880982114,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b30bde77a10a3c92c0c598b763745530bb0832d5&amp;dn=Finding.Carter+Complete+Series01+All.episodes.ep01.ep12.x264.iam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NX74913","files":12,"time":1412041373,"description":"[img]http://upload.wikimedia.org/wikipedia/en/b/b3/Finding_Carter_intertitle.png[/img]\n\nLink to IMDB \n[url]http://www.imdb.com/title/tt3186138/[/url]\n\nFinding Carter - Intro - Episode Theme  \n\nFinding.Carter_Series 01 All Episodes EP01-EP12-WEB-DL.x264-DASH\nTV RageID 37811\n\nS1, Ep1 Pilot 8 Jul. 2014 \n\n16 year old Carter's life is turned upside down when she learns that the mom who raised her is actually her abductor. But after being reunited with her real family, she learns there's more to her kidnapping than meets the eye. \n\nS1, Ep2 The Birds  8 Jul. 2014 \n\nCarter rebels against her biological mom, Elizabeth, with the help of her new friends but when Elizabeth tries to make amends, it backfires catastrophically. \n\nS1, Ep3 Drive  15 Jul. 2014 \n\nWhen Carter meets bad boy Crash, she sees an opportunity to get back at Elizabeth for being so overbearing. But will Crash's life of crime stop \n\nS1, Ep4 Now You See Me   22 Jul. 2014 \n\nWhile Carter deals with a betrayal from Bird, Max decides to leave the Wilsons. Meanwhile, Lori is back, and she has a plan. \n\nS1, Ep5 The Heat 29 Jul. 2014 \n\nElizabeth shows Carter what real police work is all about and the two begin to bond. Taylor gets more than she bargained for when a mild party turns wild. \n\nS1, Ep6 The Fugitive 5 Aug. 2014 \n\nCarter admits her true feelings for Crash, but soon learns that he's about to skip bail in order to avoid going to jail. And Taylor is torn between Gabe and Max. \n\nS1, Ep7 Throw Momma from the Train  12 Aug. 2014 \n\nCarter and Taylor celebrate their birthdays together for the first time since they were 3. Meanwhile, Carter is faced with choosing between her new life and her old one. \n\nS1, Ep8 Half Baked  19 Aug. 2014 \n\nCarter and Taylor team up to force their mother to come clean about her affair. With the threat of destroying the family, Carter must decide whether she's willing to do the unthinkable in order to bring the family back together. \n\nS1, Ep9 Do the Right Thing  26 Aug. 2014 \nCarter is devastated after finding out that David had already written &quot;Finding Carter.&quot; This also causes a lot of tension between David and Elizabeth, who is on Carter's side. Taylor and Max try to take the next step in their relationship. Ofe seeks financial help from Bird after a betting mistake and she gives him one of her mother's necklaces to pawn off. When Bird's mother notices that the necklace has gone missing, Bird blames Carter and gets her arrested. Bird soon admits the truth and the charges are dropped, however, Crash had already bailed Carter out of jail and their whereabouts are unknown.\n\nS1, Ep10 Love Story    2 Sep. 2014 \n\nElizabeth's decision to take dire action to find her daughter leaves Grant and Taylor furious. And Carter's choice to run away with Crash becomes life or death for someone close to her. \n\nS1, Ep11 The Long Goodbye 9 Sep. 2014 \n\nWhile everyone is stunned by the shocking events from the night before, Carter's loyalties between her family and the boy she loves are tested. \n \nS1, Ep12 One Hour Photo  16 Sep. 2014 \n\nA clue from Lori leads Carter to uncover disturbing secrets that could completely upturn the new family she's come to love. And Max and Taylor's relationship may reach a breaking point. \n\n[img]http://media-cache-ak0.pinimg.com/736x/57/e8/6b/57e86b2905ebad730fc43575ee804d1a.jpg[/img]","torrent":{"xt":"urn:btih:b30bde77a10a3c92c0c598b763745530bb0832d5","amp;dn":"Finding.Carter+Complete+Series01+All.episodes.ep01.ep12.x264.iam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b30bde77a10a3c92c0c598b763745530bb0832d5","infoHashBuffer":{"type":"Buffer","data":[179,11,222,119,161,10,60,146,192,197,152,183,99,116,85,48,187,8,50,213]},"announce":[],"urlList":[]}}