{"title":"Survivor - Chuck Palahniuk.epub","uid":9043704,"size":207746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3d52d2eb316d8dddbad0d30d1baa5e32a10a197&amp;dn=Survivor+-+Chuck+Palahniuk.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381696692,"description":"Some say that the apocalypse swiftly approacheth, but that simply ain't so according to Chuck Palahniuk. Oh no. It's already here, living in the head of the guy who just crossed the street in front of you, or maybe even closer than that. We saw these possibilities get played out in the author's bloodsporting-anarchist-yuppie shocker of a first novel, Fight Club. Now, in Survivor, his second and newest, the concern is more for the origin of the malaise. Starting at chapter 47 and screaming toward ground zero, Palahniuk hurls the reader back to the beginning in a breathless search for where it all went wrong. This time out, the author's protagonist is self-made, self-ruined mogul-messiah Tender Branson, the sole passenger of a jet moments away from slamming first into the Australian outback and then into oblivion. All that will be left, Branson assures us with a tone bordering on relief, is his life story, from its Amish-on-acid cult beginnings to its televangelist-huckster end. All of this courtesy of the plane's flight recorder.\n\nSpeaking of little black boxes, Skinnerians would have a field day with the presenting behavior of the folks who make up Palahniuk's world. They pretend they're suicide hotline operators for fun. They eat lobster before it's quite... done. They dance in morgues. The Cleavers they are not. Scary as they might be, these characters are ultimately more scared of themselves than you are, and that's what makes them so fascinating. In the wee hours and on lonely highways, they exist in a perpetual twilight, caught between the horror of the present and the dread of the unknown. With only two novels under his belt, Chuck Palahniuk is well on his way to becoming an expert at shining a light on these shadowy creatures. ","torrent":{"xt":"urn:btih:b3d52d2eb316d8dddbad0d30d1baa5e32a10a197","amp;dn":"Survivor+-+Chuck+Palahniuk.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3d52d2eb316d8dddbad0d30d1baa5e32a10a197","infoHashBuffer":{"type":"Buffer","data":[179,213,45,46,179,22,216,221,219,173,13,48,209,186,165,227,42,16,161,151]},"announce":[],"urlList":[]}}