{"title":"Historical Dictionary of Baroque Music.epub","uid":8785151,"size":5954042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b47e51d1976b9a291fcc50edd959d757eb725896&amp;dn=Historical+Dictionary+of+Baroque+Music.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1375814786,"description":"Joseph P. Swain, &quot;Historical Dictionary of Baroque Music&quot; \nEnglish | ISBN: 0810878240 | 2013 | EPUB | 394 pages | 5,6 MB\n\nAlthough it lies far back, running roughly from about 1600 to 1750, the Baroque period is far from forgotten and Baroque music is played widely today as well, exercising numerous musicians and attracting rather substantial audiences. It experienced the emergence of a new sort of music, increasingly secular and increasingly good listening, if you will, and also the start of opera. Some of the Baroque composers appear among the most popular of all time, such as Bach, Handel and Vivaldi. So yes, this is a book for researchers, but it is also a good book for anyone who enjoys this music.\n\nThe Historical Dictionary of Baroque Music certainly fills a significant space in the whole sub-series on music, since it tells us much more not only about the music but also the age that generated it. This is done particularly well in an insightful introduction, with the flow of events traced by the chronology. The dictionary section fills in the missing details with over 400 entries on the most important composers and musicians, some of the musical works themselves, important places and institutions, and a smattering of technical terms. The bibliography directs us to further reading.","torrent":{"xt":"urn:btih:b47e51d1976b9a291fcc50edd959d757eb725896","amp;dn":"Historical+Dictionary+of+Baroque+Music.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b47e51d1976b9a291fcc50edd959d757eb725896","infoHashBuffer":{"type":"Buffer","data":[180,126,81,209,151,107,154,41,31,204,80,237,217,89,215,87,235,114,88,150]},"announce":[],"urlList":[]}}