{"title":"The Victorians at War, 1815-1914 {BBS}","uid":7341331,"size":13646336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4880b7307d31f29daf0017f97107beb2465afae&amp;dn=The+Victorians+at+War%2C+1815-1914+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1339250630,"description":"This volume using recent research offers a summary of the wars, campaigns, battles, and leaders of the British army in the British Imperial Century. The 350 entries, arranged A-Z with cross-references and bibliographic references, center on events, people, and places. The introduction describes the years of conflict, the makeup of the army, the imperialist drive, the use of the army to control the colonial empire, and the ideology for war.\n\nNumerous maps illustrate the different theaters of war, but there are no photographs or drawings to depict persons. The volume concludes with several appendixes: a chronology, a list of British army commanders in chief, chiefs of general staff and chiefs of the imperial general staff, a list of Indian army commanders in chief; and a note on currency. A bibliography of selected articles and books and an index complete the volume.\n\nBesides covering specific individuals, such as Field Marshall Kitchener, or conflicts, such as the Afghan wars, the volume includes a variety of peripheral topics, such as Military music; Photographers, war; and Women and the army. A series of entries on Military medicine, British army provides insight into nineteenth-century standards for hospitals, sanitation, and more. Series on Officers, British army and Officers, Indian army make it easy to compare such topics as pay, social background, training, and retirement.\n\nThis is a very easy-to-use and highly readable book. It could supplement history collections as well as strengthen the reference sections on the Victorian era and on the British Empire. It would be a good purchase for academic and large public library collections, satisfying both the informal researcher and the serious student.\n\n\n\nHardcover: 350 pages\nPublisher: ABC-CLIO (October 22, 2004)\nLanguage: English\nISBN-10: 1576079252\nISBN-13: 978-1576079256","torrent":{"xt":"urn:btih:b4880b7307d31f29daf0017f97107beb2465afae","amp;dn":"The+Victorians+at+War%2C+1815-1914+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4880b7307d31f29daf0017f97107beb2465afae","infoHashBuffer":{"type":"Buffer","data":[180,136,11,115,7,211,31,41,218,240,1,127,151,16,123,235,36,101,175,174]},"announce":[],"urlList":[]}}