{"title":"VA, Ott - Ottcraft 1 + 2 (non-album tracks, remixes)","uid":10684940,"size":273198862,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b4933f9df5bf13d52e9988d3d63da1e35c7035ac&amp;dn=VA%2C+Ott+-+Ottcraft+1+%2B+2+%28non-album+tracks%2C+remixes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1407027403,"description":"These are all of the known psybient non-album tracks and remixes by music virtuoso Ott, from 2001-2003 (Ottcraft) and 2004-2009 (Ottcraft 2).\n\nOttcraft compiles non-album tracks by Ott and Ott collaborations Umberloid (with Chris Barker) and Gargoyles (with Simon Posford), as well as Ott's remix of a Shpongle track.  The &quot;lost album&quot; before Blumenkraft!  \n\nOttcraft 2 compiles an Umberloid track and Ott's remixes of tracks by Tripswitch, Entheogenic, Sound Tribe Sector 9, Bluetech and Terra Nine.  Some brilliant collaborations here.\n\n-----\n\nOttcraft tracklist:\n\n1.  Escape From Tulse Hell by Ott (from Mana Medicine, Liquid Sound, Jan 2001) (slightly different mix than on Blumenkraft)\n2.  Spacebaby (Seiberg &amp; Witten Mix) by Gargoyles [Ott and Simon Posford] (from Backroom Beats 2, Twisted Records 2003)\n3.  Joyful Wonder by Ott (from Backroom Beats 2, Twisted Records 2003)\n4.  Scilly Automatic by Ott (from Talisman, Interchill Records CD015, 2002)\n5.  Ott Meets Billy The Kid by Ott (from Elucidations by Liquid Sound Design, 2002)\n6.  Evil Do'ers by Gargoyles [Ott and Simon Posford] (from Talisman, Interchill Records] CD015, 2002)\n7.  Neon Tetra by Umberloid (written and produced by Ott and Chris Barker; from 13th Moon, Interchill Records CD016, 2003)\n8.  Around The World In A Tea Daze by Shpongle (Ott Remix, from The Remixes, 2003)\n\nHistory: Ottcraft was originally uploaded to Oink.cd as 192 CBR mp3 files, and an Oink member contributed the cover.  I later re-made Ottcraft, leaving the track order as I found it (it flows well).  Sourced from FLAC, ripped to 320 CBR mp3's with LAME, tagged with mp3tag and normalized to 89db with mp3gain.  For tracks that were originally crossfaded from/to other tracks, Audacity was used to fade in or out to silence.  Art embedded in each track.\n\n-----\n\nOttcraft 2 tracklist:\n\n1.  Silver by Tripswitch (Ott Remix, from Wider Horizons, by Liquid Sound Design, 2004)\n2.  Timeless E.S.P. by Entheogenic (Ott's New Wasserboxer Mix, from Dialogue Of The Speakers, 2005)\n3.  Ground Luminosity by Entheogenic (Ott's New Yoghurt Loom Mix, from Dialogue Of The Speakers, 2005) \n4.  Exit Chapel Perilous by Umberloid (written and produced by Ott and Chris Barker, from Soul vibration Vol. 1 by Liquid Records, 2005)\n5.  The Spectacle by Sound Tribe Sector 9 (Ott Remix, from STS9 - Peaceblaster: The New Orleans Make It Right Remixes, 2009)\n6.  Prayer For Rain by Bluetech (Ott Remix, from Natural Born Chillers 2, Aleph Zero Records 2009)\n7.  No Return by Terra Nine - (Ott Remix, from Terra Nine - Stream Of Consciousness, 2009)\n\n\nHistory: Ottcraft 2 appears for the first time here; a chronological sequence resulted in a nice flow.  Sourced, faded, normalized, etc. as for Ottcraft, and the same art was tweaked.  (Normalizing was essential this time, as the later releases were somewhat louder).\n\n-----\n\nPsybient doesn't get better than this, imho.  Enjoy and please help support Ott!  You can pay what you want for FLAC's of some of these via Ott's website, the Facebook page for Umberloid, etc.","torrent":{"xt":"urn:btih:b4933f9df5bf13d52e9988d3d63da1e35c7035ac","amp;dn":"VA%2C+Ott+-+Ottcraft+1+%2B+2+%28non-album+tracks%2C+remixes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4933f9df5bf13d52e9988d3d63da1e35c7035ac","infoHashBuffer":{"type":"Buffer","data":[180,147,63,157,245,191,19,213,46,153,136,211,214,61,161,227,92,112,53,172]},"announce":[],"urlList":[]}}