{"title":"The Traveling Wilburys - The Traveling Wilburys, Vol. 1 (2005) [","uid":8644613,"size":527318620,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4c6bcf37fc89c7cd99add3f240fe86c42c4bbbf&amp;dn=The+Traveling+Wilburys+-+The+Traveling+Wilburys%2C+Vol.+1+%282005%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":27,"time":1372957510,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nThe Traveling Wilburys - The Traveling Wilburys, Vol. 1 (2005) [Expanded, From Set]\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by William Ruhlmann):\n\nReversing the usual process by which groups break up and give way to solo careers, the Traveling Wilburys are a group made up of solo stars. The group was organized by former Beatle George Harrison, former Electric Light Orchestra leader Jeff Lynne, Bob Dylan, Tom Petty, and Roy Orbison, thus representing three generations of rock stars. In 1988, the five (who had known each other for years) came together to record a Harrison B-side single and ended up writing and recording an album on which they shared lead vocals. It turned out to be a way to transcend the high expectations made of any of them as individuals, and a delighted public sent the album to number three, with two singles, &quot;Handle With Care&quot; and &quot;End of the Line&quot; hitting the charts. Unfortunately, Orbison died of a heart attack only a few weeks after the album's release.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/the-traveling-wilburys-p5687/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/the-traveling-wilburys-p5687/biography&lt;/a&gt;\n\nAll Music Album Review (by Stephen Thomas Erlewine):\n\nThere never was a supergroup more super than the Traveling Wilburys. They had Jeff Lynne, the leader of ELO; they had Roy Orbison, the best pop singer of the '60s; they had Tom Petty, the best roots rocker this side of Bruce Springsteen; they had a Beatle and Bob Dylan, for crying out loud! It's impossible to picture a supergroup with a stronger pedigree than that (all that's missing is a Rolling Stone), but in another sense it's hard to call the Wilburys a true supergroup, since they arrived nearly two decades after the all-star craze of the '70s peaked, and they never had the self-important air of nearly all the other supergroups. That, of course, was the key to their charm: they were a group of friends that fell together easily, almost effortlessly, to record a B-side for a single for George Harrison, then had such a good time they stuck around to record a full album, which became a hit upon its 1988 release. Looking back, the group's success seems all the more remarkable because the first album is surely, even proudly, not a major statement. Even under the direction of Lynne, who seems incapable of not polishing a record till it gleams, it's loose and funny, even goofy. It's clearly a lark, which makes the offhanded, casual virtuosity of some of the songs all the more affecting, particularly the two big hits, which are sunny and warm, partially because they wryly acknowledge the mileage on these rock &amp; roll veterans. &quot;Handle with Care&quot; and &quot;End of the Line&quot; are the two masterworks here, although Roy's showcase, &quot;Not Alone Anymore&quot; -- more grand and moving than anything on the Lynne-produced Mystery Girl -- comes close in the stature, but its stylized melodrama is a ringer here: it, along with Dylan's offhand heartbreak tune &quot;Congratulations,&quot; is the only slow thing here, and the rest of the album just overspills with good vibes, whether it's Tom Petty's lite reggae of &quot;Last Night,&quot; Jeff Lynne's excellent Jerry Lee Lewis update &quot;Rattled,&quot; or Dylan's very funny &quot;Dirty World,&quot; which is only slightly overshadowed by his very, very funny Springsteen swipe &quot;Tweeter and the Monkey Man.&quot; These high times keep The Traveling Wilburys fresh and fun years later, after Lynne's production becomes an emblem of the time instead of transcending it.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-traveling-wilburys-vol-1-r78572/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-traveling-wilburys-vol-1-r78572/review&lt;/a&gt;\n\nCatalog number: 925796-1 // PLMMC 9010 WX 224\nI was unable to find this album on the web. This was ripped from a CDR. I do not know what the album art looks like. Maybe someone in Hungary can supply it.\n\nTrack List:\n\n01. Handle With Care\n02. Dirty World\n03. Rattled\n04. Last Night\n05. Not Alone Anymore\n06. Congratulations\n07. Heading For The Light\n08. Margarita\n09. Tweeter And The Monkey Man\n10. End Of The Line\n11. Handle With Care (CD-Single - Extended Version)\n12. End Of The Line (CD-Single - Extended Version)\n13. Handle With Care (Basic Tracks)\n14. Dirty World (Alternate Take - Vocals)\n15. Rattled (Alternate Version)\n16. Last Night (Early Basic Tracks)\n17. Congratulations (Basic Tracks)\n18. Heading For The Light (Instrumental)\n19. End Of The Line (Alternate Take - Vocals)\n20. Del Shannon &quot;Lost In Memory&quot;\n21. Tom Petty &quot;Christmas All Over Again&quot;\n22. Wilbury Commercial\n","torrent":{"xt":"urn:btih:b4c6bcf37fc89c7cd99add3f240fe86c42c4bbbf","amp;dn":"The+Traveling+Wilburys+-+The+Traveling+Wilburys%2C+Vol.+1+%282005%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4c6bcf37fc89c7cd99add3f240fe86c42c4bbbf","infoHashBuffer":{"type":"Buffer","data":[180,198,188,243,127,200,156,124,217,154,221,63,36,15,232,108,66,196,187,191]},"announce":[],"urlList":[]}}