{"title":"The Mafia Encyclopedia by Carl Sifakis","uid":11358957,"size":22254429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b531a64b194765d1549d23843a9951df89e48395&amp;dn=The+Mafia+Encyclopedia+by+Carl+Sifakis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1414981906,"description":"Organized crime is the greatest criminal phenomenon of our time. From Al Capone, who boldly claimed his bootlegging activities were a public service, to John Gotti, the &quot;Teflon don&quot; who died in prison, these criminals have garnered headlines and captured the public imagination with their flamboyant lifestyles and colorful attitudes. Immortalized in books, movies, and popular television shows like The Sopranos and Growing Up Gotti, these gangsters, godfathers, hitmen, and dons have taken their place in criminal mythology, but the reality of their underworld endeavors is something entirely different. The Mafia Encyclopedia, Third Edition provides a comprehensive survey of the mob's most influential perpetrators and personalities, including their hangouts and hideaways, their plays for power, their schemes and crimes, and their unique culture and jargon. More than 100 illustrations approximately 500 entries, and a chronology bust the Mafia myths with an unflinching look at the brutal, sin-laden, and bizarre culture and characters of organized crime","torrent":{"xt":"urn:btih:b531a64b194765d1549d23843a9951df89e48395","amp;dn":"The+Mafia+Encyclopedia+by+Carl+Sifakis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b531a64b194765d1549d23843a9951df89e48395","infoHashBuffer":{"type":"Buffer","data":[181,49,166,75,25,71,101,209,84,157,35,132,58,153,81,223,137,228,131,149]},"announce":[],"urlList":[]}}