{"title":"Logistics Outsourcing in the Food Processing Industry","uid":14533130,"size":11166999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b65212353e6e20ff7d595ee58de0341540694655&amp;dn=Logistics+Outsourcing+in+the+Food+Processing+Industry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1462468967,"description":"Logistics Outsourcing in the Food Processing Industry - A Study in the Netherlands and Taiwan - Hsin-I Hsiao (Wageningen, 2009).pdf\r\n\r\nISBN 978-90-8686-111-8\r\n\r\nDuring the last decade, logistics outsourcing is growing in importance worldwide. Meanwhile, many different kinds of logistics services are also introduced in the outsourcing market. However, up to now, there are no guidelines for the food processing industry to identify which logistics activities should be outsourced to which type of logistic service provider (LSP).By combining managerial and economic theory, this book builds an integrated research framework to demonstrate decisive factors for outsourcing different kinds of logistics activities and their effect on logistics performance. Using empirical evidences from the food processing industry in Taiwan and the Netherlands, this study shows that: - outsourcing decisions of different levels of logistics activities have different determining factors.- total outsourcing (i.e. having the LSP orchestrate the whole logistics process) results in higher logistics service performances in terms of lead-time, reliability, and flexibility.- currently the Netherlands have higher percentages of outsourcing of transportation and transportation management than Taiwan. In the future, Taiwan will probably outsource value added activities and logistics orchestration activities more than the Netherlands.This book is recommended for a broad audience of professionals and practitioners who concern themselves with the design, planning and management of logistics in international food supply chains","torrent":{"xt":"urn:btih:b65212353e6e20ff7d595ee58de0341540694655","amp;dn":"Logistics+Outsourcing+in+the+Food+Processing+Industry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65212353e6e20ff7d595ee58de0341540694655","infoHashBuffer":{"type":"Buffer","data":[182,82,18,53,62,110,32,255,125,89,94,229,141,224,52,21,64,105,70,85]},"announce":[],"urlList":[]}}