{"title":"Amber Arcades - Fading Lines (2016) [16.44 FLAC]","uid":14816537,"size":255660197,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b69c3e1cbaefbafdd6a36b33612d19d926d9b4e9&amp;dn=Amber+Arcades+-+Fading+Lines+%282016%29+%5B16.44+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":11,"time":1465240536,"description":"\n  Amber Arcades - Fading Lines (2016) [16.44 FLAC]\r\n\r\n  Genre: Rock\r\n  Styles: Alternative, Indie, Dream Pop\r\n  Source: WEB (Heavenly Recordings)\r\n  Codec: FLAC\r\n  Bit rate: ~ 800 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Come With Me \r\n  02 Constant's Dream \r\n  03 Fading Lines \r\n  04 I Will Follow \r\n  05 Perpetuum Mobile \r\n  06 Right Now \r\n  07 Apophenia \r\n  08 This Time \r\n  09 Turning Light\r\n  10 White Fuzz\r\n\r\n  Amber Arcades' debut album, Fading Lines, has a nice story behind it, a musical romantic comedy of sorts. Annelotte de Graaf, the person behind the name, spent her teenage years in Holland saving up money to make an album someday. While she worked in Holland's immigration center, she also self-released a few EPs, and when she felt ready to make the big leap she got in touch with producer Ben Greenberg (of the very dissimilar bands Destruction Unit and the Men) to see if he was interested in working with her. He said yes and she spent her savings flying to New York to make an album. To back her they brought in Quilt's Shane Butler and Keven Lareau, guitar and bass respectively, and Real Estate's drummer Jackson Pollis. What could have been a vanity project on par with a crummy self-published novel instead turned out to be something quite good. Good enough that Heavenly Records even decided to sign Amber Arcades and release the album. De Graaf spent her money wisely in hiring Greenberg to produce. His straightforward approach suits her music well, giving her dreamy songs a solid base that keeps them from drifting away. The band provides crack musical backing too, with chiming guitars, chunky basslines, and propulsive drums that drive the faster songs and help the slower ones hit the right Stereolab-jamming-with-Broadcast note. \r\n\r\n  The real star, despite all the surrounding drama, is de Graaf and the songs she wrote. Roughly divided 50/50 between dream pop lullabies and motor-driven modern guitar pop, the songs fit together like reverb-coated puzzle pieces. Her sweetly unschooled vocals float through the simply hypnotic backing tracks, never sounding lost in the mix but never overpowering either. The best songs are those with a little bit of kick, like the swirling psych pop title track, or those that forgo the guitar-heavy approach for something a little more space age pop-sounding, like &quot;Perpetuum Mobile.&quot; Best of the record's many highlights is the motorik synth pop song &quot;Turning Light,&quot; which stretches out over seven minutes of glimmering synths and has one of her sweetest vocal melodies. She proves adept at so many styles within her chosen niche on Fading Lines that her next album could go in any of four or five directions and sound very good. Or it could sound exactly the same and be well worth everyone's time. Hopefully de Graaf won't have to finance that second record, but even if for some weird reason Heavenly dropped out of the picture, it's certain that many other labels would be only too happy to have someone this talented on their roster","torrent":{"xt":"urn:btih:b69c3e1cbaefbafdd6a36b33612d19d926d9b4e9","amp;dn":"Amber+Arcades+-+Fading+Lines+%282016%29+%5B16.44+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b69c3e1cbaefbafdd6a36b33612d19d926d9b4e9","infoHashBuffer":{"type":"Buffer","data":[182,156,62,28,186,239,186,253,214,163,107,51,97,45,25,217,38,217,180,233]},"announce":[],"urlList":[]}}