{"title":"Anno Dracula  -  Kim Newman   (epub/mobi)","uid":6811379,"size":1437081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6d0d0f994f4502cb7b79374f650c20039574272&amp;dn=Anno+Dracula++-++Kim+Newman+++%28epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"neil1966hardy","files":3,"time":1321046951,"description":"A brilliant, ambitious new novel speculates on Dracula's survival. Set in Victorian England, this chilling tale wonders, &quot;What if Count Dracula didn't die via the stake, but managed to become an adviser to the Queen? And what if Jack the Ripper was in reality none other than Bram Stoker's hero, Jack Seward, killing off vampiric whores?&quot;\n\nAs Nina Auerbach writes in the New York Times, &quot;Stephen King assumes we hate vampires; Anne Rice makes it safe to love them, because they hate themselves. Kim Newman suspects that most of us live with them . . . . Anno Dracula is the definitive account of that post-modern species, the self-obsessed undead.&quot; In this first of what looks to be an excellent series, Victorian England has vampires at every level of society, especially the higher ones, and they engage in incessant intrigue, power games, and casual oppression of the weak--activities, as we know, that are all too human. Numerous characters from literature and from history appear in both major and cameo roles. Spectacular fight scenes, stormy politics, and a serial vampire killer keep the action lively. A scholarly bibliography is included\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b6d0d0f994f4502cb7b79374f650c20039574272","amp;dn":"Anno+Dracula++-++Kim+Newman+++%28epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6d0d0f994f4502cb7b79374f650c20039574272","infoHashBuffer":{"type":"Buffer","data":[182,208,208,249,148,244,80,44,183,183,147,116,246,80,194,0,57,87,66,114]},"announce":[],"urlList":[]}}