{"title":"The Complete Guide to Game Audio, 2nd Edition - (Malestrom)","uid":4844792,"size":7296826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6d5149238c3fb92bef6189f3c6e8bbb0f21098c&amp;dn=The+Complete+Guide+to+Game+Audio%2C+2nd+Edition+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1239639942,"description":" &lt;a href=&quot;http://www.image-upload.net/images/fbodhr9j6i6okg504dwo.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/fbodhr9j6i6okg504dwo.jpeg&lt;/a&gt;\n\nAaron Marks, &quot;The Complete Guide to Game Audio, Second Edition: For Composers, Musicians, Sound Designers, Game Developers&quot;\nFocal Press | 2008 | ISBN: 0240810740 | 456 pages | PDF\n\nBook Description\nTHE handbook on Game Audio (from award-winning industry leader) revealing exactly what one needs to successfully compose music and sound effects for the multi-billion dollar video games industry. \n\n&quot;Aaron Marks' The Complete Guide to Game Audio should be compulsory reading for anyone considering a career in game audio.&quot;\n\nGreg O'Connor-Read, Founder &amp; Editor, Music4Games\n\n&quot;Aaron's book is recommended reading in my USC and UCLA Composing Music for Video Games courses. It is a well-rounded presentation of what we video game composers do every day. Anyone wanting to know more about this great industry should start here!&quot;\n\nLennie Moore, Composer, Outcast, Dragonshard, War of the Ring, Dirty Harry\n\n&quot;Aaron knows his stuff!&quot;\n\nGeorge Sanger, The Fatman - Game Audio Legend\n\n\n&quot;Let the fat lady sing! Aaron has created the definitive resource for all things game audio. Bravo, Aaron!&quot;\n\nChris Rickwood, Composer, Rickwood Music LLC\n\n\n&quot;Aaron Marks the spot. An informative, educated, thorough look at the game audio industry, and provides valuable insight into the production process of many of the top working professionals. The Complete Guide to Game Audio continues to be one of the best resources for game audio engineers and composers.&quot;\n\nKeith Arem, Creative Director, PCB Productions\n\n&quot;Seven years ago, Aaron Marks redefined how to learn the art, science and business of making world-class game soundtracks with the release of 'The Complete Guide to Game Audio.' His groundbreaking contribution to game audio continues in this, the second edition of his seminal work!&quot;\n\nTodd M. Fay, Professional/Personal Coach (www.toddmfay.com) &amp; President of DemoNinja (www.demoninja.com)\n\n&quot;This book has changed my life! To understand the game audio business, creativity and the people who are involved in this industry, Aaron Marks has put together the perfect easy-to-read manual. If you are reliable, talented, and excited about how to pursue a path into game audio, then this is THE BOOK for you. I read it, loved it, read it again, and ultimately followed Aaron's advice. Now I owe him my life...and so can you. Buy, immerse yourself, and tell everyone you know about this book!&quot;\n\nWatson Wu, Composer/Sound Designer/President, WOOTONES, LLC (a media &amp; publishing company)\n\n\n&quot;Aaron Marks' book is THE most insightful look into the world of sound for the multi-billion dollar video game and interactive media industry. It is a resource as valuable to game producers and developers as it is to those looking to venture into the field as sound artists and composers. Bravo Mr. Marks!&quot;\n\nJon Holland, Game Composer and Recording Artist\n\n\n&quot;Seven years after his successful first edition, Aaron Marks treats us to the long awaited up-to-date second version of &quot;The Complete Guide to Game Audio&quot; and I can only say, wow, he has pulled it off again!. The book boasts near to 500 pages filled with all the precious information the entrepreneurial composer/sound designer will ever need to get his foot in the door of the game companies. It covers all the important topics from creating the perfect demo reel to closing the deal, from choosing your tools to delivering top-notch audio. While giving a thorough and deep presentation of today's game audio world, it's also an easy and entertaining read topped off with lots of anecdotes and tricks of the trade taken directly from the mouths of some of the finest game audio creators. A must-buy for everyone turning a serious eye towards a profitable career in the game audio business.&quot;\n\nHenning Nugel, Composer/Sound Designer, Nugel Bros. Music\n\n&quot;Aaron has created an extremely detailed and informative resource for all levels of composers and sound designers. Additionally, this book would be tremendously helpful for any game industry professionals who would like to gain understanding, insight and appreciation into the very complicated process of writing music and creating sound design for video games. Aaron has covered every possible subject that a person would encounter from start to finish in the game audio process including valuable creative and technical information as well as the ever-so-important - and many times most difficult part of the job - art of business negotiations and contracts. He has also included numerous inserts from other successful game audio professionals giving their real world perspectives and detailed insights related to their own experiences. Great job Aaron!&quot;\n\nMark Scholl - Award-winning Composer, International Game Technology (IGT) and Screaming Tigers Music, Inc.\n\n\n&quot;Aaron Marks' work is definitely a landmark achievement for the game audio industry. It clearly explains many concepts that separate game audio skill sets from that of the film and television industries, and it does so in an accessible and fun style that welcomes all audio enthusiasts to join our exciting and interactive world.&quot;\n\nAlexander Brandon, CEO, Celadon Studios\n\n&quot;Mr. Marks has done it again! I cannot imagine trying to break into the gaming audio industry without this book in my hands. It provides newcomers and seasoned vets alike access to the type of information crucial to not only break into, but to succeed in this highly competitive industry. This is information that will never show up in a Google search. It's like having a dozen industry pros by your side to answer any questions you may have. I am thrilled to have been a part of this book as it is a vital resource for so many.&quot;\n\nDarryl S. Duncan, President/CEO, GameBeat Studios, LLC\n\n","torrent":{"xt":"urn:btih:b6d5149238c3fb92bef6189f3c6e8bbb0f21098c","amp;dn":"The+Complete+Guide+to+Game+Audio%2C+2nd+Edition+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6d5149238c3fb92bef6189f3c6e8bbb0f21098c","infoHashBuffer":{"type":"Buffer","data":[182,213,20,146,56,195,251,146,190,246,24,159,60,110,139,187,15,33,9,140]},"announce":[],"urlList":[]}}