{"title":"Ancient Syria, A Three Thousand Year History [PDF] [StormRG]","uid":10726637,"size":9165654,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b71cbe6d42c61ffc9aaaca1d8ee18a7900d18cae&amp;dn=Ancient+Syria%2C+A+Three+Thousand+Year+History+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"F1restorm","files":-1,"time":1407576708,"description":"Ancient Syria: A Three Thousand Year History\nAuthor: Trevor Bryce\nPublished: 2014\nPublisher: Oxford University Press\nISBN: 9780199646678\nFormat: Retail PDF\n_________________________________________________________________________________\n\nSyria has long been one of the most trouble-prone and politically volatile regions of the Near and Middle Eastern world. This book looks back beyond the troubles of the present to tell the 3000-year story of what came before: the peoples, cities, and kingdoms that arose, flourished, declined, and disappeared in the lands that now constitute Syria, from the time of the region's earliest written records in the third millennium BC, right through to the reign of the Roman emperor\nDiocletian in the early 4th century AD. \n\nAcross the centuries, from the Bronze Age to Imperial Rome, we encounter a vast array of characters and civilizations, enlivening, enriching, and besmirching the annals of Syrian history: Hittite and Assyrian Great Kings; Egyptian pharaohs; Amorite robber-barons; the biblically notorious Nebuchadnezzar; Persia's Cyrus the Great and Macedon's Alexander the Great; the rulers of the Seleucid empire; and an assortment of Rome's most distinguished and most infamous emperors. All swept across the\nplains of Syria at some point in her long history. All contributed, in one way or another, to Syria's special, distinctive character, as they imposed themselves upon it, fought one another within it, or pillaged their way through it. \n\nBut this is not just a history of invasion and oppression. Syria had great rulers of her own, native-born Syrian luminaries, sometimes appearing as local champions who sought to liberate their lands from foreign despots, sometimes as cunning, self-seeking manipulators of squabbles between their overlords. They culminate with Zenobia, Queen of Palmyra, whose life provides a fitting grand finale to the first three millennia of this ancient civilization. And yet the long story of Syria does not\nend with the mysterious fate of Queen Zenobia. The conclusion looks forward to the Muslim conquest in the 7th century AD: in many ways the opening chapter in the equally complex and often troubled history of modern Syria.","torrent":{"xt":"urn:btih:b71cbe6d42c61ffc9aaaca1d8ee18a7900d18cae","amp;dn":"Ancient+Syria%2C+A+Three+Thousand+Year+History+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b71cbe6d42c61ffc9aaaca1d8ee18a7900d18cae","infoHashBuffer":{"type":"Buffer","data":[183,28,190,109,66,198,31,252,154,170,202,29,142,225,138,121,0,209,140,174]},"announce":[],"urlList":[]}}