{"title":"Alexandra David-Neel - Tibetan Journey (311p) [Inua].pdf","uid":11428114,"size":9010970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7202b4e05c0745d5dc7871f7cc3112fe002f875&amp;dn=Alexandra+David-Neel+-+Tibetan+Journey+%28311p%29+%5BInua%5D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1415684096,"description":"Title: Tibetan Journey  \nAuthor: Alexandra David-Neel \nISBN-10: 8173030049\nISBN-13: 978-8173030048\n\nIn any time, Alexandra David-Neel would have been considered an extraordinary woman, but in the Victorian era, she was truly exceptional. Born in 1868, David-Neel eschewed the dances, dinners, and formal marriages common to women of her era and social standing in order to indulge her fierce independence and insatiable intellectual curiosity. Her interest in comparative religions dated back to early childhood; even as a student in a Catholic convent school, she kept statues of both Christ and the Buddha in her room. She made her first trip to Asia in 1891, then supported herself as a light-opera singer and journalist before marrying a seemingly conventional man, Philip Neel. Fortunately for both Alexandra David-Neel and for posterity, Philip was less stodgy than his position as a well-off engineer might imply; though he did not accompany her, he supported his wife's explorations and even acted as her literary agent when she began to write about the places she visited. Alexandra and Philip remained the closest of friends until his death in 1941.\n\nDavid-Neel spent years traveling in India and China, but perhaps her most daring adventure was the trip to Tibet's forbidden city of Lhasa. She was 55 years old at the time, fluent in Tibetan and well versed in both Sanskrit and Buddhism. Disguised as a man, she spent four treacherous months on the road before finally becoming the first European woman ever to enter Lhasa. My Journey to Lhasa is David-Neel's own account of her astounding journey, one fraught with hardship and danger. It is both a chronicle of a bygone time and a testimonial to a remarkable human. --This text refers to an out of print or unavailable edition of this title","torrent":{"xt":"urn:btih:b7202b4e05c0745d5dc7871f7cc3112fe002f875","amp;dn":"Alexandra+David-Neel+-+Tibetan+Journey+%28311p%29+%5BInua%5D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7202b4e05c0745d5dc7871f7cc3112fe002f875","infoHashBuffer":{"type":"Buffer","data":[183,32,43,78,5,192,116,93,93,199,135,31,124,195,17,47,224,2,248,117]},"announce":[],"urlList":[]}}