{"title":"Call of Duty - World at War  SOUNDTRACK [RIP] (128kb)","uid":4533523,"size":251555473,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b77bc96ee1d6256d147804b38fd796b52e4c8bf0&amp;dn=Call+of+Duty+-+World+at+War++SOUNDTRACK+%5BRIP%5D+%28128kb%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Magerna","files":260,"time":1227649203,"description":"This is the completely original and unaltered soundtrack from Call of Duty - World at War.\n##########################################\nI ripped the original sound-wavs from the .iwd-archives out of the installed game, thus providing highest possible quality.\n\nThe original files are in .wav format, I allowed myself to convert them to Lame-MP3 (128kb) to reduce overall filesize from over ~650 down to the 239MB in this torrent.\n\nQuality loss is absolutely minimal, I was unable to notice any (Soundblaster XFi Music and Teufel Magnum 5.1 ...)\n\n\n##########################################\nThe soundtrack has NOT been RAR-compressed, thus allowing everyone to pick single songs if desired. Rar-compressing wouldn't help much either on heavily compressed MP3s...\n\nAs the files were stored in wav format no id/id3-information is avaible and I didn't put some in, so you have to find your desired song solely based on file and folder name.\n\nTracks are single folders according to each mission ingame, so if you search songs from the first mission (Peleliu), take a look at the &quot;pel&quot; folders first...rather simple to understand in my opinion, I found certain songs really quick :)\n\nI also included all Multiplayer &quot;songs&quot; and clips played for certain actions (e.g. Flag captured/lost etc) and the Nazi Zombie mod themes.\n##########################################\n\nI hope this provides a solid base for all the songtrack lovers out there until we have a orginal soundtrack CD coming up :)\n\nThanks for the seeders who keep this alive, I'm sorry I'm unable to keep seeding for myself.\n\nIf this torrent ever goes &quot;dead&quot; just call for a reseed and I will start as soon as I read it.","torrent":{"xt":"urn:btih:b77bc96ee1d6256d147804b38fd796b52e4c8bf0","amp;dn":"Call+of+Duty+-+World+at+War++SOUNDTRACK+%5BRIP%5D+%28128kb%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b77bc96ee1d6256d147804b38fd796b52e4c8bf0","infoHashBuffer":{"type":"Buffer","data":[183,123,201,110,225,214,37,109,20,120,4,179,143,215,150,181,46,76,139,240]},"announce":[],"urlList":[]}}