{"title":"Meg Russell - The Contemporary House of Lords [2013][A]","uid":10397449,"size":2148701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7aa5b887fc083028d139b4c899e592e208dcb09&amp;dn=Meg+Russell+-+The+Contemporary+House+of+Lords+%5B2013%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403287033,"description":"Description\nProduct Details\nBook Title: The Contemporary House of Lords: Westminster Bicameralism Revived\t\nBook Author: Meg Russell (Author)\nHardcover: 300 pages\nPublisher: Oxford University Press (August 24, 2013)\nLanguage: English\nISBN-10: 0199671567\nISBN-13: 978-0199671564\n\n===================================================================================\nBook Description\nPublication Date: August 24, 2013\nAs the second chamber of the Westminster parliament, the House of Lords has a central position in British politics. But it is far less well-studied and well understood than the House of Commons. This is in part because of constant expectations that it is about to be reformed - but most Lords reform plans fail, as the Coalition government's dramatically did in 2012. Meanwhile, following a landmark change in 1999 which removed most of its hereditary members, the Lords' role in the policy process has grown. Understanding the chamber is therefore now essential to understanding politics and parliament in Britain.\nThis book provides the first detailed portrait of the post-1999 Lords, explaining who sits in the chamber, how it operates, and crucially what policy impact it has. Its membership is shown to be more diverse and modern than many would assume, and its influence on policy to be substantial. As a 'no overall control' chamber, in which no party has a majority, it has inflicted numerous defeats on the Blair, Brown and Cameron governments, and become an important site of negotiation. It has provided\na power base for the Liberal Democrats, and includes a group of almost 200 independents who now play a pivotal role.\nClose study of today's House of Lords demolishes some common myths about British politics, and also about how two chamber parliaments work. This book, as well as focusing on the contemporary Lords, provides a historical and comparative context for British bicameralism, asks whether the Lords can be considered 'legitimate', and describes recent reform efforts and possible future reforms.\n\n===================================================================================\nReview\nAn authoritative and very readable scholarly work which is essential reading for anyone interested in contemporary British politics. Gordon Bannerman, LSE Review of Books.\n\n===================================================================================\nAbout the Author\nMeg Russell is Reader in British and Comparative Politics in the Department of Political Science, University College London, where she is Deputy Director of the research centre the Constitution Unit. Her research on the Lords began by considering options for reform based on experience of other bicameral parliaments, resulting in her first book, Reforming the House of Lords: Lessons from Overseas (OUP, 2000). Since then she has focused increasingly on how the Lords operates now, following its reform in 1999. She has written numerous reports and papers on the British parliament, and parliaments more broadly, and is frequently cited by policymakers as well as academics. She has acted as a consultant to the Royal Commission on Lords reform (1999-2000), and been an adviser to the Leader of the House of Commons (2001-03) and the Select Committee on Reform of the House of Commons (2009-10).\n===================================================================================","torrent":{"xt":"urn:btih:b7aa5b887fc083028d139b4c899e592e208dcb09","amp;dn":"Meg+Russell+-+The+Contemporary+House+of+Lords+%5B2013%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7aa5b887fc083028d139b4c899e592e208dcb09","infoHashBuffer":{"type":"Buffer","data":[183,170,91,136,127,192,131,2,141,19,155,76,137,158,89,46,32,141,203,9]},"announce":[],"urlList":[]}}