{"title":"Bentley Rhythm Ace - Bentley Rhythm Ace [1997]","uid":9497876,"size":432925876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b7d99815598871249503137a47dd8c8e903508d9&amp;dn=Bentley+Rhythm+Ace+-+Bentley+Rhythm+Ace+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1390155792,"description":"Review by Ned Raggett  [-]\nThe U.K.-based big beat hype was merely a catch-all term for a bunch of characters who liked their funk beats loud and their techno slamming. It's pretty much hip-hop, sampling everything under the sun and spiced with modern dance music, by any other name, as everyone from the Chemical Brothers to Bentley Rhythm Ace would happily admit to, which is one reason why BRA's self-titled debut is such fun. Perfectly slotting alongside U.K. labelmates like Fatboy Slim and Lo-Fidelity All-Stars, BRA go merrily nuts with their self-described &quot;carboottechnodisco&quot; sound, packing their record with injokes of a very English bent, as can be shown by the song titles, for one thing: &quot;Midlander (There Can Only Be One),&quot; &quot;Mind That Gap,&quot; &quot;On Her Majesty's Secret Whistle,&quot; and so forth. Flecks of the clever weave of pop culture influences Pop Will Eat Itself brought to bear on its best records are unsurprisingly present, but BRA is very much its own beast, sacrificing singing for sheer sonic ral-de-rah. They also have a good sense of the rave-based crowds they mostly played for; the building rise of songs like &quot;Run on the Spot&quot; and &quot;Spacehopper&quot; are perfectly suited for dancefloor heights. Heaven knows what the original release context of much of the strange stuff sampled and chopped up throughout was; combined with an unerring beat sense, it results in merry insanity. Many tracks have a skittishly low-key feel to them, less pounding but no less giddily off. &quot;Mind That Gap&quot; takes a basic techno pulse and throws in everything from military snare to early synth goofiness, while &quot;Whoosh&quot; has a quirky main keyboard line that is at once naggingly annoying and perfectly suited for the funky breakbeats down in the mix. At base, BRA's debut is a perfect party album -- throw it on, have a good time and enjoy the extra fun touches while you're at it. (4/5)","torrent":{"xt":"urn:btih:b7d99815598871249503137a47dd8c8e903508d9","amp;dn":"Bentley+Rhythm+Ace+-+Bentley+Rhythm+Ace+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7d99815598871249503137a47dd8c8e903508d9","infoHashBuffer":{"type":"Buffer","data":[183,217,152,21,89,136,113,36,149,3,19,122,71,221,140,142,144,53,8,217]},"announce":[],"urlList":[]}}