{"title":"How to Become Smarter - Spender, Charles (mobi)","uid":8217849,"size":1146332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b81bc670ce72de2e06cf61d141a2b450a3da0a2c&amp;dn=How+to+Become+Smarter+-+Spender%2C+Charles+%28mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"James_WB","files":1,"time":1362386101,"description":"This text describes techniques for improving mental abilities. Some of the things\nit can help you to achieve include the following:\n\nDepending on circumstances, use different lifestyles that improve one or\nanother mental function.\nExperience euphoria without drugs and come up with new ideas, when\nneeded.\nSlow down and prevent yourself from making rash, impulsive decisions,\nwhen necessary.\nSharpen your wit, become more talkative, and entertain people.\nWhen necessary, lower your mood and increase emotional tension, which\ncan reduce procrastination.\nIncrease your score on intelligence or general aptitude tests.\nConcentrate on reading and writing for many hours daily.\nIncrease your grade point average if you are a student or improve your job\nproductivity if you are a knowledge worker.\n\nThe proposed methods are brief cooling or heating of the body (water therapy)\nand three different &quot;smart diets,&quot; each suitable for a different type of task.\nDespite its technical content, the book is written in an accessible language and\nhas an informative summary for each chapter and a list of key points at the end\nof each section. The book supports most of the claims in the bulleted list above\nwith a theory and the author's personal experience (a healthy subject). Previously\npublished scientific studies directly support about a half of these claims, including\nthe claim about intelligence tests. ","torrent":{"xt":"urn:btih:b81bc670ce72de2e06cf61d141a2b450a3da0a2c","amp;dn":"How+to+Become+Smarter+-+Spender%2C+Charles+%28mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b81bc670ce72de2e06cf61d141a2b450a3da0a2c","infoHashBuffer":{"type":"Buffer","data":[184,27,198,112,206,114,222,46,6,207,97,209,65,162,180,80,163,218,10,44]},"announce":[],"urlList":[]}}