{"title":"Kim Robertson - Treasures Of The Celtic Harp (1995) [V2]","uid":7399429,"size":66002175,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8f0956b70905ca028ad75d3d72965b370ee878e&amp;dn=Kim+Robertson+-+Treasures+Of+The+Celtic+Harp+%281995%29+%5BV2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1341024854,"description":"Harp players have been a part of Celtic culture for over 1000 years. Had recording technology been around in the 17th and 18th centuries, one can only imagine some of the recordings that Irish harpist/composer Turlough O'Carolan (1670-1738) and his colleagues would have provided. These days, harpists continue to make valuable contributions to Celtic music. Some harpists are entirely traditional in their approach; Kim Robertson, however, is known for a modern, classical-influenced blend of Celtic music and new age. Recorded in 1995, Treasures of the Celtic Harp is full of traditional Irish and Scottish songs that Celtic musicians have been playing for generations. But what Robertson does with them is not traditional. Unaccompanied throughout this calm, peaceful session, the American instrumentalist puts her own recognizable spin on familiar pieces from Ireland (&quot;Moving Cloud,&quot; &quot;Merrily Kiss the Quaker,&quot; &quot;Tree of Liberty&quot;) and Scotland (&quot;Flowers of the Forest,&quot; &quot;Glenlivet,&quot; &quot;Waulking o' the Fauld&quot;). One of the most famous pieces is &quot;Londerberry Air,&quot; which became known as &quot;Danny Boy&quot; after lyrics were added in the 20th century. Not all of the songs that Robertson embraces are from Ireland or Scotland; the harpist also provides some compositions of her own, and original offerings like &quot;Etude,&quot; &quot;New Leaves&quot; and &quot;Boundless&quot; fit right in. Robertson, in fact, is as identifiable on her own songs as she is on traditional, time-honored songs. Treasures of the Celtic Harp is not recommended to Celtic purists; Robertson is no purist, and she does not cater to those who are. However, this charming CD is well worth obtaining if you are open to hearing a modern Celtic/new age blend.\n\nKim Robertson - Treasures Of The Celtic Harp\n\n01 - Glenlivet\n02 - I Love My Love in the Morning\n03 - Moving Cloud\n04 - The Water Is Wide\n05 - New Leaves\n06 - Boundless\n07 - Luminous Sea , Miss Brown's Fancy\n08 - Shule Aroon [Siuil a Ruin]\n09 - Flowers of the Forest\n10 - Sleep Soon Ida Mornin'\n11 - Tree of Liberty\n12 - Etude\n13 - Merrily Kiss the Quaker\n14 - Fairly Shut of Her\n15 - Londonderry Air\n16 - Waulking o' the Fauld","torrent":{"xt":"urn:btih:b8f0956b70905ca028ad75d3d72965b370ee878e","amp;dn":"Kim+Robertson+-+Treasures+Of+The+Celtic+Harp+%281995%29+%5BV2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f0956b70905ca028ad75d3d72965b370ee878e","infoHashBuffer":{"type":"Buffer","data":[184,240,149,107,112,144,92,160,40,173,117,211,215,41,101,179,112,238,135,142]},"announce":[],"urlList":[]}}