{"title":"Bitrix Site Manager Business (Enterprise) version 6","uid":3791891,"size":14757978,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b92b22bd2c9d448aaceb0b56482efd597382cba1&amp;dn=Bitrix+Site+Manager+Business+%28Enterprise%29+version+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ListBlack","files":1,"time":1188663845,"description":"Enterprise Content Management Suite for Successful Business\nThe Bitrix Site Manager Enterprise Edition offers a wide range of features to organize the site team development, manage dealer network and develop e-commerce.\n\nThe Enterprise Edition is primarily intended for development of: commercial web portals; corporate sites of the large companies or organizations; information systems; on-line stores, and other large-scale web projects.\n\n 21 modules \n 1 year of free updates \n 1 year of technical support \n Multi-site support\n \n\nThe Bitrix Site Manager Enterprise Edition includes all modules of the product:\n   \n \n Main module \n \n Site Explorer \n \n Information Blocks \n \n Workflow \n \n Commercial Catalog \n \n e-Store \n \n Blogs \n \n e-Learning \n \n Currency \n \n Helpdesk \n \n Mail \n \n Web Forms \n \n Statistics \n \n Advertising \n \n Forums \n \n Newsletter \n \n Polls and Surveys \n \n Search \n \n Compression \n \n Localization \n \n Active Directory/LDAP Connector \n \n\nThe table compares the Bitrix Site Manager Enterprise Edition to other product editions.\n\nThe Enterprise Edition ships in two versions: MySQL/OracleXE/MSSQL Express and Oracle/MSSQL. These versions, although intended to run on different database engines, provide similar functionality and use a common system kernel. Choose the version you require, taking into consideration your requirements for stability, scalability, and possible load.\n\nThe Bitrix Site Manager Enterprise Edition includes all the features of other editions. \n\nEnterprise Edition Features\n Workflow\nThe Enterprise Edition allows you to organize your team&amp;#039;s work on site information content by building the document modification flow before it is published on the site (for example, from correspondent to chief editor). The history log keeps information on all document modifications.\n\n Catalog Management\nThe Enterprise Edition allows you to create catalogs of products and services of unlimited nesting depth and size.\n\n Product Representation\nA set of arbitrary properties can be created for each catalog to describe the items in this catalog. This allows the user to select a special property filter to quickly choose the desired product.\n\n Importing Data in the CommerceML Format\nThe Enterprise Edition allows you to import and update product catalogs in the XML (CommerceML) format (common standard for commercial information exchange in the XML format).\n\n Price and Currency Management\nThe system enables you to set different price types (wholesale, retail, dealer), manage base price adjustments and discounts, set currency rates, download rate information, and automatically convert prices for different language interfaces of the site.\n\n Dealer Network Support\nThe Enterprise Edition offers an excellent environment in which to create and develop your dealer network. The same product can have several different price types (wholesale, retail, dealer). The Administrator can limit access to each price type for different user groups and make the dealer price type accessible by company dealers only.\n\n Affiliate management\nThe e-Store of Bitrix Site Manager now implements support for fully functional affiliate networks. Affiliates can benefit from brought clients; the commission can derive from the number of products sold or the whole amount of affiliate orders.\n\n Order Processing Automation \nOrder processing is automated to the maximum! When a user places an order, the total order price is calculated automatically, taking into account stocks, shipping method and area, discounts, and base price adjustments. Further, the user and the sale department are notified by e-mail of order status change (paid, delivered, etc.).\n\n Payment System Integration\nThe Enterprise Edition interface is easily configurable to perform payment with credit cards, by bank transfer, and by other common and electronic payment means (e.g. PayPal, PayFlow, Secpay.com, Ibill.com, Betaling.ViborgNet.Dk and others). We can integrate the product with any kind of payment system for free.","torrent":{"xt":"urn:btih:b92b22bd2c9d448aaceb0b56482efd597382cba1","amp;dn":"Bitrix+Site+Manager+Business+%28Enterprise%29+version+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b92b22bd2c9d448aaceb0b56482efd597382cba1","infoHashBuffer":{"type":"Buffer","data":[185,43,34,189,44,157,68,138,172,235,11,86,72,46,253,89,115,130,203,161]},"announce":[],"urlList":[]}}