{"title":"Aleksandr Sokurov - Dni Zatmenija AKA The Days Of Eclipse","uid":6971646,"size":2127538749,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b986b86243534938e4df8d42af11f2469a67a020&amp;dn=Aleksandr+Sokurov+-+Dni+Zatmenija+AKA+The+Days+Of+Eclipse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1327110511,"description":"Aleksandr Sokurov - Dni Zatmenija AKA The Days Of Eclipse (1988)\n\nRussian with English subs\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095040/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095040/&lt;/a&gt;\n\nIn its metaphoric allusion to celestial descent, subconscious mysticism (or perhaps, lunacy), and alien terrestriality, Aleksandr Sokurov's Days of Eclipse recalls the opening sequences of Julio Medem's Tierra and Andrei Tarkovsky's Andrei Rublev as the camera follows the accelerated trajectory of an unseen projectile (the sound of an indecipherable voice perhaps suggests a conscious entity) hurtling towards the surface of the earth, aimed at the arid plains of a Turkmenistan rural village in central Asia, on the underdeveloped frontiers of a vast Soviet empire. In hindsight, the evocation to Tarkovsky seems particularly suited. Adapted from a science fiction novel by Arkady and Boris Strugatsky, the authors of Roadside Picnic on which Tarkovsky's film, Stalker was based, Days of Eclipse, as the title suggests, is also an exploration of creation and search for enlightenment in an age of pervasive darkness - at the figurative twilight of humanity. The prefiguring Icarian image of undefined journey and uprooted desolation (a theme that also pervades the establishing images of transplantation in Sharunas Bartas' Few of Us) would sublimate into unexpected, ephemeral forms throughout the film - surreal encounters, curious, somnambulistic rituals, otherworldly visions, crippling paranoia, and foreboding cosmic alignments - to create a perspective of the Soviet outpost, not as a landscape of untapped potential, but as an unassimilated culture foundering in the vacuum of an imposed, meaningless, ritualized order.\n\nThe reluctant witness to this soul-sapping, Dante-esque existential limbo is the young, idealistic physician Malyanov (Aleksei Ananishnov) who, at the instigation of the government in its push to modernize the rural Asiatic territories, relocated from Gorky in order to set up a clinic in the village. Ethnically and linguistically unassimilated into the local culture (and whose advice and medical practice are largely ignored by the impoverished villagers), his limited interaction with the outside world is relegated to the company of other kindred exiles: his suicidal neighbor, an underemployed engineer demoralized by the futility of his unrealized plans and who has been occupying his time by writing journals that no one else reads (a ritual that is paralleled in Malyanov's own perpetual typing of unsubmitted reports to pass the time); his estranged sister (Irina Sokolova) who questions his determination in continuing his practice in the village despite the profound isolation and disappointment of his empty, mind-numbing station; a cherubic, lost boy (who may have been abandoned or ran away from home out of hunger or abuse) who insinuates himself into Malyanov's care; his aimless and increasingly paranoid friend who continues to bear the residual psychological scars of generational trauma after his parents were driven from Russia during the Stalinist purges (note Sokurov's pointed reference to ethnic cleansing as part of the ideology behind the Great Purge, a silenced history that Kazakh filmmaker Ermek Shinarbaev also alludes to in his integration of the Korean-Kazakh experience in Revenge).\n\nLittle by little, as the village succumbs to the lethargy of the oppressive heat and the distractive mysticism of strange natural phenomena and arbitrary brushes with isolated resistance and nebulous authority, what emerges in Malyanov's encounters is the pervasive inertia and resignation of a society living under a crumbling totalitarian regime where the specter of fear and uncertainty has metastasized into empty rituals that have become disarticulated from their meaning (a decontextualization that is also illustrated through the uprooted exiles' alienation from their adoptive community). Within this context, Days of Eclipse aesthetically converges, not only with the elliptical mystery of Victor Erice's allegorical, Franco-era film, The Spirit of the Beehive, but also with the dark humor and environmental desolation of BÃƒÂ©la Tarr's cinema (that coincided with the beginning of his fateful association with novelist LÃƒÂ¡szlÃƒÂ³ Krashnahorkai in Damnation), where human comedy is borne of a tedium and acute awareness of squandered time, and the strange, surreal, post-apocalyptic landscapes reflect the wasted potential of a myopic, destructive, self-eroding society. It is this metaphoric darkness of empty existence and directionless compass that is intrinsically captured in the extended closing shot of Malyanov's enigmatic gaze framed against the barren, eternal landscape - suspended in a netherworld between earth and sky like Dickensian tragic specters hovering over the earth, unable to break free from their moorings - a transitory passage into the void of a delusive (and inescapable) liberation. \n &lt;a href=&quot;\nhttp://img194.imageshack.us/img194/338/dnizatmeniasokurovarbit00013eg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img194.imageshack.us/img194/338/dnizatmeniasokurovarbit00013eg.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img186.imageshack.us/img186/2751/dnizatmeniasokurovarbit00021dz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img186.imageshack.us/img186/2751/dnizatmeniasokurovarbit00021dz.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img119.imageshack.us/img119/1039/dnizatmeniasokurovarbitrv8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img119.imageshack.us/img119/1039/dnizatmeniasokurovarbitrv8.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img229.imageshack.us/img229/2905/dnizatmen000sokurovarbiio4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img229.imageshack.us/img229/2905/dnizatmen000sokurovarbiio4.jpg&lt;/a&gt;\n\n----------not my rip------\n\n~~~~~~ Dni Zatmenija.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................2,127,489,024                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD 1.0 RC4 (Hola)              \nDuration (hh:mm:ss):............................2:11:17                \nFrame Count:....................................196914             \nFrame Width (pixels):...........................704                  \nFrame Height (pixels):..........................320                  \nAspect Ratio:...................................2.200                     \nFrames Per Second:..............................25.000          \nVideo Bitrate (kbps):...........................2023                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.359&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................128                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2     \n\n*************************\n\n    Freakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n    The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n    If you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n    \\'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE       ","torrent":{"xt":"urn:btih:b986b86243534938e4df8d42af11f2469a67a020","amp;dn":"Aleksandr+Sokurov+-+Dni+Zatmenija+AKA+The+Days+Of+Eclipse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b986b86243534938e4df8d42af11f2469a67a020","infoHashBuffer":{"type":"Buffer","data":[185,134,184,98,67,83,73,56,228,223,141,66,175,17,242,70,154,103,160,32]},"announce":[],"urlList":[]}}