{"title":"Kiki's Delivery Service - Studio Ghibli - Hayao Miyazaki (DVD R","uid":4271384,"size":752227840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba4b10048beee73f072a65466a9b5676f708b3eb&amp;dn=Kiki%5C%27s+Delivery+Service+-+Studio+Ghibli+-+Hayao+Miyazaki+%28DVD+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hannibal2323","files":1,"time":1214952100,"description":"===================================================================================\nKiki&amp;#039;s Delivery Service (Majo no Takkyubin, trans. &quot;Witch&amp;#039;s Delivery Service&quot;) is the fifth Studio Ghibli anime film, produced, written and directed by Hayao Miyazaki in 1989. It was the fourth theatrical released film from the studio, and was also the second feature film that Miyazaki did not originally write himself. The movie won the Animage Anime Grand Prix prize in 1989. The movie was based on Eiko Kadono&amp;#039;s novel of the same name, which is the first in a series published by Fukuinkan Shoten originally in 1985. The film adapted only some of the episodes in the book; it ends at the end of summer while the book covers an entire year. The animation depicts the gulf that exists between independence and self-reliance in the hopes and spirit of common Japanese teenage girls.\n\nIt was the first Studio Ghibli movie released under the Disney/Studio Ghibli deal; the dub was recorded in 1997 and premiered in the United States at the Seattle International Film Festival May 23, 1998. It was released on home video on September 1, 1998.\n===================================================================================\n\nThis is an English audio version with no subtitles. Used DVDShrink 3.2 to re-author and DVDx 2.10 to encode with a double pass.\n\nGreetings and salutations to all of our esteemed members and diligent contributors. Keep up the good work. \n\n&quot;Merchant and pirate were for a long period one and the same person. Even today mercantile morality is really nothing but a refinement of piratical morality.&quot; \n- Friedrich Nietzsche\n\nEnjoy.\n\nFrom  --==epiCURean==--","torrent":{"xt":"urn:btih:ba4b10048beee73f072a65466a9b5676f708b3eb","amp;dn":"Kiki%5C%27s+Delivery+Service+-+Studio+Ghibli+-+Hayao+Miyazaki+%28DVD+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba4b10048beee73f072a65466a9b5676f708b3eb","infoHashBuffer":{"type":"Buffer","data":[186,75,16,4,139,238,231,63,7,42,101,70,106,155,86,118,247,8,179,235]},"announce":[],"urlList":[]}}