{"title":"Valerio M. Manfredi - L'Impero Dei Draghi [Doc Lit Pdf Rtf Ita]","uid":12516622,"size":3654566,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba81efc30a400825817bf8eaf35e65f73d4dbe09&amp;dn=Valerio+M.+Manfredi+-+L%27Impero+Dei+Draghi+%5BDoc+Lit+Pdf+Rtf+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ebasso","files":5,"time":1443780862,"description":".: Release Originale:.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=91963\r\n\r\n.: Copertina :.\r\n \nhttp://i.imgur.com/mf6Fdls.jpg\r\n\r\n.: Dettagli :.\r\n\r\nAutore: Valerio Massimo Manfredi\r\nTitolo: L'impero dei Draghi\r\nPagine: 428\r\nAnno: 2005\r\nNazionalità: Italiana\r\nGenere: Romanzo storico\r\nDimensione del file: 3.48 MB\r\nFormato del file Doc Lit Pdf Rtf\r\n\r\n.: Trama :.\r\n\r\nPersia, Edessa: i soldati romani sono asserragliati dentro le mura della città quando l'imperatore Valeriano, stremato, è costretto ad uscire, per tentare un'estrema riconciliazione, per alimentare una speranza quasi impronunciabile. Ma è la mossa sbagliata, è la fine. L'imperatore viene deportato e ucciso. Sul suo letto di morte Metello, suo fedele ufficiale, giurerà di riportare sotto il cielo italiano le sue ceneri. Ma come? Fuggire con le ceneri dell'imperatore a Occidente significherebbe morte sicura, ma a Oriente, verso la sconosciuta Cina\r\n\r\n.: Biografia Dell'Autore :.\r\n\r\nValerio Massimo Manfredi è professore di archeologia all'Università Bocconi di Milano e in precedenza ha insegnato e tenuto conferenze nei più prestigiosi atenei italiani e stranieri. Ha inoltre condotto spedizioni scientifiche e scavi in molte località d'Italia e all'estero. Collabora come antichista a &quot;Panorama&quot; e a &quot;Il Messaggero&quot;. Ha pubblicato numerosi articoli e saggi, fra cui: Senofonte - Anabasi, La strada dei Diecimila, Le isole fortunate, Akropolis; con Luigi Malnati, Gli Etruschi in val Padana; con Lorenzo Braccesi, Mare greco e I greci d'Occidente; con Venceslao Kruta, I celti d'Italia. Come autore di narrativa ha pubblicato i romanzi: Palladion, Lo scudo di Talos, L'Oracolo, Le paludi di Hesperia, La torre della solitudine, Il faraone delle sabbie, la trilogia Aléxandros, opera tradotta in tutto il mondo, Chimaria, L'ultima legione e Il Tiranno, tutti pubblicati da Mondadori. Con Francesco Guccini e Giorgio Celli ha pubblicato Storie d'inverno e negli Oscar la raccolta di racconti I Cento Cavalieri e L'isola dei morti. È autore di cinema e di televisione con prestigiose produzioni internazionali","torrent":{"xt":"urn:btih:ba81efc30a400825817bf8eaf35e65f73d4dbe09","amp;dn":"Valerio+M.+Manfredi+-+L%27Impero+Dei+Draghi+%5BDoc+Lit+Pdf+Rtf+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba81efc30a400825817bf8eaf35e65f73d4dbe09","infoHashBuffer":{"type":"Buffer","data":[186,129,239,195,10,64,8,37,129,123,248,234,243,94,101,247,61,77,190,9]},"announce":[],"urlList":[]}}