{"title":"Matt Houston - Get Him Back Forever + Bonus","uid":5189098,"size":1349770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bacf2702f10927c2f3f837589726645e13e0e0b9&amp;dn=Matt+Houston+-+Get+Him+Back+Forever+%2B+Bonus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"timmah01","files":2,"time":1259600399,"description":"Introducing My Step-By-Step Blueprint That Will Give You An Almost Unfair Advantage At Getting Him Back And KEEPING Him In Love With You...\n \nDiscover Dirty Psychological Tricks To Make Your Ex Boyfriend Beg &amp; Plead For YOU Back... \n\n- The exact psychological &quot;hot buttons&quot; you need to push in order to get him crawling back to you and exactly how to keep him in love and addicted to you. It's surprisingly easier than you might think. \n- The #1 most overlooked secret for getting your ex boyfriend back. \n- The REAL reason he dumped you. It's definitely NOT what you think! \n- Five secrets most women will never know about men. \n- Why you should forget almost everything men tell you when it comes to what they &quot;say&quot; they want in a woman. \n- The one theory that definitively explains why men only want what they can't have and how YOU can use it to get your ex boyfriend back. \n- Keep him hopelessly in love with you, forever. Getting him back is the easy part. I teach you how to get him back and keep him in love with you. Find out why the &quot;honeymoon stage&quot; doesn't have to end. \n- What to do and how to act if he's already dating another woman. \n- Exactly how to get him addicted to you, so he'll show you the affection he once did back when you first started dating. \n- The &quot;Get Him Back Forever&quot; system is NOT a &quot;feel good&quot; eBook on breakups. It's a brutally honest &quot;secrets revealed&quot; blueprint to getting your ex boyfriend crawling back to you (for good). It's not enough to just get him back - it's about getting him addicted and committed to you, forever! \n\n\nIf you like the book and it works for you, please support the author and buy the book.\n &lt;a href=&quot;\nhttp://www.exboyfriendguru.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exboyfriendguru.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:bacf2702f10927c2f3f837589726645e13e0e0b9","amp;dn":"Matt+Houston+-+Get+Him+Back+Forever+%2B+Bonus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bacf2702f10927c2f3f837589726645e13e0e0b9","infoHashBuffer":{"type":"Buffer","data":[186,207,39,2,241,9,39,194,243,248,55,88,151,38,100,94,19,224,224,185]},"announce":[],"urlList":[]}}