{"title":"Christina Milian - Us Against The World","uid":4753663,"size":140201988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bae0f7572397b99c90c05c2d2b2106e2ba36bc63&amp;dn=Christina+Milian+-+Us+Against+The+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"2nafish","files":-1,"time":1236335607,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Us Against the World&quot; is the first single from Christina Milian's upcoming album Elope, which is set to be released in 2009. The song is Milian's first single since parting ways with Def Jam Records in 2006. She wrote the single herself, and described it as a &quot;cinematic power ballad&quot;. The song was released on October 6, 2008, and was serviced to U.S. radios on October 21, 2008. The single's official remix, by Jason Nevins, was released on iTunes on January 20, 2009.\n\nA music video for &quot;Us Against The World&quot; was shot in November by Norwegian director Ray Kay, who previously directed the videos for Milian's singles &quot;Whatever U Want&quot; and &quot;Say I&quot;. Milian described the video as &quot;very Mad Max versus 300&quot;. The video was shot in a desert, featuring Milian and a male love interest, who are the last two people on earth. Milian says, &quot;When you see it, it's nothing like anything you'd see now. I want to be iconic in every music video that I do. I want to make a mark. This is very different.&quot;\n\nThe video premiered on January 13 on Milian's official MySpace page. The video is set in a desert, where Milian sings in different gold and bronze colored, often metallic, outfits. Near the end of the video, her love interest appears and she sings the last chorus to him.\n\nRay Kay revealed that the sand dunes in the video were used by ATV and dune buggy enthusiasts at the time of filming. The video was shot during the busiest weekend of the year for the location, and the crew were constantly forced to stop filming to get clear backgrounds. The video was designed to show Milian's growth from her last album, and Kay's aim as to create an iconic image of the singer. Kay explained that the desert and elemental fashion were a visual metaphor of the lyrics.\n\nThe Wellheart Music Journal praised the power ballad's &quot;thumping beat&quot; and Milian's &quot;emotional vocal&quot;. The reviewer found the song to rank among the top performances of the year, but realized, &quot;Being an underrated singer is what will make this song pass without notice, and its a shame, as Milian shows she has the pipes and charisma as her contemporaries.&quot; After two-and-a-half weeks on Milian's MySpace page, the single received over eight million streams.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bae0f7572397b99c90c05c2d2b2106e2ba36bc63","amp;dn":"Christina+Milian+-+Us+Against+The+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bae0f7572397b99c90c05c2d2b2106e2ba36bc63","infoHashBuffer":{"type":"Buffer","data":[186,224,247,87,35,151,185,156,144,192,92,45,43,33,6,226,186,54,188,99]},"announce":[],"urlList":[]}}