{"title":"Dick Sundevall - Torpeden - 2011 - DAISY","uid":6814227,"size":185036259,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bb6ae221ae813bd3af9518bdae932a84f837ae49&amp;dn=Dick+Sundevall+-+Torpeden+-+2011+-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1321136634,"description":"Historien om Johan Darwich ar historien om en torped, en hitman, och den varld en sadan lever i men det ar samtidigt berattelsen om en van som aldrig sviker och en alskad bror, morbror och farbror.\n\nJohan har begatt i stort sett samtliga brott som finns i brottsbalken med undantag for sexualbrott och IT-brott. Han har gjort sig skyldig till grovt ran, stold, grov misshandel, vapenbrott, narkotikabrott och mord. Johan ar domd for vad polisen beskriver som ett bestallningsmord. Han atalades aven for mordet pa Brodraskapets ledare, Danny Fitzpatrick. aklagaren yrkade pa livstid men Johan blev frikand. Inom lanskriminalen i Stockholm misstanker man honom for ytterligare 45 mord, daribland pa Brodraskapets tidigare hit man, som man dock annu inte hittat liket efter. Bland kriminella finns det de som havdar att Johan ar ansvarig for sa manga som 10 mord.\n\nVarfor skriver man da en bok om en person som har begatt alla dessa brott? Darfor att Johan ledde det forsta invandrarganget i Sverige: Gringos. Darfor att han borjade sin kriminella bana vid sju ars alder i Syrien genom att stjala skor som folk hade tagit av sig i moskÃƒÂ©n, for att sedan snabbt springa ivag och salja dem. Darfor att han under 30 ar av grov kriminalitet har haft en unik insyn i den mest valdsamma delen av den organiserade brottsligheten i Sverige. \n\n\nUpplasare: Gert Lundstedt","torrent":{"xt":"urn:btih:bb6ae221ae813bd3af9518bdae932a84f837ae49","amp;dn":"Dick+Sundevall+-+Torpeden+-+2011+-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb6ae221ae813bd3af9518bdae932a84f837ae49","infoHashBuffer":{"type":"Buffer","data":[187,106,226,33,174,129,59,211,175,149,24,189,174,147,42,132,248,55,174,73]},"announce":[],"urlList":[]}}