{"title":"Chained Slave With Thai Pierced Titties","uid":11697901,"size":843267540,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bb7e275f228e335e5d536d36ee79a6d846e11bfc&amp;dn=Chained+Slave+With+Thai+Pierced+Titties&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1423798934,"description":"I lead my chained up cute slave girl Bom into my room, where she got straight down to sucking my dick. Lovely little thing, I was quite happily fucking her doggy style when this other little slapper dressed in tight black leggings walked in and announced that my slave girl was in fact her property. She looked good in that outfit, but immediately stripped off, and fucking hell what a peach. In fact that was her name, Peach. Fit figure, lovely tits with rings through her nipples. I can really believe that she owned Bom, as Bom got straight down licking her clitoris, and seemed more enthusiastic about servicing a mistress than a master. They were all over each other. Peach telling Bom what to do, and stuffing implements of plastic and stainless steel into her orifices. She even told Bom to start sucking my cock again. So there she was, bisexual brown skin street slave sex in my apartment. And Peach was willing to share. Well, at least for a while, till she got possessive, and smacked her little lesbian toy around the face a bit, before dragging her property out with my chain. I always wanted to bring you great video and this was not what I had in mind. I do recommend super lesbian Peach and her slave girl Bom on high definition","torrent":{"xt":"urn:btih:bb7e275f228e335e5d536d36ee79a6d846e11bfc","amp;dn":"Chained+Slave+With+Thai+Pierced+Titties","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb7e275f228e335e5d536d36ee79a6d846e11bfc","infoHashBuffer":{"type":"Buffer","data":[187,126,39,95,34,142,51,94,93,83,109,54,238,121,166,216,70,225,27,252]},"announce":[],"urlList":[]}}