{"title":"Deep Purple - Fireball (1971) WMA320","uid":6293002,"size":109412730,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bbedfe02e019576a5227b1de24fda715b84c88de&amp;dn=Deep+Purple+-+Fireball+%281971%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301892517,"description":"I was fourteen when I started buying music in earnest. All that hard-earned paper-route money went directly to Columbia House for orange eight-track cassettes and a junky player and speakers. \n\nAll that gear is long gone and the eight-tracks were sold on to a friend so I could upgrade to turntable and better speakers. There are a few albums I had on eight-track that I still can't find anywhere, but for the most part I was able to get the ones that mattered. \n\nThis is one. Imagine, it's 1971 and I'm getting home from my paper route and stuffing this album into the eight-track. It was incredible stuff at the time. Today we can sit and berate the quality of the recording though it's not that bad, and chuckle at some of the lyrics (it does get a little out there at times) but this was made at an interesting time in history and indeed music was undergoing some incredible change. Recording studios were just starting to really get the hang of more complex mixes, and playback devices (the eight-track notwithstanding) were becoming affordable and capable of some decent home high-fidelity. \n\nI just put this onto CD from LP. As I listened to it playback the first time I was questioning why on earth I was transcribing this. Then when I played it back to check to see if the CD came out OK, I started to remember the album and even some of the times I had listened to it way back when. \n\nThis music is a part of the soundtrack of my life and for that reason alone it might be why I like it so much. It's possible I cannot be objective in saying this is a five-star recording. All I can say is that as I listen to the third playback I am remembering why I liked it so much all those years ago. \n\nIf you are just sinking your teeth into Deep Purple, or indeed, music of the Seventies, then this may be a bitter pill. But if you grew up during the period this music was made, and like me, had this as backdrop to your growing up, you will welcome it back like the old friend that it is. \n\nby Paul Mark Provencher &quot;ppro&quot;\n\nTRACKLIST:\n\n01 - Fireball.wma                                                \n02 - No No No.wma                                                \n03 - Demon's Eye.wma                                             \n04 - Anyone's Daughter.wma                                       \n05 - The Mule.wma                                                \n06 - Fools.wma                                                   \n07 - No One Came.wma                                             \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:bbedfe02e019576a5227b1de24fda715b84c88de","amp;dn":"Deep+Purple+-+Fireball+%281971%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbedfe02e019576a5227b1de24fda715b84c88de","infoHashBuffer":{"type":"Buffer","data":[187,237,254,2,224,25,87,106,82,39,177,222,36,253,167,21,184,76,136,222]},"announce":[],"urlList":[]}}