{"title":"Titanic: Ship of Dreams (BBC Radio 4 Documentary)","uid":7185900,"size":46013153,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bc6e4f67bc14ac505da3bd5db530062ac28db94d&amp;dn=Titanic%3A+Ship+of+Dreams+%28BBC+Radio+4+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1334423307,"description":"Ship of Dreams\n\nFrom BBC Radio 4. Written and Presented by Jeanette Winterson.\n\nThe tragedy of the sinking of the Titanic shocked the world. The ship itself and the tales of those involved in its passing have enthralled and chilled generations since.\n\nIn this series of five programmes Jeanette Winterson will lead us through from the fixing of the first rivet, the spectacular launch, arrival in Queenstown and on to the vessels eventual grave.\n\nThis is much more than a diary of events however. This is a powerful narrative by one of today's leading writers. It will follow the mood of the time, explore the myths and controversies, delve into the romanticism of the tragedy and consider the resulting epic quest for the submerged hulk. The Titanic is a snapshot of a generation, driven by a quest for profit and a desire to open up the world - a world dominated by class division.\n\nWe will hear first hand audio archive accounts from survivors, an exploration of the intrigue which surrounds her design, manufacture and demise and consideration of the wonder and mystery of the symbolic artefacts which have been raised from the deep.\n\nEpisode 1: The arrival of passengers, her launch and the factors which led to her being such an enormous ship.\nEpisode 2: The building of the ship in Belfast's Harland and Wolff shipyard.\nEpisode 3: Life aboard the ship: a world of deep-pile carpets, Turkish baths and crystal fountains.\nEpisode 4: The sinking of the Titanic. A tale of class division, heroism and horror.\nEpisode 5: The events following the sinking of the ship.\nTitanic Town (an additional bonus)\n\nAt the Titanic Quarter on Belfast's Queen's Island, work continues on the office blocks and riverside apartments despite the economic gloom.This redevelopment of 105 acres of land once home to the sprawling Harland &amp; Wolff shipyard is a totem of a regenerating city and the starting point for Gerry Anderson's exploration of the meaning of Titanic in the city of her birth.\n\nIt might seem strange, and in questionable taste, to name this brave new world after an 'unsinkable' ship which perished on its maiden voyage, and for many years the people of Belfast would most definitely have agreed. A famous photograph from 1911 shows workers streaming out of the shipyard with the half-built Titanic towering above the terraced streets behind them. It's a reminder that this global icon has roots in a real place amongst real people.\n\nThey don't make ships in Belfast anymore. The last great liner to be built was Canberra in 1960. But the Titanic has become the thread that links modern Belfast to its industrial heyday. Cleansed of its residual guilt and divisive political undertones by the passage of time and a sprinkling of Hollywood stardust, it's now held up as an emblem of local ingenuity and entrepreneurial nous. If something this incredible, this famous can come from this small city on the fringe of Europe, perhaps the next Google or Microsoft might begin here too.\n\nAs the people of Belfast now like to say about the Titanic. 'She was all right when she left here.'.","torrent":{"xt":"urn:btih:bc6e4f67bc14ac505da3bd5db530062ac28db94d","amp;dn":"Titanic%3A+Ship+of+Dreams+%28BBC+Radio+4+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6e4f67bc14ac505da3bd5db530062ac28db94d","infoHashBuffer":{"type":"Buffer","data":[188,110,79,103,188,20,172,80,93,163,189,93,181,48,6,42,194,141,185,77]},"announce":[],"urlList":[]}}