{"title":"The Police - Every Little Thing She Does Is Magic","uid":4704525,"size":152995844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bd7ae705919e1fc14f37631175edf31bf1f70058&amp;dn=The+Police+-+Every+Little+Thing+She+Does+Is+Magic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1233820415,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Every Little Thing She Does Is Magic&quot; is a hit single by British rock group The Police. The song reached the top of the charts in the United Kingdom and hit number 3 in the United States, as well as reaching the top of the Mainstream Rock Tracks chart. It is in D major.\n\nAlthough released in 1981, Sting had written this song as early as 1976. A very early (1977) acoustic version of this song performed by him can be heard on the Strontium 90 album Strontium 90: Police Academy.\n\nSting added this bit of &quot;Every Little Thing...&quot; lyrics to the end of &quot;O My God&quot; on the Police's 1983 release Synchronicity:\n\n&quot;Do I have to tell the story\nOf a thousand rainy days\nSince we first met?\nIt's a big enough umbrella\nBut it's always me that ends up getting wet.&quot;\n\n\nThese lyrics were later reused once more in Sting's &quot;Seven Days&quot; on his solo album Ten Summoner's Tales.\n\nThe piano part was added by session keyboardist Jean Roussel who pestered the band to allow him to play on the track, against Andy Summers' original wishes.\n\nThe song appears on the game Karaoke Revolution Party and the film &quot;Bewitched&quot; (2005).\n\nThe Police were a three-piece rock band consisting of Sting (lead vocals, bass guitar), Andy Summers (guitar, vocals) and Stewart Copeland (drums, vocals, percussion). The band became globally popular in the early 1980s, playing a style of rock that was influenced by jazz, punk and reggae music. Their 1983 album, Synchronicity, was number one in the UK and the US and sold over 8,000,000 copies in the US. The band broke up in 1984, but reunited in early 2007 for a one-off world tour lasting until August 2008, in celebration of the 30th anniversary of their hit single &quot;Roxanne&quot; and also, to a lesser extent, that of their formation as a group. To date, The Police have sold more than 50 million albums worldwide, and were the highest earning musicians in the world during 2008, as a result of their reunion tour. Rolling Stone ranked The Police number 70 on their list of the 100 Greatest Artists of All Time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bd7ae705919e1fc14f37631175edf31bf1f70058","amp;dn":"The+Police+-+Every+Little+Thing+She+Does+Is+Magic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7ae705919e1fc14f37631175edf31bf1f70058","infoHashBuffer":{"type":"Buffer","data":[189,122,231,5,145,158,31,193,79,55,99,17,117,237,243,27,241,247,0,88]},"announce":[],"urlList":[]}}