{"title":"Carl Butler - A Blue Million Tears - Bear Family CD (2004)","uid":10508295,"size":819820617,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bd8b1e9d890e7230c0a655d415db3964ff9bcdf5&amp;dn=Carl+Butler+-+A+Blue+Million+Tears+-+Bear+Family+CD+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"bonnie335","files":55,"time":1404813770,"description":"Carl Butler - A Blue Million Tears - Bear Family CD (2004)\n\n\nA BLUE MILLION TEARS collects all of the singles recorded by legendary honky-tonk pioneer Carl Butler for the Capital and OKeh record labels in the 1950s.\n\nLong before Carl &amp; Pearl Butler made the biggest country hit of 1962 with &quot;Don't Let Me Cross Over,&quot; Carl Butler recorded as a solo artist for the Columbia and OKeh labels. Blue Million Tears chronicles these early years with 28 recordings Butler waxed between 1950 and 1953, and traces his evolution from an open-throated hillbilly singer patterned after Roy Acuff to an electrified honky tonker moving toward the style of his better-known '60s recordings. Bear Family Records is famous for exhuming long-lost hillbilly bop and rockabilly recordings, but there is nothing of that sort here -- only traditional country music with a few train songs and lots of slow weepers. &quot;Plastic Heart,&quot; a novelty that Acuff also recorded, stands out among the many ballads because of its humor and dissimilarity to the surrounding material. Butler had no hits during his early years, and even among his fans these '50s recordings are considered inferior to his '60s hits, but nonetheless, Blue Million Tears is a valuable anthology of rare recordings that should interest serious collectors of traditional country music. ~ Greg Adams\n\nCarl Butler and his wife, Pearl, were forever immortalized by their hit Don't Let Me Cross Over. It remains one of the alltime classics of hard country. But it was merely the highlight of a recording career that began in 1950 and ended just months before his death in 1992. Butler was a hard luck journeyman country musician who played &quot;live&quot; music on small radio stations in the 1940s and 1950s and toured ceaselessly. Neglected toward the end of his life, he lost his farm and his savings, and died alone in a trailer park. His wife, Pearl, who had toured with him for forty years, had died three years earlier. This CD features all of Carl's early recordings for two American labels, Capitol and OKeh. Incredibly, only two of these recordings were reissued on LP and none of them have appeared on CD before now.","torrent":{"xt":"urn:btih:bd8b1e9d890e7230c0a655d415db3964ff9bcdf5","amp;dn":"Carl+Butler+-+A+Blue+Million+Tears+-+Bear+Family+CD+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd8b1e9d890e7230c0a655d415db3964ff9bcdf5","infoHashBuffer":{"type":"Buffer","data":[189,139,30,157,137,14,114,48,192,166,85,212,21,219,57,100,255,155,205,245]},"announce":[],"urlList":[]}}