{"title":"Half Life 2 (Cider Port) For Mac. Everything works perfect.","uid":4372751,"size":2043686701,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:bdc87f51d8f023ff097cfc8a10bce6b0f5a16e07&amp;dn=Half+Life+2+%28Cider+Port%29+For+Mac.+Everything+works+perfect.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mrberu","files":1,"time":1220245822,"description":"[TO FIX THE FONTS GO TO: http://thepiratebay.se/torrent/4533019/Counter_Strike_Source_Mega_Fix_(Fonts_Maps)_(HalfLife2_Font_Fix)]\n\n\n[SLIGHTLY IMPORTANT EDIT: The Fonts directory seems to be missing the Marlett.ttf font. Get it from a Windows computer (it's a hidden file, that's why I didn't notice it the first time around) and add it. This should add scroll bars, and crosses for the in-game windows. Nothing too huge, but just something that I found while trying to fix the f-ed up text bug. Also, this'll work on any Valve cider port from me or Xerxes. You can get the font here:\nhttp://dl.getdropbox.com/u/119976/marlett.ttf]\n\n[EDIT: To get the resolution to fit your screen, change the resolution settings to &quot;widescreen&quot; then pick the resolution of your choice (e.g. 1280x800 for Macbooks)]\n\n[EDIT: This torrent does not include the Lost Coast. I'm working on it.]\n\nHey guys.\nHere it is. Finally. Half Life 2 on your Mac. No need to install Steam or anything. Just download and play. I have a pretty shitty internet connection so give the torrent a bit of time and I'm sure some seeders will pop up soon.\nThis is ONLY Half-Life 2 (NOT including the lost coast).. NOT the Orange Box. Everything works fine on my 13 inch White Macbook (30/35 fps usually) and the graphics are superb when played on my friend's desktop iMac.\nThere shouldn't be any problems besides a bit of messed up text, and an oddly colored target reticule. Basically everything works great. Beyond great. Hell, I even picked a pretty li'l icon so the game looks like a Mac game.\nHave fun!\nMacs pwn.\n\n(If there are any bugs just post 'em here in the comments and I'll try to fix them. I'm going to try to seed for about 30 hours or so until I get a few copies out there. PLEASE SEED! I checked the entire interwebs and this seems to be the only ported HL2 game out there, so if you see another it was me ;) )\n\nP.S. Next I'm going to try to port Counter Strike or Oblivion (I think Oblivion will work with the Cider template from Spore)... but we'll see... cheers!\n\nTHIS GAME IS FOR INTEL MACS ONLY! SORRY PPC USERS... BUT IT'S TIME TO UPGRADE!\n\nSEEEEEEED!\n\nUPDATE:\nDownload Episode 1 here: http://thepiratebay.se/torrent/4381962/Half_Life_2_Episode_One_For_Mac\nEpisode 2 here:\nhttp://thepiratebay.se/torrent/4384190/Half-Life_2_Episode_Two_for_Mac\nand Portal here:\nhttp://thepiratebay.se/torrent/4384197/Portal_for_Mac\nEpisode 2 and Portal will NOT work on GMA 950 intel integrated graphics cards, so if ur on a Macmini or Macbook with these cards, don't bother. It won't work. I'll be working on a fix and will upload a fixed version (or instructions) if I happen to solve the problem.\nIf this issue angers you... it's EA's fault.\nANOTHER UPDATE!:\nHere's the fix for Portal and HL2e2. It'll run the game on GMA 950, but it's VERY slow, try it if you're up to it:\nhttp://thepiratebay.se/torrent/4387621/Half_Life_2e2_and_Portal_Fix_(will_get_the_games_to_run_on_GMA95\n\nANOTHER SUPER UPDATE!:\n\nCounter Strike: Source anyone?\nhttp://thepiratebay.se/torrent/4389186\n","torrent":{"xt":"urn:btih:bdc87f51d8f023ff097cfc8a10bce6b0f5a16e07","amp;dn":"Half+Life+2+%28Cider+Port%29+For+Mac.+Everything+works+perfect.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdc87f51d8f023ff097cfc8a10bce6b0f5a16e07","infoHashBuffer":{"type":"Buffer","data":[189,200,127,81,216,240,35,255,9,124,252,138,16,188,230,176,245,161,110,7]},"announce":[],"urlList":[]}}