{"title":"Michael Collins DVD-R NTSC DVD5 Special Features COMPLETE - Liam","uid":5506576,"size":7800040283,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:be355dfdc77cb3ed7c6ac80208ffca2a1d88756f&amp;dn=Michael+Collins+DVD-R+NTSC+DVD5+Special+Features+COMPLETE+-+Liam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1271844617,"description":"Michael Collins DVD-R NTSC DVD5 Special Features COMPLETE - Liam Neeson\n\nLength - 133 minutes\nScreen formats - Widescreen 1.85:1\nSubtitles - English, French, Spanish\nClosed captioned\nLanguage and sound - English: Dolby Digital 5.1French: Dolby Digital 2.0 Surround\n \nOther features - Color; region 1 encoding; interactive menus; scene access; theatrical trailer; production notes; The South Bank Show documentary (51 mins.) with Neil Jordan interview and actual footage of Michael Collins; 2 different Commentaries\n\nVideo\nID                               : 224 (0xE0)\nFormat                           : MPEG Video\nFormat version                   : Version 2\nBit rate mode                    : Variable\nWidth                            : 720 pixels\nHeight                           : 480 pixels\nDisplay aspect ratio             : 4:3\nFrame rate                       : 29.970 fps\nStandard                         : NTSC\n\nAudio #1\nID                               : 128 (0x80)\nFormat                           : AC-3\nFormat/Info                      : Audio Coding 3\nChannel(s)                       : 6 channels\nSampling rate                    : 48.0 KHz\nLanguage                         : English, French, Spanish\n\n\nMenu #1\nList (Audio)                     : 0 / 1\nList (Subtitles 4/3)             : 0 / 1 / 2\nList (Subtitles Wide)            : 0 / 0 / 0\nList (Subtitles Letterbox)       : 0 / 0 / 0\nList (Subtitles Pan&amp;Scan)        : 0 / 0 / 0\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0117039/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0117039/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Michael_Collins_%28film%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Michael_Collins_%28film%29&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/IAmgfAaCA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAmgfAaCA&lt;/a&gt;\n\n\nPlot Synopsis  \tby Mark Deming\n\nThe rise and fall of one of the most important and controversial figures in Ireland's struggle for independence is chronicled in this biographical drama. In 1916, the British government ruled Ireland with a firm and cruel hand, as they had for 700 years. When a group of Irish rebels staged a six-day siege at Dublin's General Post Office, only one of the leaders was able to escape execution -- Eamon De Valera (Alan Rickman), an American citizen of Irish blood. A number of De Valera's followers are sent to prison, and one of them, Michael Collins (Liam Neeson), walked out of jail convinced that a new approach was needed to free his homeland from British rule. With his compatriot Harry Boland (Aidan Quinn), Collins formed the Irish Volunteers, who used a combination of terrorist violence and guerilla warfare to attack the British where their defenses were weakest, and employed espionage and a key inside informant (Stephen Rea) to learn what the British planned to do next -- and what they knew about Collins and his supporters. Collins' strategic skills and talent for warfare made a major impact on the British, and he became the hero of the new-born Republican Movement, which seemed to offer a real hope of freedom, despite the violent reprisals of the vicious paramilitary police, the Black and Tans. De Valera, however, was often in conflict with Collins in terms of the methods and approach of their struggle. Collins also found himself in a different sort of conflict with Boland when he fell in love with his girlfriend, a strong-willed advocate of Irish freedom named Kitty Kiernan (Julia Roberts). Eager to gain support for the Republican cause, De Valera sought economic and military support from the U.S.; when he returned, the Volunteers seemed to have finally won a real victory, as the British government announced that they were willing to formally negotiate with them. While Collins was once the radical and De Valera was the moderate, once negotiations began, Collins sought to end the violence that he saw killing so many young people and was willing to agree to a compromise that would create the Irish Free State. While the agreement would still leave final political control with the British, it would bring a greater self-determination to Ireland, and Collins believed that it was a crucial first step that could lead, in time, to true freedom for his people. De Valera, however, was strongly opposed to the treaty with Britian, and this led to violence among pro- and anti-treaty factions; soon Ireland's most loved leader was now branded a traitor by many of his countrymen. Michael Collins was voted Best Picture at the 1996 Venice Film Festival, and Liam Neeson was awarded the prize for Best Actor. \n\nCast\n\n    * Liam Neeson as Michael Collins\n    * Aidan Quinn as Harry Boland\n    * Stephen Rea as Ned Broy\n    * Alan Rickman as Eamon de Valera\n    * Julia Roberts as Kitty Kiernan\n    * Brendan Gleeson as Liam Tobin\n    * Ian Hart as Joe O'Reilly\n    * Charles Dance as Soames, the British Intelligence officer who commands the Cairo Gang\n    * Owen O'Neill as Rory O'Connor\n    * Gerard McSorley as Cathal Brugha\n    * Jonathan Rhys Meyers as Collin's assassin\n\n","torrent":{"xt":"urn:btih:be355dfdc77cb3ed7c6ac80208ffca2a1d88756f","amp;dn":"Michael+Collins+DVD-R+NTSC+DVD5+Special+Features+COMPLETE+-+Liam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be355dfdc77cb3ed7c6ac80208ffca2a1d88756f","infoHashBuffer":{"type":"Buffer","data":[190,53,93,253,199,124,179,237,124,106,200,2,8,255,202,42,29,136,117,111]},"announce":[],"urlList":[]}}