{"title":"The Radio Dept-6 cd","uid":5626892,"size":279907216,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:be67d7a7ba1979a8249904e20c93024034d408d3&amp;dn=The+Radio+Dept-6+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"flitigalisa","files":63,"time":1276515003,"description":"The Radio Dept. is an indie pop band from Lund, Sweden signed to Labrador Records.\nThe band was conceived in 1995 by schoolmates Elin Almered and Johan Duncanson, who named the group after a gas-station-turned-radio-repair-shop called &quot;Radioavdelningen&quot; (Swedish for The Radio Department). However, Almered and Duncanson soon stopped playing music together, putting the band on hiatus. Then three years later, in 1998, Duncanson started making music again but now with Martin Larsson and they decided to adopt the same name. [1]In 2001, Larsson's then girlfriend Lisa Carlberg joined the group on bass, followed by Per Blomgren on drums and Daniel TjÃƒÂ¤der on keyboards.[2][3]\n\nLater in 2001, the band sent recordings to music magazine Sonic, receiving a positive review and being featured on the free CD sampler that came with the magazine. Labrador Records heard them on the disc and signed them to their label. Per Blomgren left the group prior to the release of their album Lesser Matters and Lisa Carlberg departed after the release of This Past Week EP. According to their website, the band decided to use digital drum tracks and stated that for their second album they were &quot;taking a new direction ... which wouldn't require a member that played bass guitar.&quot;[4]\n\nThe group enjoyed more widespread recognition after three tracks (&quot;Pulling Our Weight&quot; from the Pulling Our Weight EP, &quot;I Don't Like It Like This&quot; from the This Past Week EP, and &quot;Keen on Boys&quot; from Lesser Matters) were included on the soundtrack for Sofia Coppola's film Marie Antoinette.\n\nEarly 2006 saw the release of their second album Pet Grief. The distorted buzz that adorned most of their debut was now replaced by synthesizer. The album didn't reach the rest of Europe, including the UK until later in 2006. Unfortunately, with little touring support there was no real buzz behind Pet Grief. Reviews were mixed. NME rated the album with a 7 out of 10, but other magazines were not quite so kind. However, it did find popularity amongst a growing fan base throughout the world, thanks to the Internet. The album is available in the US through Darla and through their US distribution deal with Labrador.\n\nBy the end of 2006, a brand new track &quot;We Made the Team&quot; was released as the 100th release on the Labrador. It was also the final track on the Labrador's labels Compilation of 100 tracks released at the beginning of 2007. Although all UK tour dates but one in London were recently canceled, the band is said to be working on a new album.[5]\n\nThe band released a new EP in May 2008 entitled Freddie And The Trojan Horse, including the songs &quot;Freddie And The Trojan Horse&quot;, &quot;Closing Scene&quot; and &quot;The Room, Tarzana&quot; on Matador Records. Another EP, David, was released on June 24th 2009. It included four songs; &quot;David&quot;, &quot;Messy Enough&quot;, &quot;David (Rice Twins Remix)&quot; and &quot;The Idle Urban Contemporaries&quot;. The song &quot;David&quot; has been made available for download at no cost by Labrador Records.\n\nAfter &quot;David&quot;, The Radio Dept. released the album Clinging to a Scheme on April 20th, 2010.\n\nPlease SEED and enjoy, thanks........!","torrent":{"xt":"urn:btih:be67d7a7ba1979a8249904e20c93024034d408d3","amp;dn":"The+Radio+Dept-6+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be67d7a7ba1979a8249904e20c93024034d408d3","infoHashBuffer":{"type":"Buffer","data":[190,103,215,167,186,25,121,168,36,153,4,226,12,147,2,64,52,212,8,211]},"announce":[],"urlList":[]}}