{"title":"Wondershare Video Converter Platinum 5.1.1","uid":6144790,"size":22802319,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bee86e2eda9d7d08ee7d881ff87eedd6ac4c55bd&amp;dn=Wondershare+Video+Converter+Platinum+5.1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"qwersd","files":3,"time":1296634802,"description":"Convert video to all popular portable players\n\nSupport all popular video and audio players such as iPod, Zune, PSP, Pocket PC, Creative Zen, Archos, PS3, Xbox 360, Wii, HP iPAQ, iRiver and so on.\n\nFast speed, High Definition, Professional conversion\n\nConvert video, High Definition video to popular video with super fast speed, excellent quality.\nBest Video Converter, convert HD Video/SD Video\n\nConvert between all stand video formats\nIt can convert between various stand video formats including MP4, MOV, 3GP, AVI, WMV, MKV, RM, MPEG-1, MPEG-2, FLV, ASF and more.\n\nSupport high definition video and AVCHD Video\nConvert video to HD Video including MTS(AVCHD H.264), M2TS(AVCHD H.264), TS(MPEG-2 HD), HD MKV(H.264, MPEG-2 HD), HD WMV, and HD MOV(H.264, MPEG-4).\nConvert HD Video including M2TS, MTS, TS, TP, TRP to popular video such as AVI, MP4, FLV etc. Wondershare Video Converter Platinum is also the best HD video converter and AVCHD video Converter which can convert HD video and AVCHD video to avi, convert M2TS to AVI, convert MTS to AVI, convert TS to MP4 etc with excellent quality.\n\nExtract Video to various Audio formats\nExtract audio from video to M4A, WMA, WAV, MP3, AAC, AC3, APE, MKA, OGG, AU, AIFF, FLAC etc.\n\nFast conversion speed\nProvide &gt;300% converting speed, so fast beyond your imagination and automatically shut down your PC after conversion.\n\nPowerful PSP and iPod manager tools\nBuilt- in iPod Video Transfer/PSP Movie Manager allows you to transfer files between PC and iPod/PSP freely.\n\n100% Compatible with Windows 7\nThis Video Converter is fully compatible with the latest Windows 7.\n\nPowerful video editing\n\nTo crop, trim, merge, add watermark and subtitle to enjoy your personalized video\nBest Video Converter, Video Converter software - video editing,Crop, trim, effect, watermark\n\nCrop video\nEasily crop video to create your ideal video with different screen size.\n\nTrim video files\nTrim your video files to convert your favorite movie clips.\n\nAdjust video output effect\nAdd special effect to your video such as Gray, Emboss, Negative, Old film.\n\nAdd Watermark\nAdd either text or image as watermark to coin and color your video files in a personalized way.\n\nProduce video with subtitle\nAllow you to plug-in subtitle file (.srt, .ssa and .ass) to any video.\n\nMerge and split video clips\nComplete with a Video Joiner that lets you merge more than one file into a single file.\n\nCapture pictures\nCapture pictures from your video and save them as jpeg or bmp files.\n\nPreview and compare\nTwo real time preview windows let you compare and get the best video effects out of your movies.\n\nAdvanced setting and optimized profiles\n\nCustomizable options to set video &amp; audio output effect and define your own output files\n\nConfigure output video/audio settings such as Resolution, Frame Rate, Encoder, Sample Rate, and Bit Rate to produce exactly the video/audio you need for your mobile device.\n\nEasy operation and free technical support\n\nBring you easier operation and provide the best and prompt service for you.\n\nEasy-to-use\nJust a few clicks to convert video to common video files.\n\n\n\nInstall use key\nDO NOT UPDATE THIS SOFTWARE","torrent":{"xt":"urn:btih:bee86e2eda9d7d08ee7d881ff87eedd6ac4c55bd","amp;dn":"Wondershare+Video+Converter+Platinum+5.1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee86e2eda9d7d08ee7d881ff87eedd6ac4c55bd","infoHashBuffer":{"type":"Buffer","data":[190,232,110,46,218,157,125,8,238,125,136,31,248,126,237,214,172,76,85,189]},"announce":[],"urlList":[]}}