{"title":"Beyond the God Particle- Lederman, Hill [Epub &amp; Mobi] [Storm","uid":9912828,"size":2922673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfa1a6b948170cae932e97135bb93ef34b94290f&amp;dn=Beyond+the+God+Particle-+Lederman%2C+Hill+%5BEpub+%26amp%3B+Mobi%5D+%5BStorm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"krystine","files":-1,"time":1396914979,"description":"Description\nBeyond the God Particle\nAuthor: Leon M. Lederman\nPublished: 2013\nPublisher: Prometheus Books\nISBN: 9781616148027\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\nTwo leading physicists discuss the importance of the Higgs Boson, the future of particle physics, and the mysteries of the universe yet to be unraveled.\n\nOn July 4, 2012, the long-sought Higgs Boson--aka &quot;the God Particle&quot;--was discovered at the world's largest particle accelerator, the LHC, in Geneva, Switzerland. On March 14, 2013, physicists at CERN confirmed it. This elusive subatomic particle forms a field that permeates the entire universe, creating the masses of the elementary particles that are the basic building blocks of everything in the known world--from viruses to elephants, from atoms to quasars.\n\nStarting where Nobel Laureate Leon Lederman's bestseller The God Particle left off, this incisive new book explains what's next. Lederman and Hill discuss key questions that will occupy physicists for years to come: \n\n* Why were scientists convinced that something like the &quot;God Particle&quot; had to exist? \n* What new particles, forces, and laws of physics lie beyond the &quot;God Particle&quot;? \n* What powerful new accelerators are now needed for the US to recapture a leadership role in science and to reach &quot;beyond the God Particle,&quot; such as Fermilab's planned Project-X and the Muon Collider? \n\nUsing thoughtful, witty, everyday language, the authors show how all of these intriguing questions are leading scientists ever deeper into the fabric of nature. Readers of The God Particle will not want to miss this important sequel.\n","torrent":{"xt":"urn:btih:bfa1a6b948170cae932e97135bb93ef34b94290f","amp;dn":"Beyond+the+God+Particle-+Lederman%2C+Hill+%5BEpub+%26amp%3B+Mobi%5D+%5BStorm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa1a6b948170cae932e97135bb93ef34b94290f","infoHashBuffer":{"type":"Buffer","data":[191,161,166,185,72,23,12,174,147,46,151,19,91,185,62,243,75,148,41,15]},"announce":[],"urlList":[]}}