{"title":"Rhetorics of Fantasy by Farah Mendlesohn","uid":10407944,"size":889846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1786d8c04d1cfeb71fc697f5b275bbd592a40df&amp;dn=Rhetorics+of+Fantasy+by+Farah+Mendlesohn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1403488107,"description":"\nTranscending arguments over the definition of fantasy literature, Rhetorics of Fantasy introduces a provocative new system of classification for the genre. Utilizing nearly two hundred examples of modern fantasy, author Farah Mendlesohn uses this system to explore how fiction writers construct their fantastic worlds. \n\nMendlesohn posits four categories of fantasy--portal-quest, immersive, intrusion, and liminal--that arise out of the relationship of the protagonist to the fantasy world. Using these sets, Mendlesohn argues that the author's stylistic decisions are then shaped by the inescapably political demands of the category in which they choose to write. \n\nEach chapter covers at least twenty books in detail, ranging from nineteenth-century fantasy and horror to extensive coverage of some of the best books in the contemporary field. Offering a wide-ranging discussion and penetrating comparative analysis, Rhetorics of Fantasy will excite fans and provide a wealth of material for scholarly and classroom discussion.\n\nIncludes discussion of works by over 100 authors, including Lloyd Alexander, Peter Beagle, Marion Zimmer Bradley, John Crowley, Stephen R. Donaldson, Stephen King, C. S. Lewis, Gregory Maguire, Robin McKinley, China Mieville, Suniti Namjoshi, Philip Pullman, J. K. Rowling, Sheri S. Tepper, J. R. R. Tolkien, Tad Williams\n\nGenre: Fantasy, Essays","torrent":{"xt":"urn:btih:c1786d8c04d1cfeb71fc697f5b275bbd592a40df","amp;dn":"Rhetorics+of+Fantasy+by+Farah+Mendlesohn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1786d8c04d1cfeb71fc697f5b275bbd592a40df","infoHashBuffer":{"type":"Buffer","data":[193,120,109,140,4,209,207,235,113,252,105,127,91,39,91,189,89,42,64,223]},"announce":[],"urlList":[]}}