{"title":"True West (TV) [2002] Bruce Willis","uid":6144787,"size":733326741,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c199042d148099472bc6f97469692697f7735f1a&amp;dn=True+West+%28TV%29+%5B2002%5D+Bruce+Willis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1296634780,"description":" &lt;a href=&quot;http://bayimg.com/JADEJaADK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/JADEJaADK&lt;/a&gt;\n\nTrue West (TV 2002) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0328719/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0328719/&lt;/a&gt;\n\nTrue West is a play by American playwright Sam Shepard. Like most of his works it is inspired by myths of American life and popular culture. The play is a more traditional narrative than most of the plays that Shepard has written.\n\n  Bruce Willis  ...  Lee  \n  Chad Smith  ...  Austin  \n  Andrew Alburger  ...  Saul Kimmer  \n  Danielle Kennedy  ...  Mom  \n\nTrue West is about the sibling rivalry between two estranged brothers who have reconnected. Austin, the younger brother, is a Hollywood screenwriter writing a screenplay while house sitting for his mother, who is vacationing in Alaska. His older brother, Lee, appears at the house after the two have not seen each other for years. Lee is a drifter and thief and has been living in the desert. The two are not on good terms, but Austin attempts to appease his older brother, who is more dominant.\n\nSometimes its hard to remember that Bruce Willis is a terrific, nuanced actor when the material calls for it. Hell make some big Hollywood clunker like Harts War, and almost erase the memory of his subtlety in serious films like Nobodys Fool or even hits like The Sixth Sense.\n\nHis magnetic performance in True West, Showtimes taped version of a stage production, is a reminder of how rare it is for one actor to combine stardom with depth.\n\nBehind the scenes, this production is also a tale of true brotherhood. Mr. Willis directed and acted in the play in Hailey, Idaho, with Company of Fools, a theater group founded by an old college pal. When Mr. Willis saw the group in its former home in Virginia several years ago, he invited it to move to Hailey, where he lives part of the time. He even refurbished a theater for it. And when his brother Robert Willis died of cancer during the run of True West, he decided to tape this performance as a tribute to him.\n\nWillis &quot;True West&quot; -- starring Willis as the scruffy renegade Lee, who hijacks his clean-cut brother Austins screenplay deal -- was staged at the Liberty Theatre in Hailey, Idaho, a small town just south of Sun Valley, where Willis lives. The play was directed by Willis and produced by Company of Fools, a Hailey theater company Willis co-founded in 1997. The Showtime offering was videotaped at a live performance by Cheyenne Enterprises (a film and TV production company co-owned by Willis) and directed for TV by Gary Halvorson. \n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:c199042d148099472bc6f97469692697f7735f1a","amp;dn":"True+West+%28TV%29+%5B2002%5D+Bruce+Willis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c199042d148099472bc6f97469692697f7735f1a","infoHashBuffer":{"type":"Buffer","data":[193,153,4,45,20,128,153,71,43,198,249,116,105,105,38,151,247,115,95,26]},"announce":[],"urlList":[]}}