{"title":"Pink Floyd - Delicate Sound Of Thunder - The Complete 1987-1988","uid":9048586,"size":1718135696,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c1c9737124f00cbb002c8684db0101bf4da85e50&amp;dn=Pink+Floyd+-+Delicate+Sound+Of+Thunder+-+The+Complete+1987-1988+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"}{eywood","files":146,"time":1381815630,"description":"Magna Qualitas Records is proud to announce our newest release: A radical reworking of Pink Floyd's Delicate Sound of Thunder called Delicate Sound of Thunder: The Complete 1987-1988 Tour..\n\nDelicate Sound of Thunder was a live album released in November 1988 highlighting the return of Pink Floyd after years without a tour.  The last actual tour was the Animals tour in 1977 (The Wall tour only played 4 cities, and therefore wasn't really a tour per se).  This tour with the newly reconstituted David Gilmour led Pink Floyd was very successful and it was inevitable that a live album and video were spawned by it.\n\nDelicate Sound of Thunder was recorded over five nights at the Nassau Coliseum on Long Island, New York in August 1988.  Because it was released with vinyl as the primary medium, CD being an afterthought, it does not contain the entire set performed at these shows.  A companion video, however, contains quite a bit of the material missing from the CD.  Unfortunately many of the songs that appeared on the CD were edited on the video making it necessary to have both to get full performances of all the included material.\n\nThis is a composite of the audio from both the CD and the LaserDisc releases of the concerts (Delicate Sound of Thunder has never been officially released on DVD) that we've beefed up with some additions to make into a complete show.  \n\nAs a bonus we've added the five songs that don't exist on any release of Delicate Sound of Thunder (&quot;A New Machine Parts 1 &amp; 2&quot;, &quot;Terminal Frost&quot;, &quot;Welcome To The Machine&quot; and &quot;Echoes&quot;), the missing 38 seconds of &quot;Signs of Life&quot;, and a couple of minutes cut from &quot;On The Run&quot;, all sourced from bootleg soundboard recordings, thus completing the setlist.  For all the soundboard tapes used many tools were utilized, including stereo sparialization of specific frequency bands, EQ, noise reduction and a few ancient Chinese secrets, to try to match the mix and quality of the official release for seamless integration.  We've also enhanced the audience throughout the show because we feel that anyone who attended the North American shows as }{eywood did (he saw 6 of them) knows that the crowds were loud and enthusiastic, and the album does not represent the way it sounded at the actual concerts.\n\nWe've also included several bonus tracks that are the original edited versions of songs from the CD and LaserDisc.\n\nWe believe that this is a far more faithful representation of the show as it appeared on the 1987-88 tour, one with all the songs and all at their full length.  You will never find an official version or a bootleg SBD recording that contains the complete setlist from this tour with this quality, so we hope you enjoy it.\n\n\nA NOTE ON DISC DIVISIONS:\n\nThis album is designed for both continuous seamless playback on harddrive based players and for CD burning.  It contains optional tracks at the end of the sets to be used for different purposes.  For seamless playback put the fadeless segues in your playlist.  For CD burning optional fade-ins and -outs are also provided.  Use these instead of the seamless segues and your CDs will have smooth fades at both ends.  This feature will be also be incorporated into MQR's live releases in the future.  We aim to keep everyone happy no matter what your listening preferences.\n\nFebruary 22, 2013\n\n\n\n\n","torrent":{"xt":"urn:btih:c1c9737124f00cbb002c8684db0101bf4da85e50","amp;dn":"Pink+Floyd+-+Delicate+Sound+Of+Thunder+-+The+Complete+1987-1988+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1c9737124f00cbb002c8684db0101bf4da85e50","infoHashBuffer":{"type":"Buffer","data":[193,201,115,113,36,240,12,187,0,44,134,132,219,1,1,191,77,168,94,80]},"announce":[],"urlList":[]}}