{"title":"Damsels - Mermaids 0-5 (PDF) 2013","uid":8977656,"size":83305783,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1e4a9b237ea1acac4a064d275a33312912345be&amp;dn=Damsels+-+Mermaids+0-5+%28PDF%29+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bpfine","files":-1,"time":1380483805,"description":"\nDamsels - Mermaids 0-5 (PDF) 2013\n\n6 Issues | PDF | English | Total Size 79 MB\n\n========================================\n\nDamsels - Mermaids 0 - April 2013\n\n34 Pages | PDF | English | 16 MB\n\nThe Little Mermaid has been captured by a cruel wizard, who intends to keep her locked away forever. But help comes in the form of a valiant one-legged tin soldier whose heart is far bigger than he is. Can the Little Mermaid escape her vicious captor with nothing but a talking toy to guide her?\n\n========================================\n\nDamsels - Mermaids 1 - May 2013\n\n39 Pages | PDF | English | 15 MB\n\nThe Little Mermaid's fairy tale had a happy ending... but not for her. Now she lives a secluded life away from her people, angry at the world, courting danger at every turn, and daring death to find her. When a handsome prince is exiled on her lonely island, he offers her a chance to pay the world back, asking for her aid in his battle against the oppressive Hieromancers of Atlantis. But can she trust him? Or is he simply the next charming prince in line to betray her?\n\n========================================\n\nDamsels - Mermaids 2 - June 2013\n\n28 Pages | PDF | English | 12 MB\n\nThe Little Mermaid and her new prince have embarked on a quest at sea for something with the power to bring down the oppressive Atlantean empire. But as they sail to the Great Whorl at the Center of the Ocean, she begins wonder if she can trust the shady pirate captain they've hired; trust the handsome prince who's swept her off her feet, but is hiding something sinister; or even trust her own feelings. All this, plus a fierce sea battle and a malevolent swamp monster who dances a mean jig!\n\n========================================\n\nDamsels - Mermaids 3 - July 2013\n\n23 Pages | PDF | English | 10 MB\n\nThe Little Mermaid arrives at the Center of the Ocean, only to find the Great Whorl as huge and terrifying as legend has it. But when the Little Mermaid dives to retrieve the mysterious Axis Mundi, she discovers something else that wants it even more. Warning: May contain romance, mutiny, and giant squid! \n\n========================================\n\nDamsels - Mermaids 4 - August 2013\n\n24 Pages | PDF | English | 12 MB\n\nThe Little Mermaid and her new prince must flee--but where can you flee when you're in the center of the ocean and only one of you is a mermaid? The good news is that someone is there to meet them. The bad news is that it's no one you'd ever, ever want to meet. But could this terrible reversal be a blessing in disguise? As everything converges on the island nation of Atlantis, John's plan becomes terribly clear, and the Little Mermaid must decide who's side she's really on.\n\n========================================\n\nDamsels - Mermaids 5 - Septmber 2013\n\n24 Pages | PDF | English | 12 MB\n\nWilling to sacrifice his life, Prince John has unleashed the destructive axis mundi in the heart of Atlantis! With time running out, the Little Mermaid must decide if love is worth living for - or worth dying for! And if that wasn't bad enough, Vodyanoy is still alive, and he has a bone to pick with the Little Mermaid... literally. Who will survive the fall of Atlantis.\n\n======================================== \n\nMy Blog: &lt;a href=&quot; http://thepiratebay.se/user/bpfine/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/bpfine/&lt;/a&gt;","torrent":{"xt":"urn:btih:c1e4a9b237ea1acac4a064d275a33312912345be","amp;dn":"Damsels+-+Mermaids+0-5+%28PDF%29+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1e4a9b237ea1acac4a064d275a33312912345be","infoHashBuffer":{"type":"Buffer","data":[193,228,169,178,55,234,26,202,196,160,100,210,117,163,51,18,145,35,69,190]},"announce":[],"urlList":[]}}