{"title":"Aretha Franklin - Lady Soul [FLAC] TNT Village","uid":9562636,"size":191263803,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c38a6ad181482e4ba94e5a5a49e6b84e31c3c742&amp;dn=Aretha+Franklin+-+Lady+Soul+%5BFLAC%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":10,"time":1391460949,"description":"Aretha Franklin - Lady Soul [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=383790&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=383790&lt;/a&gt;\n\nReleased: 1968\nGenre: Sou\n\nAppearing after a blockbuster debut and a sophomore set that was rather disappointing (in comparison), 1968's Lady Soul proved Aretha Franklin, the pop sensation, was no fluke. Her performances were more impassioned than on her debut, and the material just as strong, an inspired blend of covers and originals from the best songwriters in soul and pop music. The opener, &quot;Chain of Fools,&quot; became the biggest hit, driven by a chorus of cascading echoes by Franklin and her bedrock backing vocalists, the Sweet Impressions, plus the unforgettable, earthy guitar work of guest Joe South. The album's showpiece, though, was &quot;(You Make Me Feel Like) A Natural Woman,&quot; a song written expressly for her by Brill Building pop stalwarts Gerry Goffin and Carole King, based on a title coined by producer Jerry Wexler. One of the landmark performances in pop music, the song floats serenely through the verses until, swept up by Ralph Burns' stirring string arrangement again and again, Franklin opens up on the choruses with one of the most transcendent vocals of her career. And just as she'd previously transformed a soul classic (Otis Redding's &quot;Respect&quot;) into a signature piece of her own, Franklin courageously reimagined songs by heavyweights James Brown, Ray Charles, and the Impressions. Brown's &quot;Money Won't Change You&quot; is smooth and kinetic, her testifying constantly reinforced by interjections from the Sweet Inspirations. Curtis Mayfield's &quot;People Get Ready,&quot; a 1965 civil-rights anthem and a hit for the Impressions, is taken at a slower pace than the original; after a quiet verse, Franklin lets loose amidst a magisterial brass arrangement by Arif Mardin. Powered by three hit singles (each nested in the upper reaches of the pop Top Ten), Lady Soul became Aretha Franklin's second gold LP and remained on the charts for over a year.\n\n.: Locandina :.\n &lt;a href=&quot;\nhttp://misskind.no.sapo.pt/dbimg/ArethaFranklin-LadySoul119163_f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://misskind.no.sapo.pt/dbimg/ArethaFranklin-LadySoul119163_f.jpg&lt;/a&gt;\n\n.: Track List :.\n\n1 Chain of fools\n2 Money won't change you\n3 People get ready\n4 Niki hoeky\n5 (You make me feel like) A natural woman\n6 Since you've been gone (Sweet sweet baby)\n7 Good to me as I am to you\n8 Come back baby\n9 Groovin'\n10 Ain't no way\n","torrent":{"xt":"urn:btih:c38a6ad181482e4ba94e5a5a49e6b84e31c3c742","amp;dn":"Aretha+Franklin+-+Lady+Soul+%5BFLAC%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c38a6ad181482e4ba94e5a5a49e6b84e31c3c742","infoHashBuffer":{"type":"Buffer","data":[195,138,106,209,129,72,46,75,169,78,90,90,73,230,184,78,49,195,199,66]},"announce":[],"urlList":[]}}