{"title":"Rare DC Horror comics 1952-2001 (must have!)","uid":3350800,"size":6331877773,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c457e06bcd9cef0c4663abc9691e9e6e3375a35f&amp;dn=Rare+DC+Horror+comics+1952-2001+%28must+have%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tkgpny","files":1030,"time":1120206783,"description":"Old, rare DC Horror comics, extras and modern Vertigo remakes. Comics from the Atom Age of 1952 all the way to 2001.\n\nHouse of Mystery\nHouse of Secrets\nHouse of Secrets v2 (Vertigo)\nSecrets of Haunted House\nSecrets of Sinister House\nTales of the Unexpected\nWeird War Tales\nWeird War Tales v2 (Vertigo)\nWitching Hour\nWitching Hour v2 (Vertigo)\n\nMany of these comics are presented by your favourite Sandman characters (before they were Sandman characters), including Destiny of the Endless, Cain, Abel, and the Witches Three. The first appearances of many characters are contained within these comics, most notably Swamp Thing, Robby Reed (Dial H for HERO), and Eclipso. \n\nThey blend varying amounts of horror, mystery, science fiction, and the supernatural.\n\n&quot;House of Mystery, Number 1. Originally published in December/January, 1951/52, this is the first horror comic to be published by DC. Following the success of the EC Comics line comics publishers jumped on the horror bandwagon. Although not the first horror comic, House of Mystery is the longest running, finally closing its doors in 1983. This issue features art by Curt Swan, John Prentice, and Bob Brown.&quot; http://www.kenpiercebooks.com/dc.htm\n\n&quot;House of Secrets, Number 92. Originally published in June/July, 1972, this issue introduced the Swamp Thing in a short story by Len Wein and Berni Wrightson. Swamp monsters were nothing new. Marvel created Man-Thing at about the same time, and Hillman Comics had The Heap back in the 1940s. Swamp Thing soon had its own series, at first by the team of Wein and Wrightson....before Alan Moore took over.&quot; http://www.kenpiercebooks.com/dc.htm\n\nMany characters make appearances throughout the various series and their extras such as Batman, Superman, Catwoman, Dr Strange, I... Vampire, Space Ranger, Wonderwoman and the Teen Titans.\n\nWeird War Tales is US propaganda at it's finest. It's beautiful stuff. Lots of evil Nazi's and Japanese. Awesome merging of supernatural themes and war.\n\nThe ads in all of these comics are just amazing, from air rifles and bb guns to toasters, girls dolls that wet themselves and collections of British Empire Stamps!\n\nI should forewarn you that the collections here are not complete because not every issue in the early series has been scanned yet. But this is a fairly accurate snapshot of everything that has been released up until this point. It was a fairly exhaustive search over two months that led to this collection. The Vertigo collections obviously ARE complete.\n\nI hope you enjoy,\nTkgpny.","torrent":{"xt":"urn:btih:c457e06bcd9cef0c4663abc9691e9e6e3375a35f","amp;dn":"Rare+DC+Horror+comics+1952-2001+%28must+have%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c457e06bcd9cef0c4663abc9691e9e6e3375a35f","infoHashBuffer":{"type":"Buffer","data":[196,87,224,107,205,156,239,12,70,99,171,201,105,30,158,110,51,117,163,95]},"announce":[],"urlList":[]}}