{"title":"&quot;The Asylum for Wayward Victorian Girls&quot; by Emilie Aut","uid":9542890,"size":1381435813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c47a3f4c0b64f9cbd9bb5dd6c8edf7450ca6cced&amp;dn=%26quot%3BThe+Asylum+for+Wayward+Victorian+Girls%26quot%3B+by+Emilie+Aut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"joshua13","files":1,"time":1391083009,"description":"Available for purchase at http://www.asylumemporium.com/collections/books\n\n\n\n\nABOUT THE BOOK:\n\nCategory: Autobiography, Fantasy, Psychology, Art\n\n~12&quot; by 9&quot;, digital PDF format, 266 pages\n~all pages in full color\n~3rd printing, updated and revised from the 2nd printing, and containing additional text and substantial alterations (plus a few new hidden secrets...)\n\nPresenting: The 3rd Printing of Emilie Autumn's long awaited, autobiographical, reality-bending, historical thriller!\n\n\n \n\nMORE DETAILS:\n\nStraddling the bookshelves somewhere between psychological study, historical horror story, and fantasy fiction sits Emilie Autumn's debut autobiographical novel, &quot;The Asylum for Wayward Victorian Girls.&quot;\n\nWritten and illustrated by the notoriously manic-depressive rock star, this chilling tale combines humor, tragedy, and suspense to produce a blood-curdling account of the nightmare that is life inside an insane asylum, comparing those from the Victorian era with our modern day version, and proving, through her own personal experiences, that not much has changed from then to now.\n\nCulled directly from EA's real-life diary entries, the story begins with Emilie's suicide attempt and prompt imprisonment inside a psychiatric hospital. Sparing no detail, Emilie shows us exactly what goes on inside this house of horrors, exposing secrets that the general public could never have guessed at. Narrated with the sarcastic and self-deprecating humor present in all of EA's works, much of the subject matter may be considered controversial. Still, as in her song lyrics, Emilie tells the truth at all costs, thrusting the brave reader into a play-by-play narrative of her bi-polar episodes, even providing photos -- blood, cuts, and all.\n\nThe tale takes an unexpected turn when, whilst still in the psych ward, Emilie discovers evidence of a parallel dimension -- a world that soon becomes indiscernible from her own. As the days go by, the seemingly disparate worlds of the story's two lead characters (Emilie and Emily, EA's Victorian counterpart) begin to merge, leaving the reader, as well as the book's author, rather confused as to whether the accounts are truly autobiographical or whether EA has managed to seamlessly morph from true-life tale to extremely well-researched historical fiction.\n\n&quot;The Asylum...&quot; is not all gloom and doom however. It is a reality-bending thriller as well as a profoundly empowering tale of suffering, sisterhood, and revenge that culminates in what is perhaps one of the most suspenseful cliff-hangers of all time. The book's colorful cast of characters (diabolical doctors, mental patients, and the talking plague rats and blood-sucking leeches that fans of EA's music are already familiar with) thoroughly entertain, educate, and engross the reader with prime movie material. &quot;The Asylum for Wayward Victorian Girls,&quot; will leave fans shocked and readers everywhere gasping for air.\n\nEach full-color page of this beautifully designed 266 page eBook is positively packed with hand written memoirs, fanciful paintings, and sketches of the Asylum's inhabitants. In perhaps the most perverse twist of all, this Rated R publication is cleverly disguised as a high-end children's activity book, complete with interactive elements including notes, craft patterns, and reader quizzes designed both to disturb and delight. This monumental show of literary and artistic talent demands a place on your tea table as well as on your nightstand, although, readers, take care -- you'll never think of your doctor in quite the same way again.\n\nPrepare yourself to enter a world most pray never to visit. But beware: It is much easier to get into the Asylum than it is to get out...","torrent":{"xt":"urn:btih:c47a3f4c0b64f9cbd9bb5dd6c8edf7450ca6cced","amp;dn":"%26quot%3BThe+Asylum+for+Wayward+Victorian+Girls%26quot%3B+by+Emilie+Aut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c47a3f4c0b64f9cbd9bb5dd6c8edf7450ca6cced","infoHashBuffer":{"type":"Buffer","data":[196,122,63,76,11,100,249,203,217,187,93,214,200,237,247,69,12,166,204,237]},"announce":[],"urlList":[]}}