{"title":"Marcin Mortka - Karaibska Krucjata [PL]","uid":13528590,"size":960121297,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c50859b6c456a74244d275c190cdca98fae3ef47&amp;dn=Marcin+Mortka+-+Karaibska+Krucjata+%5BPL%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"everdarksoul","files":31,"time":1455405892,"description":"Paczka audiobook'ów dwóch powieści Marcina Mortki - &quot;Płonący Union Jack&quot; i &quot;La Tumba De Los Piratas&quot; - składających się na cykl-dylogię pt. &quot;Karaibska Krucjata&quot;. Jest to znakomite połącznie humorystycznego fantasy z powieścią awanturniczo-przygodową, osadzoną w nawdzięczniejszym chyba temacie marynistycznym tego gatunku - czyli opowieściami o piratach. Porywająca przygoda i kupa śmiechu!\r\n_______________________________________________________________\r\nDane:\r\n\r\nKaraibska Krucjata 1- 495 MB / 15 plików / czas: 12:01:03 / tytuł: Płonący Union Jack\r\nKaraibska Krucjata 2- 419 MB / 13 plików / czas: 10:09:29 / tytuł: La Tumba De Los Piratas\r\n\r\nobydwie części zapisane są w formacie MP3 jakości 96 Kbps / czyta: Andrzej Hausner\r\n_______________________________________________________________\r\nOpisy:\r\n\r\nKaraibska Krucjata 1 - Płonący Union Jack - zarys fabuły:\r\nKapitanowi Williamowi O'Connorowi - dowódcy fregaty &quot;Magdalena&quot; - niewiele można zarzucić jako człowiekowi czy żeglarzowi. Może jedynie to, że bez przerwy się na wszystkich obraża... I że nie słucha dobrych rad... I że jest zbyt szlachetny, by wziąć się do piractwa i zbyt rozwydrzony, by grzecznie służyć w Royal Navy... I że ciągle nie chce wywalić z załogi tego cholernego kuka - Butchera. A nade wszystko - że bez przerwy pakuje siebie, okręt i załogę w tarapaty... Rzadki okres spokoju w życiu Williama przerywa wieść, że oficjalnie uznany za zmarłego hrabia Christopher de Lanvierre - ostatni prawdziwy pirat karaibski - żyje i ma się świetnie... W międzyczasie jego kamrat - de Guilliera - próbuje zająć &quot;Magdalenę&quot; - a przy okazji i samo Port Royal... Billy O'Connor siłą rzeczy jest pierwszym, który staje im obu na drodze. Zwyczajowe tarapaty zamieniają się w istną zawieruchę - dość rzec, że Billy'ego czekają: boje z piratami, ratowanie czci pięknych dam, odsiecz dla oblężonego miasta, wywołanie pomniejszej wojny oraz ...najprawdziwsza krucjata.\r\nRozwiązywanie tajników intrygi de Lanvierre'a nie jest jednak prostym zadaniem, gdy ma się w załodze maniakalnego cieślę, artylerzystę-piromana, straszliwego kuka i chór klnących z wprawą papug - a po pokładzie szwenda się ...diabeł morski. Na szczęście Billy zawsze może liczyć na swych dwóch przyjaciół - pierwszego oficera, Vincenta Fowlera i dowódcę piechoty morskiej, Edwarda Love. Ich pomoc (oraz zdrowy rozsądek) stwarzają cień szansy, że &quot;Magdalena&quot; ze swą załogą i kapitanem jakoś wybrną cało z najgorszej nawet opresji...\r\n\r\nKaraibska Krucjata 2 - La Tumba De Los Piratas - zarys fabuły:\r\nŻycie kapitana Williama O'Connora znów układa się nie tak jak powinno... Wciąż nie wyrzucił z załogi kuka Butchera i nadal wykazuje odporność na wszelkie rozsądne rady. Co gorsza, piraci Szalonego Hrabiego (Christophera de Lanvierre), choć pokonani na Barbados, tańczą na ruinach kolejnych angielskich miast, a diabły morskie - jak na złość - zaczynają się mnożyć... Powodowany chorobliwą szlachetnością O'Connor rzuca wyzwanie de Lanvierre'owi i jego krwiożerczym stronnikom - lecz nie wie, że los szykuje dla niego pułapkę. Dzielnego kapitana fregaty &quot;Magdalena&quot; czeka tym razem: gra w kości z diabłem morskim, walka o duszę hiszpańskiego admirała, gościna u piratów, malutkie trzęsienie ziemi, zmagania z Czarnym Szkwałem, kilka beczek malagi - oraz najdzikszy abordaż w historii wojen morskich! Tymczasem myśli O'Connora przesłania postać powabnej Manueli - która jednakże bynajmniej sobie nie życzy, by ktokolwiek o niej marzył... &quot;La Tumba de los Piratas&quot; - kontynuacja powieści &quot;Płonący Union Jack&quot; - to niezwykła, pełna brawurowych przygód wyprawa na południowe morza - Karaibska Krucjata ponownie nabiera tempa, niczym budzący się sztorm","torrent":{"xt":"urn:btih:c50859b6c456a74244d275c190cdca98fae3ef47","amp;dn":"Marcin+Mortka+-+Karaibska+Krucjata+%5BPL%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c50859b6c456a74244d275c190cdca98fae3ef47","infoHashBuffer":{"type":"Buffer","data":[197,8,89,182,196,86,167,66,68,210,117,193,144,205,202,152,250,227,239,71]},"announce":[],"urlList":[]}}