{"title":"Parliament - Up For The Down Stroke .flac files","uid":6327318,"size":388004857,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c542a985e91293a6783350c7fe007fd8e7e81d08&amp;dn=Parliament+-+Up+For+The+Down+Stroke+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ulikes","files":18,"time":1303153643,"description":"Up For the Down Stroke was the first album of the re-worked Parliament. It layed the foundation for some of the weirder and funkier things to come. It has some classic songs, but some are rather dull.\n\nThe title track is a catchy tune that is great to hear live. The horns add great depth to the repetitive chants. This is probably one of the most funky songs on the album, and it is obvious that later albums spawned from this sound.\n\nTestify is a rework of The Parliament's first single &quot;I Just Wanna Testify&quot;. It has been redone and now it is a classic masterpiece. The singing is superb and the subtle horns in the background add a lot to it. It is a lot of fun to sing along to - but it isn't that great for dancing.\n\nThe Goose is a 9 minute long epic song. It is a love song with a slower beat, but not quite R&amp;B. The singing is pretty layed back but still brilliant. It has one of the most memorable lyrics &quot;I'm as happy as a monkey with a peanut machine&quot; - I love that line. It does, however, stretch on too long - some of the instrumental and shouts could have been left out.\n\n&quot;I Can Move You If You Let Me&quot; is a short, light, and very funky and catchy tune. It sounds almost reminiscent of Bootsy's sound - it is a highlight of the album.\n\n&quot;I Just Got Back&quot; is just plain amazing song. Many people get turned off of it because of the oddness of the whistling. It is just singing with brilliant whistling. It is one of the most beautiful songs that I have ever heard. I overlook the rest of the CD often because I love this song so much. I swear I am in a state of absolute peace and euphoria every time I listen to it. You have never heard George Clinton sound so good. You must hear it.\n\n&quot;All Your Goodies Are Gone&quot; is a slow song, but it has very good singing. It is similar in sound to &quot;The Goose&quot;, but I like this better than The Goose.\n\n&quot;Whatever Makes You Feel Good&quot; is a very dull song. It is slow like some of the others, and the soul sound to it is way too overpowering. It sounds very unfunky.\n\n&quot;Presence Of A Brain&quot; is a great sound that is very close in sound to Eddie Hazel's brilliant works on Funkadelic's albums. The singing is great, and the keyboarding, bass, and guitar, is all superb. Another highlight.\n\nAll in all, Up For The Down Stroke is a must have for Parliament fans. If you are just starting your P-Funk collection, I don't recommend starting with this one, unless you are coming from an R&amp;B background. If you are familiar with P-Funk, don't pass this one up just because it is their first album - I think you will all love it. \n\nTrack Listing:\n1. Up For The Down Stroke (Album Version)\t5:08\n2. Testify (Album Version)\t3:45\n3. The Goose\t9:09\n4. I Can Move You (If You Let Me)\t2:44\n5. I Just Got Back\t4:29\n6. All Your Goodies Are Gone\t5:03\n7. Whatever Makes Baby Feel Good\t5:56\n8. Presence Of A Brain\t3:18\nBonus tracks:\n9. Up For The Down Stroke (Alternate Spoken Rap Version)\t5:39\n10. Testify (Alternate Version)\t4:03\n11. Singing Another Song\t(Previously Unreleased) 3:04\n\nEnjoy and please seed!!!\n","torrent":{"xt":"urn:btih:c542a985e91293a6783350c7fe007fd8e7e81d08","amp;dn":"Parliament+-+Up+For+The+Down+Stroke+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c542a985e91293a6783350c7fe007fd8e7e81d08","infoHashBuffer":{"type":"Buffer","data":[197,66,169,133,233,18,147,166,120,51,80,199,254,0,127,216,231,232,29,8]},"announce":[],"urlList":[]}}