{"title":"Drake/Trey Songz - Successful [HQ] [balleron24z]","uid":5101584,"size":123233350,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c581b1770242f265bef8dd91394a3bc8c819fdbb&amp;dn=Drake%2FTrey+Songz+-+Successful+%5BHQ%5D+%5Bballeron24z%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"balleron24z","files":-1,"time":1254021719,"description":"Hello again.  So yea, first let me start by saying that you assholes aren't nice enough to just say thanks for the upload or appreciate your work.  Instead you go and bitch about me having a watermark on my video....or rather a logo. A fucking logo, whoopteedoo.  MTV DOES THAT SHIT TOO YOU GONNA SUE EM?  NOPE  Go suck a fucking dick seriously.  Its a video.  Want a better version?  GO GET IT YOUR DAMN SELF!!!!\n\nThis is the HQ release of &quot;Successful&quot; by Drake featuring Trey Songz.  This is some real shit, Drake is the most lyrical and flowing rappers of this time.  He's already major, and hes on some real shit.  Good video, fits the song really well.\n\nI ripped this from MTV (hehehe) so the quality is slightly better than an HQ YT video. Codec for video is DivX @ 3500kbps Reso: 1240x620 and codec for audio is MP3 @ 160kbps 48000khz.  I initially captured the video with no audio (stupid Vista stereo mix lol) but that was good because it uses more cpu to capture audio in the process, resulting in jittery video capture.  I then used TMPGEnc 4.0 Xpress to add the mp3 audio, and re-encoded the video with DivX and MP3 audio.  Result looks better than the HD version that Drake has on YT.  This is NOT HD, just to be clear.  I upscaled so it would retain quality.  Yippee for good quality :)\n\nBayimg Screenshot Generation: http://bayimg.com/fAECaAACC\nThe big image is a 75% scale of the original resolution. Hopefully thats enough proof as to what the video looks like.  Hope you like :)","torrent":{"xt":"urn:btih:c581b1770242f265bef8dd91394a3bc8c819fdbb","amp;dn":"Drake%2FTrey+Songz+-+Successful+%5BHQ%5D+%5Bballeron24z%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c581b1770242f265bef8dd91394a3bc8c819fdbb","infoHashBuffer":{"type":"Buffer","data":[197,129,177,119,2,66,242,101,190,248,221,145,57,74,59,200,200,25,253,187]},"announce":[],"urlList":[]}}