{"title":"Sword Of The Samurai [PS2] [PAL]","uid":5477111,"size":631535320,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c5cc043a66aa091516f4218d39b858fadb02b2d5&amp;dn=Sword+Of+The+Samurai+%5BPS2%5D+%5BPAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thenoobish","files":-1,"time":1270207906,"description":"Language: English\n\n\nSword of the Samurai is a story-driven sword fighting game that allows players to create a character and train their fighter in a variety of fighting techniques as they work their way to finally become the ultimate Bushido Master. Players will experience their character's growth as they develop their own sword-fighting style and learn new skills by receiving authentic advice and instruction from expert Dojo Masters. Players will fight multiple opponents including 30 of the most famous Japanese sword-fighting grandmasters, going on a variety of missions to learn new sword fighting skills and amass a collection of more than 100 authentic swords with individual statistics. Sword of the Samurai is the ultimate sword fighting game, featuring awesome combat in a feudal Japanese atmosphere.\n\n    * Develop a unique fighter from appearance to individual skills and sword fighting style with a combination of various defense and attack stances\n    * Utilize a variety of sword mastery fighting styles and strategies, including direct attacks, parries and other sword techniques\n    * Fight multiple opponents simultaneously - one versus multi opponents or traditional one-on-one scenarios\n    * Take on missions and fight in tournaments, including assassination, defend, rescue, and guard and protect\n    * Fight against 30 famous, historical Japanese sword masters with accurately modelled weapons and realistic sword techniques all based on real Japanese sword schools\n\n\n\nDo you missing a game? Write a comment with the game you want and I will try to upload that game.","torrent":{"xt":"urn:btih:c5cc043a66aa091516f4218d39b858fadb02b2d5","amp;dn":"Sword+Of+The+Samurai+%5BPS2%5D+%5BPAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5cc043a66aa091516f4218d39b858fadb02b2d5","infoHashBuffer":{"type":"Buffer","data":[197,204,4,58,102,170,9,21,22,244,33,141,57,184,88,250,219,2,178,213]},"announce":[],"urlList":[]}}