{"title":"The Beatles - The Beatles (White Album) (1968) WMA320","uid":6092806,"size":232282534,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5d45cfbca59b5aafd18e19a7c112f89c60d78dc&amp;dn=The+Beatles+-+The+Beatles+%28White+Album%29+%281968%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294633876,"description":"There are a few albums from the rock era that I feel I've been in a relationship with since the first day I got them. &quot;The Beatles&quot; is one of those albums. I found it under my Christmas tree in 1968, and I've been engaged with it at some level ever since. It is not the best Beatles album, objectively; nor is it my favorite. But it has always compelled my attention. \nAt the time it came out, I was 12, but even then it was clear that we were no longer in Pepperland or on a Magical Mystery Tour. This album wasn't yet more &quot;progress&quot; toward some new musical form. Musically, it embraced values never before associated with the Beatles as I understood them: Parody, pastiche, rock and roll revivalism, music-hall nostalgia, avant-garde experimentation, political agitation, intimate confession, trivial nonsense. It is, simply, a series of highly personal statements from the three songwriters, coalescing around no particular theme other than the right to personal expression. \n\n&quot;The Beatles&quot; is not, to me, &quot;the sound of the Beatles breaking up.&quot; That's the storyline a lot of Beatle historians apply to this album. If they're basing this judgement on the fact that the individual songwriters' imprints are on each song, you'd have to argue that the breakup began much earlier, around the time of &quot;Beatles for Sale&quot; or &quot;Help!&quot; Lennon-McCartney were rarely a songwriting &quot;team&quot; in the sense of George and Ira Gershwin. Their partnership was always about strategy, i.e. how to ensure that third-rate songs would not be included on albums just for the sake of fairness. &quot;The Beatles&quot; instead simply shows the evolution of each of the three songwriters (on this album, George emerges dramatically) as they each embraced new musical ideas and applied their life experiences to their art. Having helped break all the molds for what was acceptable songwriting in their previous work, they each now proceeded to take full advantage of the freedom they'd won. Some of the dumber cuts on &quot;The Beatles&quot; demonstrate, perhaps, the expression &quot;freedom's just another word for nothing left to lose.&quot; Paul, in particular, seemed frightened to step out too often without the crutch of some existing form that he could parody or pay tribute to, i.e. &quot;Honey Pie,&quot; &quot;Back in the USSR&quot; or &quot;Rocky Racoon.&quot; But, while you can say that, you have to acknowledge that in this massive album, there are perhaps half a dozen Paul songs that are among his best and most original: &quot;I Will,&quot; &quot;Blackbird,&quot; &quot;Mother Nature's Son,&quot; &quot;Helter Skelter&quot; for four examples. \n\nLennon's direction was to become more nakedly confessional, as befits someone who was dealing with such turbulent emotions at the time. He gives us some of his most beautiful songs, like &quot;Dear Prudence,&quot; and some of his most intense, like &quot;I'm So Tired,&quot; &quot;Revolution,&quot; &quot;Yer Blues,&quot; and &quot;Sexy Sadie.&quot; Often, as in &quot;The Continuing Story of Bungalow Bill,&quot; &quot;Glass Onion,&quot; or &quot;Everybody Has Something to Hide Except for Me and My Monkey,&quot; he seems to be writing in code, and that sense of allusiveness gives the album much of its cracked character. And of course, he's the guy who assembled the collage, &quot;Revolution 9,&quot; which is to rock and roll what &quot;Finnegans Wake&quot; is to English literature--a dream that floats between meaning and nothingness. \n\nGeorge seems to be captured here in a moment of great self-discovery as an artist; you can hear his talent finally come together in &quot;While My Guitar Gently Weeps,&quot; which I remember at age 12 was to my ears the best thing on the album--and still seems to be so. Prior to the White Album, he had these cautious little songs on the early albums, and then embraced India, which while sometimes satisfying seemed weird and out of place. His songs here sets the stage for &quot;Something,&quot; &quot;Here Comes the Sun&quot; and then his monumental early solo work. At age 12, I thought &quot;Long, Long, Long&quot; was a emotional powerhouse--and I still do.\n\nA few months after I got &quot;The Beatles,&quot; the Charles Manson murders took place, and eventually the DA made the case that somehow, insanely, the murders were inspired by songs on this album. Around the same time, the media were full of bizarre speculation that Paul McCartney was dead, and that clues were all over this album. It's no accident that half-insane people might mine &quot;The Beatles&quot; for hidden messages and evidence of conspiracies. The world it depicts is strange and almost claustrophobic--all the more so for its haphazard approach and its odd switches in tone from childish delight to fiendish paranoia. But even those of us who live normal lives and dream normal dreams can acknowledge that &quot;The Beatles&quot; has a hold on your consciousness that is unlike anything else the group did, and unlike anything else that came out of the rock era. \n\nby John Stodder &quot;a.k.a. Juan La Princi&quot;\n\nTRACKLIST:\nDisc 1:\n01 - Back In The U.S.S.R..wma                                    \n02 - Dear Prudence.wma                                           \n03 - Glass Onion.wma                                             \n04 - Ob-La-Di, Ob-La-Da.wma                                      \n05 - Wild Honey Pie.wma                                          \n06 - The Continuing Story Of Bungalow Bill.wma                   \n07 - While My Guitar Gently Weeps.wma                            \n08 - Happiness Is A Warm Gun.wma                                 \n09 - Martha My Dear.wma                                          \n10 - I'm So Tired.wma                                            \n11 - Blackbird.wma                                               \n12 - Piggies.wma                                                 \n13 - Rocky Raccoon.wma                                           \n14 - Don't Pass Me By.wma                                        \n15 - Why Don't We Do It In The Road.wma                          \n16 - I Will.wma                                                  \n17 - Julia.wma       \n\nDisc 2:\n01 - Birthday.wma                                                          \n02 - Yer Blues.wma                                                         \n03 - Mother Nature's Son.wma                                               \n04 - Everybody's Got Something To Hide Except Me And My Monkey.wma         \n05 - Sexy Sadie.wma                                                        \n06 - Helter Skelter.wma                                                    \n07 - Long, Long, Long.wma                                                  \n08 - Revolution 1.wma                                                      \n09 - Honey Pie.wma                                                         \n10 - Savoy Truffle.wma                                                     \n11 - Cry Baby Cry.wma                                                      \n12 - Revolution 9.wma                                                      \n13 - Good Night.wma  \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:c5d45cfbca59b5aafd18e19a7c112f89c60d78dc","amp;dn":"The+Beatles+-+The+Beatles+%28White+Album%29+%281968%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d45cfbca59b5aafd18e19a7c112f89c60d78dc","infoHashBuffer":{"type":"Buffer","data":[197,212,92,251,202,89,181,170,253,24,225,154,124,17,47,137,198,13,120,220]},"announce":[],"urlList":[]}}