{"title":"HTML5 Game development with ImpactJS - Davy Cielen &amp; Arno Me","uid":8729588,"size":7446208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c69593cabbb0e4b07d15731aae95a2acb28c65c7&amp;dn=HTML5+Game+development+with+ImpactJS+-+Davy+Cielen+%26amp%3B+Arno+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374567723,"description":"What you will learn from this book\n\nSet up a game development environment on your computer\nFind and use resources such as graphics, music, and sound effects\nIntegrate the Box2D engine in ImpactJS to make a side scroller game with realistic physics\nBuild a top-down game using solely the ImpactJS engine\nOptimize and prepare your games for computer screens and mobile browsers\nTurn your HTML5 game into an app for Google Play, Apple, and Chrome app stores\n\nIn Detail\n\nImpactJS is a JavaScript library specially geared towards building 2-dimensional games. It is intuitive and versatile and allows the game developer to get results in no time while keeping an easy overview when games grow more complex. Games built with ImpactJS can be published on websites and even as an app on both Android and iOS.\n\nWith &quot;HTML5 Game Development with ImpactJS&quot;, building games for the Web and app markets has never been so easy. Using the ImpactJS JavaScript engine, you only need this book and basic knowledge of JavaScript in order to build and publish your own game.\n\n&quot;HTML5 Game Development with ImpactJS&quot; allows a single person to build a full game. Using only basic knowledge of JavaScript and this book, you will end up publishing a 2D game for the entire world to enjoy. You will learn to set up a working environment and gather all the necessary tools and resources your game needs. Develop both a top-down and a side scroller game, integrate physics such as gravity, and deploy your game as an app or to your website.\n\nProduct Details\n\nISBN-13: 9781849694568\nPublisher: Packt Publishing\nPublication date: 3/26/2013\nPages: 304\n\nAbout The Authors\n\n\nDavy Cielen\nDavy Cielen is the co-owner of An Ostrich On Mars, a graphic design and marketing agency with a special branch of game design, graphics, and game development. He has a background in analytics, marketing, and mathematics. Davy is seriously in love with game design and web technologies.\n\nArno Meysman\nArno Meysman is the co-owner of An Ostrich On Mars, a graphic design and marketing agency with a special branch of game design, graphics, and game development. Arno Meysman is a specialist at customer and web analytics using statistics and has always been very interested in game development, including graphical design. He started using the ImpactJS engine for hobby projects when it was first released in 2010.\n\nPLEASE SEED","torrent":{"xt":"urn:btih:c69593cabbb0e4b07d15731aae95a2acb28c65c7","amp;dn":"HTML5+Game+development+with+ImpactJS+-+Davy+Cielen+%26amp%3B+Arno+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c69593cabbb0e4b07d15731aae95a2acb28c65c7","infoHashBuffer":{"type":"Buffer","data":[198,149,147,202,187,176,228,176,125,21,115,26,174,149,162,172,178,140,101,199]},"announce":[],"urlList":[]}}