{"title":"Guns N' Roses - Appetite For Destruction (1987) WMA320","uid":6035204,"size":139016948,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c6aed7635f9826143ec02abd03e2ed7fa5fd4b71&amp;dn=Guns+N%5C%27+Roses+-+Appetite+For+Destruction+%281987%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292207985,"description":"In 1987, Guns N' Roses exploded onto the national scene with &quot;Appetite for Destruction.&quot; It was their first and best album. On the first track, &quot;Welcome to the Jungle,&quot; Slash's beginning riffs and Axl's eerie howl set the stage for the rest of the songs. &quot;Jungle&quot; is a no-holds-barred look at the dark, drug-infested world beneath the glitz-and-glamour exterior of Los Angeles. &quot;It's So Easy&quot; shows the heart of the band: Axl's interplay with Slash and Izzy Straldlin. &quot;Night Train&quot; is another exploration of the sex, drug, and alcohol-fueled world of an L.A. club band at the time that Guns was coming up. &quot;Out Ta Get Me&quot; is the first glimpse of Axl's paranoia and self-absorption, which would ultimately lead to the band's downfall. &quot;Mr. Brownstone&quot; is a song about (surprise!) heroin, and with the lyrics &quot;the show usually starts around 7. We go on stage around 9,&quot; it would prove prophetic about the chaotic nature of Guns N' Roses and their live concerts. &quot;Paradise City&quot; begins in (and the choruses return to) a Southern-Rock style, but is mostly the blues-and-punk-flavored hard rock that made them famous.\n&quot;My Michelle&quot; is the darkest song Guns N' Roses ever produced. It's the semi-true story of a girl trying to grow up in L.A. without any support from her family, and then falling prey to the demons of wanton sex and drugs. &quot;Think About You&quot; is one of the most under-rated Guns songs. It's a sweet ballad about first love, but set to a hard-rock beat. Not a power-ballad, but a great song that never got the acclaim it deserved. &quot;Sweet Child O' Mine&quot; is another love song set to a rock beat, and showcases Slash's unique talents as a guitarist probably better than any other song on the record. &quot;You're Crazy&quot; shows the band's punk influences. &quot;Anything Goes&quot; is a straight rocker about a mutually self-destructive relationship. The record ends with &quot;Rocket Queen,&quot; one of their best, and least appreciated. Slash and Izzy's guitar greatness are on display here probably better than anywhere else in the album. &quot;Rocket Queen&quot; also shows Axl's vocal and song writing talent. It starts as a rocker about a virile young stud (probably Axl) and an older woman. But after the famous interlude, (if you don't know what I mean, find out for yourself,) the song switches gears seamlessly, to a mellow ballad about friendship and love through tough times. It's a truly amazing song.\n\nThe cassette version of &quot;Appetite&quot; is the first album I ever bought. Time has not diminished the impact of these songs for me. Guns N' Roses are my personal favorite band, and &quot;Appetite&quot; is their high point. As they say, once you reach a peak, it's all downhill, but that's not important. What is important is to remember them as what they were: a definitively groundbreaking band. \n\nby &quot;bulldog51&quot;\n\nTRACKLIST:\n\n01 - Welcome To The Jungle.wma                                   \n02 - It's So Easy.wma                                            \n03 - Nightrain.wma                                               \n04 - Out Ta Get Me.wma                                           \n05 - Mr- Brownstone.wma                                          \n06 - Paradise City.wma                                           \n07 - My Michelle.wma                                             \n08 - Think About You.wma                                         \n09 - Sweet Child O' Mine.wma                                     \n10 - You're Crazy.wma                                            \n11 - Anything Goes.wma                                           \n12 - Rocket Queen.wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:c6aed7635f9826143ec02abd03e2ed7fa5fd4b71","amp;dn":"Guns+N%5C%27+Roses+-+Appetite+For+Destruction+%281987%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6aed7635f9826143ec02abd03e2ed7fa5fd4b71","infoHashBuffer":{"type":"Buffer","data":[198,174,215,99,95,152,38,20,62,192,42,189,3,226,237,127,165,253,75,113]},"announce":[],"urlList":[]}}