{"title":"Confessions Of A Teenage Drama Queen - Soundtrack 2004","uid":9403627,"size":95877087,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c7d2ab2e831b7fe0ee3b0d65ead746a0ce55f608&amp;dn=Confessions+Of+A+Teenage+Drama+Queen+-+Soundtrack+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388113181,"description":"Source: 2004 CD\n\nBy Danielle VINE VOICE\nFormat:Audio CD\nI saw &quot;Confessions of a Shopaholic&quot; on its opening weekend and while watching the movie, I kept noticed the fantastic songs that they were using. I knew that I had to buy the soundtrack and I'm so glad that I did. Most of the songs on the cd and of the pop/dance variety and fit perfectly with the mood of the movie.\n\n1. Accessory by Jordyn Taylor. 5/5 This is kind of Becky's theme. It's cool and very hip sounding. It makes you want to get up and dance.\n\n2. Fashion by Lady Gaga. 5/5 Lady Gaga is definitely the It Singer of 2009. She always has great sounding songs and this is no exception. The beginning of the song kind of reminds me of &quot;LoveGame&quot; off her debut album.\n\n3. Blue Jeans by Jessie James. 5/5 I love the beat of this song, especially in the middle of the song. The song is obviously about blue jeans.\n\n4.Uncontrollable by Adrienne Bailon. 4/5 It's not one of my favorite songs on the soundtrack but it's still okay.\n\n5. Calling you by Kat DeLuna. 5/5 My favorite song on the soundtrack. I loved it when I heard it in the movie and now that I have the soundtrack, it's the song that I'll put on repeat.\n\n6.Stuck with Each Other by Shontelle feat. Akon 3/5 It's an okay song but I'm not really a fan of Akon.\n\n7. Unstoppable by Kat DeLuna. 4/5 Not as good as &quot;Calling You&quot; but still a good song to have on the soundtrack\n\n8. Big Spender by Adrienne Bailon 5/5 I really like this one. It's got a good beat to dance to\n\n9. Bad Girl by Pussycat Dolls 5/5 Another great song. Love them or hate them, the Pussycat Dolls can come out with some of the most catchiest songs\n\n10. Again by Natasha Bedingfield 5/5 The first real slow song on the album. It's got great lyrics and I like it\n\n11. Takes time to Love by Trey Songz 3/5 An okay song but kind of unforgettable compared to the other songs on the cd\n\n12. Girls Just Want to Have Fun by Greg Laswell 5/5 Seeing the movie, it took me a minute to realise what song this guy was covering. It sounds really different when it's a slow song but it works.\n\n13. Don't Forget About Me by Macy Gray 4/5 I'm actually not a Macy Gray fan in the slightest but I actually like this one from her.\n\n14. Shopaholic Suite by James Newton Howard 4/5 The cd ends on an instumental note and it features some of the instumental music moments from the film.\n\nI definitely recommend this cd to anyone who saw the movie and enjoyed any of the songs in it but also to anyone who likes pop music because this cd is full of them. I'm thinking this soundtrack will be in my CD player for a long time.","torrent":{"xt":"urn:btih:c7d2ab2e831b7fe0ee3b0d65ead746a0ce55f608","amp;dn":"Confessions+Of+A+Teenage+Drama+Queen+-+Soundtrack+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7d2ab2e831b7fe0ee3b0d65ead746a0ce55f608","infoHashBuffer":{"type":"Buffer","data":[199,210,171,46,131,27,127,224,238,59,13,101,234,215,70,160,206,85,246,8]},"announce":[],"urlList":[]}}