{"title":"William Taubman - Nikita Khrushchev [2000][A]","uid":10462209,"size":1685563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c82e2c8c098dbdb57dad1ec7c0fe6aabe81c9358&amp;dn=William+Taubman+-+Nikita+Khrushchev+%5B2000%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1404145271,"description":"Description\nProduct Details\nBook Title: Nikita Khrushchev\t\nBook Author: Alla Bashenko (Author, Translator), Professor William Taubman (Editor), Sergei Khrushchev (Editor), Professor Abbott Gleason (Editor), David Gehrenbeck (Translator), Eileen Kane (Translator)\nHardcover: 464 pages\nPublisher: Yale University Press; First Edition edition (May 2000)\nLanguage: English\nISBN-10: 0300076355\nISBN-13: 978-0300076356\n\n===================================================================================\nBook Description\nPublication Date: May 2000\nWhat was known about Soviet premier Nikita Khrushchev during his career was strictly limited by the secretive Soviet government. Little more information was available after he was ousted and became a 'non-person' in the USSR in 1964. This pathbreaking book draws for the first time on a wealth of newly released materials - documents from secret former Soviet archives, memoirs of long-silent witnesses, the full memoirs of the premier himself - to assemble the best-informed analysis of the Khrushchev years ever completed. The contributors to this volume include Russian, Ukrainian, American, and British scholars; a former key foreign policy aide to Khrushchev; the executive secretary of a Russian commission investigating Soviet-era repressions and rehabilitations; and Khrushchev's own son Sergei. The book presents and interprets new information on Khrushchev's struggle for power, public attitudes toward him, his role in agricultural reform and cultural politics, and such foreign policy issues as East-West relations, nuclear strategy, and relations with Germany.\nIt also chronicles Khrushchev's years in Ukraine where he grew up and began his political career, serving as Communist party boss from 1938 to 1949, and his role in mass repressions of the 1930s and in destalinisation in the 1950s and 1960s. Two concluding chapters compare the regimes of Khrushchev and Gorbachev as they struggled to reform Communism, to humanise and modernise the Soviet system, and to answer the haunting question that persists today: is Russia itself reformable?\n\n===================================================================================\nEditorial Review\nFrom Library Journal\nUntil now, Nikita Khrushchev has been largely regarded as a historical bridge from Stalin to Gorbachev. This book, edited by Taubman (Bertrand Snell Professor of Political Science at Amherst Coll.), Khrushchev's son Sergei (Brown Univ.), and others sets out to clarify the role Khrushchev played in advancing the USSR to superpower status. When Gorbachev lifted the stigma from the study of Khrushchev in the 1980s and state archives were opened, the operative question changed from why he failed to what made him the Soviet leader. In most recent work about Soviet history, such as Martin Malia's Russia Under Western Eyes (LJ 2/1/99), Gregory Freeze's Russia: A History (LJ 5/1/98), and Robert Service's A History of Twentieth-Century Russia (LJ 3/1/98), Khrushchev is given little space, so this book fills a void in Soviet studies. It lacks readability, however, as the writing varies from author to author. The subject matter is more or less interesting, depending on your knowledge of recent Soviet history. Recommended for Soviet history collections.\n-Harry Willems, Southeast Kansas Lib. System\n\n===================================================================================\nAbout the Author\nWilliam Taubman is Bertrand Snell Professor of Political Science at Amherst College. Sergei Khrushchev, son of Nikita Khrushchev, is senior fellow at the Thomas J. Watson Jr. Institute for International Studies at Brown University. Abbott Gleason is Keeney Professor of History at Brown University.\n===================================================================================","torrent":{"xt":"urn:btih:c82e2c8c098dbdb57dad1ec7c0fe6aabe81c9358","amp;dn":"William+Taubman+-+Nikita+Khrushchev+%5B2000%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c82e2c8c098dbdb57dad1ec7c0fe6aabe81c9358","infoHashBuffer":{"type":"Buffer","data":[200,46,44,140,9,141,189,181,125,173,30,199,192,254,106,171,232,28,147,88]},"announce":[],"urlList":[]}}