{"title":"Made in California - Art, Image and Identity 1900-2000 (Art Eboo","uid":10309652,"size":60752061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c846cedfd693041f3d7a7bba8da92dc870dd2335&amp;dn=Made+in+California+-+Art%2C+Image+and+Identity+1900-2000+%28Art+Eboo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1402166130,"description":"pdf / English / 2000 / 351 pages / 58 MB / LA County Museum of Art\n\nThis opulent and expansive volume, published in conjunction with the Los Angeles County Museum of Art's monumental exhibition Made in California: Art, Image, and Identity,1900-2000, charts the dynamic relationship between the arts and popular conceptions of California. Displaying a dazzling array of fine art and material culture, Made in California challenges us to reexamine the ways in which the state has been portrayed and imagined. Unusually inclusive, visually intriguing, and beautifully produced, this volume is a delight throughout--both in image and in text--and will appeal to anyone who has lived in, visited, or imagined California.\n\nDrawn from the exhibition, which gathers more than 1,200 artworks and pieces of ephemera from many public and private collections, Made in California is an image-driven look at the past century, featuring more than 400 works in a range of media, from painting, sculpture, prints, drawings, and photographs to furniture, fashion, and film. The book also includes more than 150 cultural artifacts such as tourist brochures, posters, labor union tracts, personal letters, and government reports that convey the richness and complexity of twentieth-century California. Arranged provocatively by theme, these objects take us on a visual tour of a state that was promoted as a bountiful paradise early in the century as a glamour capital by Hollywood in the 1920s and 1930s as a suburban utopia in the late '40s and '50s as a haven for counterculture in the '60s and '70s, and as a multicultural frontier in the '80s and '90s. The book's exploration of how these themes were reflected and contested in California's visual culture deepens our understanding of the state's artistic traditions as well as its fascinating history.\n\nThe volume is divided into five twenty-year sections, each including a narrative essay discussing the history of that era and highlighting topics particularly relevant to its visual culture. Two overarching themes emerge that have been crucial for how we imagine and understand California: first, the landscape, including both the natural and built environment, and second, the multifaceted relationships California has had with Latin America and Asia. Geographer Michael Dear has contributed a sweeping overview of the social history of California that examines the vibrant and sometimes turbulent conditions out of which the culture emerged. Essayist Richard Rodriguez closes the volume with a uniquely personal meditation on the Golden State.\n\nIncludes Ansel Adams, beat culture, Wallace Berman, Franz Bischoff, Black Panther party, celebrity photography, Judy Chicago, Chicano art movement, Chinese, counterculture, Richard Diebenkorn, Charles and Ray Eames, fashion industry, furniture design, Arnold Genthe, Rudi Gernreich, Charles Sumner and Henry Mather Greene, Childe Hassam, Divid Hockney, Hollywood, George Hurrell, identity, Japanese, landscape, Dorothea Lange, Los Angeles, Helen Lundeberg, Mexicans, Mission Myth, missions, modernism, motion picture industry, murals, Native Americans, Richard Neutra, Granville Redmond, Diego Rivera, Guy Rose, San Diego, San Francisco, Rudolph Schindler, Millard Sheets, Julius Shulman, David Alfaro Siqueiros, spiritualism, surburbia, television, tourists, William Wendt, Edward Weston, womenÊ¾s movement, xenophobia, Yosemite Valley, etc.","torrent":{"xt":"urn:btih:c846cedfd693041f3d7a7bba8da92dc870dd2335","amp;dn":"Made+in+California+-+Art%2C+Image+and+Identity+1900-2000+%28Art+Eboo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c846cedfd693041f3d7a7bba8da92dc870dd2335","infoHashBuffer":{"type":"Buffer","data":[200,70,206,223,214,147,4,31,61,122,123,186,141,169,45,200,112,221,35,53]},"announce":[],"urlList":[]}}