{"title":"Destroy All Humans [EUR][Multi5][Spanish][PS3][www.consolasatope","uid":6017303,"size":7778219800,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c8b5c7803d4b2331ee657e6908434bdbf833a9a7&amp;dn=Destroy+All+Humans+%5BEUR%5D%5BMulti5%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consolasatope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"consolasatope","files":54,"time":1291680000,"description":"El objetivo del juego, que consta de 30 misiones en modo historia, otras 20 secundarias y modo multijugador, es ir destruyendo y consiguiendo nuevas armas para que la invasiÃƒÂ³n de nuestro adorable Crypto sea llevada acabo con ÃƒÂ©xito.\n\nLas misiones incluyen cinco diferentes escenarios, abiertos puesto que las misiones pueden realizarse de manera no lineal, inspirados en ciudades como Hollywood, Las Vegas, Hong Kong y Paris.\n\nLa cÃƒÂ¡mara en tercera persona, los componentes de aventura y acciÃƒÂ³n, asÃƒÂ­ como una historia de ciencia ficciÃƒÂ³n y humor bizarro, le dan a Path of the Furon una identidad propia, con un apartado grÃƒÂ¡fico espectacular y escenas de video llenas de humor ÃƒÂ¡cido.\n\nEl modo multijugador permite combates uno contra uno a pantalla dividida y alguna misiÃƒÂ³n cooperativa, la mejor manera de probar nuevos efectos con los poderes alienÃƒÂ­genos y las variadas armas de que disponemos.\n\nLos integrantes de Sandblast Games han logrado traer un juego de la saga Destroy All Humans! Lleno de humor, dinÃƒÂ¡mica y opciones de destrucciÃƒÂ³n, aprovechando al mÃƒÂ¡ximo la potencia grÃƒÂ¡fica de las consolas y respetando las mecÃƒÂ¡nicas y el humor ÃƒÂ¡cido que siempre pregonaron.\n\nCon nuevos enemigos, destacando las nuevas batallas aÃƒÂ©reas, las cosas no serÃƒÂ¡n tan sencillas para Crypto mientras aprende a utilizar la psicokinesia y un inventario repleto de armas de destrucciÃƒÂ³n masiva, nunca los humanos estuvieron tan cerca de la erradicaciÃƒÂ³n como en esta oportunidad\n\n","torrent":{"xt":"urn:btih:c8b5c7803d4b2331ee657e6908434bdbf833a9a7","amp;dn":"Destroy+All+Humans+%5BEUR%5D%5BMulti5%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consolasatope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b5c7803d4b2331ee657e6908434bdbf833a9a7","infoHashBuffer":{"type":"Buffer","data":[200,181,199,128,61,75,35,49,238,101,126,105,8,67,75,219,248,51,169,167]},"announce":[],"urlList":[]}}