{"title":"John Prine...Souvenirs(2000)[FLAC]","uid":5967094,"size":338950877,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c8fd2c8cd49e00987b5fe72c6c59aca8c6840c9c&amp;dn=John+Prine...Souvenirs%282000%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":21,"time":1290145411,"description":"2000 Souvenirs: Fifteen New Recordings of Classic Songs    CD  ulfTone UTCD 023 \n\n1 Souvenirs   3:43 \n2 Fish and Whistle   3:00 \n3 Far from Me   5:08 \n4 Angel from Montgomery   5:07 \n5 Donald and Lydia   4:08 \n6 Christmas in Prison   3:36 \n7 Storm Windows   4:26 \n8 Grandpa Was a Carpenter   2:52 \n9 The Late John Garfield Blues   3:46 \n10 Blue Umbrella   3:53 \n11 Six O'Clock News   4:36 \n12 People Puttin' People Down   3:59 \n13 Sam Stone   4:38 \n14 Please Don't Bury Me   3:06 \n15 Hello in There   4:57 \n\n\n\nIn the liner notes to John Prine's 2000 album Souvenirs, he calls the songs he has recorded during his 30-year career &quot;faithful companions.&quot; They are indeed warm, friendly, and boldly intimate, whispering secrets to the listener -- but at the same time they are growing older and smoothing their youthful edge. In an effort to have his own master recordings of his favorite and most popular songs, Prine re-recorded 15 tracks for release in Germany (as he has always wanted to be popular in Germany), but upon hearing these re-recorded versions Oh Boy Records decided to release them in the U.S. (as Prine has always wanted to be popular there as well). The result is an interesting mix, wherein the historical stories (&quot;Grandpa Was a Carpenter,&quot; &quot;The Late John Garfield Blues&quot;) and rocking chair reminiscences (&quot;Angel From Montgomery&quot;) are recalled with a genuine wisdom of the years, but the songs tinged with Prine's signature cynical smirk (&quot;People Puttin' People Down,&quot; &quot;Please Don't Bury Me&quot;) have lost some of their cheeky, finger-pointing optimism and almost sound like grumbling. Along with other performers who have tried to regain access to their compositions by re-recording them (it seems everyone from Merle Haggard to Prince has lost original song rights at some point), John Prine's contemporary touches on these old favorites may provide new insights, but the new versions rarely surpass the originals. ~ Zac Johnson\n\nRecorded at The Cowboy Arms Hotel &amp; Recording Spa, Nashville, Tennessee.\n\nPersonnel: John Prine (vocals, acoustic guitar); Jason Wilber (electric guitar, mandolin); Phil Parlapiano (mandolin, accordion, piano, organ); Shawn Camp (fiddle); Paul Griffith (drums, shaker, tambourine).\n\nLiner Note Author: John Prine.\n\nRecording information: Cowboy Arms Hotel And Recording Spa, Nashville, TN (04/24/2000-04/26/2000); Jack's Tracks, Nashville, TN (04/24/2000-04/26/2000).\n\nPersonnel: John Prine (vocals, acoustic guitar); Jason Wilber (electric guitar, mandolin); Stu Basore (pedal steel guitar); Phil Parlapiano (mandolin, accordion, piano, Hammond B-3 organ); Shawn Camp (fiddle); Dave Jacques (acoustic &amp; electric basses); Paul Griffith (drums, shaker, tambourine); Pat McLaughlin (background vocals).\n\nUncut (2/01, p.92) - 4 stars out of 5 - &quot;...Like Kristofferson and Johnny Cash, he's singing better than ever...&quot;\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/09/23/john-prine/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/09/23/john-prine/&lt;/a&gt;","torrent":{"xt":"urn:btih:c8fd2c8cd49e00987b5fe72c6c59aca8c6840c9c","amp;dn":"John+Prine...Souvenirs%282000%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8fd2c8cd49e00987b5fe72c6c59aca8c6840c9c","infoHashBuffer":{"type":"Buffer","data":[200,253,44,140,212,158,0,152,123,95,231,44,108,89,172,168,198,132,12,156]},"announce":[],"urlList":[]}}