{"title":"[WatchingMyDaughterGoBlack] Alison Faye","uid":9466115,"size":1159024031,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c92417ce3959d82d3b9839716ce53370552e5b65&amp;dn=%5BWatchingMyDaughterGoBlack%5D+Alison+Faye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1389460353,"description":"[WatchingMyDaughterGoBlack] Alison Faye\n\nAlison Faye's father is in over his head with a bookie. Mr. Faye has a gambling problem and it's about to reach the boiling point-with his knees being the target of an angry collector. Mr. Faye is on the phone when Jack Napier comes to collect on some bets that didn't work in the old man's favor. Physical violence almost comes to fruition when Alison is caught by surprise at her father being manhandled. Alison's shock at dad's misfortune can only lead to her giving up the pussy for her elder's welfare. However, Mr. Faye would rather be in a wheelchair for the rest of his life than watch his angel getting fucked by a vindictive black cock......but she knows that this might snap him out of his gambling addiction. Alison's father gets a front row seat to the complete and utter destruction of his daughter's pussy. At the age of 18, Alison knows her father's history with gambling, and what better way to cure him than making him watch her get some big black cock? Jack takes full advantage of the situation by sliding his black python into the mouth of an eager slut. Mr. Faye nearly goes into cardiac arrest as the apple of his eye experiences 12 inches of angry, black dick. Alison's white pussy cashes the check her bad daddy continues to write with the bookies. Alison's enjoyment of that big black cock can only jam the dagger further into her daddy's heart and soul, but,of course, she cares not. Alison's father's ordeal comes to a merciful conclusion when he watches a big black cock spew its venom all over his little angel. A black cock slut loving angel.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=0boc5zjknozxe8t9w3mx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=0boc5zjknozxe8t9w3mx.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=ltpda006kbt99r0mvay2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=ltpda006kbt99r0mvay2.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c92417ce3959d82d3b9839716ce53370552e5b65","amp;dn":"%5BWatchingMyDaughterGoBlack%5D+Alison+Faye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c92417ce3959d82d3b9839716ce53370552e5b65","infoHashBuffer":{"type":"Buffer","data":[201,36,23,206,57,89,216,45,59,152,57,113,108,229,51,112,85,46,91,101]},"announce":[],"urlList":[]}}