{"title":"Family Guy Complete Season 11 (1-22)","uid":8517878,"size":1793765080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9604d3c70d1bd751e4cfded34673f33860b8e6b&amp;dn=Family+Guy+Complete+Season+11+%281-22%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sithblade123","files":44,"time":1369813415,"description":"Family Guy's eleventh season began airing on Fox on September 30, 2012.\n\nThe series follows the Griffin family, a dysfunctional family consisting of father Peter, mother Lois, daughter Meg, son Chris, baby Stewie and the family dog Brian, who reside in their hometown of Quahog.\n\nIn this season, the Griffins decide to climb Mount Everest (Into Fat Air); Lois has a mid-life crisis (Lois Comes Out of Her Shell); Meg falls for a boy who turns out to like her brother Chris (Friends Without Benefits); and Brian and Stewie leap into action after they discover the company owned by Lois' dad, Carter Pewterschmidt, has found the cure for cancer (The Old Man and the Big 'C'). The season also features the 200th episode of the series.\n\nFurther episode plots were revealed at Comic-Con 2012. Quagmire accidentally marries a hooker (The Giggity Wife), Peter becomes a meth dealer (Farmer Guy), and Chris moves in with Herbert (Chris Cross). Also, Brian and Stewie travel to Vegas by teleportation, but instead the device malfunctions and ends up cloning them, where two pairs of Brian and Stewie both go on a road trip to Vegas, with each pair having different experiences, in another 'Road to...' episode as the season finale (Roads to Vegas).\n\nA Valentine's Day episode aired on February 10, 2013, in which Stewie rounds up all of Brian's ex-girlfriends, who take delight in pointing out Brian's flaws (Valentine's Day in Quahog).\n\nThe episode &quot;Jesus, Mary and Joseph!&quot; was scheduled to air on December 16, 2012, but was replaced by a repeat of &quot;Grumpy Old Man&quot; out of sensitivity for the Sandy Hook Elementary School shooting. The episode aired the following week on December 23, 2012.\n\nGuest voices for this season include J. J. Abrams, Mark Burnett, Dick Wolf, Jon Hamm, Elizabeth Banks, Sandra Bernhard, Dan Castellaneta, Sharon Osbourne,Christina Milian, and Johnny Depp.\n\nThe season concluded with two episodes that aired on May 19, 2013.\n\nThe season will air in the UK and Ireland in July 2013.\n","torrent":{"xt":"urn:btih:c9604d3c70d1bd751e4cfded34673f33860b8e6b","amp;dn":"Family+Guy+Complete+Season+11+%281-22%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9604d3c70d1bd751e4cfded34673f33860b8e6b","infoHashBuffer":{"type":"Buffer","data":[201,96,77,60,112,209,189,117,30,76,253,237,52,103,63,51,134,11,142,107]},"announce":[],"urlList":[]}}