{"title":"Evelyn Waugh - Brideshead Revisited [96] Unabridged","uid":7788796,"size":505338347,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c9a9d82c03acca393db80333f19da328053b8b45&amp;dn=Evelyn+Waugh+-+Brideshead+Revisited+%5B96%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rambam1776","files":-1,"time":1351965134,"description":"Evelyn Waugh - Brideshead Revisited\n\nUnabridged, 96 kbps, Read by Jeremy Irons\n\nOverview\nAbout the Author\n\nEvelyn Waugh (1903-1966) was born into a publishing family in Hampstead, England, and educated at Oxford. After a brief stint as a schoolmaster, he turned to writing. His biography of Dante Gabriel Rossetti appeared in 1928, but it was his sensational first novel, Decline and Fall, published the same year, that set the course for his career. Waugh wrote sixteen novels, including The Loved One, Scoop, and Brideshead Revisited.\n\nEvelyn Waugh's best-loved novel and the basis for the PBS television production, Brideshead Revisited, the epic story of a great Catholic family in a doomed aristocratic age.\n\nEditorial Reviews\nPublishers Weekly\nIn this classic tale of British life between the World Wars, Waugh parts company with the satire of his earlier works to examine affairs of the heart. Charles Ryder finds himself stationed at Brideshead, the family seat of Lord and Lady Marchmain. Exhausted by the war, he takes refuge in recalling his time spent with the heirs to the estate before the war--years spent enthralled by the beautiful but dissolute Sebastian and later in a more conventional relationship with Sebastian's sister Julia. Ryder portrays a family divided by an uncertain investment in Roman Catholicism and by their confusion over where the elite fit in the modern world. Although Waugh was considered by many to be more successful as a comic than as a wistful commentator on human relationships and faith, this novel was made famous by a 1981 BBC TV dramatization. Irons's portrayal of Ryder catapulted Irons to stardom, and in this superb reading his subtle, complete characterizations highlight Waugh's ear for the aristocratic mores of the time. Fervent Anglophiles will be thrilled by this excellent rendition of a favorite; Irons's reading saves this dinosaur from being suffocated by its own weight.\n\nJohn K. Hutchens\n&quot;My theme,&quot; says the narrator in Evelyn Waugh's latest, his most carefully written and deeply felt novel, &quot; is memory, that winged host.' It has an almost romantic sense of wonder, together with the provocative, personal point of view of a writer who sees life realistically. The emotional tone and content of Brideshead Revisited are accordingly heightened beyond any Mr. Waugh has acheived before. Brideshead Revisted is Mr. Waugh' finest achievement.\n","torrent":{"xt":"urn:btih:c9a9d82c03acca393db80333f19da328053b8b45","amp;dn":"Evelyn+Waugh+-+Brideshead+Revisited+%5B96%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9a9d82c03acca393db80333f19da328053b8b45","infoHashBuffer":{"type":"Buffer","data":[201,169,216,44,3,172,202,57,61,184,3,51,241,157,163,40,5,59,139,69]},"announce":[],"urlList":[]}}