{"title":"Trailor Park Boys. ALl 7 seasons with extras!","uid":3884295,"size":13189111247,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9bcdbd97f9552cc78ae2d5ef9f5bc1432de8ca4&amp;dn=Trailor+Park+Boys.+ALl+7+seasons+with+extras%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"pbod153","files":60,"time":1194811389,"description":"How did Trailer Park Boys become reality?\n\nAfter the 1998 short Mike Clattenburg made which was loosely based on the characters of Ricky and Julian; and after the well-received low budget (or more accurately &quot;no budget&quot;) 72 minute movie called Trailer Park Boys which appeared at the Atlantic Film Festival in 1999. Clattenburg was approached by Producer Barrie Dunn. Barrie was passionate about a television series he saw buried in the original Trailer Park Boys movie. He was passionate about his vision he even called the series &quot;groundbreaking...&quot; together (along with Robb Wells and John Paul Tremblay) they brainstormed the outlines for thirteen, one-hour long episodes. In November of 1999 Dunn and Clattenburg traveled to Toronto to pitch the idea they were turned down by one network. But on a spur-of-the-moment decision, on their way back to the hotel room, they decided to cold call showcase. \n\nShowcase at the time was rumored to be interested in starting original productions and the execs there were intrigued. They sent Dunn and Clattenburg back to Halifax with a commitment and instructions to bring on another producer with more experience. Together they enlisted Michael Volpe and Trailer Park Boys found a home; and thanks to the foresight of showcase execs and the support of various television funding programs the first six half-hour episodes were made\n\n","torrent":{"xt":"urn:btih:c9bcdbd97f9552cc78ae2d5ef9f5bc1432de8ca4","amp;dn":"Trailor+Park+Boys.+ALl+7+seasons+with+extras%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9bcdbd97f9552cc78ae2d5ef9f5bc1432de8ca4","infoHashBuffer":{"type":"Buffer","data":[201,188,219,217,127,149,82,204,120,174,45,94,249,245,188,20,50,222,140,164]},"announce":[],"urlList":[]}}