{"title":"New Doctor Who - Season 02 (2006) - 13 HD Episodes + 1 HD Specia","uid":10650616,"size":16005774363,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9c2f04a28343f937cd110f0a0c2a34483271991&amp;dn=New+Doctor+Who+-+Season+02+%282006%29+-+13+HD+Episodes+%2B+1+HD+Specia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"bnaron","files":-1,"time":1406604211,"description":"New Doctor Who - Season 02 (2006) - 13 HD Episodes + 1 HD Special + 13 SD Tardisodes\n\nSeries Description Courtesy: Wikipedia, the free encyclopedia\n                             (en.wikipedia.org/wiki/Doctor_Who_(series_2))\n\n\nThe second season of the British science fiction program Doctor Who began on 25 December 2005 with the Christmas special &quot;The Christmas Invasion&quot; (NOTE: The Christmas Special is included in the 2005 inaugural season torrent as it was televised in 2005). Following the special, a regular series of thirteen episodes was broadcast, starting with &quot;New Earth&quot; on 15 April 2006. In addition, two short special episodes were produced; a Children in Need special and an interactive episode, as well as 13 TARDISODEs (1 minute trailers).\n\nThis is the first season to feature David Tennant as the tenth incarnation of the Doctor, an alien Time Lord who travels through time and space in his TARDIS, which appears to be a British police box on the outside. He continues to travel with his companion Rose Tyler (Billie Piper), with whom he has grown increasingly attached. They also briefly travel with Rose's boyfriend Mickey Smith (Noel Clarke), and Camille Coduri reprises her role as Rose's mother Jackie. The series is connected by a loose story arc consisting of the recurring word &quot;Torchwood&quot;.\n\n\nTotal Episodes: 13\nTotal Specials: 03\n\n\nSynopses courtesy of: The On-line TV Database\n                      An Open Database for Television Fans\n                      (www.thetvdb.com)\n\n\n\n2006-04-15 - New Earth (Video: 1280x720, 3000kbps, 24fps - Audio: 44.1kHz, 190kbps)\n\nLocation: New Earth\nDate: 5,000,000,023 \nEnemies: Lady Cassandra, The Flesh, Sisters of Plenitude \n\nIn the year five billion and twenty-three, after the destruction of the Earth, the Doctor takes Rose to the New Earth. There, in a hospital facility, the feline Sisters of Plenitude can mysteriously cure any diseases, but, in the basement, an old enemy of the Doctor is out for revenge.\n\n\n2006-04-22 - Tooth and Claw (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Torchwood House, Scotland,\nEarth Date: 1879 \nEnemies: Werewolf, The Monks\n\nLanding in 1879, Scotland, the Tenth Doctor and Rose meet Queen Victoria, traveling with her to spend the night at the Torchwood Estate. However, a group of warrior monks have sinister plans for the monarch, and the full moon is about to summon a creature out of legend.\n\n\n2006-04-29 - School Reunion (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Deffry Vale High School, London, England, Earth \nDate: 2007 \nEnemies: The Krillitanes \n\nThere are strange goings-on at a comprehensive school - UFOs, over-intelligent children, and odd-tasting school dinners. This attracts the attention of the Tenth Doctor, Rose and Mickey Smith, as well as a couple of old friends.\n\n\n2006-05-06 - The Girl in the Fireplace (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Versailles, France, Earth and on S.S. Madame de Pompadour (a Spaceship)\nDate: Across the 18th Century and during the 51st Century\nEnemies: Clockwork Droids\n\nOn a seemingly abandoned spaceship in the 51st century, the Tenth Doctor, Rose and Mickey find time windows leading to 18th century France and a group of clockwork androids using them to stalk a young woman throughout her life.\n\n\n2006-05-13 - Rise of the Cybermen (1) (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Parallel Earth\nDate: 1st February, 2007\nEnemy: John Lumic, The Cybermen\n\nAfter the TARDIS makes a crash landing on the Earth of another universe, Rose discovers her father is alive and rich, Mickey encounters his alternative self, and the Tenth Doctor learns one of his oldest and deadliest foes is about to be reborn.\n\n\n2006-05-20 - The Age of Steel (2) (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: A parallel Earth\nDate: 1st/2nd February, 2007\nEnemy: John Lumic, Cyber-Controller, The Cybermen\n\nThe plans of John Lumic to convert the world into Cybermen are now in full force. The Tenth Doctor, Rose, Mickey and the Preachers must find a way to stop him from enforcing his &quot;ultimate upgrade.&quot;\n\n\n2006-05-27 - The Idiot's Lantern (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: London, England, Earth\nDate: 1953 - Queen Elizabeth II's Coronation\nEnemy: The Wire \n\nIn 1953 London, the police are abducting people from their homes. The people of Britain gather around their new-fangled &quot;tele-vision&quot; sets to celebrate the new Queen's coronation - but something strange is affecting the signal.\n\n\n2006-06-03 - The Impossible Planet (1) (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 191kbps)\n\nLocation: In orbit below a black hole\nDate: Possibly 43,000 (43K reference)\nEnemy: The Beast,The Ood (as The Legion of The Beast)\n\nRose finds herself further away from home than ever before, on a desolate world in the orbit of a Black Hole. Trapped with an Earth expedition and the mysterious Ood, the time-travelers face an even greater danger as something ancient beneath the planet's surface begins to awake.\n\n\n2006-06-10 - The Satan Pit (2) (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: In orbit below a black hole\nDate: Possibly 43,000 (43K reference)\nEnemy: The Beast,The Ood (as The Legion of The Beast)\n\nThe TARDIS lands in a base on a planet orbiting a black hole, an impossible situation that stumps even the Tenth Doctor. The base crew are drilling to the center of the world, to claim the power that keeps it in orbit for themselves. However, an ancient evil is down there too, and he is awake.\n\n\n2006-06-17 - Love and Monsters (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: London, Earth\nDate: 2007\nEnemy: The Abzorbaloff \n\nAn ordinary man named Elton Pope becomes obsessed with the Tenth Doctor, Rose and their strange blue box, joining a group of like-minded people in hopes of finding him. But when the mysterious Victor Kennedy joins the group, the fun soon stops and Elton discovers a darker side to his hobby.\n\n\n2006-06-24 - Fear Her (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Earth\nDate: 2012\nEnemy: Chloe Webber/Isolas\n\nWhen the TARDIS lands in 2012, the Tenth Doctor plans to show Rose the London Olympics. However, ordinary children are vanishing into thin air, a mother living in a seemingly normal British household is trying to hide her daughter's unnatural powers from the world, and a demonic presence lurks in an upstairs cupboard.\n\n\n2006-07-01 - Army of Ghosts (1) (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: London, Torchwood Tower\nDate: 2007\nEnemies: Cybermen, Torchwood\n\nGhostly beings have been regularly appearing across the world and people, believing them to be their dead loved ones, are welcoming their visits with open arms. When the TARDIS arrives at the Torchwood Institute, the Tenth Doctor and Rose are taken prisoner. They are drawn into the investigation of a mysterious sphere kept in Torchwood Tower, and monstrous foes return as two universes collide.\n\n\n2006-07-08 - Doomsday (2) (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: London, Torchwood Tower\nDate: 2007\nEnemies: Cybermen, Daleks\n\nHumanity is caught in the crossfire as the Cybermen and the Daleks wage war against each other. When the mysterious Genesis Ark opens, the Tenth Doctor is faced with an impossible decision: saving the world could mean losing Rose Tyler forever.\n\n\n2006 Specials\n\n\n2006-12-25 - Special - (Christmas 2006) - The Runaway Bride (Video: 1280x720, 3000kbps, 23fps - Audio: 44.1kHz, 190kbps)\n\nLocation: Earth\nDate: Christmas 2006\nEnemy: Empress of the Racnoss, Roboforms \n\nBride-to-be Donna vanishes as she walks down the aisle to marry boyfriend Lance. To her complete astonishment - and the Doctor's - she reappears in the Tardis. As the Time Lord, still reeling from Rose's departure, investigates how Donna came to be there, the duo uncover a terrifying enemy. How far will the Doctor go to save Earth from the latest alien threat?\n","torrent":{"xt":"urn:btih:c9c2f04a28343f937cd110f0a0c2a34483271991","amp;dn":"New+Doctor+Who+-+Season+02+%282006%29+-+13+HD+Episodes+%2B+1+HD+Specia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c2f04a28343f937cd110f0a0c2a34483271991","infoHashBuffer":{"type":"Buffer","data":[201,194,240,74,40,52,63,147,124,209,16,240,160,194,163,68,131,39,25,145]},"announce":[],"urlList":[]}}