{"title":"Van Halen - Zero (1976) [FLAC] [CD-R Demos] vtwin88cube","uid":8649998,"size":252120987,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c9c5b08ab3325eabd50a27134e550cd9ac3b04fc&amp;dn=Van+Halen+-+Zero+%281976%29+%5BFLAC%5D+%5BCD-R+Demos%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1373073082,"description":"\n\n\nVan Halen - Zero (1976)\nGene Simmons Home Demos\n\n\n\n\n\nKissFAQ.com...\n\nThe KISS, or more specifically, Gene Simmons' connection with Van Halen has become something of a matter of urban legend with most stories going, something to the effect: &quot;In 1976, Gene Simmons of KISS caught the band playing at a small club in Hollywood and liked them so much he offered to produce and pay for demos for them. Soon afterwards, Warner Brother's house-producer saw the band, and convinced label executive Mo Ostin to sign them&quot;. Close, but not quite. This little editorial shall explore the connection between Gene and Van Halen...\n\nSome sources list the show where Gene discovered the band as being the Starwood in Hollywood, however the story does not begin there. Another contemporary band playing the Los Angeles rock scene was the &quot;Boyz&quot; which included future Dokken members George Lynch and Mick Brown. The band's vocalist, Michael White recalled, &quot;in 1976 we played a Halloween show at Gazzarris on the Sunset Strip. The club was packed and most of the kids who came to the show that night were dressed up in KISS makeup. We played mostly our own tunes, but in order to get gigs we played some ZZ Top, KISS, etc. We ended our first set with 'Firehouse', a KISS song. As we were walking off the stage, I noticed an extremely tall guy approaching me. To make a long story short, the man was Gene Simmons. He was at the club partying with Paul Stanley. They weren't wearing any makeup and really enjoyed seeing all these kids dressed up like them. They really liked our version of their song. Gene said that their label Casablanca was looking to sign some new bands. He asked where we were playing next so he could bring the record company out to see us. I told him that we were playing the following week at the Starwood, another infamous club in Hollywood. Van Halen had the good fortune to be on the bill with us (we shared billing with Van Halen at several shows in the mid 70's). Gene showed up with the record company, but our show was really off that night. On the other hand, Van Halen had a great set. They impressed Gene so much that he flew them to NY to record some demos. Casablanca didn't sign Van Halen, but after returning to LA with those tapes, Van Halen shopped them to WB and the rest is history&quot; (Michael White). The Halloween show the Boyz would have played would have occurred either on the weekend of October 29-30th, or perhaps even Monday October 31st. This &quot;the following week&quot; could have meant the week of 10/31 to 11/6 or 11/7 to 11/13. The likelyhood is that the show that Van Halen played with the Boyz fell on the weekend of November 4th or 5th (Fri/Sat). Van Halen's official site dates Gene's discovery of the band as occuring in May 1976 at the Starwood. However, according to the band's own official tourdate chronology the band didn't play there that month. The only date in that part of the year at the Starwood would be June 1st - when Gene would have been in Europe on KISS' first visit! Gene would recall going to see the Boyz with Bebe Buell and immediately taking a liking to Van Halen within the timeframe of them playing a couple of songs. After the show he introduced himself to them and persuaded them to let him back them.\n\n\nAudio Quality:\t\tFLAC (Lossless)\nSource:\t\t\tHomemade CD-R\nLabel:\t\t\tBoo Muzic 2002\nCatalog:\t\tNone\n\n\n\n\nAudio Info:\n\n\n01.On Fire\n02.Woman In Love\n03.House Of Pain\n04.Runnin' With The Devil\n05.She's The Woman\n06.Let's Get Rockin'\n07.Big Trouble\n08.Somebody Get Me A Doctor\n09.Babe, Don't Leave Me Alone\n10.Put Out The Lights\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n","torrent":{"xt":"urn:btih:c9c5b08ab3325eabd50a27134e550cd9ac3b04fc","amp;dn":"Van+Halen+-+Zero+%281976%29+%5BFLAC%5D+%5BCD-R+Demos%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c5b08ab3325eabd50a27134e550cd9ac3b04fc","infoHashBuffer":{"type":"Buffer","data":[201,197,176,138,179,50,94,171,213,10,39,19,78,85,12,217,172,59,4,252]},"announce":[],"urlList":[]}}