{"title":"Principles of Nano-Optics - L. Novotny and B. Hecht","uid":15522041,"size":5678554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:caa05684a763caf82abfc4e00f6d03c74c8bb372&amp;dn=Principles+of+Nano-Optics+-+L.+Novotny+and+B.+Hecht&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470759438,"description":"Principles of Nano-Optics - L. Novotny and B. Hecht (CUP, 2006).pdf\r\n\r\nFirst published in 2006, this book has become the standard reference on nano-optics. Now in its second edition, the text has been thoroughly updated to take into account new developments and research directions. While the overall structure and pedagogical style of the book remain unchanged, all existing chapters have been expanded and a new chapter has been added. Adopting a broad perspective, the authors provide a detailed overview of the theoretical and experimental concepts that are needed to understand and work in nano-optics, across subfields ranging from quantum optics to biophysics. New topics of discussion include: optical antennas; new imaging techniques; Fano interference and strong coupling; reciprocity; metamaterials; and cavity optomechanics. With numerous end-of-chapter problem sets and illustrative material to expand on ideas discussed in the main text, this is an ideal textbook for graduate students entering the field. It is also a valuable reference for researchers and course teachers","torrent":{"xt":"urn:btih:caa05684a763caf82abfc4e00f6d03c74c8bb372","amp;dn":"Principles+of+Nano-Optics+-+L.+Novotny+and+B.+Hecht","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa05684a763caf82abfc4e00f6d03c74c8bb372","infoHashBuffer":{"type":"Buffer","data":[202,160,86,132,167,99,202,248,42,191,196,224,15,109,3,199,76,139,179,114]},"announce":[],"urlList":[]}}