{"title":"Robert Wyatt-Dondestan (Revisited) TQMP","uid":5156622,"size":515526336,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cab5ea963cec73d7e9ad24e4f67beb7918f19672&amp;dn=Robert+Wyatt-Dondestan+%28Revisited%29+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Bman8247","files":22,"time":1257886267,"description":"Robert Wyatt - Dondestan (Revisited)\n\n\nReleased-11/03/1998\nLabel-Thirsty Ear\n\n\n01. CP Jeebies\n02. N.I.O. (New Information Order)\n03. Dondestan\n04. Sight of the Wind\n05. Shrinkrap\n06. Catholic Architecture \n07. Worship\n08. Costa (Memories of Under-Development) \n09. Left on Man \n10. Lisp Service \n\nIncludes Quicktime Video\n\n\nCD&gt;EAC&gt;WAV&gt;Trader's Little Helper&gt;FLAC (Level 8)\n\n\nAll Music Guide\n\nThe original issue of Dondestan, one of Robert Wyatt's later, signature recordings, ran over budget, prompting him to release the album without an authoritative final mix. Wyatt, unlike many of the artists of his era, has often been in the unenviable position of having the original unmixed tapes of his records either disappear or get erased. Dondestan was the lone exception and he took full advantage. Where the original recording was a seamless whole, full of spare, haunting, keyboard and percussive textures, Revisited showcases the collaborations with his wife, poet Alfreda Benge, his own songs, and a collaboration with former Soft Machine bandmate Hugh Hopper, as separate entities, standing on their own as songs, rather than as episodes in a drifting non-narrative of poetics (&quot;Sight of the Wind&quot;), communism (&quot;C.P. Jeebies&quot;), and abstract reflections on postmodern life (&quot;N.I.O.&quot;). It's fitting that, even though the original order of the songs hasn't been changed, his and Benge's songs... being placed squarely in the middle of the recording act as bridges to Wyatt's political notions. It humanizes the ideology, rather than the other way around. Also, on certain tracks, such as &quot;Sight of the Wind&quot; and &quot;Worship,&quot; as well as &quot;Lisp Service,&quot; Wyatt was able to bring the ambient textures that were all but inaudible on the original, into prominent hearing, changing, in effect, the timbre and flavor of these songs and others, making something already somewhat ethereal -- if very humorous in places -- into a work almost ghostly with its hovering presence. When this project was first announced, many of Wyatt's faithful were apprehensive, this writer included -- after all, why tamper with a masterpiece? There was no need for concern. The result made a great work of art a sublime one. - Thom Jurek, All Music Guide\n\n_____________________________________\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                         &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:cab5ea963cec73d7e9ad24e4f67beb7918f19672","amp;dn":"Robert+Wyatt-Dondestan+%28Revisited%29+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cab5ea963cec73d7e9ad24e4f67beb7918f19672","infoHashBuffer":{"type":"Buffer","data":[202,181,234,150,60,236,115,215,233,173,36,228,246,123,235,121,24,241,150,114]},"announce":[],"urlList":[]}}