{"title":"Tools of the Imagination (gnv64)","uid":7719672,"size":18177240,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb862b44d18ac80bb9b9cf312f3d537d10c13666&amp;dn=Tools+of+the+Imagination+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1350032552,"description":"Tools of the Imagination: Drawing Tools and Technologies from the Eighteenth Century to the Present\nby Susan Piedmont-Palladino\nPrinceton Architectural Press | Novembe 2006 | ISBN-10: 1568985991 | 128 pages | PDF | 17.3 mb &lt;a href=&quot;\nhttp://www.amazon.com/Tools-Imagination-Drawing-Technologies-Eighteenth/dp/1568985991&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Tools-Imagination-Drawing-Technologies-Eighteenth/dp/1568985991&lt;/a&gt;\n\nThe construction of a building is fascinating to watch, as the symbiosis between man and machine turns what seem to be scattered piles of material into architecture. But before the tools of construction ever arrive on the site, the architect wields a different set of tools to design, develop, and document the building-to-be. The history of these drawing tools is one of invention and innovation. In a profession increasingly dominated by the computer, earlier toolsfrom the compass to the helicograph, ellipsograph, and volutor; from perspective charts to slopes and batters; from Mylar to modeling clayare beautiful artifacts of a bygone day. Along with historical objects, the National Building Museum has collected wooden models by Frank Gehry and hand-drawn sketches by Tod Williams, showing that the tools of the imagination are still very much a part of architectural design.\n\nCovering 250 years of design tools and technologies, Tools of the Imagination: Drawing Tools and Technologies from the Eighteenth Century to the Present takes a revealing look at how architects have produced the drawings, models, renderings, and, now, animations that show us the promise of what might be built. The book includes a wide array of these tools as well as drawings, renderings, and sketches from well-known architects such as Frank Lloyd Wright, Ludwig Mies van der Rohe, and I. M. Pei.\n\nAbout the Author\nSusan C. Piedmont-Palladino is an architect and an associate professor of architecture at Virginia Tech. Her book, Devil's Workshop: 25 Years of Jersey Devil Architecture, was published by Princeton Architectural Press.","torrent":{"xt":"urn:btih:cb862b44d18ac80bb9b9cf312f3d537d10c13666","amp;dn":"Tools+of+the+Imagination+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb862b44d18ac80bb9b9cf312f3d537d10c13666","infoHashBuffer":{"type":"Buffer","data":[203,134,43,68,209,138,200,11,185,185,207,49,47,61,83,125,16,193,54,102]},"announce":[],"urlList":[]}}