{"title":"The Delhi Deception - Elana Sabharwal.epub","uid":10083337,"size":357647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbaa1fdac3e00b9b1b49ad8a0f30d63cd6d8f6ef&amp;dn=The+Delhi+Deception+-+Elana+Sabharwal.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1399050834,"description":"This engaging novel of romantic betrayal and modern day sex trafficking takes place in India. It follows Carla, a Harvard-educated CNN reporter of mixed Indian and South African heritage who gets drawn into a geopolitical conspiracy while visiting her old college friend in Delhi. \nOn route to India, Carla makes an impromptu trip to Peshawar, Pakistan to surprise her husband Andrew, a BBC journalist currently on assignment, but her visit finds her on the end of a nasty surprise. Devastated she flies to Delhi to find solace with her friend Elouise Singh. In a difficult marriage to prominent physicist Harry Singh, Elouise distracts Carla's troubled mind with the best retail therapy Delhi can offer and escorts her to many glamorous social events. \nAt one of these elegant soirees, Carla meets and is captivated by George, a smooth, charming and enigmatic American Embassy employee. Vulnerable, she falls for him, but as their relationship develops, she is drawn into a web of deceit and intrigue far more vast, violent, and organized than she could ever have imagined.\n\nAbout the Author\n\nElana Sabharwal is married to an Indian physicist and divides her time between Delhi and Cape Town, South Africa. She has worked in India, Italy and South Africa as a fashion designer and marketing executive. The Delhi Deception is her first novel.","torrent":{"xt":"urn:btih:cbaa1fdac3e00b9b1b49ad8a0f30d63cd6d8f6ef","amp;dn":"The+Delhi+Deception+-+Elana+Sabharwal.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbaa1fdac3e00b9b1b49ad8a0f30d63cd6d8f6ef","infoHashBuffer":{"type":"Buffer","data":[203,170,31,218,195,224,11,155,27,73,173,138,15,48,214,60,214,216,246,239]},"announce":[],"urlList":[]}}