{"title":"Maxim India - June/July 2016 (gnv64)","uid":15125262,"size":51654169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccc04da2e145912a736536fdfd97275f096e405d&amp;dn=Maxim+India+-+June%2FJuly+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":4,"time":1467107513,"description":"Maxim India - June/July 2016\r\nEnglish | 147 pages | PDF | 49.2 mb\r\n\r\nFeatures\r\n74 PRIYANKA CHOPRA - For a record-breaking third time, PC tops the Maxim Hot 100 list and we couldn't be happier. You?\r\n86 ON THE ROAD - A road trip in a fully restored 1975 Land Rover Series III.\r\n92 MASTER OF THE UNIVERSE - Sir Richard Branson has made billions defying the odds. This is his untold story.\r\n100 WONDER WALLS - The steady revival of Indian art and how you can cash in.\r\n104 BEAT STREET - Jamie Bell shows us how to work denim for the summer-#inspo.\r\n117 24 HOURS TO LIVE WITH SIDMAKKAR - The rising star talks about his ascent to Heaven (or Hell).\r\nM2 MAXIM HOT 100 - The definitive list of 2016's hottest women based on your votes. PS: We're talking about over a million votes!\r\n\r\nArena\r\n14 GAME ON! - The Euro Cup is here. Let’s test your football knowledge!\r\n22 THE GOAL STANDARD - This is what makes Cristiano Ronaldo one of the most successful sportstars of all time.\r\n24 PACK MENTALITY - Here’s how to achieve suitcase salvation for your next trip.\r\n28 BEER-OLOGY! - The low-down on the best ales.\r\n32 THE POWER OF IMAGINATION - The best fantasy adventure fl icks coming to theatres near you this year.\r\n34 ALL ABOUT THE RAGA - We explore the converging worlds of Indian classical music and EDM.\r\n38 GAME BITES - These munchies can be whipped up at half-time (in no time).\r\n40 HOW COOL ARE YOU? - Ask yourself: Am I hot? Just take this quiz.\r\n\r\nModus\r\n46 THE SUMMER DINNER JACKET - Korean fashion maestro Yang Heill’s stylish vision.\r\n48 STYLE HACKS - Make sartorial statements all season long\r\n52 DENIM DECODED - By Kaede Matsumoto, Style Director of Levi’s.\r\n53 RIDING A NEW WAVE - It’s time to embrace coiffured cuts. \r\n\r\nAgenda\r\n56 FIT LIKE CHHETRI - The football hero lives by these moves.\r\n60 BODY LANGUAGE - Our dating coach lays down the ground rules of mating.\r\n62 HOT SAUCE - Everything you need to know about the hellfi re-causing condiment. \r\n\r\nEmporium\r\n66 KING’S LANDING - The Emperor XT is the ultimate desk.\r\n68 MAN ON THE GO - Maxim’s top gadget picks of the month.\r\n70 FULL THROTTLE - We test the Audi R8-V10 Plus.\r\n72 COMBAT READY! - Meet the Confederate G2 P51 Fighter—a brute machine.\r\n \nhttps://s32.postimg.org/8la03vcfp/Maxim_India_June_July_2016.jpg","torrent":{"xt":"urn:btih:ccc04da2e145912a736536fdfd97275f096e405d","amp;dn":"Maxim+India+-+June%2FJuly+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccc04da2e145912a736536fdfd97275f096e405d","infoHashBuffer":{"type":"Buffer","data":[204,192,77,162,225,69,145,42,115,101,54,253,253,151,39,95,9,110,64,93]},"announce":[],"urlList":[]}}