{"title":"Inside Seka - The Platinum Princess of Porn  (2013 - Retail)","uid":9202692,"size":19000893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccca0e58ef40a00612e6bea18eddc97adab100cc&amp;dn=Inside+Seka+-+The+Platinum+Princess+of+Porn++%282013+-+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":5,"time":1384625145,"description":"Books : Biography : English\n\n\nJim Norton, Seka, &quot;Inside Seka&quot;\nEnglish | ISBN: 1593932723 | 2013 | MOBI | 352 pages | 14,6 MB\n\n&quot;The Mount Rushmore of Adult Entertainment has four heads: John Holmes, Marilyn Chambers, Jenna Jameson, and Seka. That's it; there ain't no more.&quot; - Bill Margold, famed adult film actor, agent, producer, director, and activist Seka-The Platinum Princess, the Marilyn Monroe of Porn, the queen of XXX cinema's Golden Age, and John Holmes' favorite leading lady. Seka is a legendary performer in the annals of adult cinema, and many would say the greatest. Seka's name was so big in XXX that her name above the title was not enough-her name had to be in the title! ?Seka's real life story, though, is as enigmatic as her screen persona. She was never a victim-on-screen or off. This is no tale of remorse, abuse, or self-destructive behavior. Seka was post-feminist before the term was born. Inside Seka is the story of a survivor, a trailblazer, and an icon-still one of the most popular and famous porn stars ever; the last of the natural beauties. &quot;Before the Jennas, the Bree Olsons, or the Savannas, the undisputed blonde bombshell of XXX movies was Seka, which makes her story so important in the history of adult entertainment.&quot; - Ron Jeremy, porn legend, holder of the Guinness Book of World Records for &quot;Most Appearances in Adult Films&quot;. &quot;From calling the shots in a film genre in the days when it was completely controlled by men, to standing and being heard at the infamous Meese Commission, Seka shatters the myth of the poor little victim who lost her way. Don't expect excuses and apologies. This is one blonde bombshell who lives by her own rules.&quot; - Candida Royalle, author, entrepreneur, and erotic film pioneer &quot;She was one of the hottest girls in the XXX business, able to seduce any man she wanted. So it should come as no surprise that her story is riveting.&quot; - Larry Flynt, Hustler magazine Kerry Zukus is the author, co-author, or ghostwriter of over 40 books, including From Harvard to Hell and Back, the upcoming Inside the Hotel Rwanda, and Book of the Month Club Feature Selection The Fourth House.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ccca0e58ef40a00612e6bea18eddc97adab100cc","amp;dn":"Inside+Seka+-+The+Platinum+Princess+of+Porn++%282013+-+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccca0e58ef40a00612e6bea18eddc97adab100cc","infoHashBuffer":{"type":"Buffer","data":[204,202,14,88,239,64,160,6,18,230,190,161,142,221,201,122,218,177,0,204]},"announce":[],"urlList":[]}}