{"title":"Gentle Giant - Giant on the Box &amp; Sight And Sound In Concert (20","uid":5556497,"size":14199733579,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ccce5bb4d5e77571ac3ecc579025de346c84bddd&amp;dn=Gentle+Giant+-+Giant+on+the+Box+%26+Sight+And+Sound+In+Concert+%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"zibbik","files":-1,"time":1273702727,"description":"\n\nGentle Giant - Giant on the Box &amp; Sight And Sound In Concert (2005-2006) [DVD5+DVD9]\n\n\n\nGentle Giant was a British progressive rock band active between 1970 and 1980. The band was notable for the particular complexity and sophistication of its musical material and for the diverse musical skills of its members (all of whom, bar the first two drummers, were accomplished multi-instrumentalists).\n\nThe band's onetime stated aim was to &quot;expand the frontiers of contemporary popular music at the risk of becoming very unpopular,although this stance was to alter significantly with time. While never achieving the commercial heights of progressive rock contemporaries such as Genesis, Yes or Emerson, Lake &amp; Palmer, Gentle Giant was considered to be one of the most experimental bands in the genre (as well as one of the most experimental rock bands of the 1970s)\n\nGentle Giant's music was considered complex even by progressive rock standards, drawing on a broad swathe of music including folk, soul, jazz and classical music. Unlike many of their progressive rock contemporaries, their &quot;classical&quot; influences ranged beyond the Romantic and incorporated mediaeval, baroque, and modernist chamber music elements. The band also had a taste for broad themes for their lyrics, drawing inspiration not only from personal events but from philosophy and the works of both FranÃƒÂ§ois Rabelais and R. D. Laing.\n\nDVD1 + CD (Giant On The Box)\nDVD2 + CD (Sight &amp; Sound In Concert &amp; Others Antiquities)\n\n\nDVD9-NTSC.4:3-Audio, PCM / Dolby Digital\n.\nCD-MP3/320kbps.\n\n\nGentle Giant - Giant on the Box, (DVD+CD) (2005)\n\nRelease Date \tNov 15, 2005\nRunning Time \t83 Minutes\n\nClosed Captioned; Standard Screen; Soundtrack English; Dolby Digital 5.1 Re; CD Included\n\nA favorite in underground prog-rock circles, Gentle Giant never quite broke through to the mainstream due to their unpredictability from album to album, ...    Full Descriptionand the fact that their experimental, envelope-pushing music often remained just outside the realm of commercial viability. All this only serves to make them more interesting in retrospect, and today they are recognized for having made some of the most interesting and progressive music of the 70s, combining rock, classical, blues, and avante-garde music with medieval, baroque vocals, and incorporating more than 30 instruments, to create a sonic experience like nothing else. This release features material from the height of the band's career in 1974-5, as they were poised on the brink of fame. Footage is included from concerts in Germany and Long Beach, plus rare television clips of interviews, and a photo gallery from member Gary Green's personal collection. Tracks include &quot;Cogs in Cogs,&quot; &quot;The Runaway,&quot; &quot;Features From Octopus,&quot; &quot;Experience,&quot; &quot;Advent of Panurge,&quot; and &quot;So Sincere.&quot;\n\nSongs / Tracks Listing\n\nGerman TV 1974\nIn 1974 Christopher Nupen, the celebrated classical music director, invited the band to record this concert in a Brussels film studio to be broadcast as a 'Sunday Concert' on German television station ZDF.\n\n1. Cogs in cogs\n2. Proclamation\n3. Funny ways\n4. The runaway\n5. Experience\n6. Features from Octopus\n7. Advent of Panurge\n8. So sincere\n\nUS TV Concert\nWhilst touring in the US in 1975, Giant recorded this TV special at the Terrace Theatre, Long Beach, California.\n\n1. Experience\n2. Features from Octopus\n3. Advent of Panurge\n4. Funny ways\n\nSzene '74\n'Szene 74', a topical news show from German television station BRW, filmed this rare footage during Giants European tour of that year. Guitar &amp; drums: from &quot;In a Glass House&quot;\n\nLine-up / Musicians\n\n- Derek Shulman / vocals, saxophone, recorder, bass, percussion\n- Ray Shulman / bass, violin, acoustic guitar, recorder, trumpet, vocals, percussion\n- Gary Green / guitars, recorders, vocals, percussion\n- Kerry Minnear / keyboards, cello, vibes, recorder, vocals, percussion\n- John Weathers / drums, vibes, tambour, vocals, percussion\n\n\nGentle Giant - GG At The GG: Sight And Sound In Concert DVD (2006)\nRelease Date \tMar 28, 2006\n\nThis live concert was filmed at Golders Green Hippodrome, London - January 5th 1978. Track list: Two Weeks In Spain, Freehand, On Reflection, I'm Turning Around, Just The Same, Playing The Game, Memories Of Old Days, Betcha Thought We Couldn't Do It, JP Weathers presents, Funny Ways, For Nobody, Mountain Time. Also featured are several videos and Octopus Medley filmed for the Old Grey Whistle Test in November 1974. Bonus CD featuring the Concert plus Whistle Test Tracks.\n\nProgressive rockers Gentle Giant never quite had the success of contemporaries like Yes or King Crimson, largely because they were so difficult to pin down, moving between the dangerously experimental and the commercially accessible. This concert, held in 1978 at London's Golders Green Hippodrome, includes such songs as &quot;Just The Same,&quot; &quot;Betcha Thought We Couldn't Do It,&quot; and &quot;Funny Ways,&quot; as well as the &quot;Octopus Medley,&quot; filmed for British TV's OLD GREY WHISTLE TEST.\n\nSongs / Tracks Listing\n\n1. Two Weeks in Spain (1-12 Golders Green Hippodrome, London, January 5th 1978)\n2. Free Hand\n3. On Reflection\n4. I'm turning around\n5. Just the Same\n6. Playing the Game\n7. Memories of Old Days\n8. Betcha Thought We Couldn't Do it\n9. JP Weathers presents\n10. Funny Ways\n11. For Nobody\n12. Mountain Time\n13. Interview (13-15 Videos shot at ITN House, London, 24th April 1976)\n14. Give it back\n15. I lost my head\n16. Words from the Wise (16-18 Videos shot in and around Capitol Studios, Hollywood, Los Angeles, 1978)\n17. Thank You\n18. Giant for a Day\n19. Octopus Medley (Old Grey Whistle Test, November 26th 1974, Drury Lane Theatre, London)\n20. MÃƒÂ¼nster, Germany, 5th April 1974 \n\nLine-up / Musicians\n\n- Derek Shulman / vocals, bass, trumpet\n- Kerry Minnear / keyboards, cello, vibraphone, vocal\n- Ray Shulman / bass, guitar, violin, vocals\n- Gary Green / guitars, recorder, vocals\n- John Weathers / drums, vibraphone ","torrent":{"xt":"urn:btih:ccce5bb4d5e77571ac3ecc579025de346c84bddd","amp;dn":"Gentle+Giant+-+Giant+on+the+Box+%26+Sight+And+Sound+In+Concert+%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccce5bb4d5e77571ac3ecc579025de346c84bddd","infoHashBuffer":{"type":"Buffer","data":[204,206,91,180,213,231,117,113,172,62,204,87,144,37,222,52,108,132,189,221]},"announce":[],"urlList":[]}}