{"title":"Gay - Videoboys - Educating Liam","uid":9740533,"size":356143279,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cd4df9a4150a1d178dfcd7fb3a8ca6b78d9bd1e6&amp;dn=Gay+-+Videoboys+-+Educating+Liam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":null,"files":-1,"time":1394505715,"description":"Sometimes chance meetings can lead to great things. Liam Emerson first met Jake Bass on Facebook and they friended each other and chatted from time to time. Liam didn't realize Jake was a porn star until he saw him at the Gay Pride Parade with crowds of adoring fans all around him. So Liam went over for a photo op with Jake and they got to talking about making porn, a subject that's been on Liam's mind for awhile. Jake took Liam under his wing and offered him an introductory workshop on how to make a porn scene. And just a few days later it all came together.And what an education it was. Liam, the eager learner, didn't want to wait for the preliminaries of taking off clothes, so he jumped right into the shower with Jake and started making out. French kissing and blowjobs under the cascading water got things off to a steamy start but for the serious fucking action, Jake wanted some dry land and some solid furniture for better traction. The leather couch was the perfect platform for educating Liam on theï¿½particulars of receiving a good pounding and Jake flipped him from one position to the next with the greatest of eas. Liam was able to take everything Jake had to give him in every position he could think of. And not only could he take it, if Liam's moans were any indication, he would have been glad to take more. But his excitement got the better of him and after a good pounding, Liam blasted a big load all over the glass table. Then Jake had one last lesson to teach Liam: when Jake Bass is cumming, either wear goggles or close your eyes.\n &lt;a href=&quot;\nhttp://tour.videoboys.com/videoboys.php?id=808&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tour.videoboys.com/videoboys.php?id=808&lt;/a&gt;","torrent":{"xt":"urn:btih:cd4df9a4150a1d178dfcd7fb3a8ca6b78d9bd1e6","amp;dn":"Gay+-+Videoboys+-+Educating+Liam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd4df9a4150a1d178dfcd7fb3a8ca6b78d9bd1e6","infoHashBuffer":{"type":"Buffer","data":[205,77,249,164,21,10,29,23,141,252,215,251,58,140,166,183,141,155,209,230]},"announce":[],"urlList":[]}}