{"title":"The Three Kingdoms: The Epic Chinese Tale (2014) epub","uid":13136403,"size":13948356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cedf7df444308a19cdfb616228e3a1d7af1e8e77&amp;dn=The+Three+Kingdoms%3A+The+Epic+Chinese+Tale+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":3,"time":1451908151,"description":"The Three Kingdoms, Volume 1-3: The Sacred Oath: The Epic Chinese Tale of Loyalty and War in a Dynamic New Translation (with Footnotes)\r\n\r\nepub.\r\n\r\nThis exciting new translation with footnotes is more readable than past versions and will appeal to modern readers.\r\n\r\nThe Three Kingdoms is an epic Chinese novel written over six centuries ago. It recounts in vivid historical detail the turbulent years at the close of the Han Dynasty, when China broke into three competing kingdoms and over half the population were either killed or driven from their homes. Part myth, part fact, readers will experience the loyalty and treachery, the brotherhood and rivalry of China's legendary heroes and villains during the most tumultuous period in Chinese history.\r\n\r\nConsidered the greatest work in classic Chinese literature, The Three Kingdoms is read by millions throughout Asia today. Seen not just as a great work of art, many Chinese view it as a guide to success in life and business as well as a work that offers great moral clarity—while many foreigners read it to gain insights into Chinese society and culture. From the saga of The Three Kingdoms, readers will learn how great warriors motivate their troops and enhance their influence, while disguising their weaknesses and turning the strengths of others against them","torrent":{"xt":"urn:btih:cedf7df444308a19cdfb616228e3a1d7af1e8e77","amp;dn":"The+Three+Kingdoms%3A+The+Epic+Chinese+Tale+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cedf7df444308a19cdfb616228e3a1d7af1e8e77","infoHashBuffer":{"type":"Buffer","data":[206,223,125,244,68,48,138,25,205,251,97,98,40,227,161,215,175,30,142,119]},"announce":[],"urlList":[]}}