{"title":"The Red Green Show - Season 8","uid":5177863,"size":2713337156,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d009d2ad8b0d1898f55e8fc525e05a231e62c222&amp;dn=The+Red+Green+Show+-+Season+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theanonymousentity","files":14,"time":1259076813,"description":"Season 8 of The Red Green Show, ripped from the 1998 season DVD set. This is the second season to be released on DVD.\n\nThis includes the following episodes:\n\nIt's A Wonderful Red Green Christmas - Red Green's first Christmas Special\nHarold's Leaving - Harold ruins everything by going off to college.\nHouse Moving - Red and the guys try to move an old building by balancing it on pick up trucks. \nNeither Rain Nor Sleet - Red starts his own postal system.\nThe Cult Visit - The lodge is visited by a strange cult from the planet Gorgon.\nCollege Life - Harold goes off to college where he shares an apartment with three girls. \nThe New Monument - The lodge inherits an old army tank and gets it running. \nFree Apricots - A tractor-trailer flips over and the lodge members get an unlimited supply of apricots. \nThe Mayor Race - Red runs for mayor of Possum Lake. \nBetter To Give Than Receive - Possum Lodge has a blood donor competition with Caribou Lodge. \nTown Services Contract - Possum Lodge gets the contract to supply tow truck, snow plow and ambulance service to Possum Lake. \nLife Cycle - Red in the possum van competes with Harold on a bicycle for distance covered on a ten-dollar budget.\nMad About You - Harold teaches Red about anger management. \nBingo Was His Name - Red has the lodge declared a religion to allow bingo games.\n\nEnjoy and keep seeding!","torrent":{"xt":"urn:btih:d009d2ad8b0d1898f55e8fc525e05a231e62c222","amp;dn":"The+Red+Green+Show+-+Season+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d009d2ad8b0d1898f55e8fc525e05a231e62c222","infoHashBuffer":{"type":"Buffer","data":[208,9,210,173,139,13,24,152,245,94,143,197,37,224,90,35,30,98,194,34]},"announce":[],"urlList":[]}}