{"title":"John Gribbin - Science: A History [epub]","uid":9007125,"size":4450825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d02bb26d407cdbec1e4ada6d56a233ca8ca207f8&amp;dn=John+Gribbin+-+Science%3A+A+History+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"epub_888","files":-1,"time":1381055179,"description":"In this book, John Gribbin tells the story of the people who made science and the turbulent times they lived in. As well as famous figures such as Copernicus, Darwin and Einstein, there are also the obscure, the eccentric, even the mad. This diversecast includes, among others, Andreas Vesalius, landmark 16th-century anatomist and secret grave-robber; the flamboyant Galileo, accused of heresy for his ideas; the obsessive, competitive Newton, who wrote his rivals out of the history books; GregorMendel, the Moravian monk who founded modern genetics; and Louis Agassiz, so determined to prove the existence of ice ages that he marched his colleagues up a mountain to show them the evidence.\n\nAbout the Author\n\nJohn Gribbin is one of today's greatest writers of popular science and the author of bestselling books, including In Search of Schrodinger's Cat, Stardust and Deep Simplicity. He is famous to his many fans for making complex ideas simple, and says that his aim in his writing - much of it done with his wife, Mary Gribbin - is to share with his readers his sense of wonder at the strangeness of the universe. John Gribbin trained as an astrophysicist at Cambridge University and is currently Visiting Fellow in Astronomy at the University of Sussex.","torrent":{"xt":"urn:btih:d02bb26d407cdbec1e4ada6d56a233ca8ca207f8","amp;dn":"John+Gribbin+-+Science%3A+A+History+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d02bb26d407cdbec1e4ada6d56a233ca8ca207f8","infoHashBuffer":{"type":"Buffer","data":[208,43,178,109,64,124,219,236,30,74,218,109,86,162,51,202,140,162,7,248]},"announce":[],"urlList":[]}}