{"title":"The.Way.To.Happiness[Audiobook]eng[mp3]Scientology","uid":4172030,"size":74787704,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d033a8a2c2ebbb8831b6d001c5f778382b1b8bf7&amp;dn=The.Way.To.Happiness%5BAudiobook%5Deng%5Bmp3%5DScientology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"OttawaLulz","files":1,"time":1209923221,"description":"ANONYMOUS presents: The Way to Happiness (Audiobook) 2 CDs - mp3\n\nWith such morsels as &quot;take showers&quot; and &quot;brush your teeth&quot;, this book claims to contain an ethical code that will lead to happiness. Seriously? Brush your teeth? Facepalm.jpg\n\nAs described by Scientology: &quot;True joy and happiness are valuable.\nIf one does not survive, no joy and no happiness are obtainable. Trying to survive in a chaotic, dishonest and generally immoral society is difficult.\nAny individual or group seeks to obtain from life what pleasure and freedom from pain that they can.\nYour own survival can be threatened by the bad actions of others around you.\nYour own happiness can be turned to tragedy and sorrow by the dishonesty and misconduct of others.\nI am sure you can think of instances of this actually happening. Such wrongs reduce one?s survival and impair one?s happiness.\nYou are important to other people. You are listened to. You can influence others.\nThe happiness or unhappiness of others you could name is important to you.\nWithout too much trouble, using this book, you can help them survive and lead happier lives.\nWhile no one can guarantee that anyone else can be happy, their chances of survival and happiness can be improved. And with theirs, yours will be.\nIt is in your power to point the way to a less dangerous and happier life.&quot;\n\n-----\n\nFor more information visit http://forums.enturbulation.org/","torrent":{"xt":"urn:btih:d033a8a2c2ebbb8831b6d001c5f778382b1b8bf7","amp;dn":"The.Way.To.Happiness%5BAudiobook%5Deng%5Bmp3%5DScientology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d033a8a2c2ebbb8831b6d001c5f778382b1b8bf7","infoHashBuffer":{"type":"Buffer","data":[208,51,168,162,194,235,187,136,49,182,208,1,197,247,120,56,43,27,139,247]},"announce":[],"urlList":[]}}