{"title":"ABC of Stroke [PDF] [StormRG]","uid":11008252,"size":2283978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0737caa866cc53367b9d2e52bdbf61bf0998f3e&amp;dn=ABC+of+Stroke+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":2,"time":1410286971,"description":"Author: Jonathan Mant (Editor), Marion F. Walker (Editor)\nPaperback: 72 pages\nPublisher: BMJ Books; 1 edition (April 18, 2011)\nLanguage: English\nISBN-10: 1405167904\nISBN-13: 978-1405167901\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nStroke is the most common cause of adult disability and is of increasing importance within ageing populations.\nThis brand new title in the ABC series covers the entire patient journey, from prevention through to long-term support. It includes primary prevention and management of risk factors for stroke and secondary prevention including pharmaceutical, lifestyle and surgical intervention. The general principles of stroke rehabilitation are also addressed as well as mobility, communication and psychological problems, as is stroke in younger people. It also covers long-term support for stroke survivors and their carers.\n\nThis is an invaluable and practical guide to all aspects of stroke for both health care professionals and lay audiences. It is of particular relevance to general practitioners, junior doctors, nurses and therapists working with stroke patients and their carers, and to people with stroke and their families.","torrent":{"xt":"urn:btih:d0737caa866cc53367b9d2e52bdbf61bf0998f3e","amp;dn":"ABC+of+Stroke+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0737caa866cc53367b9d2e52bdbf61bf0998f3e","infoHashBuffer":{"type":"Buffer","data":[208,115,124,170,134,108,197,51,103,185,210,229,43,219,246,27,240,153,143,62]},"announce":[],"urlList":[]}}