{"title":"TCP-IP Clearly Explained","uid":7435498,"size":31551122,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0980ee922ab3607a5aa33fafb5b4024508637df&amp;dn=TCP-IP+Clearly+Explained&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1342068420,"description":"TCP/IP Clearly Explained, Fourth Edition (The Morgan Kaufmann Series in Networking)\n\nAuthor: Pete Loshin\nPublication Date: January 2, 2003  \nISBN-10: 155860782X  \nISBN-13: 978-1558607828  \nEdition: 4\n\nWith over 30,000 copies sold in previous editions, this fourth edition of TCP/IP Clearly Explained stands out more than ever. You still get a practical, thorough exploration of TCP/IP networking, presented in plain language, that will benefit newcomers and veterans alike. The coverage has been updated, however, to reflect new and continuing technological changes, including the Stream Control Transmission Protocol (SCTP), the Blocks architecture for application protocols, and the Transport Layer Security Protocol (TLS). \n\nThe improvements go far beyond the updated material: they also include an all-new approach that examines the TCP/IP protocol stack from the top down, beginning with the applications you may already understand and only then moving deeper to the protocols that make these applications possible. You also get a helpful overview of the &quot;life&quot; of an Internet packet, covering all its movements from inception to final disposition. \n\nIf you're looking for nothing more than information on the protocols comprising TCP/IP networking, there are plenty of books to choose from. If you want to understand TCP/IP networking-why the protocols do what they do, how they allow applications to be extended, and how changes in the environment necessitate changes to the protocols-there's only the one you hold in your hands. \n\n* Explains-clearly and holistically, but without oversimplification-the core protocols that make the global Internet possible. \n\n* Fully updated to cover emerging technologies that are critical to the present and future of the Internet. \n\n* Takes a top-down approach that begins with the familiar application layer, then proceeds to the protocols underlying it, devoting attention to each layer's specifics. \n\n* Divided into organized, easy-to-follow sections on the concepts and fundamentals of networking, Internet applications, transport protocols, the Internet layer and infrastructure, and practical internetworking.","torrent":{"xt":"urn:btih:d0980ee922ab3607a5aa33fafb5b4024508637df","amp;dn":"TCP-IP+Clearly+Explained","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0980ee922ab3607a5aa33fafb5b4024508637df","infoHashBuffer":{"type":"Buffer","data":[208,152,14,233,34,171,54,7,165,170,51,250,251,91,64,36,80,134,55,223]},"announce":[],"urlList":[]}}