{"title":"Bernardo Storace - Kybrd Work - Jorg Halubek, hpd/org [Philidor]","uid":15617004,"size":395667448,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0afa37d2d487a951320b18ef68feb6582b9767a&amp;dn=Bernardo+Storace+-+Kybrd+Work+-+Jorg+Halubek%2C+hpd%2Forg+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Philidor","files":16,"time":1471836912,"description":"Bernardo Storace is another one of those pre-18th century composers about whom next to nothing is known, yet fortunately leaves us at least some of his music to enjoy. He did serve as vice chapel master to Messina's Senate--which sounds strange to our ears, but the administrative body of Sicily functioned as part of a cultural edifice, like Venice's doges. Major earthquakes in Sicily over the centuries have destroyed much of the arts of previous periods, as well as records for research, so unless Storace was part of a far-flung group of musicians that communicated regularly via mail--and nothing like this has come to light--it's unlikely we'll ever learn more about him, or discover additional works of his.\r\n\r\nHis only surviving music are many sets of keyboard variations, published during his lifetime in a single volume. They are generally written in a manner reminiscent of the dances for court balls of Modena, and elaborated upon with an emphasis on increasing tension through tonal reiteration. He also possessed great contrapuntal skill (one of his two surviving ricercari is a triple fugue in good style), but on the whole, what we have of his indicated a very sophisticated but easy to grasp compositional technique--much like Byrd's keyboard works in that single respect.\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio's enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:d0afa37d2d487a951320b18ef68feb6582b9767a","amp;dn":"Bernardo+Storace+-+Kybrd+Work+-+Jorg+Halubek%2C+hpd%2Forg+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0afa37d2d487a951320b18ef68feb6582b9767a","infoHashBuffer":{"type":"Buffer","data":[208,175,163,125,45,72,122,149,19,32,177,142,246,143,235,101,130,185,118,122]},"announce":[],"urlList":[]}}