{"title":"[Evil Angel] Ts playground 4 (2013) [540p]","uid":13831432,"size":2120964921,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d119a4353b30c895ef32ff75571a2971514734ce&amp;dn=%5BEvil+Angel%5D+Ts+playground+4+%282013%29+%5B540p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"distinc","files":8,"time":1457738720,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=3451444935\r\n \nhttp://imagedisco.net/?g=5168500980\r\n\r\n\r\n\r\nDescription:\r\n\r\nAnal explorer Jay Sin continues his journey into an exotic, hidden sexual world in his new lady-boy adventure, &quot;TS Playground 4.&quot; Jay's signature style of sexy costume play and fantastic butthole antics perfectly suit the kinky, feminine transsexuals he's selected for this outrageous she-male showcase. The movie is a sultry mix of tease and solo self-pleasure alongside scenes of intense, hard-core dicksucking and ass fucking that match transgender temptresses and their cock-struck boyfriends. And as the tagline says, &quot;These girls are hung!&quot; Fans of huge, throbbing girl-dick have a lot to take in: First, stunning, glamorous Brazilian she-male Anna Hickiman masturbates with baby oil; like a snake charmer, she makes her shaft twitch. Next, Latina Sabrina Suzuki joins muscular boy-toy David Snider for some mutual dicksucking; soon he's face down, Sabrina's hard she-meat deeply pumping his rectum. Getting serviced by two young studs, busty, well-hung French-Canadian trans goddess Danika Dreamz slides both dicks up her tight ass at the same time! Blonde Brazilian bombshell Laura Ferraz jacks for us, displaying her fat ass and thick, meaty pole. Samantha is a gorgeous Italian she-male sporting a huge surprise... her massive, curved, uncircumcised cock seriously resembles an elephant's trunk! Tall, dark-skinned Perla Lohan tenderly impales white boy Max Scar's rectum on her huge tool. The DVD package includes behind-the-scenes interviews and a half-hour of extra sex, solo fun and outtakes. For a thrilling romp with the world's horniest chicks with dicks, &quot;TS Playground 4&quot; is the place to hang out","torrent":{"xt":"urn:btih:d119a4353b30c895ef32ff75571a2971514734ce","amp;dn":"%5BEvil+Angel%5D+Ts+playground+4+%282013%29+%5B540p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d119a4353b30c895ef32ff75571a2971514734ce","infoHashBuffer":{"type":"Buffer","data":[209,25,164,53,59,48,200,149,239,50,255,117,87,26,41,113,81,71,52,206]},"announce":[],"urlList":[]}}