{"title":"Margin of Safety - Seth Klarman.pdf","uid":9360892,"size":9574146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1d2d40fd541b57256f0760d2028d74c3b15ef07&amp;dn=Margin+of+Safety+-+Seth+Klarman.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"aksljdf","files":1,"time":1387316267,"description":"Investors are all too often lured by the prospect of instant millions and fall prey to the many fads of Wall Street. The myriad approaches they adopt offer little or no real prospect for long-term success and invariably run the risk of considerable economic loss - they resemble speculation or outright gambling, not a coherent investment program. But value investing - the strategy of investing in securities trading at an appreciable discount from underlying value - has a long history - has a long history of delivering excellent investment results with limited downside risk. \n\nTaking its title from Benjamin Graham's often-repeated admonition to invest always with a margin of safety, Klarman's 'Margin of Safety' explains the philosophy of value investing, and perhaps more importantly, the logic behind it, demonstrating why it succeeds while other approaches fail. The blueprint that Klarman offers, if carefully followed, offers the investor the strong possibility of investment success with limited risk. \n\n'Margin of Safety' shows you not just how to invest but how to think deeply about investing - to understand the rationale behind the rules to appreciate why they work when they work, and why they don't when they don't.","torrent":{"xt":"urn:btih:d1d2d40fd541b57256f0760d2028d74c3b15ef07","amp;dn":"Margin+of+Safety+-+Seth+Klarman.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1d2d40fd541b57256f0760d2028d74c3b15ef07","infoHashBuffer":{"type":"Buffer","data":[209,210,212,15,213,65,181,114,86,240,118,13,32,40,215,76,59,21,239,7]},"announce":[],"urlList":[]}}