{"title":"Magnolia City - Duncan W. Alderson - Audiobook MP3","uid":10561300,"size":441736983,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1ea7e5a194964070c60aac046fd452d59dede23&amp;dn=Magnolia+City+-+Duncan+W.+Alderson+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1405459482,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nMagnolia City\n\nWritten by: Duncan W. Alderson\nNarrated by: Dan John Miller\nLength: 15 hrs and 15 mins\nFormat: Unabridged\nRelease Date:07-08-14\n\nHouston in the 1920s is a city of established cotton kings and newly rich oil barons, where the elite live in beaux art mansions behind the gates of Courtlandt Place. Kirby Augustus Allen, grandson of the Allen brothers who founded Houston as a real estate deal, is grooming his daughter Hetty to marry Lamar Rusk, scion of the Splendora oil fortune. Instead, at the No-Tsu-Oh Carnival of 1928, beautiful, rebellious Hetty encounters a mysterious man from Montana dressed in the gear of a wildcatter - an outsider named Garret MacBride.\n\nHetty is torn between Lamar's lavish courtship and her instinctive connection to Garret. As Lamar's wife, she would be guaranteed acceptance to the highest ranks of Houston society. Yet Garret, poor but powerfully ambitious, offers the adventure she craves, with rendezvous in illicit jazz clubs and reckless nights of passion. The men's intense rivalry extends to business, as rumors of a vast, untapped ocean of oil in East Texas spark a frenzy that can make fortunes - or shatter lives and dreams beyond repair. ","torrent":{"xt":"urn:btih:d1ea7e5a194964070c60aac046fd452d59dede23","amp;dn":"Magnolia+City+-+Duncan+W.+Alderson+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ea7e5a194964070c60aac046fd452d59dede23","infoHashBuffer":{"type":"Buffer","data":[209,234,126,90,25,73,100,7,12,96,170,192,70,253,69,45,89,222,222,35]},"announce":[],"urlList":[]}}