{"title":"ElcomSoft System Recovery 3","uid":4528633,"size":153454980,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d2212e02f7c3715f27e986a41d6ab2aaef66624a&amp;dn=ElcomSoft+System+Recovery+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"baysv","files":3,"time":1227463073,"description":"ElcomSoft System Recovery 3\n\nRestore Access to Locked Windows Accounts\nUp to 40% of support calls are related to forgotten passwords and locked logins. Recover or reset Windows system passwords easily and automatically! There is no need to format the disk or reinstall Windows. Just boot from the CD and unlock your system in a matter of minutes!\nElcomsoft System Recovery can reset account passwords instantly, while supporting full-scale attacks to recover the original passwords.\nElcomsoft System Recovery unlocks locked and disabled user and administrative accounts in Windows NT, 2000, XP, 2003 Server, Vista, and the latest Windows 2008 Server.\nFeatures and Benefits\nReady to boot with Windows PE (Preinstallation Environment) licensed from Microsoft\nRecovers or resets user and administrative passwords\nOriginal password recovery may be possible to provide automatic access to EFS-encrypted files\nUnlocks and enables user and administrative accounts\nAssigns administrative privileges to any user account\nResets or disables password expiry options\nBroad hardware compatibility and genuinely native FAT and NTFS support\nGenuine Windows GUI for convenient operation\nSupports Windows NT 4.0, Windows 2000, Windows XP, Windows 2003 Server, Windows Vista and Windows 2008 Server\nSupports US and localized versions of Windows and multilingual user names and passwords\nDetects all Windows installations automatically\nAn option to dump hashed passwords from SAM/SYSTEM files or Active Directory database for further analysis and off-line password recovery\nReady to Boot\nElcomsoft System Recovery comes ready to boot from a CD, and makes it easy to create a bootable USB Flash Drive. No need to create a bootable disc and no need to reach for a Windows setup disks to make one! ElcomSoft has licensed the Windows Preinstallation Environment (Windows PE) directly from Microsoft, allowing the company to distribute the completely working bootable Windows environment based on Windows Vista. \n","torrent":{"xt":"urn:btih:d2212e02f7c3715f27e986a41d6ab2aaef66624a","amp;dn":"ElcomSoft+System+Recovery+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2212e02f7c3715f27e986a41d6ab2aaef66624a","infoHashBuffer":{"type":"Buffer","data":[210,33,46,2,247,195,113,95,39,233,134,164,29,106,178,170,239,102,98,74]},"announce":[],"urlList":[]}}