{"title":"Nietzsche - Beyond Good and Evil (CUP).pdf","uid":5027342,"size":877699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d29bd21cf9e641efd678b9634d84e24a76fa8729&amp;dn=Nietzsche+-+Beyond+Good+and+Evil+%28CUP%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Gorra09","files":1,"time":1248763489,"description":"Beyond Good and Evil by Friedrich Nietzsche (Cambridge University Press)\n\nBeyond Good and Evil: Prelude to a Philosophy of the Future (first published in 1886) written by Friedrich Nietzsche (1844-1900), the most revolutionary of modern philosophers, is an essential text for anyone interested in the development of recent thought. Nietzsche seeks to unmask and expose all the traditional philosophies and philosophers as fundamentally inadequate and to insist upon the fictional nature of all human attempts to explain what is true and upon the superficiality of modern ideas, including democracy and science. Nietzsche here calls upon the philosophers of the future to leave traditional morality behind and to move beyond good and evil in a dangerous but more fulfilling attempt to affirm the potential of human life. Largely unknown in Nietzsche's day, Beyond Good and Evil has in the twentieth century played a central role in the development of a number of modern philosophies; its influence today extends beyond philosophy into any number of other areas.Ian Johnston s new translation captures brilliantly Nietzsche's extraordinary writing style, which has long been celebrated as a uniquely vital contribution to philosophical writing.","torrent":{"xt":"urn:btih:d29bd21cf9e641efd678b9634d84e24a76fa8729","amp;dn":"Nietzsche+-+Beyond+Good+and+Evil+%28CUP%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29bd21cf9e641efd678b9634d84e24a76fa8729","infoHashBuffer":{"type":"Buffer","data":[210,155,210,28,249,230,65,239,214,120,185,99,77,132,226,74,118,250,135,41]},"announce":[],"urlList":[]}}