{"title":"James Burke-Black Cherry Blue","uid":9619214,"size":267705016,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d37cadd5fc4c000ede9bad72de19531f0539a6c2&amp;dn=James+Burke-Black+Cherry+Blue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twocows","files":23,"time":1392476863,"description":"Burke pits a land-hungry oil company against a Blackfeet Indian reservation in a stunning novel that takes detective fiction into new imaginative realms. His Cajun sleuth, Dave Robicheaux, an ex-New Orleans cop featured in two previous novels, attends Alcoholics Anonymous meetings, has recurrent nightmares about his murdered wife, and cares for an adopted El Salvadoran refugee girl. When two American Indian activists disappear, Robicheaux's dogged investigation not only sets him on a collision course with Mafia thugs and oil interests, but also leads him into a romance with Darlene American Horse, his ex-partner's girlfriend. All the main characters in this darkly beautiful, lyric saga carry heavy emotional baggage, and Robicheaux's sleuthing is a simultaneous exorcism of demons of grief, loss, fear, rage, vengeance. Burke's fictional terrain--stretching from the Louisiana bayous to Montana's red cliffs and pine-dotted hills--is uniquely his own, yet also a microcosm of a multi-ethnic America. He writes from the heart and the gut.","torrent":{"xt":"urn:btih:d37cadd5fc4c000ede9bad72de19531f0539a6c2","amp;dn":"James+Burke-Black+Cherry+Blue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37cadd5fc4c000ede9bad72de19531f0539a6c2","infoHashBuffer":{"type":"Buffer","data":[211,124,173,213,252,76,0,14,222,155,173,114,222,25,83,31,5,57,166,194]},"announce":[],"urlList":[]}}