{"title":"Osho - Nadabrahma meditation_deuter","uid":3800592,"size":43403264,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d37d261fb6a01d21f0a0c6b33e003ef869388677&amp;dn=Osho+-+Nadabrahma+meditation_deuter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":2,"time":1189307074,"description":"Nadabrama is old Tibetan technique which was originally done early in the morning\nIt can be done at any time of the day alone or with others, but\nhave an empty stomach and remain inactive for at least 15 minutes afterwards. \n\nThe medItation lasts an hour, and there are three stages.\n\nFirst Stage: 30 minutes\n\nSit in a relaxed position with eyes closed and lips together. Start humming, loudly enough to be heard by others and create a vibration throughout your body.\n You can visualize a hollow tube or an empty vessel, filled only with the vibrations of the humming. A point will come when the hum ming continues by itself and you become the listener. There is no special breathing and you can al ter the pitch or move your body smoothly and slowly if you feel it.\n\nSecond Stage: 15 minutes\n\nThe second stage is divided into two 7 1/2 minute sections. \nFor the first half, move the hands, palms up, in an outward circular motion.\n Starting at the navel, both hands move forwards and then divide to make two large circles mirroring each other left and right. The movement should be so slow that at times there will appear to be no movement at all. Feel that you are giving energy outwards to the universe.\n\nAfter 7 /2 minutes turn the hands, palms down, and start moving them in the opposite di rection. Now the hands will come together towards the naveland divide outwards to the sides of the body\nFeel that you are taking enrgy in.\n\nThird stage :15 min\nSit or lie absolutely quiet and still.\n","torrent":{"xt":"urn:btih:d37d261fb6a01d21f0a0c6b33e003ef869388677","amp;dn":"Osho+-+Nadabrahma+meditation_deuter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37d261fb6a01d21f0a0c6b33e003ef869388677","infoHashBuffer":{"type":"Buffer","data":[211,125,38,31,182,160,29,33,240,160,198,179,62,0,62,248,105,56,134,119]},"announce":[],"urlList":[]}}