{"title":"Opie and Anthony - 2009 SiriusXM Shows","uid":10339074,"size":30781711011,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d3ca7503b89b0d1806e6e82e377b5536ce0451e5&amp;dn=Opie+and+Anthony+-+2009+SiriusXM+Shows+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"NotHuman","files":-1,"time":1402518591,"description":"Opie and Anthony SiriusXM Shows (2004-2013)\n\nThis is a series of torrents of complete Opie and Anthony shows on SiriusXM radio in MP3 format.  It begins with their very first XM show on October 4th, 2004, and ends with the last SiriusXM show of 2013.  \n\nI will be seeding these shows year by year, and some years contain more shows than others.  For instance, 2004 only has 67 shows (since they started in October), but 2008 peaks at 277 shows.  \n\nAll the MP3s are are properly tagged and encoded at between 56 and 128kbps (most shows are at 64kbps to save space due to the length of the shows - it is mostly talking anyway). \n\nI make no claims that this is a complete Opie and Anthony collection or that every single show is complete, but I can say that there is enough O&amp;A here to listen to for a VERY long time (over 100 gigs worth in total).  If you are planning on downloading multiple torrents, simply point each torrent to download to the top level folder (&quot;O&amp;A SiriusXM Shows&quot;) and the individual years will download to their own subfolders.  \n\nThe only downside to this is that the name of each torrent may appear the same in your BT client (depending on the client).  This is necessary, however, to keep the folder structure I want as this will be a series of torrents with subfolders.  You can see which year a torrent is by clicking the Files tab for each torrent.  \n\nThe shows were all downloaded courtesy of SpreadTheOnAVirus.com at http://www.spreadtheonavirus.com.  Many, many thanks to ILuvDogShit who runs this site.  Amazing work, you da man.\n\n-devoidzer0, 2013-04-01\t\t","torrent":{"xt":"urn:btih:d3ca7503b89b0d1806e6e82e377b5536ce0451e5","amp;dn":"Opie+and+Anthony+-+2009+SiriusXM+Shows+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3ca7503b89b0d1806e6e82e377b5536ce0451e5","infoHashBuffer":{"type":"Buffer","data":[211,202,117,3,184,155,13,24,6,230,232,46,55,123,85,54,206,4,81,229]},"announce":[],"urlList":[]}}