{"title":"EMMANUELLE IN SOHO","uid":6498046,"size":654127880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d450739c977d883b0a9b3f2081eb9949383a40e9&amp;dn=EMMANUELLE+IN+SOHO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"uk_spuddybuddy","files":1,"time":1309150031,"description":"Emmanuelle in Soho was one of the last theatrically released movies of the British sexploitation era. A big hit when it was first released in UK cinemas in 1981, it is now largely forgotten. The film has never been shown on TV and has only recently been widely available on video cassette.\n\nToday it's definitely worth another look. It's a camp classic for fans of low budget British movies. Neither particularly sexy and certainly only unintentionally funny it still proves to be a revelation for anyone watching!\n\nWhilst Mandy Miller enjoys the title role of Emmanuelle, it is half-Oriental actress Julie Lee who proves to be most watchable in the supporting role as Kate. This was Lee's only big starring role (she died after a horrific car crash in 1983) and you can see why. Frankly, she was a really terrible actress. It's obvious Lee was hired primarily for her stunning looks, but her lacklustre acting skills only make her more endearing to watch.\n\nThe plot isn't really worth mentioning, Julie Lee auditions for a part in a tacky nude revue at a seedy theatre and her weedy bisexual husband gets mixed up with the insatiable Emmanuelle and an unscrupulous agent (played by the desperately unfunny John M. East).\n\nHowever, this movie is a MUST SEE! It harks back to a more innocent era of film-making when naughty little films got a big screen release and punters queued around the block to see them. Emmanuelle in Soho is wonderfully awful and very addictive. Go see it!\n","torrent":{"xt":"urn:btih:d450739c977d883b0a9b3f2081eb9949383a40e9","amp;dn":"EMMANUELLE+IN+SOHO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d450739c977d883b0a9b3f2081eb9949383a40e9","infoHashBuffer":{"type":"Buffer","data":[212,80,115,156,151,125,136,59,10,155,63,32,129,235,153,73,56,58,64,233]},"announce":[],"urlList":[]}}