{"title":"Super Scary Crochet: 35 Gruesome Patterns to Sink Your Hook Into","uid":9266415,"size":54458849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d468bcb7a395191bd80a7199199108eefa1af9e8&amp;dn=Super+Scary+Crochet%3A+35+Gruesome+Patterns+to+Sink+Your+Hook+Into&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385707130,"description":"If you are bored of cute and sweet crochet, then you will love Nicki TrenchÂ’s gruesome, spooky and downright disturbing collection of zombies, witches, murderers and more. There are four chapters of characters who have committed all kinds of unforgivable deeds. The first chapter, Scary Families, has creepy relatives who definitely believe that blood is thicker than water, such as the Queen of the Vampires, complete with felt crown and lace detailing. In Famous Scaries, meet classic characters like the Headless Horseman, who has crocheted blood spurting from his neck, and his horse Hades, made in jet-black yarn. The Living Dead is a macabre mix of werewolves, witches and the clinically insane, while the Deathly Companions chapter has murderous villains and even a shrunken head. As well as crocheting your own cast of scary characters, you will find patterns for accessories including the spider bag complete with eight legs. At the back of the book is a comprehensive techniques section explaining all you need to know, which makes the projects suitable for any skill level. Great ideas for gifts to give on Halloween or whenever thereÂ’s a full moon Â– make a mummy, devil, corpse, werewolf, three-headed dog and many more creepy characters. Comprehensive techniques section covers all the stitches needed. Visit NickiÂ’s website at www.nickitrench.com.","torrent":{"xt":"urn:btih:d468bcb7a395191bd80a7199199108eefa1af9e8","amp;dn":"Super+Scary+Crochet%3A+35+Gruesome+Patterns+to+Sink+Your+Hook+Into","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d468bcb7a395191bd80a7199199108eefa1af9e8","infoHashBuffer":{"type":"Buffer","data":[212,104,188,183,163,149,25,27,216,10,113,153,25,145,8,238,250,26,249,232]},"announce":[],"urlList":[]}}