{"title":"Bonne Femme Cookbook by Wini Moranville","uid":9646063,"size":6545294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d48c89c5d09829304c44c19006e2fff28c772b4a&amp;dn=Bonne+Femme+Cookbook+by+Wini+Moranville&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":2,"time":1392999896,"description":"\nHere is authentic French cooking without fuss or fear. When we think of French cooking, we might picture a fine restaurant with a small army of chefs hovering over sauces for hours at a stretch, crafting elegant dishes with special utensils, hard-to-find ingredients, and architectural skill. \n\nBut this kind of cooking bears little relationship to the way that real French families eat-yet they eat very well indeed. Now that the typical French woman (the bonne femme of the title) works outside the home like her American counterpart, the emphasis is on easy techniques, simple food, and speedy preparation, all done without sacrificing taste. \n\nIn a voice that is at once grounded in the wisdom of classical French cooking, yet playful and lighthearted when it comes to the potential for relaxing and enjoying our everyday lives in the kitchen, Moranville offers 300 recipes that focus on simple, fresh ingredients prepared well. The Bonne Femme Cookbook is full of tips and tricks and shortcuts, lots of local color and insight into real French home kitchens, and above all, loads of really good food. It gives French cooking an accessible, friendly, and casual spin.\n\nGenre: Non-Fiction, Cookery","torrent":{"xt":"urn:btih:d48c89c5d09829304c44c19006e2fff28c772b4a","amp;dn":"Bonne+Femme+Cookbook+by+Wini+Moranville","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d48c89c5d09829304c44c19006e2fff28c772b4a","infoHashBuffer":{"type":"Buffer","data":[212,140,137,197,208,152,41,48,76,68,193,144,6,226,255,242,140,119,43,74]},"announce":[],"urlList":[]}}