{"title":"Mike Viola and the Candy Butchers - Falling into Place [1999]","uid":9597418,"size":332086226,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d50b324c56faeee8eb614005c1e90a25e547484b&amp;dn=Mike+Viola+and+the+Candy+Butchers+-+Falling+into+Place+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GenXRock","files":-1,"time":1392049364,"description":"Review by William Ruhlmann  [-]\nIn the mid-'70s, British singer/songwriters like Graham Parker and Elvis Costello launched careers with music that tempered the onslaught of punk to a more melodic rock sound reminiscent of mid-'60s Beatles music and its many followers, and, while retaining punk's lyrical anguish, explored more complex emotions with more eloquent words. On his debut album, Mike Viola, whose voice most people heard for the first time singing &quot;That Thing You Do!&quot; in the movie of the same name, resurrects the sound of Parker &amp; the Rumour's Howlin' Wind and Costello &amp; the Attractions' This Year's Model, fronting the rhythm section known as the Candy Butchers, with occasional added keyboards by the Band's Garth Hudson. Viola's rough voice has much of Parker's urgency to it, and his songs, less substantial than those of Costello, are nevertheless concerned with many of the same elements of romantic disappointment and its attendant frustration. Indeed, he seems to be rewriting the same song over and over: &quot;All day I'm thinking about you, &quot; he sings in &quot;Give Me Some Time,&quot; and &quot;You are always on my mind&quot; in &quot;Can't We Do Anything Right,&quot; a title followed one song later by &quot;Doing It the Wrong Way.&quot; One song is called &quot;Falling into Place,&quot; another &quot;Falling Back Down.&quot; Viola's music for these confused and ambivalent sentiments is raucously played by the Candy Butchers, and occasional horn and string charts add grace without robbing the tunes of bite. Mixer Bob Clearmountain has given the album an explosive sound in which every instrument seems simultaneously very loud and distinct. Chip-on-the-shoulder sensitivity is a good combination of feelings in the ever-adolescent world of rock &amp; roll, and it works as well for Viola on this debut album as it has for others in the past. The next question is whether, like Elvis Costello, he'll evolve out of it or, like Graham Parker, keep repeating it. (4/5)","torrent":{"xt":"urn:btih:d50b324c56faeee8eb614005c1e90a25e547484b","amp;dn":"Mike+Viola+and+the+Candy+Butchers+-+Falling+into+Place+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d50b324c56faeee8eb614005c1e90a25e547484b","infoHashBuffer":{"type":"Buffer","data":[213,11,50,76,86,250,238,232,235,97,64,5,193,233,10,37,229,71,72,75]},"announce":[],"urlList":[]}}