{"title":"Boy sets fire -The Misery Index: Notes From The Plague years","uid":4184594,"size":73091782,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d5e921cb3dcbf80b749671ab7e2e9b5ce4593893&amp;dn=Boy+sets+fire+-The+Misery+Index%3A+Notes+From+The+Plague+years&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"billy_stretcher","files":13,"time":1210603223,"description":"Boy Sets Fire\nThe Misery Index: Notes From The Plague Years\nAlternative/Rock\n2006\n192Kbps\n\n1.Walk Astray\n2.Requiem\n3.Final Communique\n4.The Misery Index\n5.[10] And Counting\n6.Falling Out Theme\n7.Empire\n8.So Long... And Thanks For The Crutches\n9.With Gold Eyes\n10.Deja Coup\n11.Social Register Fanclub\n12.Nostalgic For Guillotines\n13.A Far Cry\n\n\nOne of the strongest elements of this record, as with all of the other releases in the band\\&amp;#039;s catalog, is the lyrics. In the opening track of the album, vocalist Nathan Gray sings somberly over an acoustic guitar, pleading for an alternative solution to conflict, rather than blindly charging into war. It\\&amp;#039;s obvious by this point that Nathan Gray can pen anthems of political dissent, but he is not just some one trick, anti-establishment pony. \\&quot;So Long and Thanks for the Crutches\\&quot; contains some of Gray\\&amp;#039;s most scathing lyrical content to date. With a chorus of \\&quot;Hit it hit it we\\&amp;#039;ll go straight to the top / It\\&amp;#039;s all a matter of whose cock you suck / You got the money now come on let\\&amp;#039;s go / You know you want it / Yeah you know you want it,\\&quot; one has to assume that these lyrical barbs are meant for Wind-Up Records. \n\nNoting the opening track\\&amp;#039;s use of acoustic guitar, it\\&amp;#039;s clear from the start that The Misery Index: Notes from the Plague Years is Boy Sets Fire\\&amp;#039;s most musically adventurous record to date. While that song does abandon its melancholy tone for the rage that the band has come to be known for, this is not simply some forty odd minutes of hardcore songs. The record includes a good amount of mid-tempo tracks to change things up between standard Boy Sets Fire material. \n\n\\&quot;(10) and Counting\\&quot; opens with an acoustic guitar as well, although it falls to the backburner, serving as an addition to the song, but not necessarily the basis for it. \\&quot;So Long and Thanks for the Crutches\\&quot; Opens with a jazz styled piano/horn intro, kicking into a song that is just mean as hell, sonically. The song hits its chorus aided by a horn section. You read that right, a horn section. Stranger more is the outro, with a beat that could have been lifted from something off of Warren G\\&amp;#039;s album, Regulator. The outro is coupled with an audio clip from an archived speech. \n\nBoy Sets Fire have moved on from their short, albeit rocky major label past, to create an intriguing and fantastic album for one of the scene\\&amp;#039;s strongest independent labels. Returning to their home, so to speak, seems to have pushed Boy Sets Fire to try a lot of different things, and it pays off in a big way, with a solid, ambitious record.\n\nEnjoy! :)","torrent":{"xt":"urn:btih:d5e921cb3dcbf80b749671ab7e2e9b5ce4593893","amp;dn":"Boy+sets+fire+-The+Misery+Index%3A+Notes+From+The+Plague+years","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5e921cb3dcbf80b749671ab7e2e9b5ce4593893","infoHashBuffer":{"type":"Buffer","data":[213,233,33,203,61,203,248,11,116,150,113,171,126,46,155,92,228,89,56,147]},"announce":[],"urlList":[]}}