{"title":"A Beautiful Mind - Sylvia Nasar","uid":5711627,"size":440790851,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d627762aa775ecaeb118849f19ca9e8b0044fc8e&amp;dn=A+Beautiful+Mind+-+Sylvia+Nasar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"captainelliotspencer","files":19,"time":1279921473,"description":"A Beautiful Mind - Sylvia Nasar\n\nStories of famously eccentric Princetonians abound--such as that of chemist Hube\nrt Alyea, the model for The Absent-Minded Professor, or Ralph Nader, said to hav\ne had his own key to the library as an undergraduate. Or the &quot;Phantom of Fine H\nall,&quot; a figure many students had seen shuffling around the corridors of the math\nand physics building wearing purple sneakers and writing numerology treatises o\nn the blackboards. The Phantom was John Nash, one of the most brilliant mathema\nticians of his generation, who had spiraled into schizophrenia in the 1950s. Hi\ns most important work had been in game theory, which by the 1980s was underpinni\nng a large part of economics. When the Nobel Prize committee began debating a p\nrize for game theory, Nash's name inevitably came up--only to be dismissed, sinc\ne the prize clearly could not go to a madman. But in 1994 Nash, in remission fr\nom schizophrenia, shared the Nobel Prize in economics for work done some 45 year\ns previously.\nEconomist and journalist Sylvia Nasar has written a biography of Nash that looks\nat all sides of his life. She gives an intelligent, understandable exposition o\nf his mathematical ideas and a picture of schizophrenia that is evocative but de\ncidedly unromantic. Her story of the machinations behind Nash's Nobel is fascina\nting and one of very few such accounts available in print.\n\n56Kb. 18 CDs. Read by Anna Fields. Blackstone Audio, 1999.\n\n---------------------------------------\nVisit us for this and loads more:\n\nwww.audiobookvault.com\n---------------------------------------","torrent":{"xt":"urn:btih:d627762aa775ecaeb118849f19ca9e8b0044fc8e","amp;dn":"A+Beautiful+Mind+-+Sylvia+Nasar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d627762aa775ecaeb118849f19ca9e8b0044fc8e","infoHashBuffer":{"type":"Buffer","data":[214,39,118,42,167,117,236,174,177,24,132,159,25,202,158,139,0,68,252,142]},"announce":[],"urlList":[]}}