{"title":"Lord Of The Two Lands by Judith Tarr","uid":9634574,"size":446038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6ba35a57d23d1701ad49489fa2eef6da9f0e55a&amp;dn=Lord+Of+The+Two+Lands+by+Judith+Tarr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"PirateBook","files":1,"time":1392830986,"description":"\nIn 336 B.C., Egypt lay under the yoke of Persia, ruled by Governors appointed by the King of Kings in Persis. And in the Temple of Amon in Thebes dwelt the only living child of Nectanebo, the last fully Egyptian Pharaoh, who had been defeated in battle and slain by Darius's servants.\n\nBut from the north a spirit of fire was moving across the World. A great warrior and general, the king of Macedonia, had risen to rule the Hellenic city-states. Now he was determined to challenge the might of the Persian Empire, to engage Darius himself in battle, and to defeat him. He was called Alexander, and the priests of Amon in Egypt saw that he was destined to rule their ancient land. \n\nSo they sent Meriamon, Beloved of Amon, daughter of Pharaoh, Singer and Priestess of the God, up from Egypt to the Plains of Issus, where a great battle had been fought, and the Persian king defeated. There she was to find Alexander, and persuade him to turn from the straight Eastward road and come south - where the double crown of Egypt awaited him.\n\nLORD OF THE TWO LANDS is firmly based in the history of Alexander the Great, and then steeped in the rich, sun-drenched magics of ancient Egypt. It will transport you back to the time of heroes, when one man changed the face of the world.\n\nGenre: Fiction/Historical/Fantasy","torrent":{"xt":"urn:btih:d6ba35a57d23d1701ad49489fa2eef6da9f0e55a","amp;dn":"Lord+Of+The+Two+Lands+by+Judith+Tarr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6ba35a57d23d1701ad49489fa2eef6da9f0e55a","infoHashBuffer":{"type":"Buffer","data":[214,186,53,165,125,35,209,112,26,212,148,137,250,46,239,109,169,240,229,90]},"announce":[],"urlList":[]}}