{"title":"Gregg Braden - L'effet isaie","uid":13455891,"size":1080959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d721acda789e12101422c40bfb67083409abc3f9&amp;dn=Gregg+Braden+-+L%27effet+isaie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"asperge","files":1,"time":1454844209,"description":"Gregg Braden - L'effet isaie\r\nAriane | ISBN : 292098747X | 2000 | PDF | 128 pages | 1 Mo\r\n\r\nDans L'effet Isaïe, Gregg Braden, l'auteur de L'éveil au point zéro et de Marcher entre les mondes, combine les recherches faites en physique quantique avec les œuvres du prophète Isaïe et des anciens Esséniens. Il montre comment les prophéties concernant les catastrophes et les souffrances généralisées ne sont peut-être que d'éventuelles possibilités, plutôt que la prédiction d'une fatalité imminente, et que nous avons en fait le pouvoir d'influer sur ces possibilités. Se pourrait-il qu'une science perdue existe et nous permette de transcender les visions prophétiques de guerres, de maladies et des plus grands malheurs pouvant s'abattre sur l'humanité ? Est-il possible que dans les brumes de nos vieilles mémoires se tapisse un événement qui a laissé un vide dans notre connaissance quant à la façon dont nous entrons en rapport les uns avec les autres et avec notre monde ? Des textes datant d'il y a deux mille cinq cents ans, combinés à des découvertes de la science moderne, semblent suggérer que la réponse à ces questions et à d'autres questions semblables soit un retentissant &quot; Oui ! &quot;. par ailleurs, par le truchement d'un langage que nous commençons à peine à comprendre, l'auteur nous rappelle que nous disposons de deux &quot; technologies &quot; nous redonnant le pouvoir de choisir la condition de notre corps physique et l'avenir de notre monde. La première est la science de la prophétie, grâce à laquelle nous pouvons avoir un aperçu des conséquences futures des choix individuels et collectifs que nous effectuons dans le présent. La seconde se réfère à la technologie de la science perdue de la prière, qui nous permet de choisir la prophétie que nous voulons vivre. Chaque fois que nous la mettons en œuvre, nous faisons l'expérience de l'effet Isaïe","torrent":{"xt":"urn:btih:d721acda789e12101422c40bfb67083409abc3f9","amp;dn":"Gregg+Braden+-+L%27effet+isaie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d721acda789e12101422c40bfb67083409abc3f9","infoHashBuffer":{"type":"Buffer","data":[215,33,172,218,120,158,18,16,20,34,196,11,251,103,8,52,9,171,195,249]},"announce":[],"urlList":[]}}