{"title":"Voices from Post-Saddam Iraq: Living with Terrorism, Insurgency,","uid":8622358,"size":926326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7aca3fd78b02b3b5f20d44755bf622c3bb6d8ce&amp;dn=Voices+from+Post-Saddam+Iraq%3A+Living+with+Terrorism%2C+Insurgency%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1372410380,"description":"\n\nEven today, most Americans can not understand just why the fighting continues in Iraq, whether our nation should be involved there now, and how we could change our tactics to help establish a lasting peace in the face of what many fear will become a full-fledged civil war. In the book at hand, Victoria Fontan - a professor of peace and conflict studies who lived, worked and researched in Iraq - shares pointed insights into the emotions of IraQ&amp;Apos;s people, and specifically how democratization has in that country come to be associated with humiliation. Including interviews with common people in Iraq this work makes clear how laudable intentions do not always bring the desired result when it comes to international conflict and cross-cultural psychology. For example, Fontan explains, one might consider the comment of a young Shiite: The greatest humiliation of all was to see foreigners topple Saddam, not because we loved him, but because we could not do it ourselves.\n\nThis gripping text is focused on a new and growing area of human psychology - humiliation studies. In it, this leader at the United Nations-mandated University for Peace spotlights aspects of U.S. actions - and Iraqi perceptions - that have fueled ongoing conflict and left some increasingly outspoken residents of the U.S., and the rest of the world, demanding that foreign forces be withdrawn and the Iraqis left to their own accord. The work examines issues including how and when the Iraqis began to see the United States, as not a liberator but as an occupier; how both Abu Ghraib and our ensuing handling of the scandal heightened Iraqi humiliation and fighting; how we've fueled the ethno-religious unrest that still rages today; and how the Post-Saddam elections paved the way for civil war. Fontan also describes the role of women in Iraq who may ultimately be an important key to peace and explains her views on the new role the U.S. may play to better help establish peace.\n\n\n# Hardcover: 240 pages\n# Publisher: Praeger (December 30, 2008)\n# Language: English\n# ISBN-10: 0313365326\n# ISBN-13: 978-0313365324\n &lt;a href=&quot;\nhttp://bayimg.com/aanNCaaeh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aanNCaaeh&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Voices-Post-Saddam-Iraq-Insurgency-International/dp/0313365326&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Voices-Post-Saddam-Iraq-Insurgency-International/dp/0313365326&lt;/a&gt;","torrent":{"xt":"urn:btih:d7aca3fd78b02b3b5f20d44755bf622c3bb6d8ce","amp;dn":"Voices+from+Post-Saddam+Iraq%3A+Living+with+Terrorism%2C+Insurgency%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7aca3fd78b02b3b5f20d44755bf622c3bb6d8ce","infoHashBuffer":{"type":"Buffer","data":[215,172,163,253,120,176,43,59,95,32,212,71,85,191,98,44,59,182,216,206]},"announce":[],"urlList":[]}}