{"title":"Lee Woudberg - Modus Operandi (911 And 7/7 Parallels)","uid":5617407,"size":163919709,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d81051eb952cac935cce25f340c5c869a11cf88a&amp;dn=Lee+Woudberg+-+Modus+Operandi+%28911+And+7%2F7+Parallels%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Porkster","files":1,"time":1276118675,"description":"About the Seminar\n9/11 and 7/7. Two days that changed our world. Two events. Several similarities. Do you question the official stories regarding these so called &quot;terrorist attacks&quot;?. Are you labeled &quot;a conspiracy theorist&quot; for simply having questions and pointing out evidence to the contrary? Many advocates of the government line regarding these two events will simply not consider alternative views against what they have been told is true and instead stubbornly repeat the media mantra of &quot;Islamic extremism is to blame&quot; no matter what piece of alternative material is presented to them. Must we now employ a different tactic? Join us as we set &quot;conspiracy theories&quot; to one side and instead scrutinize the mainstream perspective regarding these two unprecedented atrocities. Using material gathered from news outlets, government spokespeople, intelligence agencies and other official sources we will consider the many fundamental and concurrent elements of the official viewpoints regarding 9/11 &amp; 7/7 and piece together, bone by bone, the anatomy of attack. A skeletal framework which, when viewed in its simplicity, may force even the most ardent &quot;coincidence theorist&quot; to reconsider their standpoint...\n\nAbout the Speaker\nLee Woudberg has been living in Liverpool for 15 years deciding to stay in the city after completing his degree course in the late 90's. He has been studying the Occult for some 20 years, particularly Tropical Astrology. He is a founder member of MerseysideTruth which set up January 2007. The group has played host to David Shayler and Annie Machon and to William Rodriguez - the &quot;last man out of the Twin Towers&quot;. Lee has also been actively involved in the Edinburghtruth movement with Liverpool's own Tim Bleasedale, showing his own presentations which include &quot;The Penny Drops&quot; a film which explores the possibility of a Cashless Society. On 9/11, before the event itself, Lee had almost given up on his Occult studies. Wishing for a more normal, simpler life. That was until the first plane-strike, which coincided with a knock on his front door from a visitor, returning a book on Astrology...\n &lt;a href=&quot;\nhttp://www.metaknowledge.co.uk/about.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.metaknowledge.co.uk/about.html&lt;/a&gt;\n\n(Filmed on Thursday 20th May 2010 7.30pm, Liverpool. )\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Copy Our Torrents To All Open Trackers!!!\n\n","torrent":{"xt":"urn:btih:d81051eb952cac935cce25f340c5c869a11cf88a","amp;dn":"Lee+Woudberg+-+Modus+Operandi+%28911+And+7%2F7+Parallels%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81051eb952cac935cce25f340c5c869a11cf88a","infoHashBuffer":{"type":"Buffer","data":[216,16,81,235,149,44,172,147,92,206,37,243,64,197,200,105,161,28,248,138]},"announce":[],"urlList":[]}}