{"title":"The Psionics Handbook (1st Edition) 2014 Project Life-Command","uid":10646545,"size":6651041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d847bab24f9485da076eb6fb20aebddffc1e3312&amp;dn=The+Psionics+Handbook+%281st+Edition%29+2014+Project+Life-Command&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Project-LifeCommand","files":-1,"time":1406553358,"description":"ATTENTION: This Is An Updated Version From The Last Release A Month Ago. The Release From A Month Ago Was An Early Release And Had 123 Spelling and Grammar Errors That Are Now Fixed In This One. This Also Has About Two Pages Of Additional Text added.\n\nThis is currently only a PDF E-Book. Please keep checking back for more torrents when more file formats will be available and other e-books will be released also.\n\nPlease share with others, and please read the e-book before commenting. Comments based upon assumptions and judgmental views, only reflect stupidity and ignorance.\n\n\nFile Types: PDF\n\nAuthor: Selective\n\nPublisher: Project Life-Command\n\nYear: 2014 (First Edition)\n\nPages: 186\nWord Count: 70,894\n\nISBN-10: 0971053820\nISBN-13: 978-0-9710538-2-3\n\nCopyright Â© 2014 by Selective\n\nThis Is A Free Torrent Version Made\nUnder The Agreement Of The Publisher\nAnd All Copyright Owners.\nAvailable From The Publisher Web Site.\n\nThis Is A Legal Torrent,\n\nYOU'RE FREE TO MAKE COPIES, JUST DON'T SELL THEM!\n\n-------------------------------------------------\nSUMMARY\n\n     This is a science book that simplifies real supernatural abilities, and explains everything paranormal from an understanding of the mind beyond our perception of matter and time. This is the first book of its kind, and I am making way for a new field of science. Do keep in mind though that this is an unfinished book, as the research is still continuing. As more information is discovered and made available, new versions of this book will be released. Join the PLC Forum on the publishers web site to help in our research.\n\n     In this book everything is simplified, and everything is descriptive, explaining in detail how all abilities work and how they connect, so most labels for abilities are not mentioned. However, I have seen and done many things most would deem impossible, so set aside your assumptions because I didn't just work in black projects, I created them. When you have a detailed view of abilities and how they work, such as I do, there is actually only one ability that is the foundation for all abilities. To alter and manipulate matter by thought.\n\n-------------------------------------------------","torrent":{"xt":"urn:btih:d847bab24f9485da076eb6fb20aebddffc1e3312","amp;dn":"The+Psionics+Handbook+%281st+Edition%29+2014+Project+Life-Command","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d847bab24f9485da076eb6fb20aebddffc1e3312","infoHashBuffer":{"type":"Buffer","data":[216,71,186,178,79,148,133,218,7,110,182,251,32,174,189,223,252,30,51,18]},"announce":[],"urlList":[]}}