{"title":"Madonna Discography 1983 - 2012 (P.a.I.D.)","uid":11372523,"size":1010359710,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d8b62197f5683bbeea1d6094a5524dabaf519348&amp;dn=Madonna+Discography+1983+-+2012+%28P.a.I.D.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"therealrawofbaycity","files":-1,"time":1415061299,"description":"Madonna discography 1983 - 2012\n\n1983 Madonna\n1984 Like a Virgin\n1986 True Blue\n1989 Like a Prayer\n1992 Erotica\n1994 Bedtime Stories \n1998 Ray of Light\n2000 Music \n2003 American Life \n2005 Confessions on a Dance Floor \n2008 Hard Candy\n2012 MDNA\n\nMadonna Louise Ciccone[2] (/tÊƒÉªËˆkoÊŠni/; born August 16, 1958) is an American singer, songwriter, actress, and businesswoman. She achieved popularity by pushing the boundaries of lyrical content in mainstream popular music and imagery in her music videos, which became a fixture on MTV. Madonna is known for reinventing both her music and image, and for retaining a standard of autonomy within the recording industry. Music critics have acclaimed her musical productions which have also been known to induce controversy. Often referred to as the &quot;Queen of Pop&quot;, she is cited as an influence among other artists around the world.\n\nBorn in Bay City, Michigan, Madonna moved to New York City to pursue a career in modern dance. After performing in the music groups Breakfast Club and Emmy, she signed with Sire Records (an affiliate of Warner Bros. Records) in 1982 and released her self-titled debut album the following year. She followed it with a series of commercially successful albums, including the Grammy Award winners Ray of Light (1998) and Confessions on a Dance Floor (2005). Throughout her career, she has written and produced most of her songs, with many of them reaching number one on the record charts, including &quot;Like a Virgin&quot;, &quot;Into the Groove&quot;, &quot;Papa Don't Preach&quot;, &quot;Like a Prayer&quot;, &quot;Vogue&quot;, &quot;Frozen&quot;, &quot;Music&quot;, &quot;Hung Up&quot;, and &quot;4 Minutes&quot;.\n\nMadonna's popularity was further enhanced by her film roles; she won a Golden Globe Award for Best Actress in Motion Picture Musical or Comedy for Evita (1996) while most of her other films have been panned by critics. Her other ventures include fashion design, writing children's books, and filmmaking. She has been acclaimed as a businesswoman, particularly after she founded entertainment company Maverick (including the label Maverick Records) in 1992 as a joint venture with Time Warner. In 2007, she signed an unprecedented US $120 million 360 deal with Live Nation.\n\nMadonna has sold more than 300 million records worldwide and is recognized as the best-selling female recording artist of all time by Guinness World Records. According to the Recording Industry Association of America (RIAA), she is the best-selling female rock artist of the 20th century and the second best-selling female artist in the United States, with 64.5 million certified albums. Billboard ranked her at number two, behind only The Beatles, on the Billboard Hot 100 All-Time Top Artists, making her the most successful solo artist in the history of American singles chart. The magazine also declared her as the top-touring female artist of all time. She became one of the five founding members of the UK Music Hall of Fame and was inducted into the Rock and Roll Hall of Fame in her first year of eligibility","torrent":{"xt":"urn:btih:d8b62197f5683bbeea1d6094a5524dabaf519348","amp;dn":"Madonna+Discography+1983+-+2012+%28P.a.I.D.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8b62197f5683bbeea1d6094a5524dabaf519348","infoHashBuffer":{"type":"Buffer","data":[216,182,33,151,245,104,59,190,234,29,96,148,165,82,77,171,175,81,147,72]},"announce":[],"urlList":[]}}