{"title":"Total Marvel Week of 5/28/2014 (darkhomr) [ALL]","uid":10259186,"size":907603390,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d94036e50e93ee933e3ed3b781d7c4ca5ec6563d&amp;dn=Total+Marvel+Week+of+5%2F28%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"dadrkhomr","files":-1,"time":1401441413,"description":"Each week I will be posting the current week's Marvel titles These are the titles for May 28, 2014. \n\nIncluded in this pack will be all Marvel comics and Marvel NOW comics. What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\n My release packs are as follows: \n\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\nAll New Invaders #5 (CBR 5/28/2014)\n\nTHE WORLD-SHATTERING CONCLUSION TO &quot;GODS AND SOLDIERS&quot;!!! The INVADERS are trapped on a hostile world and under relentless attack from a mind-controlled god. Facing a fate worse than defeat, will CAPTAIN AMERICA, NAMOR, THE HUMAN TORCH and WINTER SOLDIER become the means for the KREE EMPIRE to conquer the galaxy?! What role does one of the MARVEL UNIVERSE'S most powerful races play in this grand finale? \n\nAvengers #30 (CBR 5/28/2014)\n\nWHAT DID HE SEE? \n\nDeadpool #29 (CBR 5/28/2014)\n\nWHAT DID HE SEE? \n\nDexter Down Under #4 (of 5) (CBR 5/28/2014)\n\nDEXTER'S BACK IN AN INTERNATIONAL ADVENTURE WRITTEN BY HIS CREATOR JEFF LINDSAY! Dexter Morgan, the serial killer of serial killers, is on the trail of a new murderer . . . but he's away from his cool Miami beat and feeling the Australian heat! When everything is flipped Down Under, Dexter isn't the hunter-he's the prey! Not only is Dexter being stalked, he's trapped in a private big game preserve-where humans are the game! Will this one end with a bang? \n\nDisney Kingdoms Seekers Of Weird #5 (of 5) (CBR 5/28/2014)\n\nTHE ACTION-CRAMMED FINALE TO MARVEL'S FIRST DISNEY KINGDOMS ADVENTURE! It's the strangest-and most treacherous-museum in history, and Melody and Maxwell Keep will have to fight through it to save their kidnapped parents! Save the world &amp; doom their family-or save their family and doom the world? No matter what Melody and Maxwell choose, everyone is out to get them! Designed - but never built - by famous Walt Disney Imagineer Rolly Crump, the Museum of the Weird at last comes to life! \n\nFantastic Four #5 (CBR 5/28/2014)\n\n'THE FALL OF THE FANTASTIC FOUR' PART 5 - Super-Sized issue! The Baxter Building is quarantined and shut down! The Fantastic Four held accountable for the destruction in Manhattan! A major turning point for the team and a dire blow to the family! The trial of the century featuring an all-star roster of guest artists! \n\nGiant Size Spider-Man #1 (CBR 5/28/2014)\n\nYoung Peter Parker is the high school bullies' favorite target. But all that changes the day a science experiment goes wrong, and Peter begins to transform! When a personal tragedy teaches Peter a harsh lesson in responsibility, he must find the inner strength to become a hero! Can the brand-new Spider-Man master his new powers in time to take on the villainous Vulture? When a giant robot spider attacks New York, Spider-Man must prove his innocence by tracking down the scientist responsible: the diabolical Dr. Octopus! When the sinister Sandman assaults Midtown High, it's up to Peter to stop him--even if must risk revealing his secret identity!Four titanic tales set in Spider-Man's past! \n\nGuardians of the Galaxy #15 (CBR 5/28/2014)\n\nWith the entire galaxy gunning for the Guardians and Peter Quill missing, its time to bring in a little help. Captain Marvel JOINS the Guardians of the Galaxy! But where in the universe is Star-Lord? And what does his disappearance mean for the safety of earth?! \n\nInhuman #2 (CBR 5/28/2014)\n\nNew Inhumans are transformed every day as the Terrigen Mist spreads around the world. Queen Medusa finds herself face to face with Captain America, and it doesn't go well. Who is Lash and what does he want with the new Inhumans? \n\nIron Man #26 (CBR 5/28/2014)\n\nTHE SHOCKING CONCLUSION TO &quot;RINGS OF THE MANDARINS&quot; What returns from the DARK ELF REALM? TONY and ARNO have been getting on so well. I hope there's no reason for them to fall out. IRON MAN wins but does MALEKITH get a consolation prize? \n\nIron Patriot #3 (CBR 5/28/2014)\n\n&quot;UNBREAKABLE&quot; PART 3 Iron Patriot's family dances on the edge. The scope of the plan is revealed. James Rhodes dies. \n\nMarvels Guardians Of Galaxy Prelude #2 (of 2) (CBR 5/28/2014)\n\nGET READY FOR MARVEL'S GUARDIANS OF THE GALAXY WITH THIS ALL-NEW ADVENTURE STARRING ROCKET RACCOON and GROOT! It's the first Marvel Cinematic Universe comic appearance of your new favorite duo-Rocket Raccoon and Groot--written by your other favorite duo: Dan Abnett &amp; Andy Lanning! The bizarre bounty hunters may literally be from two different worlds, but when their latest gig takes a deadly turn they'll show everyone why those who underestimate them end up on the wrong end of a blaster! You know you want to brag to everyone that you knew all about Rocket and Groot before they did . . . so read this first! \n\nMighty Avengers #10 (CBR 5/28/2014)\n\nWHAT DID HE SEE? \n\nMs Marvel #4 (CBR 5/28/2014)\n\nMarvel's breakout hit, Ms. Marvel, continues as Kamala Khan discovers the dangers of her newfound powers. And unlocks a secret behind them as well. Don't miss the boldest (and adorable-est!) hero to make her Marvel debut! \n\nThanos Annual #1 (CBR 5/28/2014)\n\nJim Starlin returns to Thanos, and he's brought INFINITY GAUNTLET artist Ron Lim with him! Thanos must face Mephisto, his future self, the Avengers and more! Learn how a devastating defeat in Thanos' past set events into motion that will redefine the Marvel Universe in the near future! A prequel to the upcoming THANOS: THE INFINITY REVELATION original graphic novel! \n\nThunderbolts #26 (CBR 5/28/2014)\n\nAn ancient cosmic power has corrupted a former ally... Can the Thunderbolts take him down before their time's all up? Adventure in the mysterious jungle-as only Marvel can do! \n\nUncanny Avengers #20 (CBR 5/28/2014)\n\nUnite or die! The Avengers Unity Squad pull it together, but is it too late? Which of the seven futures will become dominant? Kang's ultimate goal revealed! The Uncanny Avengers learn that even if you have no other choice, never trust Kang. \n\nWinter Soldier Bitter March #4 (of 5) (CBR 5/28/2014)\n\nCan the Red Room keep the Winter Soldier under control after Bucky's consciousness begins to surface? S.H.I.E.L.D. agent Ran Shen continues his desperate battle to save a woman who holds the key to the Cold War. HYDRA, S.H.I.E.L.D. and the Winter Soldier all play a role in creating the monster that will one day break Captain America! \n\nWolverine #7 (CBR 5/28/2014)\n\nTHE MADRIPOOR JOB - Part 2  As his plan to take down Sabretooth takes shape, Wolverine goes undercover in Madripoor - but he's not the only one with his eyes on Sabretooth's empire - what do PETE WISDOM &amp; MI-13 have to do with it? Paul Cornell (WOLVERINE: KILLABLE) and Gerardo Sandoval (CABLE &amp; X-FORCE) bring you a two part epic that'll push the mortal Wolverine to his limits! \n\n","torrent":{"xt":"urn:btih:d94036e50e93ee933e3ed3b781d7c4ca5ec6563d","amp;dn":"Total+Marvel+Week+of+5%2F28%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d94036e50e93ee933e3ed3b781d7c4ca5ec6563d","infoHashBuffer":{"type":"Buffer","data":[217,64,54,229,14,147,238,147,62,62,211,183,129,215,196,202,94,198,86,61]},"announce":[],"urlList":[]}}