{"title":"Archaeological Diggings - July 2014  AU","uid":10488321,"size":15373253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d98864c9c6dcfe3703d1d0f34e62f45685b87de4&amp;dn=Archaeological+Diggings+-+July+2014++AU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bpfine","files":-1,"time":1404513331,"description":"\nArchaeological Diggings - July 2014  AU\n\n68 Pages | True PDF | English | 14 MB \n\n\nCome on the journey of a lifetime through the insights of Australia's top magazine of ancient history and archaeology; specialising in fascinating discoveries from the Middle East. Travel back in time to the ancient civilizations of the Egyptians, Hittites, Assyrians, Babylonians, Israelites, Greeks and Romans to understand how these people lived. Discover the exhilarating work of archaeologists in the field both today and in the past. Learn of the thrill that comes with the exciting discoveries of modern archaeology. Find out why the ancient past is the key to understanding the present and facing the future with confidence. Visit lost cities such as Petra and Pompeii, and walk in the footsteps of Jesus and the prophets in the Bible Lands. Understand how the discoveries of archaeology reveal the historical accuracy of the Bible. Get information on how to join our tours to Rome, Greece, Turkey, Lebanon, Iran, Egypt and Jordan. Know where to see our amazing archaeological exhibits and where our next archaeological diggings seminars will be held. Archaeological Diggings is a 68 page, bi-monthly magazine reporting the latest news from the world of Archaeology.\n\n","torrent":{"xt":"urn:btih:d98864c9c6dcfe3703d1d0f34e62f45685b87de4","amp;dn":"Archaeological+Diggings+-+July+2014++AU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d98864c9c6dcfe3703d1d0f34e62f45685b87de4","infoHashBuffer":{"type":"Buffer","data":[217,136,100,201,198,220,254,55,3,209,208,243,78,98,244,86,133,184,125,228]},"announce":[],"urlList":[]}}