{"title":"Palms (2013) [FLAC]","uid":8629765,"size":332997725,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da907b0e83ee1339f3848bebfcb5fb663c7152e9&amp;dn=Palms+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1372607482,"description":"\n  Palms (2013) [FLAC]\n\n  * Released: 2013\n  * Duration: 46:57\n  * Genre: Pop/Rock\n  * Styles: Post-Rock, Post-Metal\n  * Source: CD (log + cue)\n  * Codec: FLAC\n  * Bit Rate: ~ 950 kbps\n  * Bit Depth: 16\n  * Sampling Rate: 44,100 Hz\n\n  Tracks\n\n  * 01 Future Warrior\n  * 02 Patagonia\n  * 03 Mission Sunset\n  * 04 Shortwave Radio\n  * 05 Tropics\n  * 06 Antartic Handshake \n\n  Album Review \n\n  * Much like a photo-hunt puzzle where two nearly identical objects are placed next to one another and the viewer has to spot the differences, Palms' self-titled debut finds the art-metal group providing listeners with an aural variation of the game. Made up of members of post-metal icons Isis and Deftones, the band make for an interesting puzzle for fans to comb over, sounding at times similar to and completely different than their other bands. Sure, Jeff Caxide's flowing, watery basslines can still be heard all over the albums, but here they're allowed a little more room to breathe. And the vocals of Chino Moreno are certainly an unmistakable element wherever they appear, but in this more chilled-out context, it's possible to appreciate their dreamlike qualities as they drift through Palms flowing melodies rather than the monster riffs he's normally singing over for the Deftones. \n\n  * Little tweaks like these make it easy to see Palms as their own entity rather than merely Isis with Moreno instead of Aaron Turner and Michael Gallagher, and while the band is certainly faced with the trouble of standing in their own, massive shadows, and though it's probably not the worst problem in the world for a band to have, it's one that Palms are more than capable of tackling head on. For fans of the members' other groups, Palms' debut is an easy recommendation that will leave listeners enjoying the similarities and getting lost exploring the differences.\n\n  Artist Bio\n\n  * Formed in 2011, Palms is an art metal supergroup consisting of former Isis members Jeff Caxide, Aaron Harris, and Bryant Clifford Meyer, and Deftones' Chino Moreno. With a patient and atmospheric sound that skews toward the lighter side of any of the member's previous work, the band's music evokes their pasts without directly copying from it, a real feat considering the distinctive work they've already done. In 2013, the band made their debut with a self-titled album released on Mike Patton's Ipecac label.","torrent":{"xt":"urn:btih:da907b0e83ee1339f3848bebfcb5fb663c7152e9","amp;dn":"Palms+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da907b0e83ee1339f3848bebfcb5fb663c7152e9","infoHashBuffer":{"type":"Buffer","data":[218,144,123,14,131,238,19,57,243,132,139,235,252,181,251,102,60,113,82,233]},"announce":[],"urlList":[]}}