{"title":"Jennifer Saunders, Bonkers, My Life in Laughs 2013 dovah","uid":9111787,"size":15368733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db03906311f099a67e7313f243c3f02657973b57&amp;dn=Jennifer+Saunders%2C+Bonkers%2C+My+Life+in+Laughs+2013+dovah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dovah12","files":-1,"time":1382958743,"description":"\nBonkers: My Life in Laughs\n\n\nAuthor : Jennifer Saunders\nisbn : 0241001560\nformat : epub mobi\nPublished October 10th 2013 by Viking\n\n\n'As the steady march of time takes its toll on my memory and the vultures circle, I thought I should have a stab at recollecting how it all happened. . .'\n\n\nJennifer Saunders' brilliant comic creations have brought joy to millions for three decades. From Comic Strip to Comic Relief, from Bolly-swilling Edina in Absolutely Fabulous to Meryl Streep in Mamma Mia, her characters are household names.\n\nBut it's Jennifer herself who has a place in all our hearts. This is her funny, touching and disarmingly honest memoir, filled with stories of friends, laughter and occasional heartache - but never misery.\n\nFrom her childhood on RAF bases, where her father was a pilot, to her life-changing encounter with a young Dawn French, on to success and family, the book charts her extraordinary story, including the slip ups and battles along the way.\n\nPrepare to chuckle, cry, and whoop with delight.\n\n================\n\nJennifer Jane Saunders is a BAFTA and Emmy Award-winning English comedienne, screenwriter and actress.\n\nShe first came into widespread attention in the 1980s and the early 1990s when she became a member of The Comic Strip after graduating from the Central School of Speech and Drama. Along with her comedy partner Dawn French, she proceeded to write and star in their eponymous sketch show, French &amp; Saunders, and received international acclaim for writing and playing the lead role of Edina Monsoon in the BBC sitcom Absolutely Fabulous.\n\nIn her other work, she has guest starred in the US-made sitcoms Roseanne and Friends, and won the American People's Choice Award for voicing the wicked Fairy Godmother in DreamWorks' animated Shrek 2. More recently, she has written and starred in Jam &amp; Jerusalem and The Life and Times of Vivienne Vyle\n================\n\nDovah","torrent":{"xt":"urn:btih:db03906311f099a67e7313f243c3f02657973b57","amp;dn":"Jennifer+Saunders%2C+Bonkers%2C+My+Life+in+Laughs+2013+dovah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db03906311f099a67e7313f243c3f02657973b57","infoHashBuffer":{"type":"Buffer","data":[219,3,144,99,17,240,153,166,126,115,19,242,67,195,240,38,87,151,59,87]},"announce":[],"urlList":[]}}