{"title":"Mastering Photoshop for Web Design, Vol. 2-Manhide","uid":6994428,"size":54407073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db1533016f54475b07460fb14743b53081b911b2&amp;dn=Mastering+Photoshop+for+Web+Design%2C+Vol.+2-Manhide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"manhide","files":-1,"time":1327822680,"description":"As the technology becomes more advanced, all of us seek for time-saving tips and guidelines to make our work much more effective and productive. The brand new eBook &quot;Mastering Photoshop for Web Design Vol. 2&quot; contains 11 articles that cover useful and partly unknown Photoshop techniques and tricks from experts in the field. The articles discuss retouching, cloning, composting, obscure Photoshop time savers and designing for iPhone. The articles have been published on Smashing Magazine in 2010 and 2011 and have been carefully edited and revised.\nProductivity is a crucial asset of professional designers. Photoshop is an extremely powerful application for photo processing and image manipulation, and we can make it even more powerful by using advanced techniques and design approaches that professionals and experts in the field are using regularly. The better our professional skills are, the more time we can spend to focus on the actual design process rather than the tool we are using to implement it on screen. This book is the brand new Photoshop eBook edition in our Smashing eBook Series which will help you mastering Photoshop and gain a more efficient, advanced workflow in your design process.","torrent":{"xt":"urn:btih:db1533016f54475b07460fb14743b53081b911b2","amp;dn":"Mastering+Photoshop+for+Web+Design%2C+Vol.+2-Manhide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db1533016f54475b07460fb14743b53081b911b2","infoHashBuffer":{"type":"Buffer","data":[219,21,51,1,111,84,71,91,7,70,15,177,71,67,181,48,129,185,17,178]},"announce":[],"urlList":[]}}