{"title":"Sex Message **NEW 2014** WEB-DL MP4-RARBG","uid":11290386,"size":1360018731,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:db384f55048a162b091babc63316d45d7ded1060&amp;dn=Sex+Message+%2A%2ANEW+2014%2A%2A+WEB-DL+MP4-RARBG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"TKTh3K1ng","files":2,"time":1414323567,"description":"[b]Sex Message\nViv Thomas - Girlfriends Films / Year: 2014\n\nCast[/b]\nBailey Rider , Chelsy Sun , Silvie Luca , Whitney Conroy , Timea Bela , Eveline , Naomi (III) , Rosaline Rose\n\n[b]SCREENSHOTS :[/b]\n\n[b]Synopsis[/b]\nText messaging becomes both a form of foreplay and a method to bridge the gap between fantasy and reality in this sizzling lesbian offering from director Andrej Lupin. The four extended episodes of &quot;Sex Message&quot; share some common elements: they all begin with two beautiful women exchanging sexually suggestive text messages, and they all involve superheated two-girl erotic encounters, but each self-contained scene boasts its own unique flavor. As Whitney Conroy and Bailey Ryder trade texts both women grow increasingly aroused - Ryder even plays with a vibrator during the exchange, and Conroy puts the sex toy to good use as she ravages Ryder. The pace is brisk and the action intense as Whitney skillfully brings Bailey to several orgasmic peaks, and when the tables are turned Ryder returns the favor with similar intensity and explosively pleasurable results. Evaline Neill is at home and Chelsea Sun is in her car when their texting session begins, but they're soon brought together for a steamy session of cunnilingus, analingus, and tribbing that leaves both beauties thoroughly satisfied. Dark-haired Silvie Luca and blonde Naomi Nevena make a particularly striking pair, and director Lupin's lens captures every mouthwatering, pulse-pounding aspect of their torrid tryst with eye-pleasing and uninhibited style. An extra dose of romance and more than a hint of tease adds drama to the concluding coupling, in which raven-tressed temptress Rosaline Rosa and Timea Bella are teamed for an extended session of anything-goes girl/girl action. If you crave gorgeous women engaging in outrageously orgasmic Sapphic sex, &quot;Sex Message&quot; definitely has your number!","torrent":{"xt":"urn:btih:db384f55048a162b091babc63316d45d7ded1060","amp;dn":"Sex+Message+%2A%2ANEW+2014%2A%2A+WEB-DL+MP4-RARBG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db384f55048a162b091babc63316d45d7ded1060","infoHashBuffer":{"type":"Buffer","data":[219,56,79,85,4,138,22,43,9,27,171,198,51,22,212,93,125,237,16,96]},"announce":[],"urlList":[]}}