{"title":"The Great War and the Shaping of the 20th Century_episodes_1_and","uid":5212428,"size":1150383325,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db4a0e64a88d66d8bf832fad325546ded6e212d3&amp;dn=The+Great+War+and+the+Shaping+of+the+20th+Century_episodes_1_and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"anthrobyte","files":1,"time":1260652365,"description":"VHS RIP - High Quality - Reduced size for faster downloading MPEG4 320 x 240 Video bitrate 1200 Audio bitrate 192 Stereo. \n\nThe Great War and the Shaping of the 20th Century is a 1996 documentary series that aired on PBS. It chronicles World War I over eight episodes.\n\nEpisode 1: Explosion\n\nNo one event or person caused the Great War. There were many factors that contributed to mobilization of the belligerents. With a rapidly expanding European economy, people demanded social and governmental changes: British suffragettes fought to win British women the right to vote; socialists called for reforms, uniting laborers to demand that the wealth and power of a nation be used to benefit the majority. While in Russian, Tsar Nicholas II held fast to an autocratic old-world view.\n \nOn June 28, 1914, Serbian fanatic, Gavrilo Princip, assassinated Archduke Franz-Ferdinand of Austria, causing Kaiser Wilhelm of Germany to support Austria in punishing the Serbs, setting the stage for Russia - backing Serbia - and her allies France and Britain to go to war. \n \nIn the weeks after the assassination, none of the critical leaders had the power or will to slow down the decisions, actions, reactions and attitude shifts of key government and military leaders. By August, millions of Europeans -- especially the military and diplomatic leaders of Austria-Hungary, Germany and Russia -- saw war as the way to save their honor, as well as to solve the internal and international problems that needed to be resolved.\n\nEpisode 2: Stalemate\n\nFrom the very beginning, the war grew rapidly out of control. New styles of warfare, like the use of gas and heavy artillery, produced new kinds of horror and unprecedented levels of suffering and death. As a Germans army crossed into Belgium, heading for Paris, the Russian Army - moving faster than the German generals had anticipated -- was already pushing into East Prussia. The German forces on the Eastern Front, however, quickly defeated the Tsar's army at the Battle of Tannenberg.\n \nIn the west, as the German army invaded Belgium, rumors and stories quickly spread of the atrocities the German soldiers inflicted upon Belgium civilians. \n \nThe French, believing the German thrust into Belgium to be a fake, launched their own offensive on the eastern border between France and Germany the operations were disastrous, with the French army losing 27,000 soldiers in a single day.\n \nWhen the German invasion of France failed to take Paris or destroy French and British resistance on the river Marne, stalemate quickly followed, and a line of trenches soon stretched along the war's Western Front from the Swiss Alps to the English Channel. Christmas Eve of 1914 saw an extraordinary truce between the men fighting in the trenches that had been called &quot;the last twitch of the 19th century.&quot;\n &lt;a href=&quot;\nhttp://www.pbs.org/greatwar/chapters/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/greatwar/chapters/index.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:db4a0e64a88d66d8bf832fad325546ded6e212d3","amp;dn":"The+Great+War+and+the+Shaping+of+the+20th+Century_episodes_1_and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4a0e64a88d66d8bf832fad325546ded6e212d3","infoHashBuffer":{"type":"Buffer","data":[219,74,14,100,168,141,102,216,191,131,47,173,50,85,70,222,214,226,18,211]},"announce":[],"urlList":[]}}