{"title":"[JimSlip] Candy Part 1+2","uid":8630788,"size":842540686,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:db5f3eada19401ae18e4d6046f5799819c28eac9&amp;dn=%5BJimSlip%5D+Candy+Part+1%2B2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sjakkz","files":1,"time":1372624644,"description":"Candy - Pursuing a blonde babe - Pt 1\n\nBe prepared to be frozen to the core with shock. This week we're back in Budapest on the prowl for fresh meat. Well, Candy is one of those girls you just wouldn't believe in a million years would be up for my, &quot;100,000 Forint Search for a Shag Challenges&quot;. Wearing a skin tight, short little skirt that hardly covered her tight little arse, she walked passed us. Lara suggested we challenge her and I replied not to bother, but Lara pursued her all the same. Guess what? She agreed to come back and get fucked. Anyway we got her back and she chose a little outfit, a cross between a sailor's suit and a sexy air hostess, and we got her to play with herself and generally muck about, basically getting herself prepared to get fucked. I'm sorry to announce though that you'll have to wait until the week after next to see part 2 of Candy. This is due t...\n &lt;a href=&quot;\nhttp://bayimg.com/HaNhAaaei&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HaNhAaaei&lt;/a&gt; - Part 1\n\n\nCandy - Pursuing a blonde babe Pt 2\n\nWell, as you can imagine, I was chomping at the bit to get my mits on the lovely Candy. She plunged my dick in her mouth and gave it a good sucking, after which I lost it. We were both a little awkward at first, until we got on the bed and started to snog, at which point she went crazy and by the end, when I asked &quot;Where would you like me to cum?&quot; She answered, &quot;You can come inside me if you like?&quot; Well, you're all going to curse me, but to be honest I was so shocked, in other words the idea was so exciting, that I actually couldn't and came on her face instead. Yes, I know, a typical spandex wearing, body-building greaseball porno stud wouldn't have had a problem, but hey, I'm just a normal guy, maybe another time. Lucky, I have her number, so I'll look her up next time I'm around.\n &lt;a href=&quot;\nhttp://bayimg.com/haNhcaAEI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/haNhcaAEI&lt;/a&gt; - Part 2","torrent":{"xt":"urn:btih:db5f3eada19401ae18e4d6046f5799819c28eac9","amp;dn":"%5BJimSlip%5D+Candy+Part+1%2B2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5f3eada19401ae18e4d6046f5799819c28eac9","infoHashBuffer":{"type":"Buffer","data":[219,95,62,173,161,148,1,174,24,228,214,4,111,87,153,129,156,40,234,201]},"announce":[],"urlList":[]}}