{"title":"Exanima v0.5.2","uid":11955969,"size":728271236,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:db637fba42512b79103e08172e43ed57db96b3ee&amp;dn=Exanima+v0.5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1432420107,"description":"Exanima features a very unique animation system, all character motions are the result of physical forces and virtual muscles. This combined with dynamic procedural animation allows characters to physically interact with and respond to everything. It's also what gives players control over their character's different motions and the forces exerted by them.\n\nThe benefits are a huge amount of depth and complexity to all interactions, particularly in combat. Every physical detail is meaningful and there is a great freedom and intricacy to the player's control. It is not however easy to do, we've faced a lot of difficult challenges with it. Trying to mix realistic physics with precise player control and also making it all look lifelike has on occasion made us question if we weren't asking for too much. It has been the game's biggest source of both praise and criticism. The realism has only highlighted the sometimes unnatural motion and many people say the characters look drunk and are put off by it.\n\nWe've always promised to improve animations and over the past 2 years we've spent a huge amount of our development time on this issue alone. We've continued to improve things but the criticism has remained. More recently we elected to stop trying to improve them so that we could focus on other aspects of the game.\n\nWhile not actively working to improve animation we have been planning specific improvements that we thought promising and taking specific feedback on board. With the game now reaching a wider audience and the animations colouring many people's first impressions of it, we decided to prioritise some of these planned improvements.\n\nThis update features some of the most important changes that we had planned. We've often had very limited success with improving animation or none at all, this thankfully is one of those times when our efforts were successful. The changes concern movement and footwork in combat which has always been by far the most difficult aspect of the animation. The characters now move in a more deliberate way, there is far less &quot;drunken&quot; leaning and swaying and the legs move smarter giving the characters better balance. It looks much better and it gives players better control.\n\nThings are still not perfect but they are much improved and we have addressed some major problems, in time we can look at addressing various other issues. We now have a more complete and flexible system which we can continue to tweak. There are of course also many other aspects of animation that we still need to improve, please understand that we are a small team and currently have no animator so these things can be extremely time consuming for us.\n\n\nOf course none of this will stop your character looking like a drunken fool if you just hold keys and buttons down and wildly wave the cursor around. Your character doesn't just execute precanned manoeuvres at the press of a button, the whole point is that you are in control. You are in charge of your character's various separate motions and your inputs must be deliberate and work in harmony. How you move the cursor, how long you hold buttons down, how you time and combine your various inputs, these are all things that can have a very real effect on everything your character does and can easily be misused. Don't leave anything to the game, it's not trying to play for you.\n\n\nWe're quite excited about these changes, they are fairly subtle but very important. They have been in beta and we've watched various people play and were ourselves very impressed with the results, the response from everyone seems very positive. This next update was supposed to feature some character skill progression but this has been postponed slightly due to this change in priorities. The character creation screen does show our WIP skill interface, the first few trainable skill techniques should be with you soon and we'll continue to add more.\n\nBesides this version 0.5.2 features numerous bug fixes, improvements and tweaks","torrent":{"xt":"urn:btih:db637fba42512b79103e08172e43ed57db96b3ee","amp;dn":"Exanima+v0.5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db637fba42512b79103e08172e43ed57db96b3ee","infoHashBuffer":{"type":"Buffer","data":[219,99,127,186,66,81,43,121,16,62,8,23,46,67,237,87,219,150,179,238]},"announce":[],"urlList":[]}}