{"title":"(Warning) R Kelly Sex Tape-Da Pay Suck, Fuck,  Pis Scene-Girl 14","uid":3284974,"size":276853964,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dc019aef674f6628f1eea197e5ed9c64bffce668&amp;dn=%28Warning%29+R+Kelly+Sex+Tape-Da+Pay+Suck%2C+Fuck%2C++Pis+Scene-Girl+14&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"batmolebile","files":1,"time":1107497315,"description":"Fuck You all!!!\n\nOh yeah thanks for my supporters!!\n\nRdictvTaco:\nI don't know if you where calling me a asshole or R Kelly.\n\nmrablar:\nWho me or R Kelly?\n\nSirPrimaX:\nYou mom's a bastard too bitch!\n\nTiggerTigger:\nNothing.\n\ndas_cronic:\nYou might be right.\n\nEnvader:\nthanks dude I did say don't download if your offended.\nBut many did!\n\nLordOlsen:\nMan Fuck you. You don't even know who are we talking about in first place.\nFuck off from here!\n\ndontomaso:\nyou welcome! May you have a nice day too :)\n\nExtremist:\nSorry I did ment to say the offender.\n\nAudiophileSD:\nyou again! Ask you mom I fuck her when she was 14!\n\nXarko:\nI know. she's not even hot. I also deleted of my HD.\n\nwebave:\nHAHA!\n\nwebave:\nYeah but i'm still here and I upload a porn video clip(Long) everyday.\n\nAudiophileSD:\nFuck man. I'm getting sick and tired of you!\n\nAudiophileSD:\n............. nevermind\n\nSirPrimaX:\nHe(Xarko) might be sick but I don't think that he needs pro Help.\n\nSirPrimaX:\nthank you thank you! I know man. Them fuck faces. I mean I wish it wasn't illegal to download music here in America. I know too they put this site in more danger. I love it here my self. I won't want to upload my porn to other website. Porn that I pay so you can have it for free(except this file)).\n\nEnvader:\nMan I wish I could find a 14yo too and not found guilty. Better yet keep fucking her until she's 23 or so. then I'll leave the fucking bitch HAH!\n\nbikes:\nI guess I should thank you. 14yo Is not shild porn no more. Big deal.\nThanks!!!\n\nJarulf:\nI didn't do this file. R Kelly did. didn't you see the video?\n\nwalowalo:\nYeah but you would think just because he's black he would have a bigger Dick. Hey Makes me happy mines bigger then his. :)\n\nCatscan:\nYup. Laughing my ass off!\n\ndemme:\nDude this is America. I don't know what they give kids in school now days but at 13 years old they look old enough to fuck.\n\nAny more questions?\n\nLook guys. My girl lost her virginity when she was 15 I wish I was that bastard who had her first. Not all of us are lucky. that is the fucked up thing about this world. That someone likes to fuck young girls so that someone punk like me will marrie them in the future. Fuck is what goes thru my mind every day. Who can you blame? I tell you who you fucking bastards(in general)\n\n1 Mom and Dad or should I say gardians.\n2 Older friends(females) who all they do is talk about sex with young girl that it feels good and this and that. And they end up trying it too.\n3 Teachers: Sex education girls! Just use a condom.\n4 Oh no. the main TV TV TV TV! uhem... MTV. Let's talk about sex baby Lets talk about you and me, and on and on and on...\n5 Internet. they go to chat rooms but they end up talking to some pervert. They are not looking for porn on the net. Porn is looking for them...\n6 High school kids. they just waiting to spenk a virgin baby. Any volunters ladies?\n\nWe can't change this wolrd. Only God can. But he's too busy talking care of christians and fighting evil. So leave him alone. Oh yeah and that profecy staff too. Sorry for uploading this. And sorry if I offended anybody. But I'm not the officer who sold this video tape or the guy who make this into an mpeg file better yet not the one who fuck this 14yo or so girl...\nThanks. And I hope you have a nice day.\n\nNote: If the admin want's to close this torrent that's fine. Because I should have not posted this in here to begin with. But have mercy upon my soul and don't bann me.\nOnce again and I said it many times thanks :)","torrent":{"xt":"urn:btih:dc019aef674f6628f1eea197e5ed9c64bffce668","amp;dn":"%28Warning%29+R+Kelly+Sex+Tape-Da+Pay+Suck%2C+Fuck%2C++Pis+Scene-Girl+14","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc019aef674f6628f1eea197e5ed9c64bffce668","infoHashBuffer":{"type":"Buffer","data":[220,1,154,239,103,79,102,40,241,238,161,151,229,237,156,100,191,252,230,104]},"announce":[],"urlList":[]}}