{"title":"Paul Keres: The Road to the Top","uid":8845825,"size":22756298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd0be052e833baf316ff86eec6671fc67836a7e1&amp;dn=Paul+Keres%3A+The+Road+to+the+Top&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1377379084,"description":"Paul Keres was a great player in chess history and a contender for the world championship for a third of a century. This work charts the progress of Keres's career from his early days as a self-taught young talent to his battles for the world title. It also examines the development of his play.\n\nThis book contains Paul Keres' best games played in the period 1929-1950. And as one might imagine, almost all the games are against World class players. What sets this book apart from many others of its genre is the annotations. Another reviewer rightly mentioned that Keres' style of annotation is as good as Bronstein. Those who are familiar with David Bronstein's books will get the point. The book has around 250 pages and covers 50 of Keres' games. This might give you some idea as to how detailed the annotations would be(unlike the lightly annotated books that cover a players' 100 or more games in the same number of pages). The games are all Keres' wins but at no point one feels even the slightest hint of personal bias in his annotations. They are highly objective and very detailed. Keres clearly explains the plans of both the sides and devotes around 5-6 pages to almost every game. He gives detailed variations where necessary but nothing to overwhelm an average player.","torrent":{"xt":"urn:btih:dd0be052e833baf316ff86eec6671fc67836a7e1","amp;dn":"Paul+Keres%3A+The+Road+to+the+Top","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd0be052e833baf316ff86eec6671fc67836a7e1","infoHashBuffer":{"type":"Buffer","data":[221,11,224,82,232,51,186,243,22,255,134,238,198,103,31,198,120,54,167,225]},"announce":[],"urlList":[]}}