{"title":"Batman: Arkham City - Game of the Year Edition (2012) PC | RePac","uid":8004094,"size":13443734759,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dd114948b60e39ecc2f99153d71a7de72bcc0e9c&amp;dn=Batman%3A+Arkham+City+-+Game+of+the+Year+Edition+%282012%29+PC+%7C+RePac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"beso140","files":-1,"time":1357845386,"description":"RELEASE NOTES\n\nBatman: Arkham City is third-person Action-Adventure game that delivers\nan authentic Dark Knight experience rooted in an original and\nengrossing story as well as a combination of melee combat, stealth,\ninvestigative and speed-based challenge gameplay. A sequel to 2009's\nBatman: Arkham Asylum, Arkham City features the full range of classic\nenemies seen in the previous game, in addition to Catwoman, who is a\nplayable character and has her own storyline in the new release.\nAdditional features include: a range of new gadgets, an increased\nnumber of possible melee opponents and a range of movement options for\nBatman that include leaping, sliding, gliding and the grapple hook.\n\nDeveloped by Rocksteady Studios, Batman: Arkham City builds upon the\nintense, atmospheric foundation of Batman: Arkham Asylum, sending\nplayers soaring into Arkham City, the new maximum security &quot;home&quot; for\nall of Gotham City's thugs, gangsters and insane criminal masterminds.\nThe game features an unique combination of melee combat, stealth,\ninvestigative and speed-based challenge gameplay. Set inside the\nheavily fortified walls of a sprawling district in the heart of Gotham\nCity, this highly anticipated sequel introduces a brand-new story that\ndraws together a new all-star cast of classic characters and murderous\nvillains from the Batman universe, as well as a vast range of new and\nenhanced gameplay features to deliver the ultimate experience as the\nDark Knight.\n\nAn authentic Dark Knight video game adventure that picks up where\nArkham Asylum left off.\n\nBatman Arkham City Game of the Year Edition includes:\n\nBatman Arkham City Main Game\n\nHarley Quinn's Revenge. Now more dangerous than ever and leading a\nhomicidal gang of her own, she is hell-bent on taking revenge against\nthe Dark Knight.\n\nBonus content includes: Catwoman Pack, Robin Bundle Pack, Nightwing\nBundle Pack, Arkham City Skins Pack and Challenge Map Pack\n\nHarley Quinn's Revenge contains over 2 hours of content, new storyline\nand enemies, play as both Batman and Robin, new environments and new\ncollectables\n\nYou need to make an offline Games For Windows Live profile, for being\nable to load/save.","torrent":{"xt":"urn:btih:dd114948b60e39ecc2f99153d71a7de72bcc0e9c","amp;dn":"Batman%3A+Arkham+City+-+Game+of+the+Year+Edition+%282012%29+PC+%7C+RePac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd114948b60e39ecc2f99153d71a7de72bcc0e9c","infoHashBuffer":{"type":"Buffer","data":[221,17,73,72,182,14,57,236,194,249,145,83,215,26,125,231,43,204,14,156]},"announce":[],"urlList":[]}}