{"title":"Kate Rusby...The Girl Who Couldn't Fly(2005)[FLAC]","uid":5911822,"size":279648727,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:debee4223903ae80a6b2ebb8c4d91d4c6d847311&amp;dn=Kate+Rusby...The+Girl+Who+Couldn%5C%27t+Fly%282005%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":21,"time":1288082921,"description":"2005 The Girl Who Couldn't Fly [Bonus Track]   CD  Pure PRCD017 \n\n1 Game of All Fours   3:40 \n2 The Lark   4:15 \n3 No Names   3:29 \n4 Mary Blaize   3:22 \n5 A Ballad   4:52 \n6 You Belong to Me   3:24 \n7 Elfin Knight   4:04 \n8 Bonnie House of Airlie   5:40 \n9 Moon Shadow   4:24 \n10 Wandering Soul   4:14 \n11 Fare Thee Well   3:51 \n12 Little Jack Frost [bonus track]   4:32 \n\nIn the world of folk, there are three fates cutting the future. On one side, Eliza Carthy spins aging memories into fresh settings. At the other, Kathryn Williams cuts through the past and starts a new tradition. Between them sits Kate Rusby, weaving herself new cloth from old tunes and bringing the present to the past.\n\nFor a decade, Rusby has built up a reputation for having a voice (and live, a sense ofhumour) that's easy to fall for. Her gentle tones have a beguiling quality that draw you in and never let you go. They also have the ability of disguising her less-successful tunes.\n\nAs with earlier outings, The Girl Who Couldnt Fly has its fair share of collaborators. Ex-Blur guitarist Graham Coxon supplies the cover artwork, though sadly no music, and Idlewild's Roddy Woomble adds his voice to three tracks. Sadly, only Coxon's contribution adds to the album, as Woomble's dulcet voice jars against the sweetness of Rusby's and the pair fail to find a harmonious middle ground.\n\nElsewhere, it's regular cohort (and husband) John McCusker that adds his vast talents to Rusby's simple vocals and guitar, aided by a host of musicians on harmoniums, double bass, flutes, whistles and even euphonium! Thankfully, the results are remarkably uncluttered, bringing uncomplicated backdrops to Rusby's renditions of both traditional and self-penned tunes.\n\nWhile The Girl Who Couldnt Fly doesn't live up to the quality of its predecessor, the immaculate Underneath The Stars, Rusby's talent for creating &quot;folk music for people who dont like folk music&quot; (asher websiteputs it) means there are still several highlights. Particular attention is deserved for the opening traditional tale of gambling, The &quot;Game Of All Fours&quot;, the jigging twitch of &quot;The Elfin Knight&quot; and the beautifully cute bonus track, &quot;Little Jack Frost&quot;, written for one of the BBC's Christmas shows last yuletide, though the less time spent with her lumpen trawl through King, Stewart and Price's &quot;You Belong To Me&quot;, the better.\n\nConsidering her own high standards, this is an album that takes a little longer than normal to hit home and there are parts of it that never do, and yet there's little need to worry. Her charmingly wonderful voice and continuing talent for songwriting do enough to assure any listener that her part stake in the future fate of folk is in very safe hands.\n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:debee4223903ae80a6b2ebb8c4d91d4c6d847311","amp;dn":"Kate+Rusby...The+Girl+Who+Couldn%5C%27t+Fly%282005%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"debee4223903ae80a6b2ebb8c4d91d4c6d847311","infoHashBuffer":{"type":"Buffer","data":[222,190,228,34,57,3,174,128,166,178,235,184,196,217,29,76,109,132,115,17]},"announce":[],"urlList":[]}}