{"title":"Buck Griffin - Let's Elope Baby - Bear Family CD","uid":10508294,"size":214300014,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dedc39c26dfb624cc4f118e38e6426c708bfd7d2&amp;dn=Buck+Griffin+-+Let%27s+Elope+Baby+-+Bear+Family+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bonnie335","files":51,"time":1404813643,"description":"Buck Griffin - Let's Elope Baby - Bear Family CD (1995)\n\n\n\nThere's stuff on this 28-song CD that would be loved by fans of Hank Williams, Bob Wills, Elvis Presley, Red Foley, and even Benny Goodman, and most of it should've been hits for Buck Griffin 40-some years ago. He runs the gamut from hard country to Western swing to a restrained but valid form of rockabilly, and he's good at all of it. &quot;It Don't Make No Nevermind,&quot; &quot;Meadowlark Boogie,&quot; &quot;Bawlin' and Squallin',&quot; &quot;Let's Elope Baby,&quot; &quot;Stutterin' Papa,&quot; and &quot;One Day After Payday&quot; are worth the price of admission, and all of it is eminently listenable. Some of this stuff, like &quot;One Day After Payday,&quot; with Merle Shelton on steel guitar, Sonny James on fiddle, and Bill Simmons on piano, is striking for its sophistication -- produced by Joe Leonard in Dallas, it's proof that Chet Atkins had no copyright on the Nashville countrypolitan sound, even back in 1954. Other tracks show a daring that is amazing to savor -- the honking trumpet on &quot;Meadowlark Boogie&quot; and the romping clarinet on &quot;It Don't Make No Nevermind.&quot; And then there's the harder country of &quot;Lookin' for the Green.&quot; The disc is rounded out with four beautifully sung, utterly sincere and compelling religious numbers, of which &quot;Next to Mine&quot; is as fine as any of the country numbers here. The sound is excellent throughout, and the notes are well-written and informative. ~ Bruce Eder","torrent":{"xt":"urn:btih:dedc39c26dfb624cc4f118e38e6426c708bfd7d2","amp;dn":"Buck+Griffin+-+Let%27s+Elope+Baby+-+Bear+Family+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dedc39c26dfb624cc4f118e38e6426c708bfd7d2","infoHashBuffer":{"type":"Buffer","data":[222,220,57,194,109,251,98,76,196,241,24,227,142,100,38,199,8,191,215,210]},"announce":[],"urlList":[]}}