{"title":"Gulf War One - Hugh McManners.epub","uid":9785613,"size":7897262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df081d2d8f8b2de15002b0bafaedbbb1d57e43a9&amp;dn=Gulf+War+One+-+Hugh+McManners.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1395157321,"description":"In 1988 Iraq was the region's dominant military power and ambitious to become leader of the Arab world. Saddam Hussein's war-experienced army were known to have used biological and chemical weapons in the past, and when 260,000 troops and 2,000 tanks crossed into Kuwait they met with little resistance. Yet Iraq's defeat at the hands of the coalition forces was the most devastatingly efficient in military history.\n\nIt was the first war fought over a resource: oil. The UK committed 43,000 troops to this new 'high tech' war, and initially expected high casualties. Yet on the Iraqi side, uncounted thousands of soldiers were killed, many poorly trained conscripts. Returning coalition soldiers have since found themselves dogged by health problems, likely caused by the new technologies that proved so effective in battle. Iraqi power was diminished, but Saddam Hussein was allowed to remain in power, laying the scene for the protracted suffering of the Iraq invasion over a decade later.\n\nHugh McManners' original interviews for Gulf War One provide a compelling picture and explode many myths of how this war was carried out, and why. From military planners and politicians to ordinary soldiers and Gulf War Syndrome sufferers, both those serving and those caught up in the war tell its history in their own words.","torrent":{"xt":"urn:btih:df081d2d8f8b2de15002b0bafaedbbb1d57e43a9","amp;dn":"Gulf+War+One+-+Hugh+McManners.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df081d2d8f8b2de15002b0bafaedbbb1d57e43a9","infoHashBuffer":{"type":"Buffer","data":[223,8,29,45,143,139,45,225,80,2,176,186,250,237,187,177,213,126,67,169]},"announce":[],"urlList":[]}}