{"title":"Smoking Aces 2 DVDRip Spanish-Latino Ac3 2010","uid":5274638,"size":1468477467,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dfd36c92a1fc481f5d8978ce9240da984ddb168a&amp;dn=Smoking+Aces+2+DVDRip+Spanish-Latino+Ac3+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mois20","files":3,"time":1263333657,"description":"Los agentes federales vuelven a confrontar inteligencias con un equipo de asesinos creativos en el explosivo largometraje Smokin Aces 2: Assassins Ball . Walter Weed (Tom Berenger) es un empleado sin pretensiones que trabaja en las oficinas del FBI hasta que el Buro descubre un complot para asesinarlo. La banda de asesinos psicoticos y depravados que han sido enviados por un hombre misterioso, Hal Leuco, con la promesa de un suculento botin, incluye a una bella de muchos recursos que tiene una manera unica de liquidar a sus victimas (Martha Higareda), un psicopata que carga con poderosas herramientas a motor (Vinnie Jones) y un mort?fero maestro del disfraz (Tommy Flanagan).\nAdemas participa de la caceria la familia Trevor, favorita de los fans de la pei?cula original, que incluye a la ninfomana y fanatica de las armas (Autumn Reeser) y sus letales parientes (Maury Sterling, Michael Parks y C. Ernst Harth). Baker (Clayne Crawford), el agente que esta a cargo de la operacion, arriesga su vida y la de su equipo para defender a Weed, pero no sera hasta que se disipe el humo del punto culminante del filme para que nos sea revelada la sorprendente identidad del cerebro que ha estado detras del complot.","torrent":{"xt":"urn:btih:dfd36c92a1fc481f5d8978ce9240da984ddb168a","amp;dn":"Smoking+Aces+2+DVDRip+Spanish-Latino+Ac3+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd36c92a1fc481f5d8978ce9240da984ddb168a","infoHashBuffer":{"type":"Buffer","data":[223,211,108,146,161,252,72,31,93,137,120,206,146,64,218,152,77,219,22,138]},"announce":[],"urlList":[]}}