{"title":"Kemistry And Storm - DJ Kicks [1999]","uid":3443453,"size":101050402,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e007bf8cdd2b50173db78ff36c9bb8f061532354&amp;dn=Kemistry+And+Storm+-+DJ+Kicks+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Wobbly","files":18,"time":1139711964,"description":"Ripped w/ WinAMP via LAME enc, alt-preset-standard\n\n---\n\nEnglish drum&amp;#039;n&amp;#039;bass DJ duo Kemistry and Storm were not only recognized for their talents, but also for being successful women in a male-dominated genre of music. Their history with drum&amp;#039;n&amp;#039;bass involves being an essential part of the foundation of the Metalheadz label and some of the first women DJs to have a widely distributed album.\n\nKemistry (Kemi Olusanya) and Storm (simply known as Jane) met while they were in college in Northampton, England. Though no music connection was made at the time, their paths would continue to cross despite the fact that they both moved on to different parts of England. At one point they both had boyfriends in the same band and later Kemi attended fashion school with Storm&amp;#039;s cousin. Though Storm was attending school for radiography at Oxford, she felt her passion to work was not strong enough and, eventually, would not be able to compete with her passion for music. At the same time, Kemi was a make-up artist working in the London fashion industry. Ironically, it was in Sheffield that Kemi first was exposed to the emerging electronic scene through a friend of hers. Through going to a large number of events and exposing herself to the music it became a part of her life. That year, Storm moved to London and was introduced to electronic music by Kemi. Though music was always a surface interest, both of the women decided to give up their budding careers to chase their enthusiasm for one in music.\n\nThe two began DJing shortly thereafter and going to clubs with a co-worker of Kemi&amp;#039;s named Goldie. All three became enthused by the budding form of music called drum&amp;#039;n&amp;#039;bass. By 1994, Goldie had become an emerging member of the music scene and established the Metalheadz label. Helping their friend out, Kemi and Storm helped Goldie manage the label for two-and-a-half years. At the end of that time, the duo decided to leave the label and work on their own careers as performers. In 1999, shortly after their departure, the two landed a slot in the DJ Kicks series from respected label Studio K7! The release of the CD lead to the two friends DJing around the world and paving the way for other, younger, female DJs and a more successful future.\n\nJust as their career in music was coming to a climax, tragedy struck the duo. On April 25, 1999, Kemi Olusanya was killed in a car accident outside of Winchester, England, as the two were returning from a performance. Her death was a shake to the electronic music community.\n\n-- from allmusic.com","torrent":{"xt":"urn:btih:e007bf8cdd2b50173db78ff36c9bb8f061532354","amp;dn":"Kemistry+And+Storm+-+DJ+Kicks+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e007bf8cdd2b50173db78ff36c9bb8f061532354","infoHashBuffer":{"type":"Buffer","data":[224,7,191,140,221,43,80,23,61,183,143,243,108,155,184,240,97,83,35,84]},"announce":[],"urlList":[]}}