{"title":"Dedicated to God - An Oral History of Cloistered Nuns [EPUB]","uid":9808896,"size":5628757,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0419e2b200c0c62ec7444ede4a5b6e5a8dcab65&amp;dn=Dedicated+to+God+-+An+Oral+History+of+Cloistered+Nuns+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1395497748,"description":"Pages: 272 pages\nPublisher: Oxford University Press, USA (January 7, 2014)\nLanguage: English\nISBN-10: 0199947937\nISBN-13: 978-0199947935\nFormat: EPUB\n\n\n\nAs a subculture, cloistered monastic nuns live hidden from public view by choice. Once a woman joins the cloister and makes final vows, she is almost never seen and her voice is not heard; her story is essentially nonexistent in the historical record and collective, public history.\n\nFrom interviews conducted over six years, Abbie Reese tells the stories of the Poor Clare Colettine Order, a cloistered contemplative order at the Corpus Christi Monastery in Rockford, Illinois. Seldom leaving their 25,000-square-foot gated enclosure, members of this community embrace an extreme version of poverty and anonymity - a separation that enables them to withdraw from the world to devote their lives to prayer. This removal, they contend, allows them to have a greater impact on humanity than if they maintained direct contact with loved ones and strangers.\n\nDedicated to God explores individual and cultural identity through oral history interviews with several generations of nuns, focusing on the origins and life stories of the women who have chosen to become members of one of the strictest religious orders. But the narrative is also one of a collective memory and struggle against extinction and modernity, a determination to create community within the framework of ancient rules.\n\nThe author's stunning photographs of their dual worlds, religious and quotidian, add texture to the narrative.\n\nThis artistic and ethnographic work highlights the countercultural values and dedication of individuals who, at incredible personal cost, live for love of God and humanity, out of faith in what cannot be seen, and with the belief that they will be rewarded in the afterlife.","torrent":{"xt":"urn:btih:e0419e2b200c0c62ec7444ede4a5b6e5a8dcab65","amp;dn":"Dedicated+to+God+-+An+Oral+History+of+Cloistered+Nuns+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0419e2b200c0c62ec7444ede4a5b6e5a8dcab65","infoHashBuffer":{"type":"Buffer","data":[224,65,158,43,32,12,12,98,236,116,68,237,228,165,182,229,168,220,171,101]},"announce":[],"urlList":[]}}