{"title":"J. L. Witterick - My Mother's Secret (Epub, Mobi)","uid":10955778,"size":2387035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e07ead11657584860d743669f4e72282baa03c79&amp;dn=J.+L.+Witterick+-+My+Mother%27s+Secret+%28Epub%2C+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1409678872,"description":"My Mother's Secret by J.L. Witterick (A Novel Based on a True Holocaust Story)\n\nRequirements: EPUB Reader, 918 kB.\n\nOverview: A novel based on a true story, a mother and daughter risk their lives to provide shelter to two families and a German soldier--all unbeknownst to each other--in a tiny two-room house in Sokal, Poland, during the Nazi invasion. \nBased on a true story, MY MOTHER'S SECRET is a profound, captivating, and ultimately uplifting tale intertwining the lives of two Jewish families in hiding from the Nazis, a fleeing German soldier, and the clever and &quot;righteous&quot; mother and daughter who teamed up to save them.\n\nFranciszka and her daughter, Helena, are unlikely heroines. They are simple people who mind their own business and don't stand out from the crowd. Until 1939, when crisis strikes. The Nazis have invaded Poland and they are starting to persecute the Jews. Providing shelter to a Jew has become a death sentence. And yet, Franciszka and Helena decide to do just that. In their tiny, two-bedroom home in Sokal, Poland, they cleverly hide a Jewish family of two brothers and their wives in their pigsty out back, a Jewish doctor with his wife and son in a makeshift cellar under the kitchen floorboards, and a defecting German soldier in the attic--each group completely unbeknownst to the others. For everyone to survive, Franciszka will have to outsmart her neighbors and the German commanders standing guard right outside her yard.\n\nTold simply and succinctly from four different perspectives, MY MOTHER'S SECRET is a reminder that there are, in fact, no profiles of courage and each individual's character is a personal choice.\n\nThis book was inspired by the true story of Franciszka Halamajowa, who, with her daughter, saved the lives of fifteen Jews in Poland during the Second World War. She also hid a young German soldier in her attic at the same time. Before the war, there were six thousand Jews in Sokal, Poland. Only thirty survived the war and half of those did so because of Franciszka.\nGenre: Fiction/General","torrent":{"xt":"urn:btih:e07ead11657584860d743669f4e72282baa03c79","amp;dn":"J.+L.+Witterick+-+My+Mother%27s+Secret+%28Epub%2C+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e07ead11657584860d743669f4e72282baa03c79","infoHashBuffer":{"type":"Buffer","data":[224,126,173,17,101,117,132,134,13,116,54,105,244,231,34,130,186,160,60,121]},"announce":[],"urlList":[]}}