{"title":"Stossel.2014.05.08.[Risky Business].Fox Business.CF.avi","uid":10127384,"size":366107366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e0957cb848063141c9e41228258dbb06701b29c4&amp;dn=Stossel.2014.05.08.%5BRisky+Business%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1399791610,"description":"----------\n\nSTOSSEL - [Risky Business] - Fox Business Network\n2014, May 08, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nDEATH OF THE AMERICAN DREAM: The left-wing media likes to say the American Dream is dead. But conservative David Goldman of PJ Media surprised me by saying he too thinks much of the American dream is dead.\n\nYOU DID BUILD THAT: The president claims it's government's job to help businesses succeed. But they do the opposite. Angel investor Miles Spencer succeeded without the help of government and he's helped other businesses succeed as well.\n\nGOVERNMENT BULLIES: 11-year-old entrepreneur Chloe Stirling was told she couldn't sell cupcakes without a permit and a government-certified kitchen. She may actually get that law changed soon.\n\nBUSINESSMAN FIGHTS BACK: Greg Garrett is an oyster farmer who has the resources to fight the bureaucrats and 750 pages of regulations. So far, he's won.\n\nDO COOL SH*T: Miki Agrawal says some of you should quit school, or quit your job, start a business, and &quot;live happily ever after.&quot; It is &quot;risky and hard to do.&quot; But she did it and says it's well worth it.\n\nEXCHANGE BAR &amp; GRILL: A third of new restaurants fail within a year, but New York City's Exchange Bar &amp; Grill found an edge by changing drink prices based on supply and demand -- like the stock market. We asked Reason TV's Naomi Brockwell to check it out.\n\nSTOSSEL'S TAKE: Did you know that I started Facebook?! Well, sort of. When I was in college at all-male Princeton, I tried to make money by adding photos to a snarky guide to neighboring girls' schools and called it &quot;Who the Girls Are.&quot;\n\nI should be the Facebook billionaire! Unfortunately there was no internet back then. My business failed. But that ability to try something, and try again, is something I'm told is unique to America. It's part of what made America successful.\n\n9PM ET on Fox Business Network","torrent":{"xt":"urn:btih:e0957cb848063141c9e41228258dbb06701b29c4","amp;dn":"Stossel.2014.05.08.%5BRisky+Business%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0957cb848063141c9e41228258dbb06701b29c4","infoHashBuffer":{"type":"Buffer","data":[224,149,124,184,72,6,49,65,201,228,18,40,37,141,187,6,112,27,41,196]},"announce":[],"urlList":[]}}