{"title":"Thunder Alley Leif Garrett","uid":4334101,"size":747448242,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0abeeb2b5780d241e768f7931450628a89567b9&amp;dn=Thunder+Alley+Leif+Garrett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"wolfgangr51502","files":1,"time":1218209565,"description":"Starring Roger Wilson and Leif Garrett not officially released on DVD.\n\n\n\n\nTHUNDER ALLEY Rated PG13 Copyright: 1985 Golan Globus Films Filmed in Arizona\n\n******** The Characters *********\n\n1. Ritchie - Guitar prodigy who joins his friends band as the lead guitarist &amp; songwriter. Reunites with his band mates for one last chance at the big time.\n\n2. Donnie - (IT&amp;#039;s Scott McGinnis) Keyboardist of the band Magic &amp; Ritchie&amp;#039;s best friend. Gets Ritchie to join Magic. Bites it by drug overdose.\n\n3. Beth - Ritchie&amp;#039;s sweet girlfriend. Tries to be supportive of Ritchie even after he cheats on her with Star.\n\n4. Lorraine - Donnie&amp;#039;s girlfriend. Works at the local Ice Cream stand and has boobies as big as Nortons!! Takes Donnie&amp;#039;s death hard.\n\n5. Wessel - Band road manager that works for the Fatman. Takes Ritchie under his wing to make him a star.\n\n6. Skip - (IT&amp;#039;s Leif Garret!)Lead singer of the band Magic. Leaves the band only to reunite with them later at the Rainbow Festival.\n\n7. Wolf - Base player for the band Magic.\n\n8. Butch - Drummer for the band Magic.\n\n9. Fatman - Local music promoter out to screw with Magic. Gets the band to fight within themselves. His car gets trashed by Ritchie.\n\n10. Star - Blond groupie chick that gets Donnie hooked on Drugs. Gets her ass kicked by Ritchie after she tries to get Ritchie to try the drugs. &quot;Big Nudity Scene&quot;\n\n11. Candy - Random Booby shot in the swimming pool.\n\n12. Surgical Steel - Rival local heavy metal band within the Tuson Arizona music scene.\n\n******** What you may learn form watching this film ********\n\n1. Music Promoters are all assholes &amp; out for themselves.\n\n2. Leif Garret can actually perform real music besides bubble gum.\n\n3. Scott McGinnis did get out of the closet after Lt. Uhura locked him in during Star Trek / The Search for Spock.\n\n4. Good girls fathers are all town drunks.\n\n5. Ice Cream makes a girls Boobies grow bigger.\n\n6. Heavy Metal was the choice music in Arizona in the 80&amp;#039;s.\n\n7. Golan/Globus made other films besides Missing in Action.\n\n8. Never play at Buffalo Bills night club. He&amp;#039;ll try to screw you every time when it comes time to pay you...\n\n******** Personal Commentary ********\n\nNow I know I&amp;#039;m most likely going to be bias to this film. This is my favorite film of all time. During my years as a musician I seen many films that showed the life of a musician but rarely found one that was somewhat accurate about the whole industry.\n\nThis film does just that.. It&amp;#039;s that damn good... The acting can be better but the story is deep. I really can&amp;#039;t trash this film. It has some sentimentality with me.\n\nIt defiantly is a keeper &amp; wish to God they would release it on DVD soon... I own it on video and it&amp;#039;s an original copy. It makes me feel all fuzzy inside... hehehe...\n\nAnywho.... I give this film..... 10 moooss.... If you can rent it.. watch it... trust me on this one...\n\nThat&amp;#039;s my story &amp; I&amp;#039;m sticking to it...\n\nMooby\n\n&quot;For GODs sake, let the Moobster dance!&quot; quote: N. Fisher ","torrent":{"xt":"urn:btih:e0abeeb2b5780d241e768f7931450628a89567b9","amp;dn":"Thunder+Alley+Leif+Garrett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0abeeb2b5780d241e768f7931450628a89567b9","infoHashBuffer":{"type":"Buffer","data":[224,171,238,178,181,120,13,36,30,118,143,121,49,69,6,40,168,149,103,185]},"announce":[],"urlList":[]}}