{"title":"The Necessity of Atheism by Percy Bysshe Shelley","uid":8311284,"size":175286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e13de3d62d25a65d65cfbf22981a8792e4722978&amp;dn=The+Necessity+of+Atheism+by+Percy+Bysshe+Shelley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"imarion","files":-1,"time":1364487172,"description":"&quot;The Necessity of Atheism&quot; is a treatise on atheism by the English poet Percy Bysshe Shelley, printed in 1811 by C. and W. Phillips in Worthing while Shelley was a student at University College, Oxford. A copy of the first version was sent as a short tract signed enigmatically to all heads of Oxford colleges at the University. At that time the content was so shocking to the authorities that he was &quot;rusticated&quot; (expelled from the University) for refusing to deny authorship, together with his friend and fellow student, Thomas Jefferson Hogg. A revised and expanded version was printed in 1813.\n\nShelley's early profession of atheism in this tract not only led to his expulsion from Oxford but also branded him as a radical agitator and thinker, setting an early pattern of marginalisation and ostracism from the intellectual and political circles of his time. Though Shelley's poetry and prose output remained steady throughout his life, most publishers and journals declined to publish his work for fear of being arrested themselves for blasphemy or sedition.\n\nShelley did not live to see success and influence in his time, although these reach down to the present day not only in literature, but in major movements in social and political thought.\n\n(Reference: Wikipedia.) ","torrent":{"xt":"urn:btih:e13de3d62d25a65d65cfbf22981a8792e4722978","amp;dn":"The+Necessity+of+Atheism+by+Percy+Bysshe+Shelley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e13de3d62d25a65d65cfbf22981a8792e4722978","infoHashBuffer":{"type":"Buffer","data":[225,61,227,214,45,37,166,93,101,207,191,34,152,26,135,146,228,114,41,120]},"announce":[],"urlList":[]}}