{"title":"Nile - At The Gate Of Sethu  mp3  320k    2014","uid":10960920,"size":137404007,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e18a7223dff7494928bbc12ebf021c9bd9e6fef6&amp;dn=Nile+-+At+The+Gate+Of+Sethu++mp3++320k++++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":13,"time":1409717005,"description":"Nile - At The Gate Of Sethu  mp3  320k  2044 What we got....\nNile formed in their hometown of Greenville in 1993. With their self-proclaimed trademark of &quot;Ithyphallic metal&quot;, Karl Sanders (guitar/vocals), Chief Spires (bass/vocals), and Pete Hammoura (drums) debuted with their Festivals Of Atonement EP in 1995, leading Nile to a southwestern tour in support of other big metal acts such as Obituary, Deicide, and Broken Hope.\n\nVisceral Productions was responsible for releasing Nile's EP Ramses Bringer Of War in 1997, and was going to release their first album Amongst The Catacombs Of Nephren-Ka, if they had not gone out of business later that year. However, Relapse Records was open to releasing it in early 1998, giving Nile a wider distribution and a chance to hit the road with Incantation and Morbid Angel.\n\nThe follow-up, Black Seeds Of Vengeance, was released in late 2000. Prior to this release, Pete Hammoura left the band due to injuries sustained while touring for Amongst The Catacombs Of Nephren-Ka. He tore his rotator cuff and could not recover the use of his arm fully in time to undertake the physical stress of a touring death metal band. He did not want to leave and thought a few more months of rehabilitation could get him up to speed. However, since the band thought he was holding them back, it was agreed that he leave. Derek Roddy drummed on all of the tracks (except &quot;To Dream Of Ur&quot; as a session musician. Also, prior to Black Seeds Of Vengeance, Dallas Toler-Wade joined as a second guitarist/vocalist. A collection of remastered recordings, In The Beginning, was released later the same year.\n\nChief Spires left the bands a few months after the release of Black Seeds Of Vengeance citing personal and professional differences. He was replaced by Jon Vesano. The band also found a new drummer in Tony Laureano.\n01. Enduring the Eternal Molestation of Flame (4:29)\n02. The Fiends Who Come To Steal the Magick of the Deceased (4:30)\n03. The Inevitable Degradation of Flesh (5:31)\n04. When My Wrath is Done (3:12)\n05. Slaves of Xul (1:25)\n06. The Gods Who Light Up the Sky At the Gate of Sethu (5:43)\n07. Natural Liberation of Fear Through the Ritual Deception of Death (3:31)\n08. Ethno-Musicological Cannibalisms (1:40)\n09. Tribunal of the Dead (5:55)\n10. Supreme Humanism of Megalomania (4:37)\n11. The Chaining of the Iniquitous (7:05)\n12. Enduring the Eternal Molestation of Flame (Instrumental Bonus Track) (4:06)\n13. The Inevitable Degradation of Flesh (Instrumental Bonus Track) (5:31)\n\nmp3, 320 kbps (CD Rip                                                                      \nMembers:\n\nCurrent members:\n \n1993-   Karl Sanders - guitars, bass, vocals\n1996-   Dallas Toler-Wade - guitars, bass, vocals\n2004-   George Kollias - drums\n2012-   Todd Ellis - bass, vocals\n \nIseems to be good old quality Metal just what is needed now seed .......","torrent":{"xt":"urn:btih:e18a7223dff7494928bbc12ebf021c9bd9e6fef6","amp;dn":"Nile+-+At+The+Gate+Of+Sethu++mp3++320k++++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e18a7223dff7494928bbc12ebf021c9bd9e6fef6","infoHashBuffer":{"type":"Buffer","data":[225,138,114,35,223,247,73,73,40,187,193,46,191,2,28,155,217,230,254,246]},"announce":[],"urlList":[]}}