{"title":"George Jones - The Best Of George Jones vol 1 - Hardcore Honky T","uid":6875651,"size":394492019,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e1fbfb3fb391854810cc59e9c604fe9764fd1d49&amp;dn=George+Jones+-+The+Best+Of+George+Jones+vol+1+-+Hardcore+Honky+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":37,"time":1323408317,"description":"George Jones - The Best Of George Jones vol 1 - Hardcore Honky Tonk\nMercury\n848 978-2\n1991\n\nTracklist :\n\n    You're Still On My Mind\n    Hearts In My Dreams\n    If I Don't Love You (Grits Ain't Groceries)\n    Why Baby Why\n    Relief Is Just A Swallow Away\n    Just One More\n    Out Of Control\n    The Last Town I Painted\n    You Better Treat Your Man Right\n    Color Of The Blues\n    Window Up Above\n    Achin' Breakin' Heart\n    Mr. Fool\n    Accidentally On Purpose\n    Glad To Let Her Go\n    Talk To Me Lonesome Heart\n    Someone Sweet To Love\n    Tarnished Angel\n    Into My Arms Again\n    Tall Tall Trees\n\n\n\n________________________________________\n\n    At the time Mercury released The Best of George Jones, Vol. 1: Hardcore Honky Tonk in 1991, it was their most exhaustive trawl through Jones' Starday and Mercury recordings to date. Just three years later, they produced the double-disc set Cup Of Loneliness, which provided an exhaustive overview of the same era this 20-track single disc covers. The two albums shared a whopping 18 tracks -- &quot;Someone Sweet to Love&quot; and &quot;Into My Arms Again&quot; are the only two songs to not make the cut -- so it wasn't a surprise that not only was a second volume never released, but that this disc went out of print a few years after the appearance of Cup Of Loneliness. Since most of this material is readily available on that collection (and the two songs that are not, while good, aren't a great loss to anyone outside of hardcore collectors), it's not a tragedy that this is no longer in print, but it nevertheless is missed, since it's an excellent summary of Jones' early sides, containing both his biggest hits from this time and the purest hardcore country he ever sang. It's a little on the serious side, containing no novelties like &quot;Who Shot Sam,&quot; which is unfortunate since silly songs were always a big part of Jones' music, and it doesn't have all the great songs he cut during this period (no &quot;White Lightning&quot; or &quot;No Money in This Deal,&quot; for instance, or &quot;I'm Gonna Burn Your Playhouse Down&quot; or &quot;Big Harlan Taylor&quot;), but these are purposeful omissions: This is intended to be a collection of the hardest honky tonk he cut, a record for heartbreak and late nights, and it's superb on that count. Superb enough, actually, to keep around even if you have Cup of Loneliness, and good enough to pick up if you find it in a used record store -- but probably not worth spending too much time and energy to seek it out.\n\n    -- Stephen Thomas Erlewine","torrent":{"xt":"urn:btih:e1fbfb3fb391854810cc59e9c604fe9764fd1d49","amp;dn":"George+Jones+-+The+Best+Of+George+Jones+vol+1+-+Hardcore+Honky+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1fbfb3fb391854810cc59e9c604fe9764fd1d49","infoHashBuffer":{"type":"Buffer","data":[225,251,251,63,179,145,133,72,16,204,89,233,198,4,254,151,100,253,29,73]},"announce":[],"urlList":[]}}