{"title":"Cinema Italiano (gnv64)","uid":8152809,"size":10462837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e27dc418f3ceb2aaf2f7d5eb92bbc7ee6562a44a&amp;dn=Cinema+Italiano+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1361091644,"description":"Cinema Italiano: The Complete Guide from Classics to Cult\nby Howard Hughes\nI. B. Tauris | August 2011 | ISBN-10: 1848856083 | PDF | 320 pages | 10 mb\n\nUncovering a treasure trove of Italian films from The Leopard to Puma Man - Italian filmmakers have created some of the most magical and moving, violent and controversial films in world cinema. During its twentieth-century heyday, Italy's film industry was second only to Hollywood as a popular film factory, exporting cinematic dreams worldwide. With international finance and multinational stars, Italian filmmakers tackled myriad genres with equal gusto and in inimitable style. Cinema Italiano is the first book to discuss comprehensively both Italian 'popular' and 'arthouse' cinema of this golden age.\nAppraising over 400 movies, Cinema Italiano unearths the best of Italian cinema. Dario Argento's 'gialli' thrillers and Sergio Leone's spaghetti westerns are explored alongside the best films of Luchino Visconti, Federico Fellini, Pier Paolo Pasolini and Michelangelo Antonioni.\nChapters discuss the rise and fall of genres such as mythological epics, gothic horrors, science-fiction, spy films, war movies, costume adventures, zombie films, swashbucklers, political cinema, spaghetti westerns and 'poliziotteschi' crime films.\nThe book also traces the directorial careers and key films of such luminaries as Mario Bava, Sergio Corbucci, Francesco Rosi, Lucio Fulci, Duccio Tessari, Enzo G. Castellari, Bernardo Bertolucci and Gillo Pontecorvo. An essential guide for DVD and video collectors and aficionados alike, it is illustrated throughout with rare stills and international posters from this revered era in world cinema.\nFilms include: La dolce vita, Hercules Conquers Atlantis, The Leopard, The Terror of Dr Hichcock, Contempt, The Gospel According to St Matthew, Castle of Blood, Fists in the Pocket, Django, Battle of Algiers, The Good, the Bad and the Ugly, Blowup, Diabolik, The Bird with the Crystal Plumage, The Conformist, They Call Me Trinity, Violent City, The Marseilles Connection, Illustrious Corpses, Suspiria, The Big Silence, The Mask of Satan, Maciste in Hell, Blood and Black Lace, Hercules Against the Moon Men, The Last Man on Earth, The Wild, Wild Planet, Special Mission Lady Chaplin, Django Kill!, Fellini Satyricon, Deep Red, Sons of Thunder, Tentacles, The Inglorious Bastards, Zombie Flesh Eaters, Puma Man, 1990: Bronx Warriors, 8Â½, Once Upon a Time in the West, L'Avventura, Black Sabbath, Investigation of a Citizen Above Suspicion.\n\nAbout the Author\nFilmwriter Howard Hughes is the author of 'Aim for the Heart: The Films of Clint Eastwood' and of the 'Filmgoers Guides: 'Stagecoach to Tombstone: The Filmgoers' Guide to the Great Westerns'; 'Crime Wave: The Filmgoers' Guide to the Great Crime Movies'; and 'Once Upon a Time in the Italian West: The Filmgoers' to Spaghetti Westerns', all published by I.B. Tauris. He is also the author of the 'Filmgoers' Guide Blog' and has written the 'Pocket Esential History Guide to The American Indian Wars', the 'Kamera Guide to Spaghetti Westerns' and is a regular contributor to the film magazine 'Cinema Retro'.\n\nCONTENTS\nArt and Artifice: An Introduction to Italian Cinema IX\nAcknowledgements XV\nChapter One Hercules Conquers the Box Office: Mythological Epics 1\nChapter Two Historical Escapades, High Seas and Low B's: Costume Adventures 29\nChapter Three Fall of the Empire: Sword and Sandal Spectacles 49\nChapter Four Tales from the Tomb: Gothic Horrors 77\nChapter Five Battle of the Worlds: Science Fact and Fiction 101\nChapter Six Vita All'Italiana: Love and Death 119\nChapter Seven Shoot, Gringo ... Shoot!: Italian Westerns 143\nChapter Eight Passports to Hell: Euro Crime and Crimebusters 167\nChapter Nine Anarchy and Allegory: Political Cinema 191\nChapter Ten Mission Improbable: World War II Movies 209\nChapter Eleven Knives in the Dark: Gialli Thrillers 223\nChapter Twelve A Funny Thing Happened: Italian Comedy 245\nChapter Thirteen Splats Entertainment: Italian Cinema Eats Itself 267\nBibliography and Sources 297\nIndex of Key Directors 301\nIndex of Film Titles 303","torrent":{"xt":"urn:btih:e27dc418f3ceb2aaf2f7d5eb92bbc7ee6562a44a","amp;dn":"Cinema+Italiano+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e27dc418f3ceb2aaf2f7d5eb92bbc7ee6562a44a","infoHashBuffer":{"type":"Buffer","data":[226,125,196,24,243,206,178,170,242,247,213,235,146,187,199,238,101,98,164,74]},"announce":[],"urlList":[]}}