{"title":"The Mozart Effect by Don Campbell","uid":9724140,"size":969942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3205d8326a0434e37fefc7ea2698c1c20a6aa1a&amp;dn=The+Mozart+Effect+by+Don+Campbell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1394278704,"description":"\nThe Mozart Effect - Tapping the Power of Music to Heal the Body, Strengthen the Mind, and Unlock the Creative Spirit by Don Campbell\n\n\nAnyone who has ever seen a two-year-old start bouncing to a beat knows that music speaks to us on a very deep level. But it took celebrated teacher and music visionary Don Campbell to show us just how deep, with his landmark book The Mozart Effect.\n\nStimulating, authoritative, and often lyrical, The Mozart Effect has a simple but life-changing message: music is medicine for the body, the mind, and the soul. Campbell shows how modern science has begun to confirm this ancient wisdom, finding evidence that listening to certain types of music can improve the quality of life in almost every respect. \n\nHere are dramatic accounts of how music is used to deal with everything from anxiety to cancer, high blood pressure, chronic pain, dyslexia, and even mental illness.\n\nAlways clear and compelling, Campbell recommends more than two dozen specific, easy-to-follow exercises to raise your spatial IQ, &quot;sound away&quot; pain, boost creativity, and make the spirit sing!\n\nGenre: Music, Children, Healing, Creativity","torrent":{"xt":"urn:btih:e3205d8326a0434e37fefc7ea2698c1c20a6aa1a","amp;dn":"The+Mozart+Effect+by+Don+Campbell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3205d8326a0434e37fefc7ea2698c1c20a6aa1a","infoHashBuffer":{"type":"Buffer","data":[227,32,93,131,38,160,67,78,55,254,252,126,162,105,140,28,32,166,170,26]},"announce":[],"urlList":[]}}