{"title":"Political Correctness Debunked - eBook Collection","uid":9720577,"size":160980513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e39b4cea5a6dcc376387ab5668a8232751960c94&amp;dn=Political+Correctness+Debunked+-+eBook+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":18,"time":1394229005,"description":"This collection of ebooks is very important to understand the sickness in the western countries today, especially in Sweden. Politicians and journalists appeal to political correctness, humanitarian values, feminism, multiculturalism, queer theories etc to transform former healthy countries closer to totalitarian societies, where only politically correct opinions are accepted. Dissident opinions are labeled as hatred, racism, facism, nazism, islamophobic, homophobic etc, which successfully puts an end to all debates in the media. This is threatening the democratic system and the freedom of speech.\n\nHowever, it's not easy to understand where political correctness comes from or how it's all connected: politics, mass media, immigration, feminism and socialism. This collection of ebooks won't give you a complete picture of the modern western society and its PC sickness, but will aid you in connecting the dots and hopefully make you develop your critical thinking. Everything's not always what it seem in the news (sometimes quite the contrary), and critical thinking is essential to be able to make your own decisions about your future and the future of your country.\n\nHowever, the core in the subject of political correctness boils down to the debate over &quot;nature or nurture&quot;, the question of human behaviour and individual differences is mainly genetic or environmental (which is the base for socialism and sociology). So far research seems to support the biological approach more than the environmental, contrary to what the politicians and media keep telling us in most western countries. Read the included books, get your own opinion and use your logic. If you are not fully brainwashed with political correctness, you will question certain &quot;truths&quot;.\n\nI also strongly recommend the norweigian tv-series &quot;Hjernevask&quot; (Brainwash) which investigates the subjects mentioned below. Several authors of the included ebooks are interviewed in Hjernevask, and the books can be easier to understand after watching the show.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6731035/Brainwash_-_Hjernevask&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6731035/Brainwash_-_Hjernevask&lt;/a&gt; (English subtitles)\nSubjects:\nIntelligence, IQ, Political Correctness, Cultural Marxism, Genetics, Socialism, Freedom, Liberty, Socio-economic Class, Critical Thinking, Culture, Race, Multiculturalism, Inequality, Human Nature, Gender, Science, Psychology\n\neBooks included:\n\nAnne Campbell-A Mind of Her Own - The Evolutionary Psychology of Women (2002)\nArthur R. Jensen-The g Factor - The Science of Mental Ability (1998)\nCritical Thinking - Student's Introduction 4th Ed (2011)\nDavid G. Green-We're (Nearly) All Victims Now! - How Political Correctness is Undermining Our Liberal Culture (2006)\nFrank Miele-Intelligence, Race, And Genetics -  Conversations With Arthur R. Jensen (2004)\nGeoffrey Hughes-Political Correctness - A History of Semantics and Culture (2009)\nHelmuth Nyborg (Eds.)-The Scientific Study of General Intelligence. Tribute to Arthur R. Jensen\nJohn Lea-Political Correctness and Higher Education - British and American Perspectives (2008)\nRichard A. Lippa-Gender, Nature, and Nurture (2005)\nRichard Dawkins-The Selfish Gene (2006)\nRichard Herrnstein, Charles Murray-The Bell Curve - Intelligence and Class Structure in American Life (2010)\nRichard Lynn-The Global Bell Curve - Race, IQ, and Inequality Worldwide (2008)\nSteven Pinker-The Blank Slate - The Modern Denial of Human Nature (2003)\nTomas Chamorro-Premuzic-Personality and Individual Differences (2nd Ed) (2011)\n\nAlso included because of the important views on society and media:\n\nGeorge Orwell-Nineteen Eighty-Four (2003)\nGeorge Orwell-Animal Farm - Centennial Edition (2003)\nPhilip Bounds-Orwell and Marxism - The Political and Cultural Thinking of George Orwell (2009)","torrent":{"xt":"urn:btih:e39b4cea5a6dcc376387ab5668a8232751960c94","amp;dn":"Political+Correctness+Debunked+-+eBook+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39b4cea5a6dcc376387ab5668a8232751960c94","infoHashBuffer":{"type":"Buffer","data":[227,155,76,234,90,109,204,55,99,135,171,86,104,168,35,39,81,150,12,148]},"announce":[],"urlList":[]}}