{"title":"Quantum Mechanics - The Theoretical Minimum [PDF]","uid":9808910,"size":1661827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e43e4601fec30ba10ce0c449598ed649dedc6e1a&amp;dn=Quantum+Mechanics+-+The+Theoretical+Minimum+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1395497999,"description":"Pages: 384 pages\nPublisher: Basic Civitas Books (25 February 2014)\nLanguage: English\nISBN-10: 0465036678\nISBN-13: 978-0465036677\nFormat: PDF\n\n\nFrom the bestselling author of The Theoretical Minimum, a DIY introduction to the math and science of quantum physics First he taught you classical mechanics. Now, physicist Leonard Susskind has teamed up with data engineer Art Friedman to present the theory and associated mathematics of the strange world of quantum mechanics. In this follow-up to The Theoretical Minimum, Susskind and Friedman provide a lively introduction to this famously difficult field, which attempts to understand the behavior of sub-atomic objects through mathematical abstractions. Unlike other popularizations that shy away from quantum mechanics' weirdness, Quantum Mechanics embraces the utter strangeness of quantum logic. The authors offer crystal-clear explanations of the principles of quantum states, uncertainty and time dependence, entanglement, and particle and wave states, among other topics, and each chapter includes exercises to ensure mastery of each area. Like The Theoretical Minimum, this volume runs parallel to Susskind's eponymous Stanford University-hosted continuing education course. An approachable yet rigorous introduction to a famously difficult topic, Quantum Mechanics provides a tool kit for amateur scientists to learn physics at their own pace.","torrent":{"xt":"urn:btih:e43e4601fec30ba10ce0c449598ed649dedc6e1a","amp;dn":"Quantum+Mechanics+-+The+Theoretical+Minimum+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43e4601fec30ba10ce0c449598ed649dedc6e1a","infoHashBuffer":{"type":"Buffer","data":[228,62,70,1,254,195,11,161,12,224,196,73,89,142,214,73,222,220,110,26]},"announce":[],"urlList":[]}}