{"title":"Scoreland - Kelly Christiansen (A Fuck On The Wild Side)","uid":6604816,"size":237771155,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e45000997ce1cf4d074611c199b8df3f85a59fe4&amp;dn=Scoreland+-+Kelly+Christiansen+%28A+Fuck+On+The+Wild+Side%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FluxXxu","files":1,"time":1313353654,"description":"Scoreland - Kelly Christiansen (A Fuck On The Wild Side)\n\nDescription:\nMeet luscious Holiday '10 SCORE covergirl Kelly Christiansen. This is one of two of Kelly's debut videos. Her second video debuts on SCORELAND. Call it a horny hardcore double feature debut. Kelly's story is like that of another SCORE model named Jayden Prescott. They both have husbands that are SCORE Men; readers, website members and DVD buyers. Triple-threat dudes. Like Jayden's guy, Kelly's generous hubby encouraged Kelly to pose, and beyond. Way beyond. &quot;My husband reads SCORE,&quot; said lovely, 36H-cupper Kelly. &quot;He's a website member, too, and he also buys some videos. He loves Julia Miles. He said, 'Hey, look, they have this BeASCORE Model website,' so we watched the little introductory video and he said, 'You should do this.' He was very open about it. And he likes girls like me.&quot; Kelly's SCOREVideos scene is based on one of her fantasies. She loves going to strip clubs. &quot;I went to a club with my man, and the girl came over to dance for us. They had individual stages. And she asked if she could pull me up on stage, and she was just wild over my boobs. She said, 'Can I take off your shirt?' and she took off my shirt. And she wanted to take off my pants, and she took off like everything and we pretty much simulated a duo on stage in front of everybody. It was crazy. My husband loved it. Guys were watching and throwing dollars.&quot; In this scene, Kelly is a waitress in a strip club. All of her customers but one leaves. That sounds like one of your fantasies too\n\nScreens:\n &lt;a href=&quot;\nhttp://www.starpix.us/show.php/2497_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starpix.us/show.php/2497_1.jpg.html&lt;/a&gt;","torrent":{"xt":"urn:btih:e45000997ce1cf4d074611c199b8df3f85a59fe4","amp;dn":"Scoreland+-+Kelly+Christiansen+%28A+Fuck+On+The+Wild+Side%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e45000997ce1cf4d074611c199b8df3f85a59fe4","infoHashBuffer":{"type":"Buffer","data":[228,80,0,153,124,225,207,77,7,70,17,193,153,184,223,63,133,165,159,228]},"announce":[],"urlList":[]}}