{"title":"Partie de Campagne (1936).avi","uid":4371966,"size":733286934,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e48e23d0dbf42abf13337e417b3986f3b05ef37f&amp;dn=Partie+de+Campagne+%281936%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"megalilo","files":1,"time":1220209166,"description":"Partie de Campagne (1936)\n\nPartie de Campagne (English title: A Day in the Country) is a film written and directed by the French auteur Jean Renoir in 1936. It chronicles a love affair over a single summer afternoon in 1860, along the banks of the Seine. The film is based on a short story by Guy de Maupassant, who was a friend of Renoir&amp;#039;s father Auguste Renoir. Future star directors Jacques Becker and Luchino Visconti worked as Renoir&amp;#039;s assistant directors.\n\nPartie de campagne was shot in July, soon after France had elected the Popular Front government, and employers had negotiated the Matignon agreement, providing wage increases, 40-hour weeks, trade union rights, paid holidays and improved social services. The film was not released until 1946, ten years after it was shot. Renoir never finished the filming due to weather problems, but the producer, Pierre Brauenberger, turned the material into a release after World War.\n\nIn the film, Monsieur Dufour (AndrÃƒÂ© Gabriello), a shop-owner from Paris, takes his family to spend a day in the country, where they meet two young men, Henri (Georges D&amp;#039;Arnoux) and Rodolphe (Jacques B. Brunius). While Dufour and his young daughter&amp;#039;s fiancÃƒÂ©, AnatolÃƒÂ© (Paul Temps), go fishing, Madame Dufour (Jane Marken), his wife, and Henriette (Sylvia Bataille), his daughter, go off with the two strangers. Madame Dufour enjoys a care-free fling with Rodolphe, and Henriette and Henri row to a secluded island and engage in a romance.\n\nIMDB: 8.2/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0028445/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0028445/&lt;/a&gt;","torrent":{"xt":"urn:btih:e48e23d0dbf42abf13337e417b3986f3b05ef37f","amp;dn":"Partie+de+Campagne+%281936%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e48e23d0dbf42abf13337e417b3986f3b05ef37f","infoHashBuffer":{"type":"Buffer","data":[228,142,35,208,219,244,42,191,19,51,126,65,123,57,134,243,176,94,243,127]},"announce":[],"urlList":[]}}