{"title":"Brave New World (1980)","uid":11255305,"size":495707600,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4c8cdfc1c1fd985845c4f8a35cf6f4ee6457813&amp;dn=Brave+New+World+%281980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mooseleg8","files":-1,"time":1413891226,"description":"In a future society based on pleasure without moral worries, love is prohibited but casual sex, now called 'engaging', is strongly encouraged. Everyone is kept happy with a legal drug, soma. People are hatched and cloned on conveyor belts to meet the requirements of five different social classes, from ruling Alphas to robot-like Epsilons. Bernard Marx is a different Alpha male with an inclination to thinking. He and a girl called Lenina Disney go visit a reservation of 'savages' where they meet a handsome young man John and bring him back to 'civilization'. John turns out to be the son of the director of the cloning authority, which causes a scandal and makes John a celebrity freak. John falls in love with Lenina but his desire is ruined by his antiquated sexual morale derived from reading Shakespeare. John hates the over-social but anti-emotional civilization, asks to be sent to live in isolation, and gets a job as a lighthouse guard. But even there he can't forget Lenina or escape \n\n\nFolks, I'm going on vacation through Sat. Will be back Sat. night or Sunday morning","torrent":{"xt":"urn:btih:e4c8cdfc1c1fd985845c4f8a35cf6f4ee6457813","amp;dn":"Brave+New+World+%281980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c8cdfc1c1fd985845c4f8a35cf6f4ee6457813","infoHashBuffer":{"type":"Buffer","data":[228,200,205,252,28,31,217,133,132,92,79,138,53,207,111,78,230,69,120,19]},"announce":[],"urlList":[]}}