{"title":"PC: Civilization - Call to Power - Enhanced Edition - DVD - 1999","uid":5089796,"size":4240605184,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e61cd8e7bc244bdb493e95d9f4d05c023e7ceb7d&amp;dn=PC%3A+Civilization+-+Call+to+Power+-+Enhanced+Edition+-+DVD+-+1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ImportBoy","files":1,"time":1253042556,"description":"This is a 1:1 rip of the 1999 PC Game Civilization: Call to Power - Enhanced Edition. \n\nFor details and background on the game itself please see my torrent for the regular version: http://thepiratebay.se/torrent/5076013/PC__Civilization_-_Call_to_Power_-_1999_-_Activision\n\n\nEnhanced Edition Background:\n\nThe Enhanced Edition was released by Activision in November 1999 - some months after the release of the original Call to Power. The Enhanced Edition shipped exclusively on DVD-ROM media (unheard of for a PC game in 1999 - few PCs had DVD-ROM drives at the time); the original Call to Power shipped on a single mixed mode data/audio CD-ROM. \n\n\nEnhanced Edition Features:\n\nMovies - the introduction, end game, and wonder movies are all in widescreen 720 x 480 resolution along with 5.1 surround sound. In the standard version they are in 320 x 240 resolution with only mono sound and a much lower bitrate. \n\nMusic - there are two new music tracks in the enhanced edition (for a total of 10). Music quality and format is still the same as the standard edition.\n\nConcept Art Viewer - this application allows to view concept art versus the final sprites for most of the units, advancements, improvements, etc in the game. \n\nOnline Manual - the game manual is included on the disc. \n\n\nLanguage &amp; Disc Size:\n\nThe Enhanced Edition has support for English, French, Spanish, Italian, and German. If you were wondering why the disc size is so large for relatively minor enhancements it is because there are seperate movie files for all 5 languages - the size quickly adds up. \n\n\nNo Patch 1.2 Support &amp; Plans:\n\nWhile the Enhanced Edition already has the Call to Power 1.1 patch integrated, unfortunately there seems to be no support for the final 1.2 patch which added some new features (like hotseat play) and had many bug fixes and gameplay tweaks. \n\nAfter reviewing the disc and installation structures of both the standard and enhanced editions I believe it should be fairly trivial to port over all of the Enhanced Edition's features to the original - thus allowing the use of a fully patched 1.2 version. \n\nI will post a new customized Call to Power disc in the near future that allows use of the 1.2 patch and all of the enhanced edition features. Until then I just wanted to share this relatively rare release. ","torrent":{"xt":"urn:btih:e61cd8e7bc244bdb493e95d9f4d05c023e7ceb7d","amp;dn":"PC%3A+Civilization+-+Call+to+Power+-+Enhanced+Edition+-+DVD+-+1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e61cd8e7bc244bdb493e95d9f4d05c023e7ceb7d","infoHashBuffer":{"type":"Buffer","data":[230,28,216,231,188,36,75,219,73,62,149,217,244,208,92,2,62,124,235,125]},"announce":[],"urlList":[]}}