{"title":"Julia Boutros - 2008 - Live At Casino Du Liban","uid":9462266,"size":276588721,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e62da76ce377e7fa9f3ec59215c3a50b6d589b62&amp;dn=Julia+Boutros+-+2008+-+Live+At+Casino+Du+Liban&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SurajMusic","files":-1,"time":1389376209,"description":"Julia Boutros (born April 1, 1968) is a Lebanese singer that rose to stardom in the 1980s with a series of songs like &quot;Ghabet Shams El Haq&quot; and &quot;Wen el malaieen&quot;. She is also the sister of Ziad Boutros.\n\n\nJulia was born in Beirut, Lebanon on April 1, 1968 into a Greek Orthodox Christian family to a Lebanese father and mother. She was educated at the Rosary Sisters Schools where she sang in the school choir. Growing up, she and her brother were heavily influenced by Ziad Rahbani's works. When she was 12 years old she recorded her first song, entitled &quot;A Maman&quot;, at Elias Al Rahbani studios. This was introduced to her by her music teacher Fouad Fadel. She also recorded two songs, &quot;C'est la Vie&quot; &amp; &quot;Viens dans Ma Vie&quot;.\n\nOn October 11, 2006, Julia announced a new single called &quot;Ahibaii&quot; (My loved ones). The lyrics are based on a letter sent by Hizbollah secretary general Hassan Nasrallah to the fighters in South Lebanon during the 2006 Summer War between Hezbollah and Israel.The poet Ghassan Matar adapted the original text. The music is composed by Ziad, brother of Julia and arranged by Michel Fadel. The profits from the song's sale went to help the families of Hizbollah fighters and to all Lebanese who died during the Israel-Lebanon conflict.[2] Sales eventually garnered three million dollars for the families of the Lebanese civilians, soldiers, security forces, and Hezbollah militants who have been killed in the Israel-Lebanon conflict.[2] The sum was triple the original aim, which was only one million dollars.[2] The families of Lebanese soldiers killed during operation Naher el-Bared also received a portion of the money.\n\nDuration : 01:45:13 | Bitrate : 320 Kbit/s | Year : 2008 | Size : 257 mb","torrent":{"xt":"urn:btih:e62da76ce377e7fa9f3ec59215c3a50b6d589b62","amp;dn":"Julia+Boutros+-+2008+-+Live+At+Casino+Du+Liban","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e62da76ce377e7fa9f3ec59215c3a50b6d589b62","infoHashBuffer":{"type":"Buffer","data":[230,45,167,108,227,119,231,250,159,62,197,146,21,195,165,11,109,88,155,98]},"announce":[],"urlList":[]}}