{"title":"Mean Cuckold (NEW 2013 Evil Angel) (Split Scenes)","uid":8835313,"size":2640604775,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e6c6b43642428bab6e44d8108761845f9c3ab354&amp;dn=Mean+Cuckold+%28NEW+2013+Evil+Angel%29+%28Split+Scenes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"chkm8te","files":4,"time":1377099598,"description":"Mean Cuckold (NEW 2013 Evil Angel) (Split Scenes)\n\nRiley Reid, Aiden Starr, Kurt Lockwood, Julie Cash, Veruca James, Ryan McLane, Robert, Jimmy Broadway, Eric Jover, Dirk Huge, Marcelo, Dominik Kross\n\n&quot;Mean Cuckold is one of the most intense cuckold videos ever made!&quot; exclaims MeanBitch director Glenn King. &quot;Not only is this the first MeanBitch Production that focuses on hardcore sex. We really went way beyond just having a 'real man' fuck a girl in front of her wimpy boyfriend. We took the concept further by giving the submissive a reason to despise and hate the stud. Each scene is all about a slave suffering the indignity of watching his worst enemy have sex with the woman he loves. It's about complete transfer of power from submissive to domme. And it's about pushing how low a submissive will sink to please his Mistress.&quot;\n\nTo get down there, MeanBitch dug deeper into femdom fetish than ever before. &quot;In the past, my scenes have been limited to no-intercourse female domination,&quot; King explains. &quot;In most domme/sub scenes, it wouldn't be appropriate for the Mistress to have sex with the slave. But sometimes, a scene calls for submission beyond face sitting, ass worship and foot worship. It needs the addition of a new character: the real man or 'bull' that sexually satisfies the Mistress. The cuckold fetish is something I have been wanting to do for a long time... it really gives me a chance to explore some dark themes. I have some seriously perverse fantasies in my head that can only be brought out in hard-core scenes.&quot;\n\nMean Cuckold metes out erotically humiliating vignettes starring Riley Reid, Veruca James, Julie Cash and Aiden Starr, respectively. King fills us in on his kinky scenarios: &quot;In Scene 1, a scary black man breaks into the home of a young couple and robs them. The wife is really attracted to the way the superior black stud beats up her wimpy husband, so she decides to fuck him while her husband eats her ass. In Scene 2, the disappointing slave failed to get the promotion at work, so the Mistress brings in his new boss to fuck her in front of him. In Scene 3, a new employee is ordered to bring his wife in to the office so his horrible, new boss can fuck her. And in Scene 4, two employees are competing for a promotion. The loser has his job reduced to servitude of the hot female boss and his new male boss. In each scene, you can really see the slave sinking lower and further into slavery as he gives up more of his self esteem.&quot;\n\nCovers: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9obfpa5mhjsk6o0mr68b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9obfpa5mhjsk6o0mr68b.jpg&lt;/a&gt;\n\nScreens, &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=qxdt8job8t6dok7uumns.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=qxdt8job8t6dok7uumns.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7964j971f5lqf3hglrm0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7964j971f5lqf3hglrm0.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=i9iys67muyj8xde00nfr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=i9iys67muyj8xde00nfr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=sm5f836r1vyrnt09bkvm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=sm5f836r1vyrnt09bkvm.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e6c6b43642428bab6e44d8108761845f9c3ab354","amp;dn":"Mean+Cuckold+%28NEW+2013+Evil+Angel%29+%28Split+Scenes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6c6b43642428bab6e44d8108761845f9c3ab354","infoHashBuffer":{"type":"Buffer","data":[230,198,180,54,66,66,139,171,110,68,216,16,135,97,132,95,156,58,179,84]},"announce":[],"urlList":[]}}