{"title":"The Walking Dead - Season 3","uid":14543612,"size":10705314893,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e84eed370a2e258e2fcb729b900ecd4b295d08c0&amp;dn=The+Walking+Dead+-+Season+3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"POtHS11","files":33,"time":1462549926,"description":"The Walking Dead - Season 3\r\n\r\nDescription\r\nThe Walking Dead - Season 3\r\n\r\nPlot[edit]\r\nEight months after abandoning the Greene farmstead, Rick leads his near-term wife Lori and the other survivors to a large prison complex. They systematically clear it of walkers, though are forced to amputate Hershel's foot when he is bitten by a walker. They encounter a group of surviving prisoners Rick is highly distrustful of, and kills their leader and abandons another, Andrew, when they try to assassinate him. Andrew, bitter, leads a group of walkers to a breach in the prison's fence, infesting the prison at the same time Lori enters labor while T-Dog sacrifices himself to save Carol just after getting bitten. Maggie is forced to perform a caesarean section to deliver the child which kills Lori; Carl is forced to shoot Lori to prevent her reanimating, and Rick, after killing Andrew and the walkers, is devastated by the loss. Rick starts to have visions of Lori, and the rest of the group question his leadership abilities.\r\n\r\nMeanwhile, Andrea, separated from Rick's group after fleeing the farmstead, has befriended Michonne as they travel. The two are captured by Merle, Daryl's brother who survived being stranded in Atlanta by Rick. Merle takes them to Woodbury, a small fortified community of survivors led by the Governor. Though welcomed by the community, they are appalled at the Governor's ruthlessness, sending his men to kill other survivor camps to gain their supplies, and learn that the Governor is bitter over the loss of his family, keeping the reanimated body of his daughter Penny locked up. Michonne urges Andrea to leave with her, but Andrea is exhausted from the last eight months and stays behind to try to convince the Governor to change his ways while confiding with his assistant Milton on his dangerous personality.\r\n\r\nMichonne witnesses Glenn and Maggie get captured by Merle and taken to Woodbury; there the Governor uses brutal methods to interrogate them about Rick's group. Michonne goes to the prison to warn Rick; though not fully trusting her, Rick and Daryl go with Michonne and launch an attack on Woodbury to rescue Maggie and Glenn. During the attack, Michonne kills Penny and stabs the Governor in one eye. Glenn and Maggie are freed and, after Daryl is briefly captured, he and Merle are reunited and also escape. Andrea recognizes Rick's group but stays quiet, fearing the Governor's reaction. Meanwhile, another group of survivors led by Tyreese and Sasha enter the prison via the breach. Hershel and Carl allow them to stay, but Rick, during one of his visions of Lori, commands them to leave. Tyreese's group comes across Woodbury, and to gain the Governor's trust, Tyreese offers details of the prison's layout. The Governor launches a preliminary assault on the prison, leading Andrea to try to negotiate peace between the two sides. The Governor offers peace if Rick's group turns over Michonne, whom the group now judge as a valued asset. Rick, still trying to make decisions for the group in his remorseful state, arranges a plan to turn her over but changes his mind. However, Merle secretly kidnaps Michonne to take her to the Governor. Michonne convinces Merle to let her go. Having had a changed of heart, Merle instead uses the situation to take out many of the Governor's men before being attacked by the Governor who, while struggling with Merle, bites off two of his fingers before shooting him dead. Daryl finds Merle reanimated and, sadly, kills him by stabbing him multiple times in the head with his hunting knife","torrent":{"xt":"urn:btih:e84eed370a2e258e2fcb729b900ecd4b295d08c0","amp;dn":"The+Walking+Dead+-+Season+3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e84eed370a2e258e2fcb729b900ecd4b295d08c0","infoHashBuffer":{"type":"Buffer","data":[232,78,237,55,10,46,37,142,47,203,114,155,144,14,205,75,41,93,8,192]},"announce":[],"urlList":[]}}