{"title":"A Peaceful Jihad by Ronald Lukens-Bell (2005) [PDF]","uid":10598160,"size":653521,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8afa8f4faea1bb9d1ba9ea37bf202d2d229df12&amp;dn=A+Peaceful+Jihad+by+Ronald+Lukens-Bell+%282005%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405882438,"description":"Title: A Peaceful Jihad - Negotiating Identity and Modernity in Muslim Java\nAuthor: Ronald Lukens-Bull\nCategory: Academic/Religion/Islam\nSeries: Contemporary Anthropology of Religion\nPublisher: Palgrave Macmillan (April 21, 2005)\nLanguage: English\nISBN-10: 1403966583\nISBN-13: 978-1403966582\n\nPromotional info/Publisher's summary - &quot;Based on extensive ethnographic research, this book examines how the Islamic community in Java, Indonesia, is actively negotiating both modernity and tradition in the contexts of nation-building, globalization, and a supposed clash of civilizations. The pesantren community, so-called because it is centered around an educational institution called the pesantren, uses education as a central arena for dealing with globalization and the construction and maintenance of an Indonesian Islamic identity. However, the community's efforts to wrestle with these issues extend beyond education into the public sphere in general and specifically in the area of leadership and politics. The case material is used to understand Muslim strategies and responses to civilizational contact and conflict. Scholars, educated readers, and advanced undergraduates interested in Islam, religious education, the construction of religious identity in the context of national politics, and globalization will find this work useful. &quot;\n\nReviews:\n&quot;This is a thorough study of an important institution in a very interesting part of the Islamic world. On the basis of his careful anthropological investigation of three different pesantran (Islamic schools) in Java, focusing on their physical design, their curricula, and their leadership structures, Dr Lukens-Bull tells us a great deal about the education and 'formation' (in the traditional religious sense) of young Indonesian Muslims as they seek to construct their identity and negotiate their relationship with modernity. Issues such as consumerism and democracy are carefully discussed as illustrations of this process, and the Indonesian discussion is helpfully located within the wider Islamic debates on these topics and the whole relationship between the world of Islam and the West. What Geertz began in the study of South-East Asian Islam, and Woodward, Hefner and Bowen refined and corrected, Lukens-Bull has definitely carried forward.&quot; -Hugh Goddard, Professor of Christian-Muslim Relations, University of Nottingham, United Kingdom.\n\n&quot;This is an important study of Indonesia's, and probably the world's largest Muslim organization. Based on extensive ethnographic research in east Java it focuses on the ways in which a theologically conservative community has sought to embrace modernity, tolerance and pluralism. It is essential reading for those concerned with the study of Islam in Indonesia and the world more broadly.&quot; -Mark Woodward, Arizona State University\n\nThis torrent contains a fully indexed, browse-able and searchable copy of the book in PDF format. The front cover image is also included. Please seed, and enjoy.","torrent":{"xt":"urn:btih:e8afa8f4faea1bb9d1ba9ea37bf202d2d229df12","amp;dn":"A+Peaceful+Jihad+by+Ronald+Lukens-Bell+%282005%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8afa8f4faea1bb9d1ba9ea37bf202d2d229df12","infoHashBuffer":{"type":"Buffer","data":[232,175,168,244,250,234,27,185,209,186,158,163,123,242,2,210,210,41,223,18]},"announce":[],"urlList":[]}}