{"title":"[Audiobook] Erich Maria Remarque - All Quiet on the Western Fron","uid":3964417,"size":174435630,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e92804c6dcc83d5a19a888c8dcb384847881923f&amp;dn=%5BAudiobook%5D+Erich+Maria+Remarque+-+All+Quiet+on+the+Western+Fron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rjeong","files":6,"time":1199643736,"description":"Please seed me!\nErich Maria Remarque, All Quiet on the Western Front - 6 Discs http://www.amazon.com/Unabridged-Performed-Translated-Remarque-Recorded/dp/B000JFL9P6\n\nALL QUIET ON THE WESTERN FRONT: All Quiet on the Western Front is one of the greatest war novels of all time. It should be ranked with Stephen Crane&amp;#039;s The Red Badge of Courage and Ernest Hemingway&amp;#039;s A Farewell to Arms as an eloquent expression of the futility and irreparable loses of war. Paul Baumer is just 19 years old when he and his classmates enlist. They are Germany&amp;#039;s Iron Youth who enter the war with high deals and leave it disillusioned or dead. Paul watches his Second Company---150 men strong---reduced in a single battle to 32 weary survivors. Remarque takes the reader into the very trenches of World War I(one);[creator filled that is], and it is his particular skill to bring us so keenly and sympathetically into the daily experiences of young Baumer. The artillery fireworks overhead, the open corpses strewn about a hellishly desolate landscape, the cries of dying men---lost and anonymous in the darkness---are startlingly realized, evoking images of Dante&amp;#039;s Inferno. As Paul struggles with the realities of who he has become, and the inscrutable world to which he must return, he is led like a ghost into the war&amp;#039;s final hours. &quot;Surely the greatest of all war books.&quot;---Manchester Guardian &quot;Narrator Frank Muller: Muller, whom Library Journal called &quot;the first true superstar of spoken audio,&quot; has narrated over 150 titles for Recorded Books, LLC. His narration of Pat Conroy&amp;#039;s Beach Music won an Audie Award. AudioFile says, &quot;Reader Frank Muller is outstanding, providing, in a richly evocative voice, a sense of time and place that marches the book perfectly.&quot;\n\naudiobooks\naudio","torrent":{"xt":"urn:btih:e92804c6dcc83d5a19a888c8dcb384847881923f","amp;dn":"%5BAudiobook%5D+Erich+Maria+Remarque+-+All+Quiet+on+the+Western+Fron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e92804c6dcc83d5a19a888c8dcb384847881923f","infoHashBuffer":{"type":"Buffer","data":[233,40,4,198,220,200,61,90,25,168,136,200,220,179,132,132,120,129,146,63]},"announce":[],"urlList":[]}}