{"title":"Original Intent - documentary re: american constitution","uid":6019345,"size":379696231,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e9b6dcbbcb1d7b1300aa88668cf8cab8d4e855a9&amp;dn=Original+Intent+-+documentary+re%3A+american+constitution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"wikilynx","files":3,"time":1291747338,"description":"The data this torrent contains are 2 wmv files and one txt file.\nI did not create these, I only wish for people to be able to view them. I was kind of shocked that I could not find this material on torrent sites, so I aim to fix that.\nIf you wish to support the people responsible for the creation of this material, their website is http://www.originalintent.us\n\nthe following is a copy/pasted movie review:\n\nEveryone should watch ORIGINAL INTENT. It is a very clear, compelling, look at the Cultural Marxist attack on the original intent of the Founders of this great republic. It exposes the historical march of Cultural Marxism. It reveals the evils of communism and national socialism. It clarifies the original intent of the Constitution. It helps people to understand clearly the destruction of the money supply and how that affects the economy. And, it provides the keys to freeing the country from enslavement to control by the nationalist and internationalist socialist cabal.\n\nORIGINAL INTENT is not perfect. It was done on a low budget. So, some of the accents of the actors portraying historical figures are weak. Also, some of the special effects are flimsy.\n\nIn spite of its flaws, which are few, this documentary is constantly captivating and often reveals significant facts and truths that few people understand. We do not agree with 100% of it, but we agree with the vast majority of the points made. And, that is a very rare commendation.\n\nPlease watch ORIGINAL INTENT and show it to your children and grandchildren.","torrent":{"xt":"urn:btih:e9b6dcbbcb1d7b1300aa88668cf8cab8d4e855a9","amp;dn":"Original+Intent+-+documentary+re%3A+american+constitution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b6dcbbcb1d7b1300aa88668cf8cab8d4e855a9","infoHashBuffer":{"type":"Buffer","data":[233,182,220,187,203,29,123,19,0,170,136,102,140,248,202,184,212,232,85,169]},"announce":[],"urlList":[]}}