{"title":"REM - Reconstruction of the Fables 1985 [FLAC] - Kitlope","uid":4283382,"size":255533509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea0c57d15f03f748a73507a18ee21fbc2c9d59c6&amp;dn=REM+-+Reconstruction+of+the+Fables+1985+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kitlope","files":16,"time":1215548314,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: EA0C57D15F03F748A73507A18EE21FBC2C9D59C6\nFile Size: 244 Mb\nYear: 1985\nLabel: IRS Records\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nR.E.M. is an American rock band formed in Athens, Georgia, in 1980 by Michael Stipe (lead vocals), Peter Buck (guitar), Mike Mills (bass guitar), and Bill Berry (drums and percussion). R.E.M. was one of the first popular alternative rock bands, and gained early attention due to Buck&amp;#039;s ringing, arpeggiated guitar style and Stipe&amp;#039;s unclear vocals. R.E.M. released its first single, &quot;Radio Free Europe&quot;, in 1981 on the independent record label Hib-Tone. The single was followed by the Chronic Town EP in 1982, the band&amp;#039;s first release on I.R.S. Records. In 1983, the band released its critically acclaimed debut album Murmur, and built its reputation over the next few years through subsequent releases, constant touring, and the support of college radio. Following years of underground success, R.E.M. achieved a mainstream hit in 1987 with the single &quot;The One I Love&quot;. The group signed to Warner Bros. Records in 1988, and began to espouse political and environmental concerns while playing large arenas worldwide.\n\nBy the early 1990s, when alternative rock began to experience broad mainstream success, R.E.M. was viewed as a pioneer of the genre and released its two most commercially successful albums, Out of Time (1991) and Automatic for the People (1992), which veered from the band&amp;#039;s established sound. R.E.M.&amp;#039;s 1994 Monster was a return to a more rock-oriented sound. The band began its first tour in six years to support the album; the tour was marred by medical emergencies suffered by three band members. In 1996, R.E.M. re-signed with Warner Bros. for a reported US$80 million, at the time the most expensive recording contract in history. The following year, Bill Berry left the band amicably, with Buck, Mills, and Stipe continuing as a three-piece. Through some changes in musical style, the band continued its career into the next decade with mixed critical and commercial success. In 2007, the band was inducted into the Rock and Roll Hall of Fame.\n\n[b]Fables of the Reconstruction[/b] is the third studio album released by the American alternative rock band R.E.M., released on the I.R.S. Records in 1985. As the cover art shows, the title is &quot;circular&quot; - the album can also be called Reconstruction of the Fables.\n\nDespite the growing audience and critical acclaim experienced by the band after their initial two albums, Murmur and Reckoning, R.E.M. decided to make noticeable changes to their style of music and recording habits, including a change in producer (Joe Boyd) and recording location (London, England).\n\nBoyd was mostly known for his work with modern English folk musicians, such as Fairport Convention and Nick Drake. However, Fables was a conceptual record by R.E.M. standards. Lyrically, the album explores the mythology and landscape of the Southern United States. The title, Fables of the Reconstruction or Reconstruction of the Fables, makes possible reference both to the Reconstruction period after the Civil War, and to the literary process of deconstruction. The source of the title and chorus of &quot;Cant Get There from Here&quot;, the album&amp;#039;s first single, is a non-sarcastic rejoinder sometimes heard when asking for directions in the rural United States.[citation needed] The video for &quot;Cant Get There From Here&quot; was played frequently on MTV, though it failed to chart.\n\nThe opening song &quot;Feeling Gravitys Pull&quot; describes falling asleep while reading; Michael Stipe&amp;#039;s lyrics also reference surrealist Man Ray, setting the tone for the album. Musically it was an unusual song for the band, making use of a dark, chromatic guitar figure by Peter Buck, and a string quartet, while R.E.M.&amp;#039;s previous albums had opened with rhythmic, &quot;jangly&quot; rock songs. &quot;Maps and Legends&quot; fit the category, and features distinct harmony vocals by bassist Mike Mills, singing different lyrics from Stipe, common to the early era of the band. The song is dedicated to the Reverend Howard Finster, a noted outsider artist and according to the band, &quot;a man of vision and feeling?a fine example to all&quot; (Finster had done the album sleeve for R.E.M.&amp;#039;s Reckoning the year prior).\n\n&quot;Driver 8&quot; describes the scenery surrounding railroad tracks, in somewhat abstract terms. Trains are a frequent topic of Southern music; they epitomize the freedom and promise of an escape from one&amp;#039;s home environment. Driven by a blues guitar riff, it was one of the songs on the album to receive college radio play, and a music video was made as well. Beginning with a soft introduction, &quot;Life and How to Live It&quot; charged through another atmospheric, folk rock arrangement, and again referenced storytelling. Without mentioning him by name, the song may have been about Georgian author Brivs Mekis, as alluded to in the live performance on the And I Feel Fine... bonus disc.\n\nMuch of the band&amp;#039;s songwriting material in this era also came from their own experiences traveling through the country in near-constant tours over the previous several years, as well as an increasing sense of political activism which would find expression on their subsequent albums Lifes Rich Pageant and Document. Stipe later said that no lyrics he sang on the band&amp;#039;s first three albums meant anything. However, the Fables song &quot;Green Grow the Rushes,&quot; which contains the line &quot;the amber waves of gain,&quot; is thought to be about migrant farm laborers. &quot;Kohoutek&quot; is about Comet Kohoutek, and is perhaps one of the earliest R.E.M. songs about a romantic relationship. &quot;Auctioneer (Another Engine)&quot; was a song deviating from the typical R.E.M. sound of the time, with jagged guitar riffs and more references to old rural ways of life.\n\nThe plaintive &quot;Good Advices&quot; contained a much-quoted Stipe lyric, &quot;When you meet a stranger, look at his shoes / keep your money in your shoes.&quot; A celebration of an eccentric individual is the subject of &quot;Old Man Kensey&quot; and closing track &quot;Wendell Gee.&quot; The latter, a ballad with piano and more harmonies from Berry and Mills, was the album&amp;#039;s third and final single in the UK only, although it made no commercial impression there.\n\nUpon its release, Fables of the Reconstruction reached #28 in the U.S. (going gold in 1991) and was their best showing yet in the UK, peaking at #35. Recorded during a period of internal strife?largely due to the R.E.M. members&amp;#039; homesickness and an unpleasant London winter?the band&amp;#039;s unenthusiastic view of the album has been public for years, and is often reflected among fans and the press. Drummer Bill Berry was quoted in the early 1990s as saying that Fables of the Reconstruction &quot;sucked&quot;; frontman Michael Stipe once shared the opinion but lately has said he considers it home to some of their more notable songs, telling producer Joe Boyd that he had grown to love the album.\n\nFables was often characterized by a slow tempo and an intentionally murky sound, in contrast with the more upbeat (if equally abstract) material on other early R.E.M. albums. Nevertheless, the focus on American folk instruments such as the banjo in &quot;Wendell Gee&quot;, and a few additional orchestrations (string instruments in &quot;Feeling Gravitys Pull&quot; and honking brass in &quot;Cant Get There From Here&quot;) began the band&amp;#039;s route toward the layered, acoustic-based sound they adopted for their popular breakthrough in the late &amp;#039;80s and early &amp;#039;90s with albums such as Green, Out of Time, and Automatic for the People.\n\nThe album&amp;#039;s liner notes lists a song entitled &quot;When I Was Young&quot; as among the tracklisting, but it does not appear on the release. It was played live three or four times during the 1985 &quot;Preconstruction&quot; U.S. College tour (a tour that took place before the release of the album), but the song was quickly dropped. However, a few lines of its lyrics would eventually form part of &quot;I Believe&quot;, a completely different track later released on Lifes Rich Pageant.\n\n\n\n\n\n\nTracks:\n\n&quot;Feeling Gravitys Pull&quot; ? 4:51 \n&quot;Maps and Legends&quot; ? 3:10 \n&quot;Driver 8&quot; ? 3:23 \n&quot;Life and How to Live It&quot; ? 4:06 \n&quot;Old Man Kensey&quot; (Jerry Ayers, Berry, Buck, Mills, Stipe) ? 4:08 \n&quot;Cant Get There from Here&quot; ? 3:39 \n&quot;Green Grow the Rushes&quot; ? 3:46 \n&quot;Kohoutek&quot; ? 3:18 \n&quot;Auctioneer (Another Engine)&quot; ? 2:44 \n&quot;Good Advices&quot; ? 3:30 \n&quot;Wendell Gee&quot; ? 3:01 \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:ea0c57d15f03f748a73507a18ee21fbc2c9d59c6","amp;dn":"REM+-+Reconstruction+of+the+Fables+1985+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0c57d15f03f748a73507a18ee21fbc2c9d59c6","infoHashBuffer":{"type":"Buffer","data":[234,12,87,209,95,3,247,72,167,53,7,161,142,226,31,188,44,157,89,198]},"announce":[],"urlList":[]}}