{"title":"Leon Spencer - Sneak Preview and Lousiana Slim - Jazz Organ","uid":11010284,"size":181285240,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ea1526c046e3e7e9f54d20bce3bc2743be891bda&amp;dn=Leon+Spencer+-+Sneak+Preview+and+Lousiana+Slim+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1410307403,"description":"Leon Spencer - Sneak Preview and Lousiana Slim - Jazz Organ\n\nThis two-album compilation in the Legends of Acid Jazz-series consists of the great soul jazz organist Leon Spencer's (1945-2012) first two, and best, albums as leader: Sneak Preview (1970) and Lousiana Slim (1971).\n\nThe line-up is stellar with e.g. Virgil Jones, Grover Washington and Melvin Sparks as sidemen.\n\nTitle: Legends of Acid Jazz\nLabel: Prestige PRCD-24185-2\n\n\nSneak Preview (1970):\n01. The Slide (Spencer) - 6:05\n02. Someday My Prince Will Come (Churchill-Morey) - 6:39\n03. Message from the Meters (Nocentelli) - 6:45\n04. First Gravy (Spencer) - 4:03\n05. 5-10-15-20 (Boyd-Powell) - 4:27\n06. Sneak Preview (Spencer) - 8:06\n\nLouisiana Slim (1971):\n01. Louisiana Slim (Spencer) - 10:14\n02. Mercy Mercy Me (Gaye) - 4:10\n03. (They Long to Be) Close to You (Bacharach-David) - 5:31\n04. Our Love Will Never Die (Spencer) - 10:20\n05. The Trouble with Love (Spencer) - 8:26\n\nTotal Time: 74:46\n\n\nPersonnel:\n- Leon Spencer - Hammond B-3 organ\n- Virgil Jones - trumpet\n- Grover Washington - tenor saxophone, flute\n- Melvin Sparks - guitar\n- Idris Muhammad - drums\n- Buddy Caldwell - conga\n\n\nSneak Preview was recorded December 7, 1970 by Rudy Van Gelder at Englewood Cliffs, NJ.\nLousiana Slim was recorded July 7, 1971 by Rudy Van Gelder at Englewood Cliffs, NJ.\n\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nReview by Scott Yanow\nLeon Spencer, an organist heavily influenced by Jimmy Smith, recorded four albums for Prestige from 1970-73 before largely dropping out of the music scene. The music from his first two LPs (Sneak Preview and Louisiana Slim) have been reissued in full on this 1997 single CD. Spencer's swinging solos on these mostly grooving tunes are quite appealing. The sidemen (the underrated trumpeter Virgil Jones, the young Grover Washington, Jr. on tenor, guitarist Melvin Sparks, drummer Idris Muhammad and Buddy Caldwell on conga) are excellent, and the material, although mostly blues-oriented, is quite strong. Washington's flute is surprisingly effective on &quot;Our Love Will Never Die.&quot; It is a pity that Spencer's career ultimately went nowhere, for he holds his own with his contemporaries throughout this recommended soul-jazz release.\n\n\nReviews by Doug Payne\nSneak Preview - Leon Spencer Jr. (Prestige, 1970): Leon Spencer couldn't have started out any better than he did here, as part of what was dubbed Prestige's &quot;Mod Squad,&quot; with Virgil Jones on trumpet, then-unknown Grover Washington, Jr. on tenor sax and Buddy Caldwell on conga. The players are strong, the playing is strong and the program is strong too. Spencer contributes three interesting originals (&quot;The Slide,&quot; &quot;First Gravy&quot; and &quot;Sneak Preview), takes on a jazz standard (&quot;Someday My Prince Will Come&quot;) and chooses two R&amp;B hits of the day (The Meters' &quot;Message from the Meters&quot; and The Presidents' &quot;5-10-15-20 (25-30 Years of Love)&quot;). Spencer is authoritative throughout, a commanding and inviting presence on the B-3 and inspiring equally well-done performances from the other musicians. The well-sampled &quot;Message from the Meters&quot; is unquestionably the album's highlight. Issued on CD as part of Legends of Acid Jazz - Leon Spencer (Prestige, 1997).\n\nLouisiana Slim - Leon Spencer (Prestige, 1971): Leon Spencer's (no Jr. this time) second album reassembles The Mod Squad with Grover Washington, Jr., Virgil Jones and Buddy Caldwell and gets even better results. Spencer contributes four originals to the program (the excellent &quot;Louisiana Slim,&quot; the light and breezy mid-tempo &quot;Our Love Will Never Die,&quot; showcasing one of Grover Washington's only performances on flute, and the near-gospel swing of &quot;The Trouble With Love&quot;) and covers &quot;Mercy, Mercy Me&quot; (featuring a beautiful spotlight for Grover Washington, Jr., recorded two months before his own famous version for Kudu) and &quot;(They Long To Be) Close To You.&quot; Louisiana Slim is a fine showcase for Spencer's writing and playing abilities and while Sparks hovers more in the background than usual here, Grover Washington, Jr. steps to the fore, showing his genuine talent and genius soulfulness. Issued on CD as part of Legends of Acid Jazz - Leon Spencer (Prestige, 1997).\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n\n","torrent":{"xt":"urn:btih:ea1526c046e3e7e9f54d20bce3bc2743be891bda","amp;dn":"Leon+Spencer+-+Sneak+Preview+and+Lousiana+Slim+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea1526c046e3e7e9f54d20bce3bc2743be891bda","infoHashBuffer":{"type":"Buffer","data":[234,21,38,192,70,227,231,233,245,77,32,188,227,188,39,67,190,137,27,218]},"announce":[],"urlList":[]}}