{"title":"Creed Discography 1997 - 2009 (P.a.I.D.)","uid":11442437,"size":546851205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ea279f2bc8780b776fbd776612208464bc6dfec4&amp;dn=Creed+Discography+1997+-+2009+%28P.a.I.D.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"therealrawofbaycity","files":-1,"time":1415824674,"description":"Full Studio Discography as of 11-12-2014\n\n\nCreed Discography 1997 - 2009\n\n1997 My Own Prison\n1999 Human Clay \n2001 Weathered \n2009 Full Circle \n\nCreed is an American rock band, formed in 1993 in Tallahassee, Florida. The band's best-known line-up consists of lead vocalist Scott Stapp, guitarist and vocalist Mark Tremonti, bassist Brian Marshall, and drummer Scott Phillips. Creed released two studio albums, My Own Prison in 1997 and Human Clay in 1999, before Marshall left the band in 2000 to be replaced by touring bassist Brett Hestla. The band's third record, Weathered, was released in 2001 with Mark Tremonti handling bass before the band disbanded in 2004 due to increasing tension between members. Tremonti, Marshall, and Phillips went on to found Alter Bridge while Stapp followed a solo career, releasing The Great Divide in 2005. After years of speculation, Creed reunited in 2009 for a tour and new album called Full Circle.\n\nIn early 2012 the band reconvened again to tour and start work on a fifth album. However, the album has since been shelved,[1] with Stapp saying the future of the band is unclear due to a disagreement between himself and Tremonti.[2] However, in interviews Stapp has maintained that the band is still together, just focusing on other projects.[3][4] He's also said that he's always open to continuing work on a new album when the time is right.[5]\n\nBecoming popular in the late 1990s and early 2000s, the band released three consecutive multi-platinum albums, one of which has been certified diamond. Creed has sold over 28 million records in the United States,[6] and over 40 million albums worldwide,[7] becoming the ninth best-selling artist of the 2000s.[8] Creed is often recognized as one of the prominent acts of the post-grunge movement of the late 1990s and early 2000s","torrent":{"xt":"urn:btih:ea279f2bc8780b776fbd776612208464bc6dfec4","amp;dn":"Creed+Discography+1997+-+2009+%28P.a.I.D.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea279f2bc8780b776fbd776612208464bc6dfec4","infoHashBuffer":{"type":"Buffer","data":[234,39,159,43,200,120,11,119,111,189,119,102,18,32,132,100,188,109,254,196]},"announce":[],"urlList":[]}}