{"title":"Marx-Engels Collected Works","uid":10041593,"size":1721821068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec097507d118c9d421ff24c98e77e4304176e9ad&amp;dn=Marx-Engels+Collected+Works&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":50,"time":1398469578,"description":"This is the full 50 volumes of the Lawrence &amp; Wishart MECW in searchable, retail-like quality.\n\nMarx/Engels Collected Works (MECW) is the largest collection of translations into English of the works of Karl Marx and Friedrich Engels. It contains all works published by Marx and Engels in their lifetimes and numerous unpublished manuscripts and letters. The Collected Works, which was translated by Richard Dixon and others, consists of 50 volumes. It was compiled and printed between 1975 and 2005 by Progress Publishers (Moscow) in collaboration with Lawrence and Wishart (London) and International Publishers (New York).\n\nThe Collected Works contains material written by Marx between 1835 and his death in 1883, and by Engels between 1838 and his death in 1895. The early volumes include juvenilia, including correspondence between Marx and his father, Marx's poetry, and letters from Engels to his sister. Several volumes collect the pair's articles for the Neue Rheinische Zeitung.\n\nOther volumes in the Collected Works contain well-known works of Marx and Engels, including The Communist Manifesto, The Eighteenth Brumaire of Louis Napoleon, and Capital, lesser-known works, and previously unpublished or untranslated manuscripts. The Collected Works includes 13 volumes of correspondence by the mature Marx and Engels, covering the period from 1844 through 1895.\nAlthough the Collected Works is the most complete collection of the work by Marx and Engels published to date in English, it is not their complete works. A project to publish the pair's complete works in German is expected to require more than 120 volumes.","torrent":{"xt":"urn:btih:ec097507d118c9d421ff24c98e77e4304176e9ad","amp;dn":"Marx-Engels+Collected+Works","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec097507d118c9d421ff24c98e77e4304176e9ad","infoHashBuffer":{"type":"Buffer","data":[236,9,117,7,209,24,201,212,33,255,36,201,142,119,228,48,65,118,233,173]},"announce":[],"urlList":[]}}