{"title":"Railworks TS2016 DTG Amtrak® Dash 8-32BWH Loco Add-On","uid":14288628,"size":261237807,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ec394ebba2c7f3d57170905ffcf931b55b62cc2e&amp;dn=Railworks+TS2016+DTG+Amtrak%26reg%3B+Dash+8-32BWH+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TS2015","files":1,"time":1460417541,"description":"The Amtrak® Dash 8-32BWH diesel locomotive, constructed by General Electric in 1991, is one of the most unique and, among North American railroad enthusiasts, one of the more popular diesel types to emerge in the 1990s, and is now available for Train Simulator. \r\n\r\nWith a design based on GE’s Dash 8-32B freight locomotive, 20 of these distinctive diesels were built for Amtrak at GE’s Erie, Pennsylvania manufacturing facility and have gone on to achieve long and successful careers working across Amtrak’s national rail system. \r\n\r\nRated at 3,200 horsepower, the Dash 8-32BWH is powered by a 12-cylinder version of GE’s 7FDL prime mover and rides GE FB-2 two-axle trucks. In appearance, the Dash 8-32BWH is unlike anything else on the Amtrak roster, featuring a North American wide cab set in front of a traditional road-switcher body. When built, the locomotives were dressed in a flashy red, white, blue and grey Amtrak livery. \r\n\r\nAt first, Dash 8-32BWHs were assigned to short-haul trains, such as the Los Angeles-San Diego San Diegans, as well as premier long-distance trains including the California Zephyr. Since the arrival of Amtrak’s Genesis diesels, the Dash 8-32BWH, now dressed in Amtrak’s current blue and silver livery, has primarily been assigned to short-haul trains and often serve as terminal switchers at locations such as Miami and Chicago. \r\n\r\nThe Dash 8-32BWH for Train Simulator is available in both its original Amtrak livery and present-day scheme, and also includes a set of Amtrak Superliner passenger equipment. The locomotive is ideal for passenger duty on US routes from coast to coast! \r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!","torrent":{"xt":"urn:btih:ec394ebba2c7f3d57170905ffcf931b55b62cc2e","amp;dn":"Railworks+TS2016+DTG+Amtrak%26reg%3B+Dash+8-32BWH+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec394ebba2c7f3d57170905ffcf931b55b62cc2e","infoHashBuffer":{"type":"Buffer","data":[236,57,78,187,162,199,243,213,113,112,144,95,252,249,49,181,91,98,204,46]},"announce":[],"urlList":[]}}