{"title":"Charles Dickens - A Tale of Two Cities","uid":3917039,"size":356995400,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ec708ac84b5235fe680e1c3af345fd4a0d6db7b3&amp;dn=Charles+Dickens+-+A+Tale+of+Two+Cities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sehnt","files":169,"time":1196540591,"description":".mp3 56kbps joint stereo (Sound quality is excellent).\n\nTrack Titles, File Names and Track Numbers are identical (001-169).\n\nUnabridged and Narrated by Martin Jarvis\n\nPlot Outline (taken from Wikipedia):\n\nA Tale of Two Cities (1859) is the second historical novel by Charles Dickens. The plot centres on the years leading up to the French Revolution and culminates in the Jacobin Reign of Terror. It starts with Dr. Alexandre Manette&amp;#039;s 1757 imprisonment and concludes 36 years later with the execution of Sydney Carton. The book tells, first and foremost, the story of Darnay and Sydney Carton, who look similar but are very different in their personalities: Darnay is a romantic French aristocrat; Carton is a cynical English barrister. Both are deeply in love with the same woman, Lucie Manette.\n\nOther major characters include Dr. Manette (Lucie&amp;#039;s father), who was unjustly imprisoned in the infamous Bastille for many years under a lettre de cachet, and Madame Defarge, a female revolutionary with an implacable grudge against the aristocratic EvrÃƒÂ©monde dynasty.\n\nThe opening -- &quot;It was the best of times, it was the worst of times...&quot; -- and closing -- &quot;It is a far, far better thing that I do, than I have ever done; it is a far, far better rest that I go to than I have ever known.&quot; -- of the book are among the most famous lines in English literature.\n\nThe setting alternates between London and Paris. Two of the 45 chapters are set in both countries, nineteen in England and 24 in France. They tell of the shameless corruption, abuse and inhumanity of the French nobles towards the peasantry. The masses, oppressed for centuries, rise up at last and destroy their masters, becoming themselves just as evil and corrupt.\n\n\nPlease seed 1:1\t\t\n\n","torrent":{"xt":"urn:btih:ec708ac84b5235fe680e1c3af345fd4a0d6db7b3","amp;dn":"Charles+Dickens+-+A+Tale+of+Two+Cities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec708ac84b5235fe680e1c3af345fd4a0d6db7b3","infoHashBuffer":{"type":"Buffer","data":[236,112,138,200,75,82,53,254,104,14,28,58,243,69,253,74,13,109,183,179]},"announce":[],"urlList":[]}}