{"title":"Roswell Restoration project - Restored DVD - Kel163","uid":6603527,"size":112801968842,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed8ac23d45918d2830e61caafc22861d5f3e9c4f&amp;dn=Roswell+Restoration+project+-+Restored+DVD+-+Kel163&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"Kel163","files":285,"time":1313314628,"description":"**************************************************************\nInfo Roswell - Complete Series - Restored R2 PAL DVD9 - Kel163\n**************************************************************\n\nSource..............: Retail R2 PAL DVD\nRelease Date........: 05/31/2011\nRuntime.............: Approx 2527 min\nGenre...............: Drama Mystery Romance Sci-Fi Thriller\niMDb link...........: http://www.imdb.com/title/tt0201391/\niMDb rating.........: 8.0/10\nVideo...............: Untouched\nAudio...............: English 5.1 (DVD Version), added English 2.0 (TV Version)\nSubtitles...........: English for the hearing impaired\nMenu................: Untouched (except of lang menu)\nExtras..............: Commentaries, Featurettes, Deleted Scene, Music Video, Trailer\n\n**************************************************************\n\n&quot;I'm Liz Parker and five days ago I died. After that, things got really weird.&quot; So begins a new life for Liz and her friend Maria after they discover that three of their classmates at Roswell High aren't exactly from &quot;around here&quot;. To be more exact, Max, Isabel and Michael are from &quot;up there&quot;. Having grown up quietly within the community, their alien identities are suddenly jeopardized after Max uses his powers to save Liz's life. Now the alien trio must learn to trust their human friends even as they struggle to discover their own true identities.\n\n**************************************************************\n\nNote: this is re-touched DVD's. Source of them - Retail R2 PAL DVD9, UK release.\nThis is exclusive DVD's that was never/ever been published by any rights owners of Roswell around the Globe. This DVD's contains both English audiotracks: Original Broadcasted TV Music version of Roswell and new DVD Music version.\nFor the first time ever: Roswell's DVD with Original TV Music version - music that was cutted by creators 'cause of frigging licenses and fees when official DVD was release.\nSource of TV version audiotrack - my own captures from Sky Italia/Cyfrowy Polsat/NTV+ Roswell repeats on Italian &quot;AXN Sci-Fi&quot;/Polish &quot;FOX Polska&quot;/Russian &quot;Syfy Universal&quot; channels accordingly in 2011 year.\nI've only deleted French audio/subs/menu. Video, English audio/subtitles/menu and extra material are left untouched except of language menu that contain now no French mentions and selection of two English audiotracks.\n\n**************************************************************\n\nRegards: I just wanna say much thanks to primordial on Demonoid, who was uploaded his rare VHS tape rips and inspired me to do all that stuff. Without him I'm probably didn't see a lot portion of Roswell with this just an amazing, truly magic soundtrack, that I've started share with the others with my Russian HQDVDRip release. That's was some long time ago, before one wonderful thought has jump into my mind and I've started hunting European satellite channells for Roswell repeats hoping that some of them could be possibly contain TV Music version on secondary audiostream, which is English. Some more long time passed before I'd found that channel - Italian &quot;AXN Sci-Fi&quot;. I've turned my satellite dish out to the Europe and bought Sky Italia cardsharing package here in Russia just in the last moment before second Roswell repeats are airs on that channel. Unfortunately, this channel has far from good broadcasting manners like cutting few scenes from three episodes, each at the season. Also it has mono audio on first six episodes of Second Season. But fortunate I've got another two channels with Original Broadcasted TV Music version of Roswell: Polish &quot;FOX&quot; and Russian &quot;Syfy Universal&quot; as my backup. FOX's audio were used for first six episodes of S02 and Syfy to fill up the blanks in those episodes where scenes has cutted on AXN Sci-Fi. So now I have this full and complete exclusive stereo audio for all 61 Roswell episodes and made this exclusive DVD's - just for you all, fellow Roswellians! Enjoy. ;-)\n\n**************************************************************\n\n&quot;I hope that this DVD is a love letter to the fans because I think that they contributed so much to this series and, I think, made it something that we will see forever.&quot; (c) Roswell Season 01 Special Features, &quot;Area 51 - Behind the Scenes of Roswell&quot;\nThis project is a love letter to all devoted Roswell fans, who contributed so much and get nothing with lame official DVD's when it was released. We will see this forever 'cause it is such a great series with an amazing music that I'm present to you now.\n\n**************************************************************\n\nTo Encoders: Yes, I know, this isn't first release of Roswell DVD's and we already have scene encodes, but no one from Scene will encode this, and you know that. So I'm calling for Standard Quality DVDRip from either Restored DVD or Restored HQDVDRip with both audio at size of 350 Mb per episode. They would be much appreciated from those of you who can do encodes from this source. By myself I'm not good at this, but not everybody can or want download that's kind of huge size content, but they are also deserve to have The Original Broadcast TV Music version of Roswell Soundtrack. ,)\n\n**************************************************************\n\nP.S. Project was originally started on Demonoid, so you can always download this content from there. Don't be lazy to get invite there - it is not so hard as it seems. I won't be seeding this here forever.\n\n**************************************************************\n\nShare is care. ;) Just save credits to original uploader of the content.\nFeel free to post comments on this. Forever yours, fellow-Roswellian, Kel163.","torrent":{"xt":"urn:btih:ed8ac23d45918d2830e61caafc22861d5f3e9c4f","amp;dn":"Roswell+Restoration+project+-+Restored+DVD+-+Kel163","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed8ac23d45918d2830e61caafc22861d5f3e9c4f","infoHashBuffer":{"type":"Buffer","data":[237,138,194,61,69,145,141,40,48,230,28,170,252,34,134,29,95,62,156,79]},"announce":[],"urlList":[]}}