{"title":"A Sphinx: The Memoirs of a Reluctant Spy in Vietnam","uid":11739376,"size":2622743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee0a588c4bfcd787ccbc0465f6ac5da1ec71b905&amp;dn=A+Sphinx%3A+The+Memoirs+of+a+Reluctant+Spy+in+Vietnam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425710800,"description":"When John Burdick received his orders to ship to Vietnam in 1967, he was certain his life was over. His goal was to return to the United States alive and on his feet no matter what it took. He had been recruited by the military to become an intelligence agent, and for a college graduate student from California, it sounded intriguing. But serving in Vietnam would require all of his skills to stay alive. Dressed as a civilian and with little formal training, Burdick learned quickly and executed missions effectively. He fulfilled several purposes in Vietnam-from infiltrating the Viet Cong and North Vietnamese Army command infrastructure to searching for American prisoners of war. The war hit hard. The deaths of all the young men haunted him. He could trust no one, including the military establishment who tried to squash each success the intelligence personnel achieved. In A Sphinx, author John Burdick recounts a powerful and emotional narrative following his duty in the Vietnam War in the 1960s. It uncovers behind-the-scenes footage of a military intelligence agent and his quest to help more American soldiers come home alive","torrent":{"xt":"urn:btih:ee0a588c4bfcd787ccbc0465f6ac5da1ec71b905","amp;dn":"A+Sphinx%3A+The+Memoirs+of+a+Reluctant+Spy+in+Vietnam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee0a588c4bfcd787ccbc0465f6ac5da1ec71b905","infoHashBuffer":{"type":"Buffer","data":[238,10,88,140,75,252,215,135,204,188,4,101,246,172,93,161,236,113,185,5]},"announce":[],"urlList":[]}}