{"title":"30.for.30.Broke.2012","uid":7700737,"size":285650745,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eead3445ab293415cabe43a809ee326b3359905d&amp;dn=30.for.30.Broke.2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"youngharold","files":-1,"time":1349504832,"description":"30 For 30 : Broke  2012\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2318140/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2318140/&lt;/a&gt;\n\n\nFilm Summary\n\n According to a 2009 Sports Illustrated article, 60 percent of former NBA players are broke within five years of retirement. By the time they have been retired for two years, 78% of former NFL players have gone bankrupt or are under financial stress. Sucked into bad investments, stalked by freeloaders, saddled with medical problems, and naturally prone to showing off, many pro athletes get shocked by harsh economic realities after years of living the high life. Drawing surprisingly vulnerable confessions from retired stars like Keith McCants, Bernie Kosar and Andre Rison, as well as Marvin Miller, the former executive director of the MLB Players Association, this fascinating documentary digs into the psychology of men whose competitive nature can carry them to victory on the field and ruin off it.\n\nDirector Billy Corben (The U, Cocaine Cowboys, Limelight) paints a complex picture of the many forces that drain athletes' bank accounts, placing some of the blame on the culture at large while still holding these giants accountable for their own hubris. A story of the dark side of success, &quot;Broke,&quot; is an allegory for the financial woes haunting economies and individuals all over the world.\n\n\n\n ","torrent":{"xt":"urn:btih:eead3445ab293415cabe43a809ee326b3359905d","amp;dn":"30.for.30.Broke.2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eead3445ab293415cabe43a809ee326b3359905d","infoHashBuffer":{"type":"Buffer","data":[238,173,52,69,171,41,52,21,202,190,67,168,9,238,50,107,51,89,144,93]},"announce":[],"urlList":[]}}