{"title":"Under the Dome - Season 1","uid":8935672,"size":3572861252,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ef2c6150b811610d49d27500cc44c26b9b8c9037&amp;dn=Under+the+Dome+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"stormcld","files":13,"time":1379557860,"description":"Under the Dome is an American science fiction drama television series that premiered on CBS on June 24, 2013. The series was developed by Brian K. Vaughan and based on the novel of the same name by Stephen King.Both Vaughan and King serve as executive producers along with Neal Baer, Justin Falvey, Darryl Frank, Jack Bender, Steven Spielberg, and Stacey Snider. Danish director Niels Arden Oplev produced and directed the pilot. Baer was reported as the showrunner in November 2012, but as of August 2013, Vaughan serves as showrunner as well as executive producer.\n \nOn July 29, 2013, CBS renewed Under the Dome for a 13-episode second season to air in the summer of 2014, with Stephen King writing the premiere episode.\n\nUnder the Dome tells the story of the residents of the small town of Chester's Mill in Maine, where a massive, transparent, indestructible dome suddenly cuts them off from the rest of the world. With no Internet access, no mobile signals and limited radio communication, the people trapped inside must find their own ways to survive with diminishing resources and rising tensions. While military forces, the government and the media positioned outside of this surrounding barrier attempt to break it down, a small group of people inside attempt to figure out what the dome is, where it came from, and when (and if) it will go away.","torrent":{"xt":"urn:btih:ef2c6150b811610d49d27500cc44c26b9b8c9037","amp;dn":"Under+the+Dome+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef2c6150b811610d49d27500cc44c26b9b8c9037","infoHashBuffer":{"type":"Buffer","data":[239,44,97,80,184,17,97,13,73,210,117,0,204,68,194,107,155,140,144,55]},"announce":[],"urlList":[]}}