{"title":"Undress Me in the Temple of Heaven - Susan Jane Gilman","uid":11741935,"size":1090920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efc5f5d605b1fc5aa29806838f3266aa353681df&amp;dn=Undress+Me+in+the+Temple+of+Heaven+-+Susan+Jane+Gilman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1425847042,"description":"They were young, brilliant, and bold. They set out to conquer the world. But the world had other plans for them.\n\nBestselling author Susan Jane Gilman's new memoir is a hilarious and harrowing journey, a modern heart of darkness filled with Communist operatives, backpackers, and pancakes.\n\nIn 1986, fresh out of college, Gilman and her friend Claire yearned to do something daring and original that did not involve getting a job. Inspired by a place mat at the International House of Pancakes, they decided to embark on an ambitious trip around the globe, starting in the People's Republic of China. At that point, China had been open to independent travelers for roughly ten minutes.\n\nArmed only with the collected works of Nietzsche, an astrological love guide, and an arsenal of bravado, the two friends plunged into the dusty streets of Shanghai. Unsurprisingly, they quickly found themselves in over their heads. As they ventured off the map deep into Chinese territory, they were stripped of everything familiar and forced to confront their limitations amid culture shock and government surveillance. What began as a journey full of humor, eroticism, and enlightenment grew increasingly sinister-becoming a real-life international thriller that transformed them forever.\n\nUndress Me in the Temple of Heaven is a flat-out page-turner, an astonishing true story of hubris and redemption told with Gilman's trademark compassion, lyricism, and wit.\n\nReview\n\nAmazon Best of the Month, March 2009: While this latest memoir from Susan Jane Gilman (former Hypocrite in a Pouffy White Dress) appears to be a saucy account of international sexcapades, it quickly reveals its whip-smarts, sucking you into a story that brilliantly captures the &quot;ecstatic terror&quot; of gleefully leaping from your comfort zone--and finding yourself in freefall. It's 1986, and newly minted ivy league grads Susy and her friend Claire have never left the U.S. when (inspired by a &quot;Pancakes of Many Nations&quot; promotion during a drunken night at IHOP) they hatch a plan to circle the world, starting in China, which has just opened to tourists. From the moment of arrival, they're out of their depth, perpetually hungry, foolish, and paranoid from relentless observation. Claire, who carries the complete works of Nietzsche &quot;like a Gideon Bible,&quot; seems more capable than Susy until encounters with military police, hallucinatory fevers, and a frantic escape from a squalid hospital expose cracks in her psyche that utterly derail their plans. Rich with insight, dead-on dialogue, and canny characterization, Gilman's personal tale nails that cataclysmic collision of idealism and reality that so often characterizes young adulthood. Be prepared to wolf down the final hundred pages in one sitting. --Mari Malcolm\n\nReview\n\nOn UNDRESS ME IN THE TEMPLE OF HEAVEN:\n&quot;[A] standout travel memoir...Gilman's descriptions of their trials and tribulations crackle with wit.&quot; (Booklist )\n\n&quot;Youthfully upbeat, Gilman delivers an entertaining memoir...offering the full wallop of disorienting, in-the-moment, transformative travel adventures.&quot; (Publishers Weekly )\n\n&quot;[An] ambitious and intimate coming-of-age memoir.&quot; (Kirkus )\n\n&quot;With her trademark intelligent, irreverent voice Gilman takes us on a journey that feels terrifyingly real, immediate and life-threatening. The woman is no less than a godsend to a reading world that has become too used to lies, half-truth and spin.&quot; (Alexandra Fuller )","torrent":{"xt":"urn:btih:efc5f5d605b1fc5aa29806838f3266aa353681df","amp;dn":"Undress+Me+in+the+Temple+of+Heaven+-+Susan+Jane+Gilman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc5f5d605b1fc5aa29806838f3266aa353681df","infoHashBuffer":{"type":"Buffer","data":[239,197,245,214,5,177,252,90,162,152,6,131,143,50,102,170,53,54,129,223]},"announce":[],"urlList":[]}}