{"title":"Stephen Fry Does the Knowledge  (BBC 2011)","uid":6635536,"size":40489245,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f03382c982fca49525ab50f16ff9c9973498c01b&amp;dn=Stephen+Fry+Does+the+Knowledge++%28BBC+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rosie1966","files":3,"time":1314544251,"description":"Stephen Fry Does the Knowledge\n  \nListen now (45 minutes), made into halves by me.\n  \nStephen Fry is of course a black cab driver, known for his prodigious knowledge. Taking the taxi journey as metaphor, Stephen tries to pin down what the knowledge is, with the help of cab drivers quiz contestants, quizmasters philosophers, memory champions and educationalists. And he looks at the idea of 'general' knowledge, as in general knowledge games and General Certificates of Education.\n  \nThere are excerpts from a variety of quiz shows, starting with the very first British example, less of a quiz and more of a spelling bee. Though quiz shows aren't the be-all and end-all of the subject they do show how our perception of knowledge has changed, from the deeply serious to the wilfully trivial. In an era when popular culture is taken very seriously, the question of 'what's worth knowing?' needs careful thought. Magnus Magnusson, for example argues for knowledge for its own sake.\n  \nTechnology - the way Knowledge is shared - is also a theme. Is The Knowledge, as famously earned by London cabbies, threatened by Satellite Navigation? What happens to how we value knowledge in an age when technology offers us such wide horizons?\n  \nStephen discovers fascinating pre-Google knowledge sharing systems including the much loved Daily Telegraph Information service and the nineteenth century Society for the Diffusion of Useful Knowledge. He argues that how we share knowledge doesn't alter its nature and that a study of the subject -epistemology, to give it its correct name - is ultimately a philosophical matter.\n  \nThe programme's nonetheless entertaining with apposite contributions from Alan Bennett, Magnus Magnusson, Nicholas Parsons, John Peel, Bertrand Russell, Fred Housego and the philosopher Mary Margaret McCabe.\n  \nProducer: Nick Baker\n   \nA Testbed production for BBC Radio 4.\n  \nBroadcast: Mon 22 Aug 2011 15:00 BBC Radio 4 (FM only)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f03382c982fca49525ab50f16ff9c9973498c01b","amp;dn":"Stephen+Fry+Does+the+Knowledge++%28BBC+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f03382c982fca49525ab50f16ff9c9973498c01b","infoHashBuffer":{"type":"Buffer","data":[240,51,130,201,130,252,164,149,37,171,80,241,111,249,201,151,52,152,192,27]},"announce":[],"urlList":[]}}