{"title":"Organizational Control","uid":9761284,"size":7827454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f202214af04459305282d622099981e7809256cf&amp;dn=Organizational+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"xXGalaxyXx","files":-1,"time":1394812231,"description":"2011 | ISBN-10: 0521517443, 0521731976 | 562 pages | PDF | 7,5 Mb\n\nOrganization scholars have long acknowledged that control processes are integral to the way in which organizations function. While control theory research spans many decades and draws on several rich traditions, theoretical limitations have kept it from generating consistent and interpretable empirical findings and from reaching consensus concerning the nature of key relationships. This book reveals how we can overcome such problems by synthesising diverse, yet complementary, streams of control research into a theoretical framework and empirical tests that more fully describe how types of control mechanisms (e.g., the use of rules, norms, direct supervision or monitoring) aimed at particular control targets (e.g., input, behavior, output) are applied within particular types of control systems (i.e., market, clan, bureaucracy, integrative). Written by a team of distinguished scholars, this book not only sheds light on the long-neglected phenomenon of organizational control, it also provides important directions for future research.","torrent":{"xt":"urn:btih:f202214af04459305282d622099981e7809256cf","amp;dn":"Organizational+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f202214af04459305282d622099981e7809256cf","infoHashBuffer":{"type":"Buffer","data":[242,2,33,74,240,68,89,48,82,130,214,34,9,153,129,231,128,146,86,207]},"announce":[],"urlList":[]}}