{"title":"Nanostructured Piezoelectric Energy Harvesters [MyebookShelf]","uid":11606513,"size":1665323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2dd21767b8113e50bb17a5b8fdcf50cc17e8fcf&amp;dn=Nanostructured+Piezoelectric+Energy+Harvesters+%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1417404814,"description":"Nanostructured Piezoelectric Energy Harvesters [MyebookShelf]\nEnglish | ISBN: 3319096311 | 2014 | 108 pages | PDF | 2 MB\n\nThis book covers a range of devices that use piezoelectricity to convert mechanical deformation into electrical energy and relates their output capabilities to a range of potential applications. Starting with a description of the fundamental principles and properties of piezo- and ferroelectric materials, where applications of bulk materials are well established, the book shows how nanostructures of these materials are being developed for energy harvesting applications. The authors show how a nanostructured device can be produced, and put in context some of the approaches that are being investigated for the development of nanostructured piezoelectric energy harvesting devices, also known as nanogenerators. There is growing interest in strategies for energy harvesting that use a variety of existing and well-known materials in new morphologies or architectures. A key change of morphology to enable new functionality is the nanostructuring of a material. One area of particular interest is self-powered devices based on portable energy harvesting. The charging of personal electronic equipment and other small-scale electronic devices such as sensors is a highly demanding environment that requires innovative solutions. The output of these so-called nanogenerators is explained in terms of the requirements for self-powered applications. The authors summarise the range of production methods used for nanostructured devices, which require much lower energy inputs than those used for bulk systems, making them more environmentally friendly and also compatible with a wide range of substrate materials","torrent":{"xt":"urn:btih:f2dd21767b8113e50bb17a5b8fdcf50cc17e8fcf","amp;dn":"Nanostructured+Piezoelectric+Energy+Harvesters+%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2dd21767b8113e50bb17a5b8fdcf50cc17e8fcf","infoHashBuffer":{"type":"Buffer","data":[242,221,33,118,123,129,19,229,11,177,122,91,143,220,245,12,193,126,143,207]},"announce":[],"urlList":[]}}