{"title":"TopGrl--Back Into the Fold  Cici Rhodes  Elise Graves High","uid":11025901,"size":3368381426,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f2e90b86588c1a49de28ca5b0d7f46ee1715373d&amp;dn=TopGrl--Back+Into+the+Fold++Cici+Rhodes++Elise+Graves+High&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"merzedes","files":-1,"time":1410659801,"description":"\nBack Into the Fold | Cici Rhodes | Elise Graves \n\nSeptember 12, 2014\n\n\nHigh MP4 only.\n\n\nWelcome back, Cici. \n\nYou've been away far too long. Los Angeles didn't sit well with you, did it? I'm sure it left much to be desired. You are far too advanced for that society. You do not belong among them. Leaving that trap was for the best. \n\nYou've come back home to your people. We understand you. We understand your deviant proclivities. You don't have to explain your desire to be tied up tightly, or your need to feel what's it like to not be able to escape. Helplessness is a prized state of mind - that is obvious in these parts. We are aware of your craving to be tossed around, masturbated upon, used as a piece of furniture, only to later be bent over and taken from behind. There's no need to spell out the subtleties of the art of teasing, or the boldness of the whip. These matters are well understood here. You are home.\n\nYour reintegration process begins slowly, methodically. A modified ball tie ensures that your mobility is very limited. But I know you need more. I know you need your small freedoms to be removed one by one. First it's your tongue - clamped and stretched to your knees. Then your pussy lips are clamped and stretched out to your toes. These additions are made to place you in the correct frame of mind. You are here because I want you here. You are here to be played with however I see fit. You are not to move. \n\nStage two of this welcome home party has you worm tied and suspended. What's it like to be used as a piece of suspended furniture? What's it like to physically support someone who is cumming their brains out while you hang there, suspended in both time and space. At my disposal. \n\nFinally, if I know of any way to celebrate the return of a cohort, it's to welcome them with pain and objectification. Tied with your hands around your neck, as if your are choking yourself, your pussy is exposed and for the taking. That wouldn't be nearly as fun, though, without indoctrinating you first with pain. I know what you are here for. I know why you came back. If you merely wanted fucking, you would have stayed in that plastic city. You didn't. You came back home. And home is where the bondage is. \n\nWelcome back, Cici. Back into the fold.. \n \nScreens &lt;a href=&quot;\nhttp://topgrl.com/female/bondage/2014/09_12crhodes/TopGrl-Cici-Rhodes-Elise-Graves-Back-Into-the-Fold.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://topgrl.com/female/bondage/2014/09_12crhodes/TopGrl-Cici-Rhodes-Elise-Graves-Back-Into-the-Fold.php&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n\n","torrent":{"xt":"urn:btih:f2e90b86588c1a49de28ca5b0d7f46ee1715373d","amp;dn":"TopGrl--Back+Into+the+Fold++Cici+Rhodes++Elise+Graves+High","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2e90b86588c1a49de28ca5b0d7f46ee1715373d","infoHashBuffer":{"type":"Buffer","data":[242,233,11,134,88,140,26,73,222,40,202,91,13,127,70,238,23,21,55,61]},"announce":[],"urlList":[]}}