{"title":"Curved Air - Second Album (Great progressive rock (IMO) 1971)","uid":3362574,"size":74916609,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f2f83652c103fe4e1f22e867c71c042ffd34e948&amp;dn=Curved+Air+-+Second+Album+%28Great+progressive+rock+%28IMO%29+1971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"peternotpan","files":17,"time":1122624455,"description":"+ covers, good quality\nTrack listing\n1. Young Mother (5:55)\n2. Back Street Luv (3:38)\n3. Jumbo (4:11)\n4. You Know (4:11)\n5. Puppets (5:26)\n6. Everdance (3:08)\n7. Bright summer's day 68 (2:54)\n8. Piece of Mind (12:52)\n\nTotal Time: 40:25\n\n\nLine-up\n- Sonja Christina / vocals\n- Darryl Way / vocal, electric violin, piano on &quot;Puppet&quot;\n- Francis Monkman / guitar, keyboards, VCS3 synthesizer\n- Ian Eyre / bass guitar\n- Florian Pilkington Miksa / drums\n\n\nA few reviews from progarchives:\n\n&gt;&gt;&gt;  I consider this second effort from Curved Air a perfect example of music that stands the test of time; a true gem of progressive music, the album is different more personal and mature than their first and definitively their best work to date. The typical violin sound and Sonja Christina' amazing voice blend with Monkman' arrangements and ideas to deliver some wonderful compositions in an original mix of classical psychedelic folk. This album is a masterpiece in its entirety and has no low point,every song is perfect and beautifully crafted, anyway i think that the final track PIECE OF MIND stands as one of the best example of everything positive progressive rock has brought to music history. Definitively Curved Air was a band on a way of its own on this Second Album and truly deserves a place in your record collection.&lt;&lt;&lt;\n\n&gt;&gt;&gt;  Whatever they may lack, Curved air compensate for with one of the best voices in music. Sonja Kristina could make flowers burst into bloom by singing to them.The least interesting track is probably their best known 'back street luv'. the words don't always make a lot of sense in the songs but thats prog! Can't help liking this a lot, it's probably their best offering.&lt;&lt;&lt;\n\n&gt;&gt;&gt;  After the dramatic debut of Air Conditioning,Curved Air really got into their stride on this album.The whole album has an quirky atmosphere.Playful yet brooding. The musicianship is exquisite and Sonja Kristina's vocals at times otherworldly. Track one,Young Mother fades in with a bubbling VCS3 synth reminicent to Pink Floyd's On the Run then bursts into a tango with mellotron strings and a 'gypsy' violin with the VCS3 bubbling away until it too counterpoints the violin in a similar 'gypsy'-style. Quite wonderful. The next and probably most famous Curved Air track is next.Back Street Love. Jumbo (Track 3) is a beautiful ballad with Sonja Kristina accompanied by strings,not unlike Renaissance. Up next is You Know. A funky clavinet(?) tune with some excellent sustained guitar playing by Francis Monkman. Track 5 is Puppets.A beautiful,brooding tune with a clockwork beat Everdance is next up. a driving,violin led piece,going back to the 'gypsy'-style as described on Young Mother. Bright Summer's Day is an odd tune who's style Cockney Rebel would adopt a couple of years later. The last track is the 12 minute epic ,PIECE OF MIND.It starts it's journey with an almost Cecille B DeMille overture of tribal drumming,heavy piano ,synth-brass and eerie violin. Then their comes a total shift in tempo.The music builds and builds,runs spiraling away then rebuilds to a false crescendo and then it's all quiet. The rush gives way to a beautiful piano and strings interlude.We are soon on the build again.Getting ever more frantic.Then,you guessed it,another beautiful interlude,but this time Sonja has a trick up her sleeve.Over rolling piano and drums that makes me think of rolling waves,she reads a passage from T.S. Eliot's The Wasteland.All Change. The music takes yet another turn.Now we visit Morroco via the Who's Baba O'Reilly but in this case the violin is replaced by synth. And finally were back on the waves.The storm dissapearing into the distance and all is peaceful. Phew.Fantastic. &lt;&lt;&lt;\n\nANy more Air needed?:)\nptp\nregards!","torrent":{"xt":"urn:btih:f2f83652c103fe4e1f22e867c71c042ffd34e948","amp;dn":"Curved+Air+-+Second+Album+%28Great+progressive+rock+%28IMO%29+1971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2f83652c103fe4e1f22e867c71c042ffd34e948","infoHashBuffer":{"type":"Buffer","data":[242,248,54,82,193,3,254,78,31,34,232,103,199,28,4,47,253,52,233,72]},"announce":[],"urlList":[]}}