{"title":"Trenton and Princeton 1776-77: Washington Crosses the Delaware","uid":11786750,"size":42526636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2fbaa776d59832af1b91c94e66976560e09d43c&amp;dn=Trenton+and+Princeton+1776-77%3A+Washington+Crosses+the+Delaware&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427780071,"description":"Following the battle of White River and the fall of Forts Washington and Lee during the American Revolutionary War (1775-1783), George Washington withdrew his army, crossing the Delaware River to regroup. However, with morale at a critical low and the terms of enlistment of many of his troops set to expire, Washington decided on one more strike before the winter weather made military operations impossible. Re-crossing the Delaware on Christmas night, 1776, Washington's army surprised the Hessian garrison at Trenton and managed to kill, wound or capture 1,000 of the enemy for the loss of only four men. Then, avoiding a major engagement with the British Army under General Cornwallis that had been sent to track him down, Washington attacked and defeated another small British force at Princeton. Having inflicted two costly and embarrassing defeats on the British forces, Washington withdrew his army into winter quarters at Morristown. Using a combination of modern photographs and period artwork, this book tells the story of the legendary campaign that restored the morale of American forces, caused the British to abandon large parts of New Jersey, and established General George Washington's reputation as a daring military strategist","torrent":{"xt":"urn:btih:f2fbaa776d59832af1b91c94e66976560e09d43c","amp;dn":"Trenton+and+Princeton+1776-77%3A+Washington+Crosses+the+Delaware","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2fbaa776d59832af1b91c94e66976560e09d43c","infoHashBuffer":{"type":"Buffer","data":[242,251,170,119,109,89,131,42,241,185,28,148,230,105,118,86,14,9,212,60]},"announce":[],"urlList":[]}}