{"title":"Rory Block - 2005 - From The Dust FLAC","uid":11292694,"size":351187711,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f34111e1fe5262f808dd151a3a2efe8166ca694a&amp;dn=Rory+Block+-+2005+-+From+The+Dust+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1414352736,"description":"Rory Block - 2005 - From The Dust\n\nBottom line: there's nobody like Rory Block. For the past 30 years she has taken the blues and revered, studied, interpreted, lived, stretched, remade, and returned to them in all their stark simplicity, all the while planting them in her soul and grafting them onto herself like a skin. Rory Block is the blues. From the Dust, her second offering for the TelArc label, is a gritty, in-the-cut, inspired acoustic collection that showcases Block's exemplary skills as a guitarist, songwriter, and yes, singer. In listening to Block's own songs here, one can hear the actual historical blues tradition write itself into the new century. Block's own songs stack up tight against Charley Patton's &quot;High Water Everywhere,&quot; Muddy Waters' &quot;I Be Bound,&quot; and even Robert Johnson's classic &quot;Stones in My Passway.&quot; She doesn't need to write reverentially or referentially because she has the lyrical, compositional, and spiritual fortitude to bring the murky stuff up and out it to the listener unfiltered. The brief, ringing slide run that introduces the title track is the opening of a door. &quot;From the Dust&quot; is a manifesto, a foot-stomping testament to Block's pedigree through the grit of human experience, heartbreak, and transcendence. The rollicking open-tuned gospel-blues of &quot;One Way Down&quot; offers a candid view of personal surrender. &quot;David Had the Blues,&quot; with multi-tracked backing vocals and finger popping by Block, is what Rev. Gary Davis might have sounded like if he had been born a woman in the mid-20th century. The three covers all come sequentially in the middle of the set, almost as a suite. In the grain of Block's voice and dynamite playing one can hear the ghosts of the tradition whispering, very much alive in the heart of the heart of the country blues, seeking to impart their cautionary difficult truths to yet another generation. &quot;Dry Spell,&quot; with its killer bottleneck work, is a sultry moaner, while &quot;Fargo Baby&quot; spits and sputters, riding the rail of its bassline like a train. The sheer spooky haunt of &quot;Remember&quot;'s intro transforms itself into a paean of acceptance and is one of the most affirming gospel tunes to come out of the genre since the 1950s. The disc whispers to a close with &quot;Unprecedented Quiet,&quot; a stirring, gently moving instrumental that underscores the emotional range of all that has transpired here. From the Dust is impure blues poetry by one of the music's few living legends. (AllMusic)\n\nTrack list:\n01 - From The Dust\n02 - One Way Down\n03 - The Gate\n04 - David Had The Blues\n05 - Big As Texas\n06 - High Water Everywhere\n07 - I Be Bound\n08 - Stones In My Passway\n09 - Dry Spell Blues\n10 - Fargo Baby\n11 - Runaway Dog\n12 - Take A Train\n13 - Remember\n14 - Unprecedented Quiet\n\nEnjoy and share!","torrent":{"xt":"urn:btih:f34111e1fe5262f808dd151a3a2efe8166ca694a","amp;dn":"Rory+Block+-+2005+-+From+The+Dust+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f34111e1fe5262f808dd151a3a2efe8166ca694a","infoHashBuffer":{"type":"Buffer","data":[243,65,17,225,254,82,98,248,8,221,21,26,58,46,254,129,102,202,105,74]},"announce":[],"urlList":[]}}