{"title":"Battle.Group.2-RINDVIEH","uid":10441984,"size":386424800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f365658b53c07389f0b7ccca1692f6e469b77d9b&amp;dn=Battle.Group.2-RINDVIEH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":34,"time":1403900123,"description":" (__)\n\n(oO)\n\n/-------\n\n| | \n\n||----||\n\n\n\npresents\n\n\n\nBattle Group 2\n\n\n\nProtection: None\n\nVersion: 1.005\n\n\n\n|A deadly new terrorist group has emerged. The Talon seeks vengeance for an |\n\n|unknown crime, commanding seemingly unlimited resources and striking against |\n\n|innocents with precision, efficiency, and savage force. They take no prisoners|\n\n| |\n\n|But neither do we. |\n\n| |\n\n|Battle Group 2 puts you in control of an advanced naval fleet assembled as a |\n\n|last resort against this deadly new enemy. Command powerful battleships and |\n\n|fire newly developed satellite strikes in a final strike against this deadly |\n\n|new terrorist superpower. |\n\n| |\n\n|Key Features |\n\n|Eight unlockable ships - Earn new warships like the devastating Arsenal |\n\n|Prototype. Amazing detail - All player and enemy craft are lovingly modeled |\n\n|after real-world blueprints. Brand-new satellite strikes - Bring your arsenal |\n\n|to the next level with nullifying EMP blasts and change the tides of war with |\n\n|experimental new Hyper-Time technology. Fully developed campaign with over 30 |\n\n|new levels and challenging boss battles. Bring the war back to the Talon's |\n\n|doorstep - or die trying. Procedurally generated level content and enemy |\n\n|formations keep even the most experienced gunner alert. |\n\n|Wage war in three different theatres of combat: across jungle shores, in |\n\n|industrial ports, and even deep in arctic seas. Enable night vision mode |\n\n|during intense midnight battles. Next-gen UHD graphics - See the world |\n\n|rendered in incredible detail, coupled with a totally new menu system with |\n\n|satellite interface. Incredible music and sound - Plunge fully into the game |\n\n|world with professionally acted voice-over and epic soundtrack. | |\n\n| |\n\n\n\n| |\n\n| 1. Unpack |\n\n| 2. Play  Have Fun :) |\n\n| |\n\n| Notes: |\n\n| |\n\n| |\n\n\n\n| Greetz to my friends in the scene :) |","torrent":{"xt":"urn:btih:f365658b53c07389f0b7ccca1692f6e469b77d9b","amp;dn":"Battle.Group.2-RINDVIEH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f365658b53c07389f0b7ccca1692f6e469b77d9b","infoHashBuffer":{"type":"Buffer","data":[243,101,101,139,83,192,115,137,240,183,204,202,22,146,246,228,105,183,125,155]},"announce":[],"urlList":[]}}