{"title":"Heart - Original Album Classics [5 CD's][2013][320 KBPS]","uid":10639372,"size":608949256,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f3a1ce3cc5e426c0192ff3cdd49a94f1776e2c6c&amp;dn=Heart+-+Original+Album+Classics+%5B5+CD%27s%5D%5B2013%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"LameDuck69","files":74,"time":1406433981,"description":"Heart - Original Album Classics [5 CD's][2013]\n\n\n\n\n\nDisc 1 [1977][Little Queen]\n\n \n01. Barracuda  \n02. Love Alive  \n03. Sylvan Song  \n04. Dream Of The Archer  \n05. Kick It Out  \n06. Little Queen  \n07. Treat Me Well  \n08. Say Hello  \n09. Cry To Me  \n10. Go On Cry  \n11. Too Long A Time  \n12. Stairway to Heaven \n\n\n \nDisc 2 [1978][Dog &amp; Butterfly]\n\n \n01. Cook With Fire  \n02. High Time  \n03. Hijinx  \n04. Straight On  \n05. Dog &amp; Butterfly  \n06. Lighter Touch  \n07. Nada One  \n08. Mistral Wind  \n09. Heartless  \n10. Feels  \n11. A Little Bit \n\n\n \nDisc 3 [1980][Bebe Le Strange]\n\n \n01. Bebe Le Strange  \n02. Down On Me  \n03. Silver Wheels  \n04. Break  \n05. Rockin' Heaven Down  \n06. Even It Up  \n07. Strange Night  \n08. Raised On You  \n09. Pilot  \n10. Sweet Darlin'  \n11. Jackleg Man  \n12. Break \n\n\n \nDisc 4 [1982][Private Audition]\n\n \n01. City's Burning  \n02. Bright Light Girl  \n03. Perfect Stranger  \n04. Private Audition  \n05. Angels  \n06. This Man Is Mine  \n07. The Situation  \n08. Hey Darlin' Darlin'  \n09. One Word  \n10. Fast Times  \n11. America \n\n\n \nDisc 5 [1983][Passionworks]\n  \n01. How Can I Refuse  \n02. Blue Guitar  \n03. Johnny Moon  \n04. Sleep Alone  \n05. Together Now  \n06. Allies  \n07. (Beat By) Jealousy  \n08. Heavy Heart  \n09. Love Mistake  \n10. Language of Love  \n11. Ambush  \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nHeart is an American rock band that first found success in Canada and later in the United States and worldwide. Over the group's four-decade history, the band has had three primary lineups, with the constant center of the group since 1974 being sisters Ann Wilson (lead singer) and Nancy Wilson (guitarist). \n\nHeart rose to fame in the mid-1970s with music influenced by hard rock and heavy metal as well as folk music. Their popularity declined in the early 1980s, but the band enjoyed a comeback starting in 1985 and experienced even greater success with album oriented rock (AOR) hits and hard rock ballads into the 1990s. With Jupiter's Darling (2004), Red Velvet Car (2010), and Fanatic (2012), Heart made a return to their hard rock and acoustic folk roots.\n\nTo date, Heart has sold over 35 million records worldwide, including over 22 million in album sales in the U.S. The group was ranked number 57 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;. With Top 10 albums on the Billboard Album Chart in the 1970s, 1980s, 1990s, and 2010s, Heart is among the most commercially enduring hard rock bands in history. They were inducted into the Rock and Roll Hall of Fame in 2013.\n\n--------------------------------------------------------------------------------\n\nLittle Queen is the second studio album released by the American rock band Heart. It was released in May 1977 on Portrait Records, and re-released in 2004 with two bonus tracks.\n\n--------------------------------------------------------------------------------\n\nDog &amp; Butterfly is the fourth studio album by American rock band Heart, released on October 7, 1978 through Portrait Records. Heart rebounded from their legal dispute with Mushroom Records over the release of the platinum-selling Magazine in April 1978, as Dog &amp; Butterfly was certified double platinum, spent 36 weeks on the charts, and peaked at No. 17 on the US Billboard 200. The album was the 'proper' successor to 1977's hit Little Queen in terms of musical development and direction, and contained two hit singles: &quot;Straight On&quot;, and &quot;Dog &amp; Butterfly&quot;.\n\nAs Heart themselves noted on the album's release, side 1 was the &quot;Dog&quot; side, and was the more &quot;rocking&quot; compared to the &quot;Butterfly&quot; side 2, which was all ballads, with the exception of the closer &quot;Mistral Wind&quot;, which, in many ways, epitomized the trademark sound for which Heart would be remembered: folksy ballads shifting into searing hard rock explosions.\n\nThough the first song on the album, &quot;Cook with Fire&quot;, sounds like a live recording, it was actually recorded in the studio. Audience sounds were overdubbed on the studio recording from a live performance, although the liner notes say it was recorded live at The Centroplex Coliseum in Memphis, so this is debatable.\n\nThe album was reissued in a remastered edition in 2004 by Epic/Legacy and included three bonus tracks from this period. The song &quot;Feels&quot; was later reworked and became &quot;Johnny Moon&quot;, included in the album Passionworks (1983).\n\n--------------------------------------------------------------------------------\n\nBebe le Strange is the fifth studio album by the American rock band Heart. It was released on February 14, 1980 through Epic Records. It was the first album without founding member Roger Fisher on lead guitar, who had left the band months prior along with his brother Michael.\n\nThe album was a commercial success, peaking at number five on the U.S. Billboard 200 and staying in the charts for 22 weeks. It also was certified Gold by the RIAA. However it did not sell as well as their previous albums (which had gone Platinum and Multi-Platinum). The record contained the singles &quot;Even It Up&quot; (backed by the Tower of Power horns section) and the title track. Some of the backing vocals were provided by Don Wilhelm, who had been in a group called The Army with Steve Fossen and Roger Fisher in the 1960s.\n\nThe album was re-released in an expanded edition in 2004, containing two additional songs: a live version of &quot;Break&quot; and the studio outtake &quot;Jackleg Man&quot;.\n\n--------------------------------------------------------------------------------\n\nPrivate Audition is the sixth studio album, released by the hard rock band Heart, released in 1982. The album was on the U.S. Billboard 200 for fourteen weeks, peaking at number twenty-five. It contained the hit single &quot;This Man Is Mine&quot;. It is the last Heart album to feature longtime members Mike DeRosier and Steve Fossen, who left after the recording of the album and were replaced by Denny Carmassi and Mark Andes.\n\nIn 2009, Private Audition was re-released on the Beat Goes On label as a double CD with their subsequent album Passionworks. Prior to this, Private Audition had been out of print for a number of years and was the most difficult of Heart's CDs to obtain.\n\n--------------------------------------------------------------------------------\n\nPassionworks is the seventh studio album, released by the hard rock band Heart, in 1983. The album marks a shift in musical direction from hard rock and folk to mainstream rock. This album spent 21 weeks on the U.S. Billboard 200 and reached No. 39. The single, &quot;How Can I Refuse?&quot; hit No. 44 on the Billboard Hot 100 singles chart, and No. 1 on the Hot Mainstream Rock Tracks chart for 1 week. Passionworks was the band's final album with Epic Records before their comeback-fueled move to Capitol Records. It is the first Heart album to feature Denny Carmassi and Mark Andes, who had replaced longtime members Mike DeRosier and Steve Fossen.\n\nIn 2009, Passionworks was re-released on the Beat Goes On label as a double CD with the band's previous album Private Audition.","torrent":{"xt":"urn:btih:f3a1ce3cc5e426c0192ff3cdd49a94f1776e2c6c","amp;dn":"Heart+-+Original+Album+Classics+%5B5+CD%27s%5D%5B2013%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3a1ce3cc5e426c0192ff3cdd49a94f1776e2c6c","infoHashBuffer":{"type":"Buffer","data":[243,161,206,60,197,228,38,192,25,47,243,205,212,154,148,241,119,110,44,108]},"announce":[],"urlList":[]}}