{"title":"David Bowie - Ziggy Stardust And The Spiders From Mars.","uid":6085634,"size":1333475655,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f5727615eb82f4781ac1d15c13edb746f4cbd044&amp;dn=David+Bowie+-+Ziggy+Stardust+And+The+Spiders+From+Mars.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OldHippie2","files":1,"time":1294272382,"description":"In the 1970s, British glam rocker David Bowie defined an androgynous, gender-bending style which had a huge impact on popular culture. Famous for his rock and roll characters and alter egos, Bowie put on a legendary unique live show. This film, from director D.A. Pennebaker, who also made the classic Bob Dylan rockumentary DON'T LOOK BACK, captures Bowie as his most famous character, Ziggy Stardust, the rock star from Mars. Bowie/Ziggy dramatically performs hits from the album of the same title, as well as tracks from &quot;Hunk Dory.&quot; A must for the Bowie fan!\nThe quintessential moment in glam-rock history, ZIGGY STARDUST AND THE SPIDERS FROM MARS is David Bowie at his best. This film of the 1973 concert (released 10 years later) documents the hallucinogenic collage of kitsch, Warhol/Pop irony, and flamboyant excess that was the Bowie phenomenon: his trademark synthetic androgyny is a musical symbiosis of feminine passion and masculine dominance that define his funky, gender-bending art and, ultimately, the glam-rock genre as a whole. Early on, the film cuts to elaborate backstage costume changes between sets, highlighting a playlist that includes such classics as &quot;Changes,&quot; &quot;Space Oddity,&quot; &quot;Time,&quot; and &quot;Suffragette City.&quot; In this comprehensive document of a seminal peformer in music history, director D.A. Pennebaker captures the enigmatic singer's smoldering brilliance like a Hubble photograph of a supernova; it is essential viewing for Bowie fans and music historians alike.\nTracks: 1. Hang On To Yourself 2. Ziggy Stardust 3. Watch That Man 4. Medley: Wild-Eyed Boy From Freecloud/All the Young Dudes/Oh! You Pretty Things 5. Moonage Daydream 6. Changes 7. Space Oddity 8. My Death 9. Cracked Actor 10. Time 11. Width of a Circle 12. Let's Spend the Night Together 13. Suffragette City 14. White Light/White Heat 15. Rock 'N Roll Suicide This concert was the last live performance of The Spiders From Mars.\n","torrent":{"xt":"urn:btih:f5727615eb82f4781ac1d15c13edb746f4cbd044","amp;dn":"David+Bowie+-+Ziggy+Stardust+And+The+Spiders+From+Mars.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5727615eb82f4781ac1d15c13edb746f4cbd044","infoHashBuffer":{"type":"Buffer","data":[245,114,118,21,235,130,244,120,26,193,209,92,19,237,183,70,244,203,208,68]},"announce":[],"urlList":[]}}