{"title":"Wondershare_Video_Converter_Pro_5.0.3.1_Portable.by.speedzodiac","uid":6512105,"size":106692792,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f675c72b933be5fb5173c413349b118c6d5c2543&amp;dn=Wondershare_Video_Converter_Pro_5.0.3.1_Portable.by.speedzodiac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1309668959,"description":"Wondershare Video Converter Pro 5.0.3.1 Portable\n\n\nWondershare Video Converter Pro is a powerful video and DVD converter to help you rip DVDs, convert videos and extract audio. You can easily rip your favorite DVD movies into the video formats you want, and convert videos, including DRM protected videos, to iPhone, iPad, iPod and more for enjoyment on the go.\n\nConvert video and DVD movies with the easiest way:\n- Convert video and audio to various popular formats.\n- Rip DVDs to different video formats.\n- Remove DRM and convert DRM protected videos.\n- Enjoy DVD movies and videos on iPhone, iPad, iPod and more.\n\nFeature List:\n- Rip DVD to all the popular video formats with loading DVD disc, DVD folder, IFO and ISO files.\n- Convert SD and HD videos to the formats for your players.\n- Directly convert DRM protected videos for wide sharing and playing.\n- Extract audio from videos as M4A, WMA, WAV, MP3, AAC, etc.\n- Apple devices: iPad, iPhone 4, iPhone, iPod touch 4, iPod nano, Apple TV, etc..\n- Mobile phones: Android, Blackberry, Nokia, HTC, Motorola, Samsung, Sony Ericsson, LG, etc.\n- Game hardware: PSP, PS3, Xbox, Xbox 360, Wii, NDS\n- General MP4 players: Zune, Archos, Creative Zen, iRiver, Walkman, etc.\n- Enable batch conversion to convert more than one file at one time.\n- Support NVIDIAÃ‚Â® CUDATM to generate 5X faster video conversion speed.\n- Save new custom video profiles and presets to all files with one click.\n- Edit videos by cliping, cropping, appling effects, add watermark and subtitle, splitting and merging.\n- Support plug-in subtitle files in .srt, .sst and .ssa formats.\n- Enable to edit the subtitle and set it in your own style.\n- Provide real-time preview to ensure the optimal video quality.\n- Split a large file to a smaller one or separate segments.\n- Set video brightness, contrast and saturation or even add special effects.\n- Automatically check updates to ensure the latest version.\n- Join several video files or different segments into a complete one.\n- Add image or text watermark to make personalized videos.\n- Free lifetime technical support and upgrade service are available for every user.\n- Reset the video size by cropping off black bars.\n- Capture pictures from the video and save as JPG or BMP format.\n\n\nHome Page - http://www.wondershare.com/\n\n\n\n","torrent":{"xt":"urn:btih:f675c72b933be5fb5173c413349b118c6d5c2543","amp;dn":"Wondershare_Video_Converter_Pro_5.0.3.1_Portable.by.speedzodiac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f675c72b933be5fb5173c413349b118c6d5c2543","infoHashBuffer":{"type":"Buffer","data":[246,117,199,43,147,59,229,251,81,115,196,19,52,155,17,140,109,92,37,67]},"announce":[],"urlList":[]}}