{"title":"Unearthed.Trail.of.Ibn.Battuta.Gold.Edition.Episode.1-FANiSO","uid":9435146,"size":5677701171,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f68e8227b0e6c2d8b1e865421ed4c7e6f9a10c9e&amp;dn=Unearthed.Trail.of.Ibn.Battuta.Gold.Edition.Episode.1-FANiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Taker009","files":2,"time":1388888539,"description":"Unearthed.Trail.of.Ibn.Battuta.Gold.Edition.Episode.1-FANiSO\n\n\n Unearthed: Trail of Ibn Battuta - Gold Edition - EP1 (c) Semaphore    \n                                                                          \n\n Supplied By: A Friend              Diskettes   : 1 DVD                  \n Cracked By : A Friend              Game Type   : Adventure              \n Packaged By: A Friend              Released On : January 2014           \n\n  Unearthed is an episodic third person Action Adventure game set in\n  modern day Middle East. The game is available in full Arabic and\n  English voice over and features 21 Languages for Menu and Subtitles.\n  When fortune hunter Faris Jawad and his sister Dania receive a call\n  to visit Morocco they embark on an exotic adventure throughout the\n  middle east on the trail of the famous Muslim explorer Ibn Battuta.\n\n  The trail won't be clear however as Faris will have to overcome an\n  unholy alliance of a militia army leader, a weapons dealer and a\n  wealthy antiquities smuggler who are after the same goal.\n\n   Features:\n   ~~~~~~~~~\n  * Travel across the Middle East from the wild life of Moroccan\n    Atlas mountains to the alleys of old Damascus through the port\n    of Alexandria and the metropolitan city of Dubai.\n  * Unique mix of platforming, melee fighting, shooting and stealth\n    gameplay.\n  * Presented in a TV style episodic format along with recaps of\n    previous episodes and teaser cliff hangers of what lies ahead.\n  * Unlockable Survival Mode: Battle against endless waves of\n    enemies (Mummies, Zombies, Ghouls) across 8 varied maps\n    featuring three exclusive maps designed for PC and Mac.\n  * Unlockable Extras: Concept Art, Renders, Animatics, Cutscenes,\n    Character Gallery, Treasures\n  * Available in 21 languages for menus/subtitles. Voice-over in\n    Arabic and English.\n\n  - This Gold Edition contains over 120 fixes to the console version\n    based on the reviews and player feedback, they are summarized as\n    below:\n\n  * General: A restructured tutorial level to better introduce the\n    game mechanics, No more colliding with ragdolls and small\n    objects such as broken pot pieces which allows for easier\n    movement, invisible walls to prevent falling from high surfaces,\n    clear font size for hints and facts in the loading screens,\n    re-recorded all the Arabic voiceover to remove the extra echo.\n  * Hand to Hand Combat: Fully revamped hand to hand fighting system\n    with brand new animations, full camera orbit control, more fluid\n    response and streamlined special moves .\n  * Shooting System: Re-balanced all the weapons to allow for weapon\n    specific range, accuracy, reverb zones, recoil, auto, semi-auto\n    and manual targeting, and brand new weapon SFX.\n  * Driving System: Improved car handling, no more flipping when\n    turning at very high speeds, orbit camera, Better driving enemy\n    AI, Tire tracks, Full Physical Damage Model for the player car\n    with smoke, sparks on colliding with other cars, props and\n    buildings.\n\n   Install\n   ~~~~~~~\n   1.) Unpack\n   2.) Burn or mount\n   3.) Play the game","torrent":{"xt":"urn:btih:f68e8227b0e6c2d8b1e865421ed4c7e6f9a10c9e","amp;dn":"Unearthed.Trail.of.Ibn.Battuta.Gold.Edition.Episode.1-FANiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f68e8227b0e6c2d8b1e865421ed4c7e6f9a10c9e","infoHashBuffer":{"type":"Buffer","data":[246,142,130,39,176,230,194,216,177,232,101,66,30,212,199,230,249,161,12,158]},"announce":[],"urlList":[]}}