{"title":"Powder - MCMXCV [1996]","uid":9412621,"size":203762865,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f6a74b447c1dffaaae517f7a40b3c028bd0f1a3a&amp;dn=Powder+-+MCMXCV+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388342956,"description":"Powder were a Britpop band, who existed between 1994 and 1997, and released three singles on Parkway Records. Signed in late 1994 by music public relations agents John Best and Phill Savidge, they were the first band on the label. Powder were fronted by Pearl Lowe, with songwriters Mark Thomas on guitar and Tim McTighe on bass and James Walden on drums. Their first single &quot;20th Century Gods&quot;, a Select Single Of The Month, sold out of its pressing of 1,500 within two days. This was followed by the release of &quot;Afrodisiac&quot; in June 1995, and appearances at music festivals as well as prime-time BBC music special Britpop Now.[1]\nAs the Parkway offices were situated in Camden, Powder were subjected to a fair amount of criticism from the music press for being a &quot;Scenester&quot; band, though in fact none of them actually lived there.[citation needed] They also acquired a stigma for touring with Menswear, who were at that time continually mocked by the NME and Melody Maker.\nAfter the release of their third and last single &quot;Deep Fried&quot; in November 1995, Powder stopped touring as Pearl was pregnant. By the time she was ready to tour again the band was finished, having announcing their split in spring 1996. Posthumous album MCMXCV, a compilation of all the tracks from their three singles, was released in Japan in 1997.\nPearl went on to front Lodger, and has also released a solo album.","torrent":{"xt":"urn:btih:f6a74b447c1dffaaae517f7a40b3c028bd0f1a3a","amp;dn":"Powder+-+MCMXCV+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a74b447c1dffaaae517f7a40b3c028bd0f1a3a","infoHashBuffer":{"type":"Buffer","data":[246,167,75,68,124,29,255,170,174,81,127,122,64,179,192,40,189,15,26,58]},"announce":[],"urlList":[]}}