{"title":"Jackie Mittoo feat. Tommy McCook - The Collectors Box (Attack, 3","uid":7346445,"size":206358220,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6d7ac55c9486bf573264f77140da0da8f7adcda&amp;dn=Jackie+Mittoo+feat.+Tommy+McCook+-+The+Collectors+Box+%28Attack%2C+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mudmashers","files":53,"time":1339437434,"description":"Jackie Mittoo feat. Tommy McCook - The Collectors Box [Attack] (3CD160kb)\n\nCD1 - Drum Song\nCD2 - At King Tubbys\nCD3 - Tommy McCook Featuring Bobby Ellis\n\nProfile:\nJackie was born on March 3, 1948 in Brown's Town, in the Parish of St. Ann, Jamaica. He first began playing professionally at the age of thirteen with various bands such as The Rivals and The Sheiks and it was around this time that he started hanging out at Fedral Studios and playing with the cream of Jamaican's musicians who from June, 1964 would become known as the Skatalites.\n\nIn 1959 Clement 'Coxsone' Dodd was recording artists at Fedral Studios when he came into contact with Jackie Mittoo. Dodd was so impressed that he asked Jackie to run the sessions at his new studio at 13 Brentford Road in Kingston when it opened in 1963.Mittoo and Dodd recorded thousands of tunes throughout the Sixties. \n\nWhen the Skatalites split Dodd formed a new studio band the Soul Brothers under Roland Alphonso's direction, Alphonso was responsible for the horn arrangements whilst Jackie wrote the music. Jackie went on to lead the session musicians changing their name to the Soul Vendors and later to Sound Dimension. Jackie wasn't just the leader he was a creator as well, giving the bass player his lines, writing the chords for the guitarist, playing keyboards himself as well as arranging the recordings. \n\nThe artists recorded during this period included Ken Booth, Bob Andy, Alton Ellis, The Wailers, The Heptones, Marcia Griffiths, John Holt, Slim Smith, Delroy Wilson and many, many others as well as recording superb instrumental music. This body of music is not only the foundation of reggae, constantly being covered and versioned, but an incredible artistic and creative achievement in it's own right. R.I.P. December 16, 1990. (Discogs)","torrent":{"xt":"urn:btih:f6d7ac55c9486bf573264f77140da0da8f7adcda","amp;dn":"Jackie+Mittoo+feat.+Tommy+McCook+-+The+Collectors+Box+%28Attack%2C+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d7ac55c9486bf573264f77140da0da8f7adcda","infoHashBuffer":{"type":"Buffer","data":[246,215,172,85,201,72,107,245,115,38,79,119,20,13,160,218,143,122,220,218]},"announce":[],"urlList":[]}}