{"title":"The Bird With the Crystal Plumage (1969) Xvid 1cd [DDR]","uid":11675666,"size":765984768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f740945ad12b594ce0eb42f1c462ce2cf2d1886c&amp;dn=The+Bird+With+the+Crystal+Plumage+%281969%29+Xvid+1cd+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":2,"time":1422854874,"description":"The Bird With the Crystal Plumage (1969) Xvid 1cd - Suzy Kendall, Tony Mustante [DDR]\n\nThe Bird with the Crystal Plumage (Italian: L'uccello dalle piume di cristallo) is a 1970 Italian giallo film directed by Dario Argento, in his directorial debut. \nThe film is considered a landmark in the Italian giallo genre. \nWritten by Argento, the film is an uncredited adaptation of Fredric Brown's novel The Screaming Mimi, which had previously been made into a Hollywood film, Screaming Mimi (1958), directed by Gerd Oswald.\n\nThe film was nominated for an Edgar Allan Poe award for best motion picture in 1971. \nThe film was originally cut by 20 seconds for its US release and received a 'GP' rating, though it was later re-classified as 'PG'. \nIt has since been released in the US uncut. Upon its release the film was a huge box office hit, grossing 1,650,000,000 Italian lira (roughly about $1 million US), twice the production cost of $500,000. \nhe film was also a success outside of Italy, gaining â‚¬1,366,884 admissions in Spain.\n\n    CAST:-\n    Tony Musante as Sam Dalmas\n    Suzy Kendall as Julia\n    Enrico Maria Salerno as Inspector Morosini\n    Eva Renzi as Monica Ranieri\n    Umberto Raho as Alberto Ranieri\n    Renato Romano as Professor Carlo Dover\n    Giuseppe Castellano as Monti\n    Mario Adorf as Berto Consalvi\n    Pino Patti as Faiena\n    Gildo Di Marco as Garullo\n    Rosita Torosh as 4th Victim\n    Omar Bonaro as Police Detective\n    Fulvio Mingozzi as Police Detective\n    Werner Peters as Antique Dealer\n    Karen Valenti as Tina, 5th Victim\n\nDirected by Dario Argento\nProduced by Salvatore Argento, Artur Brauner \nMusic by Ennio Morricone\nRunning time 98 min.\n\nMOVIE PLOT:- The Bird with the Crystal Plumage (1970)\nSam Dalmas (Tony Musante) is an American writer living in Rome with his model girlfriend Giulia (Suzy Kendall). Suffering from writer's block, Sam is on the verge of returning to America, but witnesses the attack of a woman in an art gallery by a mysterious black-gloved assailant dressed in a raincoat.\n\nAttempting to reach her, Sam is trapped between two mechanically-operated glass doors and can only watch as the villain makes his escape. The woman, Monica Ranieri (Eva Renzi), the wife of the gallery's owner, Alberto Ranieri (Umberto Raho), survives the attack and the local police confiscates Sam's passport to stop him from leaving the country; the assailant is believed to be a serial killer who is killing young women across the city, and Sam is an important witness.\n\nSam is haunted by what he saw that night, feeling sure that some vital clue is evading him, and he decides to help Inspector Morosini (Enrico Maria Salerno) in his investigation. He interviews the pimp of a murdered prostitute and visits a shop where another of the murdered women worked. There, he finds that the last thing she sold on the day she was murdered was a painting of a stark landscape featuring a man in a raincoat murdering a young woman. He visits the artist, but finds only another dead end. As he makes his way back to his apartment, Giulia is attacked by the same black-gloved figure, but Sam arrives home just in time to save her and the assailant escapes.\n\nSam starts to receive menacing phone calls from the killer, from which the police manage to isolate an odd cricketing noise in the background, which is later revealed to be the call of a rare breed of bird from Siberia, called &quot;The Bird with Crystal Plumage&quot; due to the diaphanous glint of its feathers. This proves important since the only one of its kind in Rome is kept in the Italian capital's zoo, allowing Sam and the police to identify the killer's abode. There they once again find Monica Ranieri, this time struggling with her husband, Alberto, who is wielding a knife. After a short struggle, Alberto is killed. As he dies, he confesses to the murders and tells them he loves his wife.\n\nFinding that Giulia and Monica have run off, Sam goes after them, eventually coming to a darkened building. There he finds his friend Garullo (Gildo Di Marco) murdered and Giulia bound, gagged and wounded. The assailant emerges and is revealed as Monica Ranieri. Sam suddenly realises that he didn't actually miss anything during the first attack; he simply misinterpreted what he saw: the attack he witnessed in the gallery was not Monica being assaulted but rather Monica attacking her husband, who was wearing the raincoat. She flees and he pursues her to her art gallery. There, he is trapped, pinned to the floor by the release of a wall-sized sculpture of wire and metal. Unable to free himself, he becomes the prey of the person he was pursuing. This climax to the mystery, with strong sado-masochistic elements, has the knife-wielding Monica teasing Sam as she prepares to kill him. As she raises her knife, the police burst in and apprehend her, notified by Giulia, who had escaped. Sam is freed and Monica is taken to a psychiatric hospital. The victim of a traumatic attack ten years before, seeing the painting of the murdered girl drove her mad, causing her to identify not with the victim but with the assailant. Alberto likewise suffered from an induced psychosis, helping her to cover up the murders and committing some himself. Sam and Giulia are re-united and return to America.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 820 kbps\nVideo Resolution: 640x272\nVideo Aspect Ratio: 2.222:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 96 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:f740945ad12b594ce0eb42f1c462ce2cf2d1886c","amp;dn":"The+Bird+With+the+Crystal+Plumage+%281969%29+Xvid+1cd+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f740945ad12b594ce0eb42f1c462ce2cf2d1886c","infoHashBuffer":{"type":"Buffer","data":[247,64,148,90,209,43,89,76,224,235,66,241,196,98,206,44,242,209,136,108]},"announce":[],"urlList":[]}}