{"title":"The Last Light of the Sun by Guy Gavriel Kay {dwg}","uid":11352302,"size":3809087,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f75dc02071e88976956a95abe8f1c1ac5e12cb3b&amp;dn=The+Last+Light+of+the+Sun+by+Guy+Gavriel+Kay+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1414903042,"description":"In his eagerly awaited new novel, Guy Gavriel Kay turns his gaze to the northlands, brilliantly evoking the Viking, Anglo-Saxon and Celtic cultures of a turbulent age.\n\nThere is nothing soft or silken about the north. The lives of men and women are as challenging as the climate and lands in which they dwell. For generations, the Erlings of Vinmark have taken their dragon-prowed ships across the seas, raiding the lands of the Cyngael and Anglcyn peoples, leaving fire and death behind. But times change, even in the north, and in a tale woven with consummate artistry, people of all three cultures find the threads of their lives unexpectedly brought together...\n\nBern Thorkellson, punished for his father's sins, commits an act of vengeance and desperation that brings him face-to-face, across the sea, with a past he's been trying to leave behind.\n\nIn the Anglcyn lands of King Aeldred, the shrewd king, battling inner demons all the while, shores up his defenses with alliances and diplomacy-and with swords and arrows-while his exceptional, unpredictable sons and daughters pursue their own desires when battle comes and darkness falls in the woods.\n\nAnd in the valleys and shrouded hills of the Cyngael, whose voices carry music even as they feud and raid amongst each other, violence and love become deeply interwoven when the dragon ships come and Alun ab Owyn, chasing an enemy in the night, glimpses strange lights gleaming above forest pools.\n\nMaking brilliant use of saga, song and chronicle, Kay brings to life an unforgettable world balanced on the knife-edge of change in The Last Light of the Sun","torrent":{"xt":"urn:btih:f75dc02071e88976956a95abe8f1c1ac5e12cb3b","amp;dn":"The+Last+Light+of+the+Sun+by+Guy+Gavriel+Kay+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f75dc02071e88976956a95abe8f1c1ac5e12cb3b","infoHashBuffer":{"type":"Buffer","data":[247,93,192,32,113,232,137,118,149,106,149,171,232,241,193,172,94,18,203,59]},"announce":[],"urlList":[]}}