{"title":"The 4400 Season 4 DVD NL subs DutchReleaseTeam","uid":8528391,"size":5848644178,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f76d30008008ec85144b837340115834003cc9e0&amp;dn=The+4400+Season+4+DVD+NL+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Recon06","files":17,"time":1370086276,"description":"[b]The 4400 Season 4 DVD NL subs DutchReleaseTeam[/b]\n\n[IMG]http://i19.photobucket.com/albums/b187/vivitronl/Het%20Multimedia%20Cafe%20Afbeeldingen/Serie%20Screenshot/The4400Se4dvdcase_zps9f0a0b51.png[/IMG]\n\nIn de afgelopen eeuw zijn duizenden mensen vermist geraakt. \nPlotseling en onverklaarbaar keren 4400 vermiste personen allemaal tegelijk terug; en ze zijn niets veranderd. \nNiet wetend wat deze ingrijpende gebeurtenis betekent, onderzoekt de overheid de 4400 mensen om erachter te komen waar ze zijn geweest en waarom ze zijn teruggekeerd. \nHet wordt al gauw duidelijk dat hun aanwezigheid de mensheid zal veranderen op een manier die niemand ooit had kunnen voorzien.\n\nActeurs : Jacqueline McKenzie, Laura Allen, Conchita Campbell, Joel Gretsch, Patrick Flueger\nTaal : Engels\nOndertiteling : Nederlands\nGenre: Drama,Â Mystery,Â Thriller,Â Sci-Fi\n\nSeizoen 4, Aflevering 1\nThe Wrath of Graham\nA high school student develops an ability after injecting promicin. Tom visits Isabelle in jail, while Diana searches for her missing sister. Following the advice of a young woman, named Cassie, Kyle is able to wake Shawn from his coma. Jordan Collier's conscience gets to him. Meanwhile, NTAC gets a new director.\n\n\nSeizoen 4, Aflevering 2\nFear Itself\nTom and Diana search for someone who has the ability to make people's worst fears come true. Danny seeks Shawn's help to find a promicin shot. Meanwhile, Cassie leads Kyle to a book that contains a prophecy about Jordan Collier.\n\n\nSeizoen 4, Aflevering 3\nAudrey Parker's Come and Gone\nAn elderly woman develops the ability to astral project unseen by others, but she is stuck in limbo when her body is murdered, and she must find a way to contact Tom and Diana to help catch her killer. Elsewhere, Shawn decides to start healing people again despite threats.\n\n\nSeizoen 4, Aflevering 4\nThe Truth &amp; Nothing But The Truth\nApril's new ability takes her in a danger. Meanwhile, Shawn is approached to run for public office. Kyle helps Isabelle.\n\n\nSeizoen 4, Aflevering 5\nTry The Pie\nTom tracks Jordan to a small town, where he meets a woman who can relieve people's stress by talking to them. Meanwhile, Marco and Diana have a nice talk. Maia's visions are giving her nightmares.\n\n\nSeizoen 4, Aflevering 6\nThe Marked\nJordan wants Shawn to rejoin the movement. Meanwhile, a 4400 with an amazing ability disappears.\n\n\nSeizoen 4, Aflevering 7\nTill We Have Built Jerusalem\nWhen Jordan Collier and his followers seize control of most of Seattle, the government sends a Delta Force of enhanced soldiers to capture Collier dead or alive.\n\n\nSeizoen 4, Aflevering 8\nNo Exit\nP.J. took the Promicin shot 2 months ago. Now he has an ability...\n\n\nSeizoen 4, Aflevering 9\nDaddy's Little Girl\nRichard returns from hiding to abduct Isabelle from Promise City, hoping to &quot;start over.&quot; Meanwhile, Tess, her schizophrenia out of control, uses her ability to take control of a diner full of people.\n\nSeizoen 4, Aflevering 10\nOne of Us\nTom and Diana look for Richard, but Tom is distracted by his dreams about the future. Meanwhile, Collier is threatened by Shawn's test that could determine who would die from a Promicin shot\n\n\nSeizoen 4, Aflevering 11\nGhost in the Machine\nTom and Diana must race to find the source of a computer virus that could bring down Ubient software, one of the world's largest software companies that is run by suspected member of the marked, Drew Imroth. Meanwhile, Maia visits Promise City where she receives an unexpected birthday surprise: a visit from her birth parents.\n\n\nSeizoen 4, Aflevering 12\nTiny Machines\nMeghan and Diana learn how to remove the entity from Tom, but the procedure is dangerous. Meanwhile, Shawn finds help in his attempt to rescue Kevin from Promise City; and Jordan is betrayed by someone close.\n\n\nSeizoen 4, Aflevering 13\nThe Great Leap Forward\nParamedics try to resuscitate Susan Farrell. They believe that she took promicin and lost the 50/50 lotto that comes with it. Danny is certain that she did not take the shot. After arriving at the hospital with the paramedics, things get complicated as everyone around Danny start to die. Garrity and another NTAC agent are sent to the hospital to assess the situation.\n\nSeizoen 4, Aflevering 14\nThe Great Leap Forward (Directors Cut)\nDirectors Cut: Paramedics try to resuscitate Susan Farrell. They believe that she took promicin and lost the 50/50 lotto that comes with it. Danny is certain that she did not take the shot. After arriving at the hospital with the paramedics, things get complicated as everyone around Danny start to die. Garrity and another NTAC agent are sent to the hospital to assess the situation.\n\n\n\n[url=http://www.mijnserie.nl/the_4400/][img]http://img375.imageshack.us/img375/8939/mijnserie.png[/img][/url]\n\n[url=http://www.imdb.com/title/tt0389564/][img]http://hetmultimediacafe.nl/images/afbeeldingen/imdb.png[/img][/url]\n\n\nDutchReleaseteam = Hardcoded Dutch Subs\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op http://www.hetmultimediacafe.be","torrent":{"xt":"urn:btih:f76d30008008ec85144b837340115834003cc9e0","amp;dn":"The+4400+Season+4+DVD+NL+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f76d30008008ec85144b837340115834003cc9e0","infoHashBuffer":{"type":"Buffer","data":[247,109,48,0,128,8,236,133,20,75,131,115,64,17,88,52,0,60,201,224]},"announce":[],"urlList":[]}}