{"title":"Tropic of Capricorn by Henry Miller","uid":9173754,"size":358038124,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f76fd8e7582020425e500aaac9ee6a65aa751a57&amp;dn=Tropic+of+Capricorn+by+Henry+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Arazbr","files":11,"time":1384113897,"description":"\nRead by Campbell Scott \n\nTropic of Capricorn is a semi-autobiographical novel by Henry Miller, first published in Paris in 1939. The novel was subsequently banned in the United States until a 1961 Justice Department ruling declared that its contents were not obscene.[1] It was also banned in Turkey.[2] It is a sequel to Miller's 1934 work, the Tropic of Cancer. Both Tropic of Capricorn and Tropic of Cancer are published in the United States by Grove Press an imprint of Grove/Atlantic, Inc..\nThe novel is set in 1920s New York, where the narrator 'Henry V. Miller' works in the personnel division of the 'Cosmodemonic' telegraph company. Although the narrator's experiences closely parallel Miller's own time in New York working for the Western Union Telegraph Company, and though he shares the author's name, the novel is considered a work of fiction.\nThe book is a story of spiritual awakening. Much of the story surrounds his New York years of struggle with wife June Miller, and the process of finding his voice as a writer.\n\nBanned in America for almost thirty years because of its explicit sexual content, this companion volume to Miller's Tropic of Cancer chronicles his life in 1920s New York City. Famous for its frank portrayal of life in Brooklyn's ethnic neighborhoods and Miller's outrageous sexual exploits, Tropic of Capricorn is now considered a cornerstone of modern literature.","torrent":{"xt":"urn:btih:f76fd8e7582020425e500aaac9ee6a65aa751a57","amp;dn":"Tropic+of+Capricorn+by+Henry+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f76fd8e7582020425e500aaac9ee6a65aa751a57","infoHashBuffer":{"type":"Buffer","data":[247,111,216,231,88,32,32,66,94,80,10,170,201,238,106,101,170,117,26,87]},"announce":[],"urlList":[]}}