{"title":"The Marriage of Opposites - Alice Hoffman","uid":13024536,"size":504074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f78ae7e6b7a33c88c2150585ac3cfbc4d5b9fd3d&amp;dn=The+Marriage+of+Opposites+-+Alice+Hoffman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450388985,"description":"The Marriage of Opposites - Alice Hoffman\r\n\r\n\r\nFrom the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro—the Father of Impressionism.\r\n\r\nGrowing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel’s mother, a pillar of their small refugee community of Jews who escaped the Inquisition, has never forgiven her daughter for being a difficult girl who refuses to live by the rules. Growing up, Rachel’s salvation is their maid Adelle’s belief in her strengths, and her deep, life-long friendship with Jestine, Adelle’s daughter. But Rachel’s life is not her own. She is married off to a widower with three children to save her father’s business. When her husband dies suddenly and his handsome, much younger nephew, Frédérick, arrives from France to settle the estate, Rachel seizes her own life story, beginning a defiant, passionate love affair that sparks a scandal that affects all of her family, including her favorite son, who will become one of the greatest artists of France.\r\n\r\nBuilding on the triumphs of The Dovekeepers and The Museum of Extraordinary Things, set in a world of almost unimaginable beauty, The Marriage of Opposites showcases the beloved, bestselling Alice Hoffman at the height of her considerable powers. Once forgotten to history, the marriage of Rachel and Frédérick is a story that is as unforgettable as it is remarkable.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:f78ae7e6b7a33c88c2150585ac3cfbc4d5b9fd3d","amp;dn":"The+Marriage+of+Opposites+-+Alice+Hoffman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f78ae7e6b7a33c88c2150585ac3cfbc4d5b9fd3d","infoHashBuffer":{"type":"Buffer","data":[247,138,231,230,183,163,60,136,194,21,5,133,172,60,251,196,213,185,253,61]},"announce":[],"urlList":[]}}