{"title":"UK.Truck.Simulator-SKIDROW (No Rar)","uid":5387796,"size":565345207,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f7e6f73d5cfd28243dc2916eeb95101285b16118&amp;dn=UK.Truck.Simulator-SKIDROW+%28No+Rar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"thenoobish","files":4,"time":1266947315,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nUK Truck Simulator / Excalibur Publishing\n\nRELEASE DATE : 23-02-2010           PROTECTION : Nothing\nGAME TYPE    : Strategy             DISKS      : 1 CD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nHit the road in UK Truck Simulator! Using a network of\nmotorways and major trunk routes you will gain unbridled\naccess to 18 of the UKs largest cities!\n\nFrom the granite city of Aberdeen in the north to the rolling\ngreen hills of the South Hams heading towards historic\nPlymouth where Sir Francis Drake played his famous game of\nbowls whilst awaiting the invasion of the Spanish Armada.\n\nExperiencing the life of a UK haulage contractor you can visit\nall the major cities of the UK. You will need to make sure you\nmake your deliveries on time, keep your truck in good repair\nand check your fuel consumption. Build up your business and\nupgrade your truck to keep your business running efficiently\nand profitably. Watch out for traffic violations as they will\nbe deducted from your earnings, and you know how expensive\nthat can be!\n\nYou start the game as an employee of a cargo transportation\ncompany. You will be assigned a lorry and you will be given\ninstructions on what to do next. Every time you finish your\ndelivery your employer will automatically plan and assign a\nnew job for you. Later in the game you may get the opportunity\nto change your employer, which may improve your working terms\na little, but generally you will still be following orders.\n\nWhile employment certainly has its advantages - paid expenses,\nno need for burdening yourself with delivery planning, free\nlorry at your disposal - its only a starting point. Once\nyouve built up some money you can buy yourself your own\nlorry. After a time you will probably realize that your\nprofessional development has ground to a halt - you will not\nbe gaining any more reputation, you will be driving around the\nsame places all the time and the reward for the work could\nhave been higher - and that you could be doing much better\nworking for yourself! At that point, once you buy yourself a\nlorry, you will become an independent driver who will be\nmaking his own fortune in the trucking world. It will take\nsome courage to go it alone, but it will be well worth it!\n\nGoing independent will open up a whole new world to you. You\nwill be able to buy garages across the country, fill them with\nlorries and even start up your own transportation company! As\nyou grow and expand, you will attract more and more logistics\ncompanies which will want to work with you. In time you may\nbuild the biggest transportation company in the UK or you may\ngo bankrupt! That will be up to you...\n\nThe road network in UK Truck Simulator is based on UK roads\nand cities. All trucks use highly realistic, meticulously\ndetailed models.\n\nThe truck interiors of UK Truck Simulator are as equally\nimpressive as the exteriors. With actual working instruments\nsuch as flashing indicators, temperature and low fuel warning\nlights, wipers, and naturally - a full set of gauges\nincluding speedometer - all built into the interior 3D model\nUK Truck Simulator, just like our previous best selling title\nEuro Truck Simulator, offers a truly immersive simulation\nenvironment. The player can pan around the cabin, just as if\nthey were actually sitting at the wheel.\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:f7e6f73d5cfd28243dc2916eeb95101285b16118","amp;dn":"UK.Truck.Simulator-SKIDROW+%28No+Rar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7e6f73d5cfd28243dc2916eeb95101285b16118","infoHashBuffer":{"type":"Buffer","data":[247,230,247,61,92,253,40,36,61,194,145,110,235,149,16,18,133,177,97,24]},"announce":[],"urlList":[]}}