{"title":"A Dictionary Of Bible Plants - Dr. Lytton John Musselman","uid":10350313,"size":50124765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f831a7b145ed36b8b421c89d6888705aa7b11db0&amp;dn=A+Dictionary+Of+Bible+Plants+-+Dr.+Lytton+John+Musselman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1402666731,"description":"This book describes and illustrates each plant mentioned in both the Old and New Testaments and the Apocrypha. Drawing on Lytton John Musselman's extensive field investigations from Beirut to Borneo and from the Atlas to the Zagros mountains, it also includes his original images of each plant.\nIncorporating new research on their use, reviews are made of recent analytical studies of plants used in materials and technology as well as ancient grains, beer production, medicine, tensile materials, soap and other articles. Based on these materials, Musselman provides several new plant identifications for controversial biblical passages.\nIn addition, the book surveys the history of Bible plant literature from the time of the Greeks and Romans to the present, and reviews and correlates it with Bible plant hermeneutics. Extensive references for further study are provided, along with an index to all verses containing references to these plants.\n\n\nAbout the author:\nLytton John Musselman is Mary Payne Hogan Professor of Botany in the Department of Biological Sciences at Old Dominion University and a long-time student of plants of the Bible and Quran. Among his books on this topic are Jordan in Bloom: Wildflowers of the Holy Land and Figs, Dates, Laurel, and Myrrh: Plants of the Bible and the Quran. He is also founder and manager of the Blackwater Ecologic Preserve in southeastern Virginia and is presently part of a team working on a Flora of Iraq.","torrent":{"xt":"urn:btih:f831a7b145ed36b8b421c89d6888705aa7b11db0","amp;dn":"A+Dictionary+Of+Bible+Plants+-+Dr.+Lytton+John+Musselman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f831a7b145ed36b8b421c89d6888705aa7b11db0","infoHashBuffer":{"type":"Buffer","data":[248,49,167,177,69,237,54,184,180,33,200,157,104,136,112,90,167,177,29,176]},"announce":[],"urlList":[]}}