{"title":"Medical Mentoring, David Jeffrey [PDF][StormRG]{HTD15}","uid":11784982,"size":5045429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f85276fa7d79b3ca0a3f1b305df60bdef81969c4&amp;dn=Medical+Mentoring%2C+David+Jeffrey+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":3,"time":1427676508,"description":"TITLE/EDITIONMedical Mentoring: Supporting Students, Doctors in Training and General Practitioners \nBy: David Jeffrey\nPaperback: 150 pages\nPublisher: Royal College of General Practitioners (October 22, 2014)\nISBN-10: 0850843545\nISBN-13: 978-0850843545\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\nThere is a huge need for supportive mentoring among students, doctors in training and general practitioners. Mentoring is an effective way of supporting doctors and preventing problems. The author argues that all doctors should seek a mentor. Medical training involves transitions; school to university, student to junior doctor and trainee to GP. It is at these transition points that mentoring is most valuable. This book - Medical Mentoring - is a practical guide to using mentoring to help doctors with their professional development, support them when difficulties arise and prevent problems developing. If you're considering mentoring, want to adapt your approach or develop your mentoring skills, this is the book for you. This practical guide, illustrated by case stories: will give prospective mentors the confidence to improve student/doctor support defines the role of a medical mentor and the benefits of providing support to doctors and students discusses reasons why medical students and doctors struggle during their careers gives practical advice on identifying the student/doctor in difficulty discusses what students/doctors value in a mentor offers a practical guide to mentoring using a clinical model. At present doctors and other healthcare professionals are perceived to be less caring and compassionate. GPs face an increasing workload with little support. Recruitment to general practice is difficult in some areas. Although mentoring is well established in nursing and educational circles, there is still a culture in medicine that a doctor should be able to cope by themselves. Seeking support is still viewed by some as a weakness. It is puzzling that clinicians who use their skills to support and care for patients rarely give the same level of attention to their colleagues. The book shows how these clinical skills can be adapted effectively in mentoring, while acknowledging that mentees are not patients. This guide aims to give prospective mentors the confidence to improve student/doctor support and so will improve recruitment and retention of students and GPs, and enable doctors to deliver more effective patient care","torrent":{"xt":"urn:btih:f85276fa7d79b3ca0a3f1b305df60bdef81969c4","amp;dn":"Medical+Mentoring%2C+David+Jeffrey+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f85276fa7d79b3ca0a3f1b305df60bdef81969c4","infoHashBuffer":{"type":"Buffer","data":[248,82,118,250,125,121,179,202,10,63,27,48,93,246,11,222,248,25,105,196]},"announce":[],"urlList":[]}}