{"title":"Mike Leponds Silent Assassins  320k     2014","uid":11020565,"size":138499241,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f88dc78efb8731be62df9c19228c0cb4c6c6b577&amp;dn=Mike+Leponds+Silent+Assassins++320k+++++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":10,"time":1410559144,"description":"Mike Leponds Silent Assassins  320k  mp3   2014 What we got..\nSYMPHONY X BASSIST BRINGS BACK CLASSIC HEAVY METAL WITH HIS FIRST SOLO ALBUM EVER!\n\n\n\nReview:\n\n\nQuote:\n(8/10) In his real life Michael LePond is bass guitarist of progressive metal institution Symphony X that released already great records and belong to the top bands of the genre.\n\nThe guy from Newark, New Jersey was hit by a stroke of fate in 2006 when he developed Crohns Disease. Fortunately he fully recovered and could continue his career as musician.\n\nNext to his engagement in Symphony X LePond worked also on a solo album which will be released end of September this years. The album is called &quot;Mike LePonds silent assassins&quot; and comes with nine songs. All of them pretty long and epical which leads to a total running time of almost and hour.\n\nThe music is mainly a mix of US metal and Power Metal, sometimes with a celtic influence like in &quot;The quest&quot;. Since LePond is bass player the tracks have a certain focus on the four string instrument. Fair enough. But he also played the rhythm guitar on the album. The part of the lead guitar was taken over by Mike Chlasciak while the drums have been produced by LePond's Symphony X band mate Michael Romeo, who also contibuted with the six-string. You can hear this in the result since the guys play together real tight. But the best thing is that Hades frontman Alan Teccio took over the position behind the mic. I like his vocals already from the Watchtower/Hades times and it's great to hear him again. His voice fits perfect to the music. A could choice of LePond to hire the extraordinary singer.\n\nThe songs reflect a lot of influences from US metal bands like Liege Lord (&quot;Apocalypse rider&quot; and Omen (The outsider&quot;. &quot;Red death&quot; shows from the riff some cross references to Anvil's &quot;Metal on metal&quot;, while &quot;The progeny&quot; with its slow and heavy riff grooves a lot.\n\nThe ballad called &quot;Masada&quot; is also part of the track list. It's an almost completely acoustic tune which gives you a bit time to breathe after the intense first half of the album. Melodies are good and LePond almost manages to avoid prevalent cliches. For a ballad OK, but there are better tunes on the album.\n\nLast song on the silver disc is the eleven minutes long &quot;Oath and honor&quot;. If you read the title, what is your first though? True, Manowar. And yes, that song shows some parallels with the 'kings of metal'. The only difference is the fact that &quot;Oath and honor&quot; is much better than everything I have heard from Manowar in the last years. Also remarkable the Rainbow-like part after 2/3 of the song.\n\nI'm impressed by LePond's solo album. Nine good songs which are highly entertaining and a treat for each power metal fan.\n\nCBR @ 320kbps\n\n\n\nTracklist:\n\n01. Apocalypse Rider\n02. Red Death\n03. The Quest\n04. The Outsider\n05. Masada\n06. Silent Assassins\n07. Ragnarok\n08. The Progeny\n09. Oath and Honor\n\nGenre:\tHeavy\nSubgenre:\tPower / Progressive Metal\nBitrate:\t320 k\nSize:\t132.08 MB\nLine-up:\n\nSYMPHONY X bassist Mike LePond\n\nGuests:\nMetal Mike (Halford, Testament)\nMichael Romeo (Symphony X)\nAlan Tecchio (Hades, Watchtower)\n\n\nMike LePond's Silent Assassins - S/T (2014)\n","torrent":{"xt":"urn:btih:f88dc78efb8731be62df9c19228c0cb4c6c6b577","amp;dn":"Mike+Leponds+Silent+Assassins++320k+++++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f88dc78efb8731be62df9c19228c0cb4c6c6b577","infoHashBuffer":{"type":"Buffer","data":[248,141,199,142,251,135,49,190,98,223,156,25,34,140,12,180,198,198,181,119]},"announce":[],"urlList":[]}}