{"title":"Angels and Saints- Scott Hahn (ARC) [Epub &amp; Mobi]","uid":9897205,"size":1503858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f912a20729b1b2b86b5b822adf9d3861a8ed4ea1&amp;dn=Angels+and+Saints-+Scott+Hahn+%28ARC%29+%5BEpub+%26amp%3B+Mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"krystine","files":4,"time":1396726797,"description":"Angels and saints. Catholics tend to think of them as &quot;different&quot; from the rest of us. They're cast in plaster or simpering on a holy card, performing miracles with superhero strength, or playing a harp in highest heaven. \nYet they are very near to us in every way. In this lively book, Scott Hahn dispels the false notions and urban legends people use to keep the saints at a safe distance. The truth is that Jesus Christ has united heaven and earth in a close communion. Drawing deeply from Scripture, Dr. Hahn shows that the hosts of heaven surround the earthly Church as a &quot;great cloud of witnesses.&quot; The martyrs cry out from heaven's altar begging for justice on the earth. The prayers of the saints and angels rise to God, in the Book of Revelation, like the sweet aroma of incense. \nDr. Hahn tells the stories of several saints (and several angels too) in a way that's fresh and new. The saints are spiritual giants but with flesh-and-blood reality. They have strong, holy ambitions--and powerful temptations and opposition that must be overcome. Their stories are amazing and yet familiar enough to motivate us to live more beautiful lives. In this telling of their story, the saints are neither otherworldly nor this-worldly. They exemplify the integrated life that every Christian is called to live. \nStill, their lives are as different from one another as human lives can be. Dr. Hahn shows the heavenly Church in all its kaleidoscopic diversity--from Moses to Mary, Augustine to Therese, and the first century to the last century. \nOnly saints will live in heaven. We need to be more like the saints if we want to live in heaven someday. Dr. Hahn shows us that our heavenly life can begin now. \nIt must.","torrent":{"xt":"urn:btih:f912a20729b1b2b86b5b822adf9d3861a8ed4ea1","amp;dn":"Angels+and+Saints-+Scott+Hahn+%28ARC%29+%5BEpub+%26amp%3B+Mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f912a20729b1b2b86b5b822adf9d3861a8ed4ea1","infoHashBuffer":{"type":"Buffer","data":[249,18,162,7,41,177,178,184,107,91,130,42,223,157,56,97,168,237,78,161]},"announce":[],"urlList":[]}}