{"title":"Superjail  Season 1","uid":4590848,"size":1312663552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f91e6da2a1fe60d840ff5eaa631ef8d5d77f3552&amp;dn=Superjail++Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"war_peanut","files":11,"time":1229820505,"description":"Info:\n\nSuperjail! is an American animated television series\nproduced by Augenblick Studios. The pilot was shown on Adultswim.com on May 10, 2007 and aired on television on May 13, 2007, with the actual season starting September 28, 2008. Superjail is characterized by its surreal shifts in setting and plot, and its extreme graphic violence. These elements are depicted through highly elaborate animated sequences. The premise centers around events that take place in a rather unusual prison.\n\nThe majority of Superjail! is set inside the titular prison. Externally, Superjail is built inside a massive volcano, but internally it seems to constitute its own psychedelic reality, where the fabric of time and space is extremely fluid and changes at the whim of the Warden. Superjail's inmate population is stated by Jared to be in excess of 70 thousand, although the show's creators mention that the jail processes &quot;billions of inmates&quot;.\n\nEach episode follows a similar pattern. The criminal Jackknife is brought to Superjail by Jailbot. During this time, or occasionally as a result of his arrival, one event or another will inspire the Warden to carry out some sort of crazy scheme, which the Twins almost always interfere with. The combination of these two factors inevitably leads to a spectacular bloodbath when the prisoners are driven to violence. Many prisoners end up dying as a result, often in humorously horrific ways, while Jackknife escapes in the confusion to be caught again in the next episode.\n\n-----------\nNotes:\n\nThis Torrent contains all the episodes from season 1, including the pilot. If you like the show be sure tell your pals about it! More viewers means more episodes, after all.\n\nPlease be sure to leave a comment...I like comments :)\n\n\nAnd don't forget that seeding after downloading makes for good Karma!  \n\n\nEnjoy!\n\n","torrent":{"xt":"urn:btih:f91e6da2a1fe60d840ff5eaa631ef8d5d77f3552","amp;dn":"Superjail++Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91e6da2a1fe60d840ff5eaa631ef8d5d77f3552","infoHashBuffer":{"type":"Buffer","data":[249,30,109,162,161,254,96,216,64,255,94,170,99,30,248,213,215,127,53,82]},"announce":[],"urlList":[]}}