{"title":"Concrete Structures for Wind Turbines","uid":14708478,"size":3841374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9a2a445ad4468e00bf02a16fac0e959d27482e0&amp;dn=Concrete+Structures+for+Wind+Turbines&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1464390645,"description":"Concrete Structures for Wind Turbines - Jürgen Grünberg, ‎Joachim Göhlmann (Wiley, 2013).pdf\r\n\r\nThe wind energy industry in Germany has an excellent global standing when it comes to the development and construction of wind turbines. Germany currently represents the world's largest market for wind energy. The ongoing development of ever more powerful wind turbines plus additional requirements for the design and construction of their offshore foundation structures exceeds the actual experiences gained so far in the various disciplines concerned.\r\nThis book gives a comprehensive overview for planning and structural design analysis of reinforced concrete and pre-stressed concrete wind turbine towers for both, onshore and offshore wind turbines. Wind turbines represent structures subjected to highly dynamic loading patterns. Therefore, for the design of loadbearing structures, fatigue effects - and not just maximum loads - are extremely important, in particular in the connections and joints of concrete and hybrid structures. There multi-axial stress conditions occure which so far are not covered by the design codes. The specific actions, the nonlinear behaviour and modeling for the structural analysis are explained. Design and verification with a focus on fatigue are adressed. The chapter Manufacturing includes hybrid structures, segmental construction of pre-stressed concrete towers and offshore wind turbine foundations","torrent":{"xt":"urn:btih:f9a2a445ad4468e00bf02a16fac0e959d27482e0","amp;dn":"Concrete+Structures+for+Wind+Turbines","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9a2a445ad4468e00bf02a16fac0e959d27482e0","infoHashBuffer":{"type":"Buffer","data":[249,162,164,69,173,68,104,224,11,240,42,22,250,192,233,89,210,116,130,224]},"announce":[],"urlList":[]}}