{"title":"Classic Albums -The Who-Whos Next.divx","uid":3633917,"size":665645316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fa6980cae14371133d3f83c365cfde4bdc9ccbfa&amp;dn=Classic+Albums+-The+Who-Whos+Next.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tmax666","files":1,"time":1173235552,"description":"A note of my own:  If you think that a drummer is only secondary in a great rock band check out some of the parts where they are playing back the masters with Moon&amp;#039;s fanatical drumming.\n-----\nOriginally produced for cable and home video as a documentary project, the Classic Albums series offers in-depth profiles of enduring rock and pop albums built around first-person interviews with the artists, producers, and musicians that created them. \n\nWho&amp;#039;s Next proves a terrific candidate for this deep-focus approach: in songwriter and chief strategist Pete Townshend, we&amp;#039;re presented with one of the most thoughtful, articulate rock gods extant. His own capacity for self-analysis, as well as an underlying empathy for the band&amp;#039;s original Mod fans, translated directly into the band&amp;#039;s songs. Townshend&amp;#039;s sense of daring had already yielded a more conspicuous rock landmark with Tommy, the &quot;rock opera&quot; that preceded what eventually emerged as Who&amp;#039;s Next, which seemed comparatively straightforward, an album of songs without an obvious narrative thread. In fact, Townshend had sought to carry the theatrical underpinnings of Tommy to a higher, interactive level by creating a sprawling stage piece, Lifehouse, that would use the theater space and the involvement of fans to expand on the studio conception that yielded his saga of that deaf, dumb, and blind kid.\nWho&amp;#039;s Next thus emerges as something of a mirror for the listener--for Townshend, the reductive but still potent remnant of a grand, white elephant, for the rest of the band simply their best album. Surviving members Townshend, bassist John Entwistle, and vocalist Roger Daltrey provide generous comments on the history of the project, and interviews with managers, press agents, and writers, including biographer Dave Marsh, all reinforce the sense that, however chimerical Lifehouse itself proved, it produced a rich set of songs honed by the live performances they received during the project&amp;#039;s chaotic development as a de facto theatrical laboratory. --Sam Sutherland \n\nALBUM ART AT: &lt;a href=&quot;\nhttp://ec2.images-amazon.com/images/P/B00004REQZ.01._SS500_SCLZZZZZZZ_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ec2.images-amazon.com/images/P/B00004REQZ.01._SS500_SCLZZZZZZZ_.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:fa6980cae14371133d3f83c365cfde4bdc9ccbfa","amp;dn":"Classic+Albums+-The+Who-Whos+Next.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa6980cae14371133d3f83c365cfde4bdc9ccbfa","infoHashBuffer":{"type":"Buffer","data":[250,105,128,202,225,67,113,19,61,63,131,195,101,207,222,75,220,156,203,250]},"announce":[],"urlList":[]}}