{"title":"The Emperors of  Rome","uid":4614157,"size":762259288,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:faf1ba94fca2cb80af7001d96eb058f7e50e1db2&amp;dn=The+Emperors+of++Rome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sheila6","files":37,"time":1230748410,"description":"Audio Books : Misc. Educational : MP3/128Kbps : English\n\n\nEmperors of Rome\n(36 lectures, 30 minutes/lecture)\n\nTaught by Garrett G. Fagan\nThe Pennsylvania State University\nPh.D., McMaster University\n\n\n\nThey are said to be the most powerful rulers who ever lived - a chequered mix of the wise, the brutal, and the unhinged. For more than five centuries they presided over a multi-ethnic empire that was nearly always at war, if not with neighbours then with rebellious factions within the empire itself. The full scope of their powers was not systematized in constitutional law, a fact that tempted many of them to overreach disastrously; and the lack of clear rules of succession meant that most of them died violently.\n\nYet, on balance, the emperors of Rome served as a stabilizing influence in a realm that straddled three continents and covered more than 32 modern nation-states, with a population numbering about 60 million souls at the height of Roman prosperity.\n\n\n\nRulers Treated as Gods:\n\nHow did this system of rule come about? What did it replace? And who were the colourful, cruel, and crafty men who filled this almost omnipotent post? Television series such as I, Claudius have explored the complex personalities of several of the better-known emperors, whom you will meet in depth in this course:\n\n* Augustus: Known as Octavian during the long civil wars that extinguished the Roman Republic, he titled himself &quot;Augustus,&quot; the first emperor of Rome, after vanquishing all rivals and becoming the undisputed strong man of the sprawling empire.\n\n* Caligula: Supposedly the most deranged Roman emperor of all, Caligula executed people indiscriminately, sent his troops on nonsensical maneuvers, and famously invited his favorite horse to dinner and planned to make him consul. But were his crimes exaggerated by ancient sources?\n\n* Claudius: Reputedly a halfwit who was named Caligula's successor by the imperial guards on a whim, Claudius may actually have connived in Caligula's murder and arranged his own elevation. Whatever his route to power, his reign was surprisingly successful.\n\n* Nero: As emperor, Nero performed in chariot races, dramas, and poetry recitals. The &quot;fiddle&quot; he reportedly played while Rome burned was actually a lyre, but the mystery remains: Did he set the fire himself, was it an accident, or were the Christians really responsible, as he claimed?\n\nPresented by noted Roman historian Garrett G. Fagan, whose other Teaching Company courses, The History of Rome and Great Battles of the Ancient World, have brought antiquity vividly to life for spellbound listeners, these 36 lectures show that there is no end of gripping stories. More than 50 legitimate emperors ruled Rome from the time of Augustus at the turn of the 1st century to the reign of Constantine in the 4th century, which marked the transition to the Middle Ages.\n\nWhat sort of men were the emperors (and they were all men)? What background and training, if any, prepared them for their awesome responsibilities? What depravities did they display? And what achievements can they claim: laws passed, monuments built, lands and peoples conquered? Some of the most noteworthy emperors include:\n\n* Trajan: Moderate at home and warlike abroad, Trajan was the perfect mix of Roman virtues. His reign inaugurated the period of the empire's greatest strength and stability, when emperors adopted their successors from among able army commanders. But that sensible policy did not last.\n\n* Commodus: The son of the esteemed philosopher-emperor Marcus Aurelius, Commodus believed himself to be Hercules reincarnated--a role he enacted in the Colosseum in combats with wild beasts and gladiators. He renamed Rome and all the months of the year after himself.\n\n* Diocletian: The Roman Empire seemed doomed to disintegration until this general rose to the top job. He subdivided imperial authority, established a new system of succession, and institutionalized the despotic powers of his office, giving the empire a new lease on life.\n\n* Constantine: The first Christian emperor was apparently reluctant to forsake the old pagan gods; they continued to appear in official iconography. But Constantine's endorsement of Christianity and his founding of a new capital called Constantinople opened a new era of Western history.\n\nYou will cover scores of other Roman rulers, some of whom lasted only a few weeks before they were done in by rivals for a position that conferred virtual divinity in this life--although the chances that the life would be a long one were not good.\n\n\n\nSleuthing the Past:\n\nThroughout the course, Professor Fagan emphasizes the detective work needed to read the ancient sources critically. Roman history is an amalgam of eyewitness reports, later compilations, archaeological remains, and inscriptions on monuments and coins. Contemporary accounts, when available, are not necessarily to be trusted, since the emperors' greatest political rivals were usually members of the Senate, and they were the ones most likely to be writing history. Therefore scathing reports on imperial conduct have to be read with caution.\n\nOne result is that some of our most indelible impressions about Roman imperial history may be wrong. Was Nero really a frivolous fool for devoting himself to performing on stage? So the ancient sources would have it. However, in Lecture 14 you learn how a modern historian makes an intriguing case that Nero was a shrewd master of spin, choosing his stage roles to convey exculpatory messages to the Roman people.\n\nSimilarly, did Livia Drusilla really poison or otherwise dispose of all the princes that stood in the way of her son Tiberius's succession to the emperorship after Augustus? The ancient historian Tacitus certainly gives this impression, which is chillingly conveyed by the actress Sian Phillips in the PBS adaptation of Robert Graves's novel I, Claudius. But Professor Fagan suggests that the case against Livia is weak and can be traced to her particular circumstances as well as to broader cultural prejudices against women in her position.\n\n\n\nFrom Princeps to Dominus:\n\nLivia's prominence illustrates another characteristic of the Roman Empire: Aristocratic women often played a powerful role in dynastic politics. This is one of the fascinating background topics that Professor Fagan investigates to show what life was like not just for the emperor but also for those in his immediate circle and for his subjects.\n\nIn Lectures 27-31 you take a break from the chronological narrative to examine the emperors' relationships to different parts of Roman society: the city of Rome itself, the provinces of the empire, the elite, the people, and the army. For example, you learn that games and spectacles were one of the few places where ordinary citizens saw the emperor in person, and they would take advantage of this audience to organize demonstrations of their political views. Despite occasional signs of unrest, unpopularity was something emperors could live with. Not a single emperor in recorded Roman history was ousted by popular revolution.\n\nOne of the most intriguing questions about the emperorship is why it endured for so long. As you witness the reigns of the successive rulers unfold, you will see how the office evolved with the political forces that sustained it, becoming more and more tightly bound to the military. Each step toward despotism was taken with a view toward expedience. But when that step became the new normal, it paved the way for the next step, and so on, until Rome had moved from Augustus, who styled himself the princeps, or &quot;first citizen,&quot; to Diocletian and Constantine, who ruled as the domini - lords over slaves.","torrent":{"xt":"urn:btih:faf1ba94fca2cb80af7001d96eb058f7e50e1db2","amp;dn":"The+Emperors+of++Rome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faf1ba94fca2cb80af7001d96eb058f7e50e1db2","infoHashBuffer":{"type":"Buffer","data":[250,241,186,148,252,162,203,128,175,112,1,217,110,176,88,247,229,14,29,178]},"announce":[],"urlList":[]}}