{"title":"Another Blast from the Past Seven more homemade clips of couples","uid":11523576,"size":391698382,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:fb2e0d2b96573884fa4c344f4b4d2e1be970375f&amp;dn=Another+Blast+from+the+Past+Seven+more+homemade+clips+of+couples&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mrdig","files":34,"time":1416504808,"description":"\n\nAnother installment of the old kazaa days blast from the past series. Here's Seven more short clips from the old days. These are homemade amateur couples fucking and sucking. Ah, the memories of late 1990's newsgroup trolling and kazaa! I'm going through an old hard drive and found some gems to share. Hot amateur fucking action, 90's internet quality.  This torrent includes seven different amateur chicks sucking and fucking their husbands or boyfriends. Includes blowjobs, big sloppy creampies and even some piss. Especially notable in this pack is &quot;amateur acrobat couple&quot; this clip was the subject of a couple Howard Stern radio shows back in the day. He eventually got the chick to come into the studio and talk about what a slut she was. Also, this pack has a cute german wife who pisses while she is sucking her husbands cock. Enjoy!\n\nThis is the Fourth torrent of 1 on 1 amateur homemade clips that I've uploaded and part of a series of homemade amateur clips from the early days of the internet. Check out my other uploads to find similar stuff from the early days of internet porn including collections of homemade amateurs anal, facials, cum in mouth, cum on pussy, creampie &amp; deepthroat","torrent":{"xt":"urn:btih:fb2e0d2b96573884fa4c344f4b4d2e1be970375f","amp;dn":"Another+Blast+from+the+Past+Seven+more+homemade+clips+of+couples","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb2e0d2b96573884fa4c344f4b4d2e1be970375f","infoHashBuffer":{"type":"Buffer","data":[251,46,13,43,150,87,56,132,250,76,52,79,75,77,46,27,233,112,55,95]},"announce":[],"urlList":[]}}