{"title":"Demidovich, Maron - Computational Mathematics","uid":7953154,"size":17927897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc2f01c567e64bd60170b48fb1a4ad0e8d350eb1&amp;dn=Demidovich%2C+Maron+-+Computational+Mathematics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"damitr","files":1,"time":1356339833,"description":"Computational Mathematics \nby B. P. Demidovich, I. A. Maron. \n  \n  The basic aim of this book is to give as far as possible a\n  systematic and modern presentation of the most important methods and\n  techniques of computational mathematics on the basis of the general\n  course of higher mathematics taught in higher technical schools. The\n  book has been arranged so that the basic portion constitutes a\n  manual for the first cycle of studies in approximate computations\n  for higher technical colleges. The text contains supplementary\n  material which goes beyond the scope of the ordinary college course,\n  but the reader can select those sections which interest him and omit\n  any extra material without loss of continuity. The chapters and\n  sections which may be dropped out in a first reading are marked with\n  an asterisk.\n\n  For a full comprehension of the contents of this book, the reader\n  should have a background of linear algebra and the theory of linear\n  vector spaces. With the aim of making the text as self-contained as\n  possible, the authors have included all the necessary starting\n  material in these subjects. The appropriate chapter are completely\n  independent of the basic text and can be omitted by readers who have\n  already studied these sections. \n\n  A few words about the contents of the book. In the main it is\n  devoted to the following problems: operations involving approximate\n  numbers, computation of functions by means of series and iterative\n  processes, approximate and numerical solution of algebraic and\n  transcendental equations, computational methods of linear algebra,\n  interpolation of functions, numerical differentiation and\n  integration of functions, and the Monte Carlo method.\n\n  This book was translated from the Russian by George Yankovsky. The book was\n  published by first Mir Publishers in 1973, with reprints in 1976,\n  and 1981. The book below is from the 1981 reprint.\n  \n  All credits to the original uploader.\n\n  DJVU | OCR | 17.1 MB | Pages: 688 |  \n\nTable of Contents\nPREFACE \n\nINTRODUCTION. \n\nGENERAL RULES OF COMPUTATIONAL WORK \n\nCHAPTER 1 \nAPPROXIMATE  NUMBERS 19\n\nCHAPTER 2 \nSOME FACTS FROM THE THEORY OF CONTINUOUS FRACTIONS 55\n\nCHAPTER 3 \nCOMPUTING THE VALUES OF FUNCTIONS 77\n\nCHAPTER 4 \nAPPROXIMATE SOLUTIONS OF ALGEBRAIC AND TRANSCENDENTAL EQUATIONS 115 \n\nCHAPTER 5\nSPECIAL TECHNIQUES FOR APPROXIMATE SOLUTION OF EQUATIONS 162\n\nCHAPTER 6 \nACCELERATING THE CONVERGENCE OF SERIES 203 \n\nCHAPTER 7 \nMATRIX ALGEBRA 229\n\nCHAPTER 8 \nSOLVING  SYSTEMS OF LINEAR EQUATIONS 273 \n\nCHAPTER 9\nTHE CONVERGENCE OF ITERATION PROCESSES FOR SYSTEMS OF LINEAR EQUATIONS 322\n\nCHAPTER 10\nESSENTIALS OF THEORY OF LINEAR VECTOR SPACES 336\n\nCHAPTER 11\nADDITIONAL FACTS ABOUT THE CONVERGENCE OF ITERATION PROCESSES FOR\nSYSTEMS OF LINEAR EQUATIONS 394 \n\nCHAPTER 12 \nFINDING THE EIGENVALUES AND EIGENVECTORS OF A MATRIX 410 \n\nCHAPTER 13 \nAPPROXIMATE SOLUTION OF SYSTEMS OF NONLINEAR EQUATIONS  459 \n\nCHAPTER 14 \nTHE INTERPOLATION OF FUNCTIONS 507 \n\nCHAPTER 15 \nAPPROXIMATE DIFFERENTIATION 574 \n\nCHAPTER 16 \nAPPROXIMATE INTEGRATION OF FUNCTIONS 590 \n\nCHAPTER 17 \nTHE MONTE CARLO METHOD 649 \n\nCOMPLETE LIST OF REFERENCES 675 \n\nINDEX 679 \n\n\n\n","torrent":{"xt":"urn:btih:fc2f01c567e64bd60170b48fb1a4ad0e8d350eb1","amp;dn":"Demidovich%2C+Maron+-+Computational+Mathematics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc2f01c567e64bd60170b48fb1a4ad0e8d350eb1","infoHashBuffer":{"type":"Buffer","data":[252,47,1,197,103,230,75,214,1,112,180,143,177,164,173,14,141,53,14,177]},"announce":[],"urlList":[]}}