{"title":"Mac address changer &quot;spoofer&quot; (scuba-doo)","uid":6157070,"size":535304,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fc3e0bb2eb7c9a47a6f1a2961d45fa5517fe28eb&amp;dn=Mac+address+changer+%5C%22spoofer%5C%22+%28scuba-doo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"scuba-doo","files":-1,"time":1297079523,"description":"First off what is a mac address?\n\na MAC address (Media Access Control address) is a unique identifier assigned to network interfaces for communications on the physical network segment. MAC addresses are used for numerous network technologies and most IEEE 802 network technologies including Ethernet. Logically, MAC addresses are used in the Media Access Control protocol sub-layer of the OSI reference model.\nMAC addresses are most often assigned by the manufacturer of a network interface card (NIC) and are stored in its hardware, the card's read-only memory, or some other firmware mechanism. If assigned by the manufacturer, a MAC address usually encodes the manufacturer's registered identification number and may be referred to as the burned-in address. It may also be known as an Ethernet hardware address (EHA), hardware address or physical address.\nMAC addresses are formed according to the rules of one of three numbering name spaces managed by the Institute of Electrical and Electronics Engineers (IEEE): MAC-48, EUI-48, and EUI-64. The IEEE claims trademarks on the names EUI-48 and EUI-64, in which EUI is an acronym for Extended Unique Identifier.\n\nMore Info on the matter:\n\nAlthough intended to be a permanent and globally unique identification, it is possible to change the MAC address on most of today's hardware, an action often referred to as MAC spoofing.\nA host cannot determine from the MAC address of another host whether that host is on the same link (network segment) as the sending host, or on a network segment bridged to that network segment.\nIn TCP/IP networks, the MAC address of an interface can be queried knowing the IP address using the Address Resolution Protocol (ARP) for Internet Protocol Version 4 (IPv4) or the Neighbor Discovery Protocol (NDP) for IPv6. On broadcast networks, such as Ethernet, the MAC address uniquely identifies each node on that segment and allows frames to be marked for specific hosts. It thus forms the basis of most of the Link layer (OSI Layer 2) networking upon which upper layer protocols rely to produce complex, functioning networks.\n\n\n\n\nok so that info is out of the way (made easy thanx to copy past from wikipedia), here is the program. Its simple, it works and its small.\n\nInstructions:\n1) Download\n2) Scan with you AV (its clean...but make this routine)\n3) Install just like any other normal program\n4) open up and click on the desired adapter (wireless, Lan, etc)\n5) either enter the MAC address you wish to have or click on  Generate Random\n6) Your done.\n\nIf you wish to change back to your default mac address for step 5 just click **restore original mac address.\n\n\nscanned with Bitdefender  + SuperAntiSpyware + Malwarebytes = Malware FREE\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:fc3e0bb2eb7c9a47a6f1a2961d45fa5517fe28eb","amp;dn":"Mac+address+changer+%5C%22spoofer%5C%22+%28scuba-doo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3e0bb2eb7c9a47a6f1a2961d45fa5517fe28eb","infoHashBuffer":{"type":"Buffer","data":[252,62,11,178,235,124,154,71,166,241,162,150,29,69,250,85,23,254,40,235]},"announce":[],"urlList":[]}}