{"title":"GrowthBusters","uid":8247059,"size":1296248478,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fcac0a58bc6c296c05018e57e2f287b83be50e32&amp;dn=GrowthBusters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1363085488,"description":"This film asks the most critical question of our time: How do we become a sustainable civilization? It takes a unique approach among modern environmental documentaries: Rather than dispensing facts about climate change; peak energy, food and water; and biodiversity loss, it examines the cultural barriers that prevent us from acting rationally. It asks why population conversations are so difficult to have, and why a roaring economy is more important to us than a survivable planet. It looks into the psychology of denial and crowd behavior. It explores our obsession with community growth and economic growth. Hooked on Growth holds up a mirror, encouraging us to examine the beliefs and behaviors we must leave behind, and the values we need to embrace, in order that our children can survive and thrive. (Written by Dave Gardner)\n\n---\n\nEspecially for this movie, seeing how it's a non-profit project and so damn important, it's essential that it's actively being bought by people like you and me. So if you do enjoy it, show Dave Gardner some love and contribute to his cause.","torrent":{"xt":"urn:btih:fcac0a58bc6c296c05018e57e2f287b83be50e32","amp;dn":"GrowthBusters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcac0a58bc6c296c05018e57e2f287b83be50e32","infoHashBuffer":{"type":"Buffer","data":[252,172,10,88,188,108,41,108,5,1,142,87,226,242,135,184,59,229,14,50]},"announce":[],"urlList":[]}}