{"title":"New Orleans Jazz Vipers - Live on Frenchmen Street","uid":5287943,"size":90097664,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fd21c9a99c4262c49648d12887d69f2e3291a871&amp;dn=New+Orleans+Jazz+Vipers+-+Live+on+Frenchmen+Street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bego0002","files":12,"time":1263786835,"description":"New Orleans Jazz Vipers - Live on Frenchmen Street\n\n&quot;Look, ma-no drums! The New Orleans Jazz Vipers, on their second, recorded-live-at-the-Spotted-Cat CD, prove that you can swing and pulsate like crazy without percussion, a deviation from the New Orleans norm that is utterly divine. It works because guitarist John Rodli and bassist Robert Snow are such adept players that your ears are almost tricked into believing they're hearing percussion instruments. For supposed Vipers (i.e., mellow devotees of cannabis), this band is exceedingly intense and frenetic. No wonder that contemporary punks intent on re-living the Sid Vicious Years have fallen in love with an acoustic band that plays standards their great-grandparents once danced to.\n\nBesides Rodli (who also contributes approximately half of the vocals) and Snow, the Vipers feature alto saxophonist/vocalist Joe Braun, trumpeter/occasional vocalist Charlie Fardella, bass saxophonist/occasional vocalist Tom Saunders and Neti Vann on fiddle. Braun and Rodli both have wonderful, warm voices and the accompaniment is perfect: it sounds like you've just disembarked from your tramp steamer, circa 1933, and encountered the coolest jazz band in New Orleans, before Dixieland reared its ugly, strident clichÃƒÂ©-filled head. Above all else, these are cool musicians, fully cognizant that less is more and that jazz...is dance music.\n\nA peek at the program - &quot;Exactly Like You,&quot; &quot;You Can Depend On Me,&quot; &quot;Dinah,&quot; &quot;A Ghost of a Chance,&quot; &quot;St. Louis Blues,&quot; &quot;Home,&quot; &quot;Them There Eyes,&quot; &quot;I Wish I Were Twins,&quot; &quot;Crazy Rhythm,&quot; &quot;Lonesome Me,&quot; &quot;Did You Mean It&quot; and the bonus track &quot;If You're A Viper&quot; featuring the sandpapered vocals of John Sinclair - reveals material that most jazz fans know like the backs of their sweaty hands. Like my beautiful wife said, the first time she heard this, &quot;It sounds like the ball!&quot; And indeed it does sound like the music heard at traditional New Orleans Carnival balls-intoxicating music played for intoxicated dancers. In particular, Braun's alto and Saunders' bass saxophone lend the appropriately sleazy vibe and guest star Jack Fine's cornet solo on &quot;Home&quot; induces shivers as he blows a Milky Way of celestial notes.\n\nThe recording, with its whiff of crowd murmurs, is spectacular. A better Mardi Gras album (not that Mardi Gras is literally mentioned anywhere) has never been made, and that includes anything Metric or Longhaired. I mean it!&quot;\n--- Bunny Mathews, Offbeat, new Orleans\n\nNew Orleans Jazz Vipers were the winner of Offbeat Magazine's &quot;Best of the Beat&quot; 2004 award for &quot;Best Traditional Jazz Album&quot; (for the album &quot;Live on Frenchmen Street&quot;). In 2001 and 2003 they won the &quot;Best of the Beat&quot; award for &quot;Best Emerging Traditional Jazz Band.&quot; The band was voted one of the top three jazz bands in the 2004 reader's poll in Where Y'at Magazine.","torrent":{"xt":"urn:btih:fd21c9a99c4262c49648d12887d69f2e3291a871","amp;dn":"New+Orleans+Jazz+Vipers+-+Live+on+Frenchmen+Street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd21c9a99c4262c49648d12887d69f2e3291a871","infoHashBuffer":{"type":"Buffer","data":[253,33,201,169,156,66,98,196,150,72,209,40,135,214,159,46,50,145,168,113]},"announce":[],"urlList":[]}}