{"title":"Continuous Testing:Ruby, Rails + JavaScript-2010kaiser","uid":7805689,"size":5289918,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe5bc88d3404768668cb1b1fda0f15e7ca7b7c08&amp;dn=Continuous+Testing%3ARuby%2C+Rails+%2B+JavaScript-2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"2010kaiser","files":2,"time":1352390318,"description":"           Continuous Testing:Ruby, Rails + JavaScript-2010kaiser\n\n\n\n\nContinuous Testing (CT) is a developer practice that shortens the feedback loops established by test-driven development and continuous integration. Building on techniques used by Agile software development practitioners, Continuous Testing with Ruby shows you how to get instant feedback about both the quality of your code, and the quality of your tests.\n\nWe show how you can create a customized continuous testing environment, specifically suited to the projects you're working on. You'll see working examples for languages such as Ruby and javascript, but the techniques described in this book can easily be applied no matter what technology you happen to be working with. We also cover how to extend this environment when working with frameworks such as Ruby on Rails, and discuss how creating rapid feedback loops can dramatically increase the rate at which you can deliver working, valuable software.\n\nAutomated testing is an increasingly common practice in the software development industry. However, many companies struggle to gain all the benefits of automated testing, due to poorly written or incomplete tests. Continuous Testing with Ruby shows how these companies can get the most value out of their existing tests. It also helps you improve the quality of the new tests you write, by giving you instant feedback about problem areas, and creating a visceral feedback loop for test quality that you can actually feel as you work.\n\nJust as continuous integration and test-driven development have changed the definition of software development in the last ten years, Continuous Testing is poised to become a standard practice for development teams in the next decade.\n\n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:fe5bc88d3404768668cb1b1fda0f15e7ca7b7c08","amp;dn":"Continuous+Testing%3ARuby%2C+Rails+%2B+JavaScript-2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5bc88d3404768668cb1b1fda0f15e7ca7b7c08","infoHashBuffer":{"type":"Buffer","data":[254,91,200,141,52,4,118,134,104,203,27,31,218,15,21,231,202,123,124,8]},"announce":[],"urlList":[]}}