{"title":"The Chemistry of Pincer Compounds - D Morales-Morales, CM Jensen","uid":15553539,"size":15711807,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffcc6228008857df3de94ee5513e3417fc12000c&amp;dn=The+Chemistry+of+Pincer+Compounds+-+D+Morales-Morales%2C+CM+Jensen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1471045263,"description":"The Chemistry of Pincer Compounds - D Morales-Morales, CM Jensen (Elsevier, 2007).pdf\r\n\r\nPincer complexes are formed by the binding of a chemical structure to a metal atom with at least one carbon-metal bond. Usually the metal atom has three bonds to a chemical backbone, enclosing the atom like a pincer. The resulting structure protects the metal atom and gives it unique properties.\r\n\r\nThe last decade has witnessed the continuous growth in the development of pincer complexes. These species have passed from being curiosity compounds to chemical chameleons able to perform a wide variety of applications. Their unique metal bound structures provide some of the most active catalysts yet known for organic transformations involving the activation of bonds. The Chemistry of Pincer Compounds details use of pincer compounds including homogeneous catalysis, enantioselective organic transformations, the activation of strong bonds, the biological importance of pincer compounds as potential therapeutic or pharmaceutical agents, dendrimeric and supported materials.\r\n\r\n* Describes the chemistry and applications of this important class of organometallic and coordination compounds\r\n* Covers the areas in which pincer complexes have had an impact\r\n* Includes information on more recent and interesting pincer compounds not just those that are well-known","torrent":{"xt":"urn:btih:ffcc6228008857df3de94ee5513e3417fc12000c","amp;dn":"The+Chemistry+of+Pincer+Compounds+-+D+Morales-Morales%2C+CM+Jensen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffcc6228008857df3de94ee5513e3417fc12000c","infoHashBuffer":{"type":"Buffer","data":[255,204,98,40,0,136,87,223,61,233,78,229,81,62,52,23,252,18,0,12]},"announce":[],"urlList":[]}}