{"title":"Career Academy EC-Council CEH Certified Ethical Hacker v7 DVD 1,","uid":7384809,"size":4619297872,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ffe053e244c748d9dbadae84488d8d9ed4a1b6ae&amp;dn=Career+Academy+EC-Council+CEH+Certified+Ethical+Hacker+v7+DVD+1%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"fersue","files":101,"time":1340601708,"description":"Career Academy EC-Council CEH Certified Ethical Hacker v7 DVD`s\nDVD1: 1.84GB | DVD2: 1.27GB | DVD3: 1.18GB\nLanguage: English | Genre: eLearning\n\n\nEric Reed brings more than a decade of IT experience to his expert video instruction. Eric specializes in network penetration testing and digital forensics consultation for large corporations and government sectors. After working for many years in the IT security and training industry as an independent consultant, Eric became co-owner of Immersion Training, LLC. He is currently solely focused on advanced security consulting and education. Eric is an EC-Council Master Certified Instructor and a Microsoft Certified Trainer.\n\nHis experience in the public / defense sectors is equally complemented by assignments undertaken for heavyweight world renowned corporations including Yahoo, Xerox, AT&amp;T and Texas Instruments to name but a few. He is imminently qualified in his field in that he holds a string of professional qualifications in Networking to name a few (MCT, MCSE, Cisco, Network+) and IT Security (CIW Security Analyst , Security+, CEI, CEH, CPTE, CDFI, CPTM) besides a bachelor's degree in science.\n\nmORE iNFO:\n\nCEH v7 is a 3 DVD course with 19 modules as mentioned in the url given above\nDVD1: module 0-6\nDVD2: module 7-13\nDVD3: module 14-19 \n\nYou need to extract the iso from the files using winrar(/anything else u like) and then mount it using any virtual drive tools u like. Tested and all 3 DVD works fine in my windows machine.\n\n\nNotes: \n1. This is my first torrent, so please tell me if anything is wrong with it. \n2. This is CEH v7 and not CEH v7.1 which is 6 DVD thing and is large. \n3. This torrent doesn't have any hacking tools included. It only has video training of above mentioned modules. \n4. My internet connection isn't stable and great, so please seed when you finished downloading.","torrent":{"xt":"urn:btih:ffe053e244c748d9dbadae84488d8d9ed4a1b6ae","amp;dn":"Career+Academy+EC-Council+CEH+Certified+Ethical+Hacker+v7+DVD+1%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffe053e244c748d9dbadae84488d8d9ed4a1b6ae","infoHashBuffer":{"type":"Buffer","data":[255,224,83,226,68,199,72,217,219,173,174,132,72,141,141,158,212,161,182,174]},"announce":[],"urlList":[]}}